{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":47,"messages":[{"userId":321996436,"authorName":"AlexS","from":"&quot;AlexS&quot; &lt;missalexmissalex@...&gt;","profile":"missalexmissalex","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Young child and not listening","postDate":"1276738037","msgId":55030,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGh2YnRsbCs4M2o4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEUxMzIwRTUyLTk2OEMtNDFFQS04Rjc4LUNCQjUwNDA0MjZBREBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":55029,"nextInTopic":55031,"prevInTime":55029,"nextInTime":55031,"topicId":54987,"numMessagesInTopic":0,"msgSnippet":"My general guideline is that a physical need trumps an emotional need, hands down, immediately, as valid as emotional needs are. A baby needing attention is","messageBody":"<div id=\"ygrps-yiv-1152634424\">My general guideline is that a physical need trumps an emotional need, hands down, immediately, as valid as emotional needs are. A baby needing attention is basically in that category. If we can&#39;t find a way to meet both simultaneously, it is my role in the family to firmly insist on others not getting in the way of whichever person getting help. Being firm about that is not something I would consider bullying at all even if my annoyance is visible. <br/>\n<br/>\nLately we&#39;ve been at the park until someone has a physical need to leave--we need a potty, or one of us has burned through allll the snacks and is running out of fuel, or the dog is about to pee the carpet, etc. I can sympathize, make plans to return, talk about fun things we&#39;ll do at home, use a bunch of &quot;one more thing,&quot; &quot;do you want me to fly you to the car or do you want to walk&quot; etc kind of strategies but there is really a point at which We Are Leaving. On the rare occasion that I am starting to feel like I am going to lose my temper I will tell her as calmly as possible that she has only 2 choices left: She can leave now with a happy mommy, or she can leave now with a grumpy mommy. It&#39;s the honest truth. If she says &quot;happy&quot; I somehow find a reserve of playfulness on the way out. If she doesn&#39;t say anything I say, &quot;Oh, so you must want a grumpy mommy&quot; and do my best chasing troll mommy impression. Somehow, it works. The grumpy troll mommy hustling her to the car is sort of funny. <br/>\n<br/>\nI don&#39;t have another child and I don&#39;t know how similar this is but up until when K was 2 1/2 (she just turned 3) I was the primary caregiver for several terminally ill family members and to a certain degree, she got it. I would often tell her I didn&#39;t want to do whatever thing for whomever right then either but I was going to &quot;because nothing is more important than taking care of the people you love.&quot; And that we had to do it, because they couldn&#39;t do these things for themselves. She was younger, and maybe an element of it was me just being calmly firm, but often right after I said that she would shift gears abruptly and talk excitedly about getting a ride on Grandpa&#39;s wheelchair or something like that. <br/>\n<br/>\nHope that helps. I always appreciate everyone talking about anything about kids my daughter&#39;s age--I learn so much! <br/>\n<br/>\nAlex<br/>\nmama to Katya, 3 yrs</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Young child and not listening","postDate":"1276736855","msgId":55029,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYwMDMyMi40NTU2LnFtQHdlYjExMDQwNS5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PGh2YmduaCt2bnIwQGVHcm91cHMuY29tPg==","referencesHeader":"PGh2YmduaCt2bnIwQGVHcm91cHMuY29tPg=="},"prevInTopic":55028,"nextInTopic":55030,"prevInTime":55028,"nextInTime":55030,"topicId":54987,"numMessagesInTopic":0,"msgSnippet":"***I didn t think anyone wanted a verbatim account of the situation, so I took liberty to summarize.  But that seems to have led to misunderstanding of my","messageBody":"<div id=\"ygrps-yiv-1180016587\">***I didn&#39;t think anyone wanted a verbatim account of the situation, so I <br/>\ntook liberty to summarize.  But that seems to have led to <br/>\nmisunderstanding of my actions and the situation.  Here are some more <br/>\ndetails that will, perhaps, clarify what happened and how I was not <br/>\ncomfortable with my response to my daughter&#39;s slowness at coming inside.***<br/>\n<br/>\nAfter having read all of the responses, I think people understood perfectly what was going on.  Most people on this list either have had or currently have 3 yr olds.  What you are going through and what you are describing is very common.<br/>\n<br/>\n***I initially told my daughter when we got the baby to sleep in his crib <br/>\nthat we could go outside for about an hour.  My expectation for his nap <br/>\nwas off, therefore I didn&#39;t expect to have to go inside at 45 minutes.***<br/>\n<br/>\nMost 3 yr olds have no concept of time in this way.  In an ideal world we all get exactly the time we need to do what we need to do, but life is messy.  In each interaction a parent gets to make decisions that impact their kids.  The goal is to have more positive than negative.  So, even if you usually would allow for transition time, many times with 2 kids, that just won&#39;t be possible, so working towards the next positive interaction, the next positive decision, for both kids is the goal.  <br/>\n<br/>\n***As for slapping, our response has been that we treat people as we want <br/>\nto be treated.  But for this child, maybe for most 3 yo, empathy isn&#39;t <br/>\neasily understood.  And this is where I feel like breakdowns in my <br/>\npeaceful parenting keep occurring.  She couldn&#39;t empathize with her <br/>\nbrother who was getting more upset.  She has a hard time empathizing <br/>\nwith me when I tell her not to hit me.***<br/>\n<br/>\nMost 3 yr olds absolutely can&#39;t empathize.  It is completely unrealistic to expect it at all!  Trying to get a 3 yr old to empathize is counter productive!  The focus should be on tangible concrete things.  &quot;The baby needs my attention right now and you need to come inside to do this.&quot;  That is concrete.  The 3 yr old doesn&#39;t need to feel the pain of the infant in order to know that the baby needs attention NOW.  Same with hitting.  <br/>\n<br/>\nWhen Chamille was little, we used to play biting games.  We started it because she wouldn&#39;t stop biting and it hurt.  Instead of working with her to get her to stop, because she wasn&#39;t aware that she should, we played biting games until she KNEW that it hurt.  It was both fun and painful, fun to play with pain.  It was a game that she liked to play, one that she knew would and could cause pain.  She stopped trying to bite others as a result of that game.  She got enough biting from the biting game.    <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":255388392,"authorName":"Kelly Halldorson","from":"&quot;Kelly Halldorson&quot; &lt;kelly@...&gt;","profile":"kellygrafx","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Young child and not listening","postDate":"1276735144","msgId":55028,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI3NTFBMTMxN0EwQjQ0RjA4Nzg2NTg0MUNFOTJBODJDQFBIUFZpZGVvVkFJTz4=","inReplyToHeader":"PDg2OTU4MC4zMjQ4MS5xbUB3ZWIxMTA0MDkubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PGh2YjBzYStrN2ExQGVHcm91cHMuY29tPiA8ODY5NTgwLjMyNDgxLnFtQHdlYjExMDQwOS5tYWlsLmdxMS55YWhvby5jb20+"},"prevInTopic":55027,"nextInTopic":55029,"prevInTime":55027,"nextInTime":55029,"topicId":54987,"numMessagesInTopic":0,"msgSnippet":"... It also might NOT be ignoring. They may be just *tuning out* the parent. So, I would say don t assume it s even that...the kids might not even realize you","messageBody":"<div id=\"ygrps-yiv-125667980\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;Right, and many times parents misunderstand that not listening is NOT the same as not complying. Many times little kids hear just fine, they just don&#39;t want to do what they are being asked or told to do, so they ignore. Less words are better, and phrasing things in ways that kids want to do what is being asked of them, generally has a better response. &lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>It also might NOT be ignoring. They may be just *tuning out* the parent. So, I would say don&#39;t assume it&#39;s even that...the kids might not even realize you are talking to them. <br/>\n<br/>\nI find when it happens with my kids (who aren&#39;t young) if I walk over and gently talk to them gently while making some kind of soft physical contact (hand on shoulder, arm around etc).<br/>\n<br/>\npeace,<br/>\nKelly<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Young child and not listening","postDate":"1276733367","msgId":55027,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg2OTU4MC4zMjQ4MS5xbUB3ZWIxMTA0MDkubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGh2YjBzYStrN2ExQGVHcm91cHMuY29tPg==","referencesHeader":"PGh2YjBzYStrN2ExQGVHcm91cHMuY29tPg=="},"prevInTopic":55026,"nextInTopic":55028,"prevInTime":55026,"nextInTime":55028,"topicId":54987,"numMessagesInTopic":0,"msgSnippet":"***It can help to step away from the idea that there are times when a young child needs to follow directions - that sounds a little wacko, but when the","messageBody":"<div id=\"ygrps-yiv-941196891\">***It can help to step away from the idea that there are times when a young child &quot;needs&quot; to follow directions - that sounds a little wacko, but <br/>\nwhen the reality is that your child can&#39;t listen and respond in the way <br/>\nyou envision, then its the vision that&#39;s off. Your dd is just being a <br/>\n3yo.***<br/>\n<br/>\nRight, and many times parents misunderstand that not listening is NOT the same as not complying.  Many times little kids hear just fine, they just don&#39;t want to do what they are being asked or told to do, so they ignore.  Less words are better, and phrasing things in ways that kids want to do what is being asked of them, generally has a better response.  <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Young child and not listening","postDate":"1276732678","msgId":55026,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ1ODEyLjI4NzU5LnFtQHdlYjExMDQwOC5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PEUxMzIwRTUyLTk2OEMtNDFFQS04Rjc4LUNCQjUwNDA0MjZBREBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGh2OWRwcitkN2FuQGVHcm91cHMuY29tPiA8RTEzMjBFNTItOTY4Qy00MUVBLThGNzgtQ0JCNTA0MDQyNkFEQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":55025,"nextInTopic":55027,"prevInTime":55025,"nextInTime":55027,"topicId":54987,"numMessagesInTopic":0,"msgSnippet":"***Some people have that thought and decide that unschooling is wrong, and that the mother should maintain her boundaries and start making sure she gets her","messageBody":"<div id=\"ygrps-yiv-1136026638\">***Some people have that thought and decide that unschooling is wrong, <br/>\nand that the mother should maintain her boundaries and start making <br/>\nsure she &quot;gets her way&quot; as often as the child does.  But when you&#39;re <br/>\nmeasuring and counting, that&#39;s not partnership.***<br/>\n<br/>\nThat has been on my mind lately, that idea of boundaries.  I think that is just it, the very notion of boundaries is created by a sense of &quot;the other&quot; rather than of &quot;us&quot; or &quot;we&quot;.  My boundaries are every changing and growing as my kids change and grow.  It&#39;s a very symbiotic relationship.  Sure, there are non-negotiable things occasionally, but I&#39;ve found that most things are flexible, even if *I* don&#39;t feel like being flexible.symbiotic<br/>\n<br/>\nKids pick up on that kind of flexibility.  If it&#39;s how you live, they&#39;ll learn to adapt it.  With really young kids, there should be less words and more action.  Grabbing and moving and going and doing CAN be positive things if the mom or dad makes it so.<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Young child and not listening","postDate":"1276729781","msgId":55025,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4NTc0NzA1LUU3RUItNDVFQS04MEE2LTU4QkEzQTg1OEY4QkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGh2Ymo3ZCs3ODIzQGVHcm91cHMuY29tPg==","referencesHeader":"PGh2Ymo3ZCs3ODIzQGVHcm91cHMuY29tPg=="},"prevInTopic":55023,"nextInTopic":55026,"prevInTime":55024,"nextInTime":55026,"topicId":54987,"numMessagesInTopic":0,"msgSnippet":"-=- However, the not listening by my daughter has led me to not be so peaceful at times. ******** -=-Its funny, but I read this as not listening To my","messageBody":"<div id=\"ygrps-yiv-1541201200\">-=-&gt;&gt;However, the not listening by my daughter has led me to not be so  <br/>\npeaceful at times.<br/>\n********<br/>\n-=-Its funny, but I read this as &quot;not listening To my daughter&quot; the  <br/>\nfirst time through and thought &quot;well, yes, not listening to people  <br/>\noften leads to a lack of peace&quot; --=-<br/>\n<br/>\nOH. I read it that way too.<br/>\n<br/>\nI sat next to a mom being not so nice to a 19 year old for five  <br/>\nhours.  She complained to me that he doesn&#39;t listen.  Then she spent  <br/>\nhours showing me (and him, again) how very little SHE listens.   I  <br/>\ntalked to her a little at first, and then not until we were at the end  <br/>\nof the flight, because I didn&#39;t want to get into it with her.<br/>\n<br/>\n-=-After reading the responses, it seems as though I wasn&#39;t explicit  <br/>\nenough in my original post and that caused some readers to take issue,  <br/>\nespecially with my usage of &quot;non-unschooling.-=-<br/>\n<br/>\nIt&#39;s not about you, and it wasn&#39;t &quot;taking issue.&quot;  It was discussing  <br/>\nideas in the light of what will help other readers understand  <br/>\nunschooling better.<br/>\nClarity is crucial.<br/>\n<br/>\n-=- I should have written &quot;peaceful parenting.&quot; I didn&#39;t think anyone  <br/>\nwanted a verbatim account of the situation, so I took liberty to  <br/>\nsummarize. But that seems to have led to misunderstanding of my  <br/>\nactions and the situation. Here are some more details that will,  <br/>\nperhaps, clarify what happened and how I was not comfortable with my  <br/>\nresponse to my daughter&#39;s slowness at coming inside. -=-<br/>\n<br/>\nI think you&#39;ve missed the point of the responses.  It&#39;s not about the  <br/>\nsituation.  It&#39;s about how you have defined your position in  <br/>\nrelationship to decisions you made, and whether that&#39;s something  <br/>\nothers on the list should emulate or not.<br/>\n<br/>\n-=-When it comes to wet glue, we had together repaired some dollhouse  <br/>\nfurniture. Several times, she touched pieces and we had to reset them,  <br/>\nat which point, I reiterated that touching the wet glue would delay  <br/>\nthe fixing process, as I wrote curtly, &quot;don&#39;t touch wet glue.&quot; The  <br/>\npieces were on the kitchen table and I was not ten feet away nursing  <br/>\nthe baby. -=-<br/>\n<br/>\nMaybe they should have been on the top of the refrigerator, then, and  <br/>\nnot on the kitchen table.  It sounds like entrapment, to leave  <br/>\nsomething she can touch and mess up and get in trouble for.  A safe  <br/>\nplace for glue to dry is as important a step as putting the glue on in  <br/>\nthe first place.  That wasn&#39;t about unschooling, nor about your  <br/>\nchild.  That was something that could have been avoided.<br/>\n<br/>\n-=-And this is where I feel like breakdowns in my peaceful parenting  <br/>\nkeep occurring.-=-<br/>\n<br/>\nDon&#39;t think of yourself as having peaceful parenting which can suffer  <br/>\nbreakdowns.<br/>\nThink of yourself as the bigger half of the relationship between you  <br/>\nand your daughter.<br/>\n<br/>\nYou&#39;ve created a large structure (and can&#39;t decide what to call it),  <br/>\nand people are recommending you dismantle that structure and deal  <br/>\ndirectly with your daughter, no lens, no filter, just you the real  <br/>\nperson and her the real person, partners.<br/>\n<br/>\n-=-The response I get from most parents I know when I seek advice  <br/>\nabout my daughter is all mainstream, bullying tactics. With my voice,  <br/>\nI feel like I bullied my daughter. I respect many unschooling parents  <br/>\nfor their commitment to peaceful resolutions, which is why I solicited  <br/>\nadvice here. -=-<br/>\n<br/>\nAll the time you&#39;ve spent with this would have been better spent being  <br/>\nsweet and playful with your daughter, than trying to persuade us to  <br/>\naccept ever more detailed accounts of why you felt like you bullied  <br/>\nher.  We&#39;re trying to give you simple, direct, happy tools for making  <br/>\ndecisions in each moment, so you won&#39;t feel like a bully.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Young child and not listening","postDate":"1276727341","msgId":55021,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGh2Ymo3ZCs3ODIzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGh2YmR1aCs0bXVwQGVHcm91cHMuY29tPg=="},"prevInTopic":55020,"nextInTopic":55023,"prevInTime":55020,"nextInTime":55022,"topicId":54987,"numMessagesInTopic":0,"msgSnippet":"... ************ Rather than focusing on the words, it might be more helpful to think about why you value those things in the first place. Unschooling or","messageBody":"<div id=\"ygrps-yiv-479906916\">&quot;o_jeansullivan&quot; &lt;o_sully@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Perhaps I should have written in a &quot;non peaceful parenting way&quot; instead of &quot;non-unschooling.&quot;<br/>\n </span></blockquote>************<br/>\n<br/>\nRather than focusing on the words, it might be more helpful to think about why you value those things in the first place. Unschooling or peaceful parenting aren&#39;t things you picked at random - so what&#39;s good about those things? Break the big ideals down into the smaller, more manageable principles. Maybe you wish you&#39;d been more peaceful in the moment - that&#39;s something to think about. What constitutes peace when you&#39;re juggling the needs of two kids, plus your own? Its not likely to be the same kind of peace that comes when you&#39;re all snuggled on the bed together. <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/peace/noisy\">http://sandradodd.com/peace/noisy</a><br/>\n<br/>\nYou yelled and felt icky about that - its okay to just stop with that, too, rather than identify feeling icky as tied to some moral highground. You&#39;d rather not be in that situation again. You&#39;d rather not feel backed into a corner where that&#39;s the only response you have left. When you get down to that level it doesn&#39;t matter if you&#39;re looking for an unschooling or more peaceful solution - you&#39;re looking for better ways to deal, more options for &quot;next time&quot;. More and better options are good things!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;However, the not listening by my daughter has led me to not be so peaceful at times.<br/>\n </span></blockquote>********<br/>\n<br/>\nIts funny, but I read this as &quot;not listening To my daughter&quot; the first time through and thought &quot;well, yes, not listening to people often leads to a lack of peace&quot; - not really what you were saying! But at the same time there&#39;s an element of that involved. You&#39;re not communicating well and one of the reasons is that you&#39;re thinking too much about communication in terms of you speaking and your dd listening. Observation and consideration are big big parts of communicating with young children - with anyone, really, but its easier to see this with young children because talking is less of an option. So part of communicating better with your dd involves observing her reactions and rythms and working those into your consideration. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":3007071,"authorName":"o_jeansullivan","from":"&quot;o_jeansullivan&quot; &lt;o_sully@...&gt;","profile":"o_jeansullivan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Young child and not listening","postDate":"1276724785","msgId":55023,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGh2YmduaCt2bnIwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGltMk5Td3JJX2lQQ2NMdW9BRzhpQ2drTXEwdjVpS2xTcnpSeXdFcEBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":55021,"nextInTopic":55025,"prevInTime":55022,"nextInTime":55024,"topicId":54987,"numMessagesInTopic":0,"msgSnippet":"After reading the responses, it seems as though I wasn t explicit enough in my original post and that caused some readers to take issue, especially with my","messageBody":"<div id=\"ygrps-yiv-1495550252\">After reading the responses, it seems as though I wasn&#39;t explicit enough in my original post and that caused some readers to take issue, especially with my usage of &quot;non-unschooling.&quot;  I should have written &quot;peaceful parenting.&quot;  I didn&#39;t think anyone wanted a verbatim account of the situation, so I took liberty to summarize.  But that seems to have led to misunderstanding of my actions and the situation.  Here are some more details that will, perhaps, clarify what happened and how I was not comfortable with my response to my daughter&#39;s slowness at coming inside.    <br/>\n<br/>\nI initially told my daughter when we got the baby to sleep in his crib that we could go outside for about an hour.  My expectation for his nap was off, therefore I didn&#39;t expect to have to go inside at 45 minutes.  Mostly the baby naps on me in a Moby, but for this nap, I was able to put him in his crib so that my 3 yo and I could go pick pea pods and strawberries in the garden together.  My plan had been to have us go inside after an hour, which would have worked perfectly if the baby had slept that long.  And I would have allowed time for my daughter to come in at her pace.  When I first heard the baby on the monitor, I explained that we had to go inside, and my 3 yo started following me around to the garage.  When I turned the side of house and waited for her, she did not appear.  The baby was starting to get upset at this time.  That is also when she decided she needed to go the long way around and slowly ride her scooter back into the garage.  I caught up with her when she was getting on her scooter.  That is when I yelled and I ended up carrying the scooter into the garage to hurry up the process.  This resulted in her tears and yelling that she wanted to take it into the garage &quot;all by herself.&quot;  But this accomplished the deed of getting her inside so I could get the baby.  But I&#39;m not comfortable with my response of yelling at her.<br/>\n<br/>\nWhen it comes to wet glue, we had together repaired some dollhouse furniture.  Several times, she touched pieces and we had to reset them, at which point, I reiterated that touching the wet glue would delay the fixing process, as I wrote curtly, &quot;don&#39;t touch wet glue.&quot;  The pieces were on the kitchen table and I was not ten feet away nursing the baby.  We&#39;ve done lots of projects before and my 3 yo has played with glue many times. In this instance, her compulsion took over her knowledge of fixing things with glue.  As for slapping, our response has been that we treat people as we want to be treated.  But for this child, maybe for most 3 yo, empathy isn&#39;t easily understood.  And this is where I feel like breakdowns in my peaceful parenting keep occurring.  She couldn&#39;t empathize with her brother who was getting more upset.  She has a hard time empathizing with me when I tell her not to hit me.  <br/>\n<br/>\nThe response I get from most parents I know when I seek advice about my daughter is all mainstream, bullying tactics.  With my voice, I feel like I bullied my daughter.  I respect many unschooling parents for their commitment to peaceful resolutions, which is why I solicited advice here.  <br/>\n<br/>\n   <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Vidyut Kale &lt;wide.aware@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; &quot;So parents, how do I get my otherwise independent daughter to listen to me<br/>\n&gt; when it is important that she does?&quot;<br/>\n&gt; <br/>\n&gt; I read your post several times over the last couple of days, and I couldn&#39;t<br/>\n&gt; put my finger on what was niggling me. Which, at the risk of sounding very<br/>\n&gt; non-unschooling (if that exists), I think I identified. The part where you<br/>\n&gt; act seems missing. What are you DOING when she touches wet glue, or slaps<br/>\n&gt; you or doesn&#39;t cooperate with an urgent moment? Have wet glue where/when she<br/>\n&gt; doesn&#39;t notice it. Dodge when she slaps, you have two kids, so find ways to<br/>\n&gt; not become inaccessible to one of them..... don&#39;t whisper, don&#39;t raise your<br/>\n&gt; voice, ACT as needed in the moment...?<br/>\n&gt; <br/>\n&gt; I see nothing wrong with the urgency conveyed in &quot;Get inside NOW&quot;. For that<br/>\n&gt; matter, I doubt if I&#39;d wait 8-10 minutes for action to happen while there<br/>\n&gt; was an infant that needs attention NOW (like you said). I&#39;d probably go,<br/>\n&gt; &quot;There goes the monitor, race you to the door&quot; or something. Or, like others<br/>\n&gt; said, pick and run.<br/>\n&gt; <br/>\n&gt; While I don&#39;t have two kids, in your place I&#39;d probably focus on a &#39;game<br/>\n&gt; plan&#39; for when baby needs &#39;OUR&#39; attention and make the other child a part of<br/>\n&gt; the emergency response. Of course, if its an all the time thing, I&#39;d also<br/>\n&gt; have strategies for help rather than continual disruptions.<br/>\n&gt; <br/>\n&gt; I don&#39;t think unschooling is about this kind of tiptoeing or &#39;getting&#39;<br/>\n&gt; anyone to do anything. If the urgency is in your heart, its far more real to<br/>\n&gt; enact it in that moment. I don&#39;t think its the end of the world to have a<br/>\n&gt; blazing fast response spontaneously done. If you include your daughter, its<br/>\n&gt; likely she might feel like the knight on a white horse charging in to save<br/>\n&gt; her brother rather than you disrupting her fun because you want to pay<br/>\n&gt; attention to something else that has become more important than her (of<br/>\n&gt; course she resists letting go of attention). I also don&#39;t think it is the<br/>\n&gt; end of the world if it doesn&#39;t work out like that and she is not in the mood<br/>\n&gt; to go with your emergency response, but you carry her along anyway.<br/>\n&gt; <br/>\n&gt; Though I guess more experienced unschoolers are probably more graceful about<br/>\n&gt; it.<br/>\n&gt; <br/>\n&gt; Vidyut<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Young child and not listening","postDate":"1276723408","msgId":55020,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDMTk0MEQwLjIwNDAwQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PGh2YmR1aCs0bXVwQGVHcm91cHMuY29tPg==","referencesHeader":"PGh2YmR1aCs0bXVwQGVHcm91cHMuY29tPg=="},"prevInTopic":55019,"nextInTopic":55021,"prevInTime":55019,"nextInTime":55021,"topicId":54987,"numMessagesInTopic":0,"msgSnippet":"... This is still the equivalent of what I was saying before about people asking, Is this the right way? or Is this okay? or Am I doing it right? It is","messageBody":"<div id=\"ygrps-yiv-2066002571\">On 6/16/2010 1:58 PM, o_jeansullivan wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Perhaps I should have written in a &quot;non peaceful parenting way&quot; <br/>\n&gt; instead of &quot;non-unschooling.&quot;<br/>\n<br/>\n </span></blockquote>This is still the equivalent of what I was saying before about people <br/>\nasking, &quot;Is this the right way?&quot; or &quot;Is this okay?&quot; or &quot;Am I doing it <br/>\nright?&quot;<br/>\n<br/>\nIt is still trying to fit into some group&#39;s way of doing things.<br/>\n<br/>\nAn alternative is to consider the ideas of others, but figure out how <br/>\nyou want to use them in your own life with your own kids in the ways <br/>\nthat seem best to you.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Young child and not listening","postDate":"1276722722","msgId":55019,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERDODEwRDFELUQxRDMtNDE0QS05NTUwLThEMzlGNDU2MUZBNEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGh2YmR1aCs0bXVwQGVHcm91cHMuY29tPg==","referencesHeader":"PGh2YmR1aCs0bXVwQGVHcm91cHMuY29tPg=="},"prevInTopic":55017,"nextInTopic":55020,"prevInTime":55018,"nextInTime":55020,"topicId":54987,"numMessagesInTopic":0,"msgSnippet":"-=-Perhaps I should have written in a non peaceful parenting way instead of non-unschooling. -=- It s still written in a lack-of-something-else way. Maybe","messageBody":"<div id=\"ygrps-yiv-1999362824\">-=-Perhaps I should have written in a &quot;non peaceful parenting way&quot;  <br/>\ninstead of &quot;non-unschooling.&quot;-=-<br/>\n<br/>\nIt&#39;s still written in a lack-of-something-else way.<br/>\n<br/>\nMaybe you could have said &quot;It wasn&#39;t as gentle as I could have been,&quot;  <br/>\nor &quot;It wasn&#39;t the best choice I could have made.&quot;&#92;<br/>\n<br/>\n-=-In descriptions, I tend to lump the parents who unschool into the  <br/>\npeaceful/non-aggressive parenting camp, although I know the two do not  <br/>\nalways go hand in hand. -=-<br/>\n<br/>\nYou were still lumping it into a camp.<br/>\nThat was my main objection.<br/>\n<br/>\nWhen I interact with my child, I shouldn&#39;t have a cast of thousands  <br/>\nand a philosophical &quot;lump&quot; or camp between me and her.  It should me  <br/>\nmaking a choice to be the way I&#39;d like to be.<br/>\n<br/>\nSomeone can do that without ANY thoughts of &quot;non-aggressive parenting  <br/>\ncamps&quot; or &quot;anti-non-pro-unschoolingesque&quot; labels.<br/>\nIt&#39;s the label that&#39;s the problem.  It&#39;s comparing a choice we&#39;ve made  <br/>\nto an ideal in a vague camp elsewhere.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":3007071,"authorName":"o_jeansullivan","from":"&quot;o_jeansullivan&quot; &lt;o_sully@...&gt;","profile":"o_jeansullivan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Young child and not listening","postDate":"1276721937","msgId":55017,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGh2YmR1aCs0bXVwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEUxMzIwRTUyLTk2OEMtNDFFQS04Rjc4LUNCQjUwNDA0MjZBREBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":55015,"nextInTopic":55019,"prevInTime":55016,"nextInTime":55018,"topicId":54987,"numMessagesInTopic":0,"msgSnippet":"... Perhaps I should have written in a non peaceful parenting way instead of non-unschooling.  In descriptions, I tend to lump the parents who unschool","messageBody":"<div id=\"ygrps-yiv-1750127228\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; -=-In a very non-unschooling way, I ended up yelling &quot;Get inside NOW&quot; - <br/>\n&gt; =-<br/>\n&gt; <br/>\n&gt; Something has gone wrong in the world of &quot;very unschooling&quot; if there  <br/>\n&gt; is the idea of a &quot;very non-unschooling&quot; way of being.<br/>\n&gt; <br/>\n&gt; Of course there is, but unschooling itself shouldn&#39;t be the focus of  <br/>\n&gt; anyone&#39;s life, and it seems that&#39;s happening in many places these  <br/>\n&gt; days.   Either someone is giving some really bad advice out there, or  <br/>\n&gt; some people are just squinting at unschooling and thinking it&#39;s a new  <br/>\n&gt; set of rules they could easily break in some very non-unschooling way.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Perhaps I should have written in a &quot;non peaceful parenting way&quot; instead of &quot;non-unschooling.&quot;  In descriptions, I tend to lump the parents who unschool into the peaceful/non-aggressive parenting camp, although I know the two do not always go hand in hand. My husband and I attempt to be very peaceful and respectful of our children.  However, the not listening by my daughter has led me to not be so peaceful at times.<br/>\n<br/>\nThere are lots of responses to read to my original post, so onward I go to read the advice.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Young child and not listening","postDate":"1276719077","msgId":55014,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM1MDREMzE1LUIxMzMtNDNFMy04MUI5LTUxMjNDQjU4ODk5NkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDRDMTkxOTUwLjcwNjAxMDFAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PGh2YjBzYStrN2ExQGVHcm91cHMuY29tPiA8NEMxOTE5NTAuNzA2MDEwMUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":55013,"nextInTopic":55015,"prevInTime":55013,"nextInTime":55015,"topicId":54987,"numMessagesInTopic":0,"msgSnippet":"-=- Instead of don t slap me try I don t like that . At the same time ... stumped - ... and ... Here s a collection of things to do with kids who need more","messageBody":"<div id=\"ygrps-yiv-1529489489\">-=-&gt; Instead of &quot;don&#39;t slap me&quot; try &quot;I don&#39;t like that&quot;. At the same  <br/>\ntime<br/>\n<blockquote><span title=\"ireply\">  &gt; look into why she&#39;s slapping. Is it to get your attention? Be more<br/>\n &gt; attentive. Is she antsy? find her other fun things to do that are<br/>\n &gt; really physical. Sometimes moms with active little girls get  <br/>\n </span></blockquote>stumped -<br/>\n<blockquote><span title=\"ireply\">  &gt; it can help to look for &quot;boy&quot; fun if she&#39;s bouncing off the walls and<br/>\n &gt; you&#39;re tearing out your hair. Think climbing and swinging on ropes  <br/>\n </span></blockquote>and<br/>\n<blockquote><span title=\"ireply\">  &gt; hitting things with sticks and bats. Think crawling around pretending<br/>\n &gt; to be an animal or jumping like a kangaroo.-=-<br/>\n<br/>\n </span></blockquote>Here&#39;s a collection of things to do with kids who need more physical  <br/>\nactivity:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/physicality/\">http://sandradodd.com/physicality/</a><br/>\n<br/>\nBut I agree with Pam, that the problem with suggestions about what  <br/>\nparents might do instead could be misinterpreted.  Yes, it&#39;s worth  <br/>\nknowing why the child is slapping the mom, but nothing is going to  <br/>\nmake it okay for anyone past the age of a nursing baby to be doing  <br/>\nthat.  And if a child tries any finite list and says &quot;tried all that,  <br/>\nit didn&#39;t work...&quot; then I&#39;m afraid they&#39;ll think &quot;...so I have to  <br/>\nallow the slapping.&quot;<br/>\n<br/>\nFirst, make clear that it&#39;s not okay.  And I&#39;m NOT talking about the  <br/>\nmainstream &quot;hit him back&quot; or &quot;put him in time out&quot; or spank or  <br/>\nanything.    But how about &quot;OUCH!&quot;?   How about &quot;Don&#39;t.&quot;  How about  <br/>\ngetting up and walking away?  (If there&#39;s not a pool or pond or fire  <br/>\nright there...)    I remember saying &quot;touch soft,&quot; or &quot;be gentle,&quot; and  <br/>\nthen acting it out, on the child or on a cat or dog.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Young child and not listening","postDate":"1276718648","msgId":55015,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDczNDEzODRGLUY5RkEtNEFFNS04M0Q4LTI0ODVDNkUwRjAyMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDRDMTkwQzA4LjkwNzA3MDVAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PGh2OWRwcitkN2FuQGVHcm91cHMuY29tPiA8RTEzMjBFNTItOTY4Qy00MUVBLThGNzgtQ0JCNTA0MDQyNkFEQFNhbmRyYWRvZGQuY29tPiA8NEMxOTBDMDguOTA3MDcwNUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":55014,"nextInTopic":55017,"prevInTime":55014,"nextInTime":55016,"topicId":54987,"numMessagesInTopic":0,"msgSnippet":"-=-When people ask, Is this okay? or Is this unschooling? or Am I doing this right? then I know they haven t really got the idea of unschooling, yet,","messageBody":"<div id=\"ygrps-yiv-453989221\">-=-When people ask, &quot;Is this okay?&quot; or &quot;Is this unschooling?&quot; or &quot;Am I<br/>\ndoing this right?&quot; then I know they haven&#39;t really got the idea of<br/>\nunschooling, yet, because they are still thinking that others are going<br/>\nto be able to actually answer such questions.-=-<br/>\n<br/>\nAH...  but sometimes someone will tell ME &quot;that&#39;s not unschooling&quot; or  <br/>\n&quot;that&#39;s not okay&quot; or &quot;I thought if you were an unschooler, you would...&quot;<br/>\n<br/>\nAnd then I think they believe they HAVE found others who can actually  <br/>\nanswer that question.  And they&#39;re passing &quot;the answer&quot; along to me.<br/>\n<br/>\nLiving by principles rather than by rules means each decision is made  <br/>\nindependently, based on the best options, considering lots of  <br/>\nfactors.    &quot;Can we stay longer?&quot; shouldn&#39;t be a question with a pre- <br/>\ndetermined answer.   Maybe isn&#39;t even always the answer.  Sometimes  <br/>\nthe answer is &quot;Not this time; we&#39;re already late to pick [dad or  <br/>\nsomeone] up, and he&#39;s waiting, so let&#39;s hurry!&quot;   And if the mom had  <br/>\njust said &quot;let&#39;s go&quot; for no good reason, and she has nowhere to go,  <br/>\nand the kid really IS having fun, she needs to run through all those  <br/>\nfactors and see whether she&#39;s being arbitrary and unreasonable or  <br/>\nimpatient for no reason.   Maybe she is.  Maybe she isn&#39;t. Maybe she&#39;s  <br/>\nfeeling ill and needs to get back home.  Maybe someone&#39;s getting  <br/>\nsunburned.   I don&#39;t know all possible factors.  If a hundred people  <br/>\non this list threw out ten factors apiece, it would be a whole lot of  <br/>\nfactors, and maybe none would apply to any one situation.<br/>\n<br/>\nUnschooling isn&#39;t easy.  If anyone told you it was, consider what that  <br/>\nperson had to gain by making a claim like that.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Young child and not listening","postDate":"1276718308","msgId":55013,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMwMzI0RkY2LTM1M0MtNEM5Ni1BRUNDLTZDNzc5MENENTk3NUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDRDMTkwQzA4LjkwNzA3MDVAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PGh2OWRwcitkN2FuQGVHcm91cHMuY29tPiA8RTEzMjBFNTItOTY4Qy00MUVBLThGNzgtQ0JCNTA0MDQyNkFEQFNhbmRyYWRvZGQuY29tPiA8NEMxOTBDMDguOTA3MDcwNUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":55012,"nextInTopic":55014,"prevInTime":55012,"nextInTime":55014,"topicId":54987,"numMessagesInTopic":0,"msgSnippet":"-=- I think the parents don t have a good sense of how to stay strong and clear and appropriately in charge, as the responsible adult in the relationship,","messageBody":"<div id=\"ygrps-yiv-245964552\">-=- I think the parents don&#39;t have a good sense<br/>\nof how to stay strong and clear and appropriately in charge, as the<br/>\nresponsible adult in the relationship, while still giving their child a<br/>\nwhole lot of freedom to make their own choices. Again, I think they feel<br/>\nhyper-sensitive to any hint of control and maybe are afraid they would<br/>\nbe turning into their own parents if they exert any control at all.<br/>\nMaybe they feel like there is a slippery slope there, or maybe they<br/>\nreally can&#39;t distinguish between appropriate control and too much  <br/>\ncontrol.-=-<br/>\n<br/>\nI agree with all of that but reading it from what I think is the point  <br/>\nof view of some of the younger moms with problems, they might only see  <br/>\n&quot;control,&quot; over and over.<br/>\n<br/>\nMaybe thinking of it as management or coaching would help.  It doesn&#39;t  <br/>\nchange what actually happens, but it might be a way to see it from a  <br/>\ndifferent angle.<br/>\n<br/>\nSometimes I&#39;ve used the analogy of hosting a party.   I&#39;ve met some  <br/>\nTERRIBLE party hosts, who invited a bunch of people over but didn&#39;t  <br/>\nhave any toilet paper or ice.   Having a good unschooling day is like  <br/>\nhosting a party.   Think in advance of what would be fun, and what  <br/>\nsupplies are needed, and avoid things that would make it uncomfortable  <br/>\nor might turn into a fight.  A party where there&#39;s a fight isn&#39;t a  <br/>\nparty anymore.  Sometimes, being a host, you need to suggest an  <br/>\nactivity, or move a tight crowd of people toward some empty chairs and  <br/>\ntables.  Sometimes (probably always) you put some things away so they  <br/>\nwon&#39;t get broken.  Sometimes you put a guest away (in a way) by  <br/>\noffering them a bed, or asking them to go on an errand if they&#39;re  <br/>\nsober and feeling restless.   But SOMEbody is ultimately in charge of  <br/>\nevery good party.   The best parties look spontaneous and seem to be  <br/>\nunfolding naturally, but that takes a lot of planning and preparation.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Young child and not listening","postDate":"1276718041","msgId":55012,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDMTkyQkQ5LjYwNjA2MDBAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PEFBTkxrVGluRkV4RUlsazVoRzBIeXR6czBIWTRFNkc4dWhJUFg2ZWZ5c0NEU0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGh2OWRwcitkN2FuQGVHcm91cHMuY29tPgk8RTEzMjBFNTItOTY4Qy00MUVBLThGNzgtQ0JCNTA0MDQyNkFEQFNhbmRyYWRvZGQuY29tPiA8QUFOTGtUaW5GRXhFSWxrNWhHMEh5dHpzMEhZNEU2Rzh1aElQWDZlZnlzQ0RTQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":55011,"nextInTopic":55013,"prevInTime":55011,"nextInTime":55013,"topicId":54987,"numMessagesInTopic":0,"msgSnippet":"... The original poster of this thread has only pre-school age children so the issue is truly much more a parenting thing than an unschooling thing.  That is","messageBody":"<div id=\"ygrps-yiv-1265496158\">On 6/16/2010 12:24 PM, k wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; In this case, it&#39;s not the unschooling that presents challenges to the<br/>\n&gt; parent because the thing one is going through would be there whether<br/>\n&gt; unschooling were present or not.<br/>\n&gt;<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>The original poster of this thread has only pre-school age children so <br/>\nthe issue is truly much more a parenting thing than an unschooling <br/>\nthing.  That is probably why the focus seems not to be on learning and <br/>\nmore on the parent/child balance of power. The principles brought up by <br/>\nthe question are good ones for parents planning to unschool to grapple <br/>\nwith early on, anyway.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Playing with post it notes WAS Re: Young child \tand not listening","postDate":"1276717004","msgId":55011,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlsSlVndG9ldEVib1QxMTNfTXRJaWpfMVJOdmo1QkJKM0RMd2JiTEBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDQyNTM5OS45MTgzNC5xbUB3ZWI4MTUwMS5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PGh2YjBzYStrN2ExQGVHcm91cHMuY29tPgk8NEMxOTE4OTguMzAxMDMwNEBlYXJ0aGxpbmsubmV0Pgk8NDI1Mzk5LjkxODM0LnFtQHdlYjgxNTAxLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":55010,"nextInTopic":55012,"prevInTime":55010,"nextInTime":55012,"topicId":54987,"numMessagesInTopic":0,"msgSnippet":"There s a WHOLE bunch o those: http://www.youtube.com/results?search_query=mario+post-it so thanks for inspiration, Alex. That was fun! ~Katherine","messageBody":"<div id=\"ygrps-yiv-1134582007\">There&#39;s a WHOLE bunch o&#39;those:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/results?search_query=mario+post-it\">http://www.youtube.com/results?search_query=mario+post-it</a><br/>\nso thanks for inspiration, Alex. That was fun!<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 6/16/10, BRIAN POLIKOWSKY &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:polykowholsteins@...\">polykowholsteins@...</a>&gt; wrote:<br/>\n&gt; This is what can happen when playing with post-it notes and tape:<br/>\n&gt; Super Mario<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=QAue4hnH8-A\">http://www.youtube.com/watch?v=QAue4hnH8-A</a><br/>\n&gt;<br/>\n&gt; Alex Polikowsky<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Young child and not listening","postDate":"1276716265","msgId":55010,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGluRkV4RUlsazVoRzBIeXR6czBIWTRFNkc4dWhJUFg2ZWZ5c0NEU0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEUxMzIwRTUyLTk2OEMtNDFFQS04Rjc4LUNCQjUwNDA0MjZBREBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGh2OWRwcitkN2FuQGVHcm91cHMuY29tPgk8RTEzMjBFNTItOTY4Qy00MUVBLThGNzgtQ0JCNTA0MDQyNkFEQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":55008,"nextInTopic":55011,"prevInTime":55009,"nextInTime":55011,"topicId":54987,"numMessagesInTopic":0,"msgSnippet":"-=-In a very non-unschooling way, I ended up yelling Get inside NOW -=- ... is the idea of a very non-unschooling way of being.","messageBody":"<div id=\"ygrps-yiv-304608812\">-=-In a very non-unschooling way, I ended up yelling &quot;Get inside NOW&quot; -=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;Something has gone wrong in the world of &quot;very unschooling&quot; if there<br/>\n </span></blockquote>is the idea of a &quot;very non-unschooling&quot; way of being.&lt;&lt;&lt;<br/>\n<br/>\nIt is disturbing when I read or hear stuff like that because it sounds<br/>\nlike people are looking for a reason their life is hard and the reason<br/>\nthey find is unschooling?<br/>\n<br/>\nHow about the adage from Mary Gold that &quot;it&#39;s not the unschooling?&quot;<br/>\nfrom <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/gold/journey\">http://sandradodd.com/gold/journey</a><br/>\n<br/>\n&quot;I had a sign that I put up on my mirror that said Its NOT the<br/>\nunschooling, its ___________ and then I would fill in the blank. Its<br/>\nnot the unschooling, its P.M.S. (That was a big one, thus the once a<br/>\nmonth nature of my panic attacks.) or Its not the unschooling, its<br/>\nflu season. Or its not the unschooling its time for the in-laws to<br/>\nvisit. (Another biggie.) After I filled in enough different<br/>\nvariations, I realized that I really needed only one sign to remind me<br/>\nwhat its all about. Its not the unschooling, its LIFE.&quot;<br/>\n<br/>\nIn this case, it&#39;s not the unschooling that presents challenges to the<br/>\nparent because the thing one is going through would be there whether<br/>\nunschooling were present or not.<br/>\n<br/>\n~Katherine</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Playing with post it notes WAS Re: Young child and not listening","postDate":"1276714552","msgId":55008,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyNTM5OS45MTgzNC5xbUB3ZWI4MTUwMS5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDRDMTkxODk4LjMwMTAzMDRAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PGh2YjBzYStrN2ExQGVHcm91cHMuY29tPiA8NEMxOTE4OTguMzAxMDMwNEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":55006,"nextInTopic":55010,"prevInTime":55007,"nextInTime":55009,"topicId":54987,"numMessagesInTopic":0,"msgSnippet":"This is what can happen when playing with post-it notes and tape: Super Mario http://www.youtube.com/watch?v=QAue4hnH8-A  Alex Polikowsky [Non-text portions","messageBody":"<div id=\"ygrps-yiv-16528850\">This is what can happen when playing with post-it notes and tape:<br/>\nSuper Mario <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=QAue4hnH8-A\">http://www.youtube.com/watch?v=QAue4hnH8-A</a><br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[{"url":"http://www.youtube.com/embed/QAue4hnH8-A?wmode=opaque","type":"VIDEO"}]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Young child and not listening","postDate":"1276713296","msgId":55006,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDMTkxOTUwLjcwNjAxMDFAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PGh2YjBzYStrN2ExQGVHcm91cHMuY29tPg==","referencesHeader":"PGh2YjBzYStrN2ExQGVHcm91cHMuY29tPg=="},"prevInTopic":55005,"nextInTopic":55008,"prevInTime":55005,"nextInTime":55007,"topicId":54987,"numMessagesInTopic":0,"msgSnippet":"... For the most part, I agree with the above. However, there is a time to state, clearly and strongly, Do not hit me. I ve seen too many unschooling parents","messageBody":"<div id=\"ygrps-yiv-2038877014\">On 6/16/2010 10:15 AM, plaidpanties666 wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Instead of &quot;don&#39;t slap me&quot; try &quot;I don&#39;t like that&quot;. At the same time <br/>\n&gt; look into why she&#39;s slapping. Is it to get your attention? Be more <br/>\n&gt; attentive. Is she antsy? find her other fun things to do that are <br/>\n&gt; really physical. Sometimes moms with active little girls get stumped - <br/>\n&gt; it can help to look for &quot;boy&quot; fun if she&#39;s bouncing off the walls and <br/>\n&gt; you&#39;re tearing out your hair. Think climbing and swinging on ropes and <br/>\n&gt; hitting things with sticks and bats. Think crawling around pretending <br/>\n&gt; to be an animal or jumping like a kangaroo.<br/>\n<br/>\n </span></blockquote>For the most part, I agree with the above. However, there is a time to <br/>\nstate, clearly and strongly, &quot;Do not hit me.&quot;<br/>\n<br/>\nI&#39;ve seen too many unschooling parents sweetly going on about how they <br/>\ndon&#39;t like something, while the kid keeps on smacking them. That&#39;s not <br/>\ngood for the child. Physically restrain them, put them down, back away <br/>\nand say, &quot;Stop&quot; and mean it - don&#39;t sit there and let a kid beat up on <br/>\nyou while you think about what they really need.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Young child and not listening","postDate":"1276713112","msgId":55005,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDMTkxODk4LjMwMTAzMDRAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PGh2YjBzYStrN2ExQGVHcm91cHMuY29tPg==","referencesHeader":"PGh2YjBzYStrN2ExQGVHcm91cHMuY29tPg=="},"prevInTopic":55001,"nextInTopic":55006,"prevInTime":55004,"nextInTime":55006,"topicId":54987,"numMessagesInTopic":0,"msgSnippet":"... This is part of that process I was talking about - we aren t always going to anticipate accurately every situation, but we ll make corrections as we go","messageBody":"<div id=\"ygrps-yiv-1479966177\">On 6/16/2010 10:15 AM, plaidpanties666 wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; If you find you&#39;re saying a lot of those kinds of &quot;don&#39;ts&quot; then look <br/>\n&gt; for ways to make your home more kid friendly.<br/>\n<br/>\n </span></blockquote>This is part of that process I was talking about - we aren&#39;t always <br/>\ngoing to anticipate accurately every situation, but we&#39;ll make <br/>\ncorrections as we go along making better and better choices. Learning. <br/>\nUnschooling doesn&#39;t mean never saying &quot;don&#39;t.&quot; But it does mean finding <br/>\nways to avoid saying &quot;don&#39;t.&quot; Just ONE way is to say yes, instead. My <br/>\nhusband used to say, &quot;don&#39;t&quot; to the kids playing with tape and with <br/>\npost-it notes - it seemed so wasteful to him and not good for the kids <br/>\nto do it. Then my mom gave them tape and some other office supplies <br/>\nwrapped as a gift. After they&#39;d opened it and played with it for a <br/>\nwhile, she commented that they were sure having a lot of fun with a <br/>\nsuper cheap gift. It somehow legitimized playing with tape, for him, and <br/>\nhe didn&#39;t have the same negative feelings about it, after that. He still <br/>\nwas disturbed when they &quot;played&quot; with post-it notes, so my mom made that <br/>\nsomething they did a TON of at her house. She had a little drawer she <br/>\nkept stocked with office supplies that were entirely at the kids&#39; <br/>\ndisposal to do whatever they wanted with and she always left them <br/>\npost-it notes all over her house - even before they could read. And all <br/>\nthe grandkids would leave post-it notes for her in funny places for her <br/>\nto find. This went on for years. It wasn&#39;t hard for my kids to handle <br/>\n&quot;don&#39;t&quot; at home - they understood that was something special to do at <br/>\nGrandma&#39;s house. So - there is an example of a creative solution, but <br/>\nsome hard-core types would think my husband should have been the one to <br/>\ntotally give in. He probably would have, if I&#39;d pushed the issue. But he <br/>\nhas reasons for his feelings and they count, too. He grew up in a very <br/>\nvery different kind of life - small town in Iran, very authoritarian <br/>\nparenting, lots of punishment, no toys - and was already being stretched <br/>\nin a million different ways. If we could find a way to make him more <br/>\ncomfy in these little ways, seemed to me to be a good idea.<br/>\n<br/>\nSo - judgment is required. Nobody&#39;s situation is exactly like anybody <br/>\nelse&#39;s.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Young child and not listening","postDate":"1276709896","msgId":55001,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDMTkwQzA4LjkwNzA3MDVAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PEUxMzIwRTUyLTk2OEMtNDFFQS04Rjc4LUNCQjUwNDA0MjZBREBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGh2OWRwcitkN2FuQGVHcm91cHMuY29tPiA8RTEzMjBFNTItOTY4Qy00MUVBLThGNzgtQ0JCNTA0MDQyNkFEQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":55000,"nextInTopic":55005,"prevInTime":55000,"nextInTime":55002,"topicId":54987,"numMessagesInTopic":0,"msgSnippet":"... I think unschooling is appealing to people who still feel the effects of having been over-controlled, themselves, as children. They are still reacting to","messageBody":"<div id=\"ygrps-yiv-1537905917\">On 6/16/2010 8:42 AM, Sandra Dodd wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; But try<br/>\n&gt; to assume that the way you (anyone reading this) learned about<br/>\n&gt; unschooling could have been skewed and awkward.<br/>\n<br/>\n </span></blockquote>I think unschooling is appealing to people who still feel the effects of <br/>\nhaving been over-controlled, themselves, as children. They are still <br/>\nreacting to that and don&#39;t want to &quot;do that&quot; to their own children. <br/>\nUnschooling seems to offer a philosophical or rational basis for not <br/>\ncontrolling their children.<br/>\n<br/>\nSo - for them - unschooling is all about who is in control, in every <br/>\naspect of life.<br/>\n<br/>\nThis is tricky to respond to - there are people who have the urge to <br/>\nmicromanage every aspect of their kids&#39; lives and they need to hear that <br/>\nthey really cannot control what their children learn and that trying to <br/>\ncontrol it is counterproductive to a happy learning lifestyle. They need <br/>\nto understand more about how to let go of arbitrary restrictions and <br/>\nrules and be more facilitators and supporters.<br/>\n<br/>\nBut, there are others who seem to hear the above and take it to mean <br/>\nthat the parent should give all power to the child and always honor and <br/>\nobey the child&#39;s every desire, immediately, without compromise or <br/>\ndelay.  I&#39;ve seen situations, for example, where a child is hitting or <br/>\nkicking a parent, and the parent doesn&#39;t make the child stop or put the <br/>\nchild down or move away or respond to the hitting and kicking at all, <br/>\nbut keeps sweetly offering one thing after another to the child, trying <br/>\nto find something the child wants.  Unschooling does NOT mean the <br/>\nparents should become the child&#39;s punching bag. That&#39;s an extreme <br/>\nversion, though, of the kind of timidity some people seem to have, using <br/>\nunschooling as their excuse. I think the parents don&#39;t have a good sense <br/>\nof how to stay strong and clear and appropriately in charge, as the <br/>\nresponsible adult in the relationship, while still giving their child a <br/>\nwhole lot of freedom to make their own choices. Again, I think they feel <br/>\nhyper-sensitive to any hint of control and maybe are afraid they would <br/>\nbe turning into their own parents if they exert any control at all. <br/>\nMaybe they feel like there is a slippery slope there, or maybe they <br/>\nreally can&#39;t distinguish between appropriate control and too much control.<br/>\n<br/>\n  I think there is a misconception that unschooling parents should never <br/>\nclearly and strongly insist on anything, but should always go completely <br/>\nalong with whatever their child wants at that moment. People feel like <br/>\nunschooling failures if their child ever has to do anything against <br/>\ntheir will and they feel like failures if their child is ever unhappy <br/>\nabout anything, even just for a few minutes.<br/>\n<br/>\nThere is no rule for when a parent should insist on something. There is <br/>\njudgment involved. The focus in unschooling isn&#39;t, however, on turning <br/>\nover all power in the family to the children. The focus isn&#39;t on who has <br/>\npower and who doesn&#39;t. The focus is on creating a lifestyle that <br/>\nsupports natural learning. Parents will find themselves exerting less <br/>\ncontrol in an unschooling family, compared to most conventional families <br/>\nin which kids are schooled, because a more collaborative, cooperative <br/>\nand child-friendly lifestyle that is based more on big principles and <br/>\nless on specific rules is more conducive to creating a great environment <br/>\nfor natural learning.<br/>\n<br/>\nWhen people ask, &quot;Is this okay?&quot; or &quot;Is this unschooling?&quot; or &quot;Am I <br/>\ndoing this right?&quot; then I know they haven&#39;t really got the idea of <br/>\nunschooling, yet, because they are still thinking that others are going <br/>\nto be able to actually answer such questions.<br/>\n<br/>\nInstead, when faced with a difficult situation (such as the one that <br/>\nstarted of this thread) think quickly of a couple of choices and quickly <br/>\nask yourself, &quot;Which will lead to more happiness in our lives?&quot; &quot;Which <br/>\nchoice will better support learning?&quot;  Pick the best of the choices you <br/>\nhave thought of. If your only two options seem, at the moment, to be <br/>\n&quot;leave my daughter in real danger near an open pond&quot; versus &quot;pick her up <br/>\nand carry her with me into the house, even though she&#39;s screaming and <br/>\nfighting me,&quot; then isn&#39;t the better of those two choices clear?<br/>\n<br/>\n  Then, later, think back about how you got into that particular <br/>\nsituation and see if you can come up with another option - especially <br/>\nsee if you can come up with an option that avoids you getting into that <br/>\nsituation. If it seems to you tht it is unavoidable that such situations <br/>\nare going to happen, then come up with other options about how to react.<br/>\n<br/>\nThis is a process - it is what life with children is like. We might <br/>\nstart out with general ideas/principles, but we don&#39;t start out with the <br/>\nanswers to specific situations, we work them out as we go along. We make <br/>\nbetter and better choices, over time, with practice, and we figure out <br/>\nhow to set up situations, in advance, so that life is simpler and <br/>\nhappier and more supportive of our own children with their own unique <br/>\ninterests and needs.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":326782993,"authorName":"Vidyut Kale","from":"Vidyut Kale &lt;wide.aware@...&gt;","profile":"vidyutgore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Young child and not listening","postDate":"1276709601","msgId":55000,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGltMk5Td3JJX2lQQ2NMdW9BRzhpQ2drTXEwdjVpS2xTcnpSeXdFcEBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGh2OWRwcitkN2FuQGVHcm91cHMuY29tPg==","referencesHeader":"PGh2OWRwcitkN2FuQGVHcm91cHMuY29tPg=="},"prevInTopic":54999,"nextInTopic":55001,"prevInTime":54999,"nextInTime":55001,"topicId":54987,"numMessagesInTopic":0,"msgSnippet":"So parents, how do I get my otherwise independent daughter to listen to me when it is important that she does? I read your post several times over the last","messageBody":"<div id=\"ygrps-yiv-1205630589\">&quot;So parents, how do I get my otherwise independent daughter to listen to me<br/>\nwhen it is important that she does?&quot;<br/>\n<br/>\nI read your post several times over the last couple of days, and I couldn&#39;t<br/>\nput my finger on what was niggling me. Which, at the risk of sounding very<br/>\nnon-unschooling (if that exists), I think I identified. The part where you<br/>\nact seems missing. What are you DOING when she touches wet glue, or slaps<br/>\nyou or doesn&#39;t cooperate with an urgent moment? Have wet glue where/when she<br/>\ndoesn&#39;t notice it. Dodge when she slaps, you have two kids, so find ways to<br/>\nnot become inaccessible to one of them..... don&#39;t whisper, don&#39;t raise your<br/>\nvoice, ACT as needed in the moment...?<br/>\n<br/>\nI see nothing wrong with the urgency conveyed in &quot;Get inside NOW&quot;. For that<br/>\nmatter, I doubt if I&#39;d wait 8-10 minutes for action to happen while there<br/>\nwas an infant that needs attention NOW (like you said). I&#39;d probably go,<br/>\n&quot;There goes the monitor, race you to the door&quot; or something. Or, like others<br/>\nsaid, pick and run.<br/>\n<br/>\nWhile I don&#39;t have two kids, in your place I&#39;d probably focus on a &#39;game<br/>\nplan&#39; for when baby needs &#39;OUR&#39; attention and make the other child a part of<br/>\nthe emergency response. Of course, if its an all the time thing, I&#39;d also<br/>\nhave strategies for help rather than continual disruptions.<br/>\n<br/>\nI don&#39;t think unschooling is about this kind of tiptoeing or &#39;getting&#39;<br/>\nanyone to do anything. If the urgency is in your heart, its far more real to<br/>\nenact it in that moment. I don&#39;t think its the end of the world to have a<br/>\nblazing fast response spontaneously done. If you include your daughter, its<br/>\nlikely she might feel like the knight on a white horse charging in to save<br/>\nher brother rather than you disrupting her fun because you want to pay<br/>\nattention to something else that has become more important than her (of<br/>\ncourse she resists letting go of attention). I also don&#39;t think it is the<br/>\nend of the world if it doesn&#39;t work out like that and she is not in the mood<br/>\nto go with your emergency response, but you carry her along anyway.<br/>\n<br/>\nThough I guess more experienced unschoolers are probably more graceful about<br/>\nit.<br/>\n<br/>\nVidyut<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Young child and not listening","postDate":"1276708554","msgId":54999,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGh2YjBzYStrN2ExQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGh2OWRwcitkN2FuQGVHcm91cHMuY29tPg=="},"prevInTopic":54998,"nextInTopic":55000,"prevInTime":54998,"nextInTime":55000,"topicId":54987,"numMessagesInTopic":0,"msgSnippet":"... *********** It can help to step away from the idea that there are times when a young child needs to follow directions - that sounds a little wacko, but","messageBody":"<div id=\"ygrps-yiv-1652287740\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;o_jeansullivan&quot; &lt;o_sully@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;With explicit instructions like &quot;don&#39;t touch the wet glue&quot; or &quot;don&#39;t slap me&quot; it seems to take many attempts for her to follow instructions.  When time is critical, like getting to my baby to comfort him, I need some tools to get DD to follow instructions.<br/>\n </span></blockquote>***********<br/>\n<br/>\nIt can help to step away from the idea that there are times when a young child &quot;needs&quot; to follow directions - that sounds a little wacko, but when the reality is that your child can&#39;t listen and respond in the way you envision, then its the vision that&#39;s off. Your dd is just being a 3yo. <br/>\n<br/>\nSo you need to come up with a whole different set of strategies. Pam had great ideas for the baby situation. Another thing to consider is whether baby really needs to be alone in a bed to sleep. He may, I can&#39;t possibly know, but its worth experimenting to see if he&#39;ll sleep in other places - in a buggy or sling or whatever - to give y&#39;all more options. <br/>\n<br/>\n&quot;Don&#39;t touch wet glue&quot; seems like the sort of instruction you could let go of entirely. Let her play in glue - its fun for little kids. If you find you&#39;re saying a lot of those kinds of &quot;don&#39;ts&quot; then look for ways to make your home more kid friendly. You have years of messy little people ahead of you! find ways to facilitate that. Have special &quot;art&quot; clothes, or use paints and glues with bare bodies - its so much easier to clean a naked girl covered in glue, paint and/or mud then to clean lots and lots of clothing (I know this from experience ;)).<br/>\n<br/>\nInstead of &quot;don&#39;t slap me&quot; try &quot;I don&#39;t like that&quot;. At the same time look into why she&#39;s slapping. Is it to get your attention? Be more attentive. Is she antsy? find her other fun things to do that are really physical. Sometimes moms with active little girls get stumped - it can help to look for &quot;boy&quot; fun if she&#39;s bouncing off the walls and you&#39;re tearing out your hair. Think climbing and swinging on ropes and hitting things with sticks and bats. Think crawling around pretending to be an animal or jumping like a kangaroo. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":185586397,"authorName":"lylaw","from":"&quot;lylaw&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Young child and not listening","postDate":"1276708293","msgId":54998,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFEMURDMzIzQjYxMTQ0QUU5OTJCNEVENjUyQkRBQjExQEx5bGFQQz4=","inReplyToHeader":"PEUxMzIwRTUyLTk2OEMtNDFFQS04Rjc4LUNCQjUwNDA0MjZBREBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGh2OWRwcitkN2FuQGVHcm91cHMuY29tPiA8RTEzMjBFNTItOTY4Qy00MUVBLThGNzgtQ0JCNTA0MDQyNkFEQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":54997,"nextInTopic":54999,"prevInTime":54997,"nextInTime":54999,"topicId":54987,"numMessagesInTopic":0,"msgSnippet":"so sorry I forgot to go back and cut out the post above mine.  I really should have done that before I started typing. lyla [Non-text portions of this message","messageBody":"<div id=\"ygrps-yiv-150205436\">so sorry I forgot to go back and cut out the post above mine.  I really should have done that before I started typing.<br/>\n<br/>\nlyla<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"lylaw","from":"&quot;lylaw&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Young child and not listening","postDate":"1276708240","msgId":54997,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFCNERDQUU0NkExRDQ4ODRCMjVCQzg5MzE0QTQ3MUYxQEx5bGFQQz4=","inReplyToHeader":"PEUxMzIwRTUyLTk2OEMtNDFFQS04Rjc4LUNCQjUwNDA0MjZBREBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGh2OWRwcitkN2FuQGVHcm91cHMuY29tPiA8RTEzMjBFNTItOTY4Qy00MUVBLThGNzgtQ0JCNTA0MDQyNkFEQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":54995,"nextInTopic":54998,"prevInTime":54996,"nextInTime":54998,"topicId":54987,"numMessagesInTopic":0,"msgSnippet":"From: Sandra Dodd Sent: Wednesday, June 16, 2010 8:42 AM To: AlwaysLearning@yahoogroups.com Subject: Re: [AlwaysLearning] Young child and not listening -=-","messageBody":"<div id=\"ygrps-yiv-1181990605\">From: Sandra Dodd <br/>\nSent: Wednesday, June 16, 2010 8:42 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\nSubject: Re: [AlwaysLearning] Young child and not listening<br/>\n<br/>\n<br/>\n  <br/>\n-=- Unfortunately, when DD doesn&#39;t listen and it is important that she <br/>\ndoes, I always seem to end up raising my voice. -=-<br/>\n<br/>\nI would pick her up and carry her, or not have wet glue out. Set them <br/>\nup to succeed, but don&#39;t give them the keys to your life, nor the <br/>\npower to endanger a younger sibling.<br/>\n<br/>\n-=-In a very non-unschooling way, I ended up yelling &quot;Get inside NOW&quot; - <br/>\n=-<br/>\n<br/>\nSomething has gone wrong in the world of &quot;very unschooling&quot; if there <br/>\nis the idea of a &quot;very non-unschooling&quot; way of being.<br/>\n<br/>\nOf course there is, but unschooling itself shouldn&#39;t be the focus of <br/>\nanyone&#39;s life, and it seems that&#39;s happening in many places these <br/>\ndays. Either someone is giving some really bad advice out there, or <br/>\nsome people are just squinting at unschooling and thinking it&#39;s a new <br/>\nset of rules they could easily break in some very non-unschooling way.<br/>\n<br/>\nI never looked at unschooling, at my house. I looked at learning. <br/>\n&quot;Does this lead to learning?&quot; &quot;Is this interesting?&quot; Fun? Sweet, <br/>\nmemorable, peaceful?<br/>\n<br/>\nSometimes the answer has GOT to be no. If I don&#39;t want to go in [but <br/>\nthere&#39;s a pond] means the baby is afraid or uncomfortable, then the <br/>\nanswer is NO, we&#39;re going in the house. Not maybe. Not later. Not <br/>\nwhen you&#39;re ready.<br/>\n<br/>\nWould you let a neighbor or a salesman keep you from going to your baby?<br/>\nI wouldn&#39;t.<br/>\n<br/>\nSomewhere in there the idea of being on a team to do the right thing <br/>\nwas lost. It sounds more like the child is seeing how far the mother <br/>\nwill go and the mother fears to say &quot;too far.&quot; When it&#39;s no longer <br/>\nabout learning or joy, but is just about &quot;I must have my own way,&quot; <br/>\nthen it seems to me that if it&#39;s wrong for the mother to do that to a <br/>\nchild, then it&#39;s equally as wrong for a child to do that to a mother.<br/>\n<br/>\nSome people have that thought and decide that unschooling is wrong, <br/>\nand that the mother should maintain her boundaries and start making <br/>\nsure she &quot;gets her way&quot; as often as the child does. But when you&#39;re <br/>\nmeasuring and counting, that&#39;s not partnership.<br/>\n<br/>\nSo I&#39;m a guest this week in a home in a place that&#39;s very foreign to <br/>\nme. I hear birds I&#39;ve never heard. Everyone in the house right now <br/>\nspeaks Chinese and I don&#39;t understand a word. Jihong, her parents <br/>\nand her two children. The boy and Jihong speak English, the daughter <br/>\ndoes some of both and is too young for me to understand her yet <br/>\n(though when I tried, it turned out she was offering me water, in <br/>\nChinese). I could easily come off very, very rude here, so I&#39;m <br/>\ntreading lightly. If we go out in public, I hope they&#39;ll coach me to <br/>\nkeep me from being blatantly foreign and tacky. They would be doing <br/>\nme a favor if they did that.<br/>\n<br/>\nI *could* just do as much and whatever I want in a loud, obnoxious <br/>\nway, and they would probably keep smiling and just clean up after me <br/>\nlater if necessary. But I don&#39;t want to be that way. Because I&#39;ve <br/>\nbecome accustomed to living with the ideas of generosity and <br/>\ngratitude, I don&#39;t want to disturb their peace.<br/>\n<br/>\nMy children were that way too, but I&#39;m not sure how to describe what <br/>\nwent into the development of that, although it seems to me (tongue in <br/>\ncheek, I write...) that I&#39;ve been describing and explaining for nearly <br/>\n20 years. I have, but some people go to the direct &quot;what do we do?&quot; <br/>\nand get some fateful, frightful advice.<br/>\n<br/>\nI can&#39;t control where people get advice, and I&#39;m not keen on spending <br/>\nthe next 20 years cleaning up after misconceptions. People will join <br/>\nthis list in the next few days and miss this post entirely. But try <br/>\nto assume that the way you (anyone reading this) learned about <br/>\nunschooling could have been skewed and awkward.<br/>\n<br/>\nNot only about unschooling, but about anything in your life, find <br/>\nsources you trust and be thoughtful.<br/>\n<br/>\n++++++++++++++++++++++++++++++<br/>\n<br/>\nwhat a great post sandra - I have been thinking about what happens in people&#39;s minds with regard to interpreting/applying unschooling ideas in their own lives.   I think many people *are* inclined to look for rules and shifting paradigms is so much more than shifting a set of rules of course.  I also think people tend to have their minds crammed full of truisms (like &quot;children need limits&quot; and &quot;they have to learn sometime&quot; type stuff, and when they read about the ideas that are just a fluid part of unschooling for many who&#39;ve been doing it for a while, or who have made that paradigm shift, they interpret the ideas through a lens crowded with those truisms, kind of like a looking through glasses that are fogged up, or something, (or if not looking closely at all, perhaps a telescope a bird has crapped on!), and jump to conclusions about how unschooling principles are or aren&#39;t put into action, and then this huge tumbleweed of confusion and wrong assumptions grows and grows and gets more and more muddled.    so I really appreciate how you call out what is or isn&#39;t unschooling, and how you don&#39;t tolerate thoughtlessness about word choice on this list. it&#39;s very tiresome, as I have discovered, presenting that view, repeatedly, and rarely feeling understood. <br/>\n<br/>\nwarmly, lyla<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":129999023,"authorName":"John and Amanda Slater","from":"John and Amanda Slater &lt;fourslaterz@...&gt;","profile":"fourslaterz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Young child and not listening","postDate":"1276705988","msgId":54995,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIxOTc3OC41NjkyOS5xbUB3ZWI1MzkwNS5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PEFBTkxrVGluTmV3QnZPZDN6UVRXMk9MSzFrQ2NpN2tvMVlab2gzZnJiWHdDZ0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGh2OWRwcitkN2FuQGVHcm91cHMuY29tPiA8QUFOTGtUaW5OZXdCdk9kM3pRVFcyT0xLMWtDY2k3a28xWVpvaDNmcmJYd0NnQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":54994,"nextInTopic":54997,"prevInTime":54994,"nextInTime":54996,"topicId":54987,"numMessagesInTopic":0,"msgSnippet":"* ","messageBody":"<div id=\"ygrps-yiv-1170771873\">*<br/>\n&lt;&lt;&lt;As an example, our two-month old baby takes irregular afternoon naps.<br/>\nYesterday he slept for three hours in the afternoon. Today he slept for 45<br/>\nminutes. Our daughter and I went outside during his afternoon nap (I thought<br/>\nwe would have at least an hour outside). I heard him wake up and start to<br/>\nyell on the monitor and told DD that we needed to go inside right away. It<br/>\ntook probably 8-10 minutes to get her inside.&gt;&gt;<br/>\n<br/>\n****<br/>\nIn this case, tell her you will be outside until the baby cries.  And then you will get him and come back out.  One thing I always elaborated with my boys was that we had done it for them.  &quot;I don&#39;t want the new baby to be left to cry in his crib and I never left you to cry in your crib.  Now you are big and can come get me, but he is too little.&quot;  <br/>\n<br/>\nIf this is a common problem maybe make it your dd&#39;s snack time when the baby wakes up.  Moving toward a snack is easier than moving away from the yard.<br/>\n<br/>\nAmanda<br/>\nEli 9, Samuel 7<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":301108410,"authorName":"Marina DeLuca-Howard","from":"Marina DeLuca-Howard &lt;delucahoward@...&gt;","profile":"matedgirl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Young child and not listening","postDate":"1276703958","msgId":54994,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGluTmV3QnZPZDN6UVRXMk9MSzFrQ2NpN2tvMVlab2gzZnJiWHdDZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGh2OWRwcitkN2FuQGVHcm91cHMuY29tPg==","referencesHeader":"PGh2OWRwcitkN2FuQGVHcm91cHMuY29tPg=="},"prevInTopic":54992,"nextInTopic":54995,"prevInTime":54993,"nextInTime":54995,"topicId":54987,"numMessagesInTopic":0,"msgSnippet":"It sounds like these are patterns of behaviour...only you can break the patterns.  Set baby to nap outside, bring extra wipes and diapers with you. Drive, or","messageBody":"<div id=\"ygrps-yiv-1581646360\">It sounds like these are patterns of behaviour...only you can break the<br/>\npatterns.  Set baby to nap outside, bring extra wipes and diapers with you.<br/>\nDrive, or push a stroller around to help baby sleep.  There are lots of ways<br/>\nto accomplish this. Don&#39;t expect the three year old to solve the<br/>\nproblems--she can&#39;t.<br/>\n<br/>\nYou are putting yourself in a box--she sounds like a typical three year<br/>\nold.  She can&#39;t see the dangers around her, but that&#39;s your job to keep her<br/>\nsafe.  If you want to avoid yelling you have to understand her typical<br/>\nreactions.  It really is a lot of work--that&#39;s why many parents use reward,<br/>\npunishments, bribes or coercion/yelling/threats.  Partnering with children<br/>\nis hard--they see things very clearly, but only from their own<br/>\nperspective:-)<br/>\n*<br/>\n&lt;&lt;&lt;As an example, our two-month old baby takes irregular afternoon naps.<br/>\nYesterday he slept for three hours in the afternoon. Today he slept for 45<br/>\nminutes. Our daughter and I went outside during his afternoon nap (I thought<br/>\nwe would have at least an hour outside). I heard him wake up and start to<br/>\nyell on the monitor and told DD that we needed to go inside right away. It<br/>\ntook probably 8-10 minutes to get her in*side.&gt;&gt;<br/>\n<br/>\nDon&#39;t set up situations where you mislead her into believing something, such<br/>\nas, we will have an hour outside.  Clearly you don&#39;t know, and when she goes<br/>\nto enforce the contract she finds you defaulting.  You don&#39;t have the luxury<br/>\nof a logical discussion:  you need to get the baby.  Preventing this scene<br/>\nis better then putting yourself in a position of fighting.  Nobody wins<br/>\nfights.  Don&#39;t set up a situation where she resents the baby, because that&#39;s<br/>\nwhat&#39;s coming.<br/>\n<br/>\nMarina<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 15 June 2010 22:44, o_jeansullivan &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:o_sully@...\">o_sully@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Our three-year old daughter has a wild imagination, a fierce spirit, an<br/>\n&gt; opinion on everything, and often doesn&#39;t listen to anything we say. Most of<br/>\n&gt; the time when I am ignored, it isn&#39;t a big issue and if what I have to say<br/>\n&gt; is important, I will find another way to say it. But there are times when it<br/>\n&gt; is very important that she listens and follows directions.<br/>\n&gt; . Because we have a gigantic pond in our backyard and have had issues in<br/>\n&gt; the past with DD running off, I can&#39;t leave her alone outside at all.<br/>\n&gt;<br/>\n&gt; In a very non-unschooling way, I ended up yelling &quot;Get inside NOW&quot; several<br/>\n&gt; times before DD came indoors. It was important to her to ride her scooter<br/>\n&gt; into the garage and to walk the long way around the house. Unfortunately,<br/>\n&gt; when DD doesn&#39;t listen and it is important that she does, I always seem to<br/>\n&gt; end up raising my voice. I&#39;ve tried whispering, and that is equally ignored.<br/>\n&gt; With explicit instructions like &quot;don&#39;t touch the wet glue&quot; or &quot;don&#39;t slap<br/>\n&gt; me&quot; it seems to take many attempts for her to follow instructions. When time<br/>\n&gt; is critical, like getting to my baby to comfort him, I need some tools to<br/>\n&gt; get DD to follow instructions.<br/>\n&gt;<br/>\n&gt; So parents, how do I get my otherwise independent daughter to listen to me<br/>\n&gt; when it is important that she does?<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nIf you want to build a boat, do not instruct the men to saw wood, stitch<br/>\nthe sails, prepare the tools and organize the work, but make them long for<br/>\nsetting sail and travel to distant lands.  Antoine De Saint-Exupry<br/>\n<br/>\nRent our cottage:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://davehoward.ca/cottage/\">http://davehoward.ca/cottage/</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [AlwaysLearning] Young child and not listening","postDate":"1276702958","msgId":54992,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUxMzIwRTUyLTk2OEMtNDFFQS04Rjc4LUNCQjUwNDA0MjZBREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGh2OWRwcitkN2FuQGVHcm91cHMuY29tPg==","referencesHeader":"PGh2OWRwcitkN2FuQGVHcm91cHMuY29tPg=="},"prevInTopic":54988,"nextInTopic":54994,"prevInTime":54991,"nextInTime":54993,"topicId":54987,"numMessagesInTopic":0,"msgSnippet":"-=- Unfortunately, when DD doesn t listen and it is important that she does, I always seem to end up raising my voice. -=- I would pick her up and carry her,","messageBody":"<div id=\"ygrps-yiv-1341152778\">-=- Unfortunately, when DD doesn&#39;t listen and it is important that she  <br/>\ndoes, I always seem to end up raising my voice. -=-<br/>\n<br/>\nI would pick her up and carry her, or not have wet glue out.  Set them  <br/>\nup to succeed, but don&#39;t give them the keys to your life, nor the  <br/>\npower to endanger a younger sibling.<br/>\n<br/>\n-=-In a very non-unschooling way, I ended up yelling &quot;Get inside NOW&quot; - <br/>\n=-<br/>\n<br/>\nSomething has gone wrong in the world of &quot;very unschooling&quot; if there  <br/>\nis the idea of a &quot;very non-unschooling&quot; way of being.<br/>\n<br/>\nOf course there is, but unschooling itself shouldn&#39;t be the focus of  <br/>\nanyone&#39;s life, and it seems that&#39;s happening in many places these  <br/>\ndays.   Either someone is giving some really bad advice out there, or  <br/>\nsome people are just squinting at unschooling and thinking it&#39;s a new  <br/>\nset of rules they could easily break in some very non-unschooling way.<br/>\n<br/>\nI never looked at unschooling, at my house.  I looked at learning.   <br/>\n&quot;Does this lead to learning?&quot;  &quot;Is this interesting?&quot;   Fun?  Sweet,  <br/>\nmemorable, peaceful?<br/>\n<br/>\nSometimes the answer has GOT to be no.  If I don&#39;t want to go in [but  <br/>\nthere&#39;s a pond] means the baby is afraid or uncomfortable, then the  <br/>\nanswer is NO, we&#39;re going in the house.  Not maybe.  Not later.  Not  <br/>\nwhen you&#39;re ready.<br/>\n<br/>\nWould you let a neighbor or a salesman keep you from going to your baby?<br/>\nI wouldn&#39;t.<br/>\n<br/>\nSomewhere in there the idea of being on a team to do the right thing  <br/>\nwas lost.  It sounds more like the child is seeing how far the mother  <br/>\nwill go and the mother fears to say &quot;too far.&quot;  When it&#39;s no longer  <br/>\nabout learning or joy, but is just about &quot;I must have my own way,&quot;  <br/>\nthen it seems to me that if it&#39;s wrong for the mother to do that to a  <br/>\nchild, then it&#39;s equally as wrong for a child to do that to a mother.<br/>\n<br/>\nSome people have that thought and decide that unschooling is wrong,  <br/>\nand that the mother should maintain her boundaries and start making  <br/>\nsure she &quot;gets her way&quot; as often as the child does.  But when you&#39;re  <br/>\nmeasuring and counting, that&#39;s not partnership.<br/>\n<br/>\nSo I&#39;m a guest this week in a home in a place that&#39;s very foreign to  <br/>\nme.  I hear birds I&#39;ve never heard.  Everyone in the house right now  <br/>\nspeaks Chinese and I don&#39;t understand a word.   Jihong, her parents  <br/>\nand her two children.  The boy and Jihong speak English, the daughter  <br/>\ndoes some of both and is too young for me to understand her yet  <br/>\n(though when I tried, it turned out she was offering me water, in  <br/>\nChinese).   I could easily come off very, very rude here, so I&#39;m  <br/>\ntreading lightly.  If we go out in public, I hope they&#39;ll coach me to  <br/>\nkeep me from being blatantly foreign and tacky.  They would be doing  <br/>\nme a favor if they did that.<br/>\n<br/>\nI *could* just do as much and whatever I want in a loud, obnoxious  <br/>\nway, and they would probably keep smiling and just clean up after me  <br/>\nlater if necessary.  But I don&#39;t want to be that way.  Because I&#39;ve  <br/>\nbecome accustomed to living with the ideas of generosity and  <br/>\ngratitude, I don&#39;t want to disturb their peace.<br/>\n<br/>\nMy children were that way too, but I&#39;m not sure how to describe what  <br/>\nwent into the development of that, although it seems to me (tongue in  <br/>\ncheek, I write...) that I&#39;ve been describing and explaining for nearly  <br/>\n20 years.  I have, but some people go to the direct &quot;what do we do?&quot;  <br/>\nand get some fateful, frightful advice.<br/>\n<br/>\nI can&#39;t control where people get advice, and I&#39;m not keen on spending  <br/>\nthe next 20 years cleaning up after misconceptions.  People will join  <br/>\nthis list in the next few days and miss this post entirely.   But try  <br/>\nto assume that the way you (anyone reading this) learned about  <br/>\nunschooling could have been skewed and awkward.<br/>\n<br/>\nNot only about unschooling, but about anything in your life, find  <br/>\nsources you trust and be thoughtful.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Young child and not listening","postDate":"1276670456","msgId":54988,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDMTg3MUY4LjQwMTAwMDhAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PGh2OWRwcitkN2FuQGVHcm91cHMuY29tPg==","referencesHeader":"PGh2OWRwcitkN2FuQGVHcm91cHMuY29tPg=="},"prevInTopic":54987,"nextInTopic":54992,"prevInTime":54987,"nextInTime":54989,"topicId":54987,"numMessagesInTopic":0,"msgSnippet":"... Three year olds aren t up to following verbal instructions, most of the time. Your expectations are too high. Find other ways. For example, the baby is","messageBody":"<div id=\"ygrps-yiv-232884852\">On 6/15/2010 7:44 PM, o_jeansullivan wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; So parents, how do I get my otherwise independent daughter to listen <br/>\n&gt; to me when it is important that she does?<br/>\n </span></blockquote>Three year olds aren&#39;t up to following verbal instructions, most of the <br/>\ntime. Your expectations are too high. Find other ways. For example, the <br/>\nbaby is crying inside -  race her to the baby or make up a quick pretend <br/>\ngame that includes looking for the crying baby. Let her pretend she&#39;s <br/>\nthe mommy who needs to go take care of the baby. Or play follow the <br/>\nleader for a few minutes. Sometimes with litte kids you can just move <br/>\nfast, sweep them off their feet and say, &quot;We&#39;ll come right back.&quot; Grab <br/>\nthe baby and a little blanket and a clean diaper and go right back out. <br/>\nYou can be in and out before she hardly has a chance to complain. Or, if <br/>\nthat seems unrealistic for your child, maybe give her a piggyback ride <br/>\ninto the house to get the baby.<br/>\n<br/>\nAlso - don&#39;t keep giving instructions to a kid who isn&#39;t paying <br/>\nattention. If something isn&#39;t working - stop doing it. You probably <br/>\ndon&#39;t want to get her in the habit of ignoring you, right?<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":3007071,"authorName":"o_jeansullivan","from":"&quot;o_jeansullivan&quot; &lt;o_sully@...&gt;","profile":"o_jeansullivan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Young child and not listening","postDate":"1276656251","msgId":54987,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGh2OWRwcitkN2FuQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":54988,"prevInTime":54986,"nextInTime":54988,"topicId":54987,"numMessagesInTopic":0,"msgSnippet":"Our three-year old daughter has a wild imagination, a fierce spirit, an opinion on everything, and often doesn t listen to anything we say.  Most of the time","messageBody":"<div id=\"ygrps-yiv-1887834171\">Our three-year old daughter has a wild imagination, a fierce spirit, an opinion on everything, and often doesn&#39;t listen to anything we say.  Most of the time when I am ignored, it isn&#39;t a big issue and if what I have to say is important, I will find another way to say it.  But there are times when it is very important that she listens and follows directions.  <br/>\n<br/>\nAs an example, our two-month old baby takes irregular afternoon naps.  Yesterday he slept for three hours in the afternoon.  Today he slept for 45 minutes.  Our daughter and I went outside during his afternoon nap (I thought we would have at least an hour outside).  I heard him wake up and start to yell on the monitor and told DD that we needed to go inside right away.  It took probably 8-10 minutes to get her inside.  Because we have a gigantic pond in our backyard and have had issues in the past with DD running off, I can&#39;t leave her alone outside at all.  <br/>\n<br/>\nIn a very non-unschooling way, I ended up yelling &quot;Get inside NOW&quot; several times before DD came indoors.  It was important to her to ride her scooter into the garage and to walk the long way around the house.  Unfortunately, when DD doesn&#39;t listen and it is important that she does, I always seem to end up raising my voice.  I&#39;ve tried whispering, and that is equally ignored.  With explicit instructions like &quot;don&#39;t touch the wet glue&quot; or &quot;don&#39;t slap me&quot; it seems to take many attempts for her to follow instructions.  When time is critical, like getting to my baby to comfort him, I need some tools to get DD to follow instructions.<br/>\n<br/>\nSo parents, how do I get my otherwise independent daughter to listen to me when it is important that she does?</div>","specialLinks":[]}],"prevTopicId":55159,"nextTopicId":55322}}