{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":3899762,"authorName":"coyote&#39;s corner","from":"&quot;coyote&#39;s corner&quot; &lt;jana@...&gt;","profile":"calourojm","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Canada, was Re: [UnschoolingDiscussion]OT? HSDLA and Gay  Marriage","postDate":"1066251281","msgId":82978,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAzNTIwMWMzOTM1ZSQ4ZTdmOTI4MCQ3ZDE4MGU0NEBBb3Blbj4=","referencesHeader":"PDAwMDUwMWMzOGZmZCRlZGYwNmI0MCQwMGMxZmVhOUBTRVlNT1VSQlVUVFM+IDwxMDY1ODc3NjE2LjgwMy41OTA1MS5tMTJAeWFob29ncm91cHMuY29tPiA8MDAwNTAxYzM4ZmZkJGVkZjA2YjQwJDAwYzFmZWE5QFNFWU1PVVJCVVRUUz4gPDUuMS4xLjUuMS4yMDAzMTAxNTE3MDkzMS4wMGE3NzE1MEBwb3AxLm5zLnN5bXBhdGljby5jYT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":82977,"nextInTime":82979,"topicId":82978,"numMessagesInTopic":0,"msgSnippet":"Wow - Seems like Canada ia what the USA wanted to be and failed! Janis (who really is sorry about the lipstick thing) ... From: Andrea To:","messageBody":"<div id=\"ygrps-yiv-388021676\">Wow - Seems like Canada ia what the USA wanted to be and failed!<br/>\nJanis (who really is sorry about the lipstick thing)<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Andrea <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a> <br/>\n  Sent: Wednesday, October 15, 2003 4:18 PM<br/>\n  Subject: Canada, was Re: [UnschoolingDiscussion]OT? HSDLA and Gay Marriage<br/>\n<br/>\n<br/>\n  At 10:34 AM 10/11/03 -0400, Shyrley wrote:<br/>\n  &gt;Sigh. I hear Canada is nice :-)<br/>\n<br/>\n  It&#39;s better than nice! You might be interested in this column:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.post-gazette.com/columnists/20030730sam0730p1.asp\">http://www.post-gazette.com/columnists/20030730sam0730p1.asp</a><br/>\n<br/>\n  Though we did come down and burn your White House a while back.<br/>\n<br/>\n  Donna in Nova Scotia<br/>\n<br/>\n  &gt;It&#39;s not just the weather that&#39;s cooler in Canada<br/>\n  &gt;<br/>\n  &gt;Wednesday, July 30, 2003<br/>\n  &gt;<br/>\n  &gt;You live next door to a clean-cut, quiet guy. He never plays loud music or <br/>\n  &gt;throws raucous parties. He doesn&#39;t gossip over the fence, just smiles <br/>\n  &gt;politely and offers you some tomatoes. His lawn is cared-for, his house is <br/>\n  &gt;neat as a pin and you get the feeling he doesn&#39;t always lock his front <br/>\n  &gt;door. He wears Dockers. You hardly know he&#39;s there.<br/>\n  &gt;<br/>\n  &gt;And then one day you discover that he has pot in his basement, spends his <br/>\n  &gt;weekends at peace marches and that guy you&#39;ve seen mowing the yard is his <br/>\n  &gt;spouse.<br/>\n  &gt;<br/>\n  &gt;Allow me to introduce Canada.<br/>\n  &gt;<br/>\n  &gt;The Canadians are so quiet that you may have forgotten they&#39;re up there, <br/>\n  &gt;but they&#39;ve been busy doing some surprising things. It&#39;s like discovering <br/>\n  &gt;that the mice you are dimly aware of in your attic have been building an <br/>\n  &gt;espresso machine.<br/>\n  &gt;<br/>\n  &gt;Did you realize, for example, that our reliable little tag-along brother <br/>\n  &gt;never joined the Coalition of the Willing? Canada wasn&#39;t willing, as it <br/>\n  &gt;turns out, to join the fun in Iraq. I can only assume American diner menus <br/>\n  &gt;weren&#39;t angrily changed to include &quot;freedom bacon,&quot; because nobody here <br/>\n  &gt;eats the stuff anyway.<br/>\n  &gt;<br/>\n  &gt;And then there&#39;s the wild drug situation: Canadian doctors are authorized <br/>\n  &gt;to dispense medical marijuana. Parliament is considering legislation that <br/>\n  &gt;would not exactly legalize marijuana possession, as you may have heard, <br/>\n  &gt;but would reduce the penalty for possession of under 15 grams to a fine, <br/>\n  &gt;like a speeding ticket. This is to allow law enforcement to concentrate <br/>\n  &gt;resources on traffickers; if your garden is full of wasps, it&#39;s smarter to <br/>\n  &gt;go for the nest rather than trying to swat every individual bug. Or, in <br/>\n  &gt;the United States, bong.<br/>\n  &gt;<br/>\n  &gt;Now, here&#39;s the part that I, as an American, can&#39;t understand. These poor <br/>\n  &gt;benighted pinkos are doing everything wrong. They have a drug problem: <br/>\n  &gt;Marijuana offenses have doubled since 1991. And Canada has strict gun <br/>\n  &gt;control laws, which means that the criminals must all be heavily armed, <br/>\n  &gt;the law-abiding civilians helpless and the government on the verge of a <br/>\n  &gt;massive confiscation campaign. (The laws have been in place since the <br/>\n  &gt;&#39;70s, but I&#39;m sure the government will get around to the confiscation <br/>\n  &gt;eventually.) They don&#39;t even have a death penalty!<br/>\n  &gt;<br/>\n  &gt;And yet ... nationally, overall crime in Canada has been declining since <br/>\n  &gt;1991. Violent crimes fell 13 percent in 2002. Of course, there are still <br/>\n  &gt;crimes committed with guns -- brought in from the United States, which has <br/>\n  &gt;become the major illegal weapons supplier for all of North America -- but <br/>\n  &gt;my theory is that the surge in pot-smoking has rendered most criminals too <br/>\n  &gt;relaxed to commit violent crimes. They&#39;re probably more focused on <br/>\n  &gt;shoplifting boxes of Ho-Hos from convenience stores.<br/>\n  &gt;<br/>\n  &gt;And then there&#39;s the most reckless move of all: Just last month, Canada <br/>\n  &gt;decided to allow and recognize same-sex marriages. Merciful moose, what <br/>\n  &gt;can they be thinking? Will there be married Mounties (they always get <br/>\n  &gt;their man!)? Dudley Do-Right was sweet on Nell, not Mel! We must be the <br/>\n  &gt;only ones who really care about families. Not enough to make sure they all <br/>\n  &gt;have health insurance, of course, but more than those libertines up north.<br/>\n  &gt;<br/>\n  &gt;This sort of behavior is a clear and present danger to all our stereotypes <br/>\n  &gt;about Canada. It&#39;s supposed to be a cold, wholesome country of polite, <br/>\n  &gt;beer-drinking hockey players, not founded by freedom-fighters in a bloody <br/>\n  &gt;revolution but quietly assembled by loyalists and royalists more <br/>\n  &gt;interested in order and good government than liberty and independence.<br/>\n  &gt;<br/>\n  &gt;But if we are the rugged individualists, why do we spend so much of our <br/>\n  &gt;time trying to get everyone to march in lockstep? And if Canadians are so <br/>\n  &gt;reserved and moderate, why are they so progressive about letting people do <br/>\n  &gt;what they want to?<br/>\n  &gt;<br/>\n  &gt;Canadians are, as a nation, less religious than we are, according to <br/>\n  &gt;polls. As a result, Canada&#39;s government isn&#39;t influenced by large, <br/>\n  &gt;well-organized religious groups and thus has more in common with those of <br/>\n  &gt;Scandinavia than those of the United States, or, say, Iran.<br/>\n  &gt;<br/>\n  &gt;Canada signed the Kyoto global warming treaty, lets 19-year-olds drink, <br/>\n  &gt;has more of its population living in urban areas and accepts more <br/>\n  &gt;immigrants per capita than the United States.<br/>\n  &gt;<br/>\n  &gt;These are all things we&#39;ve been told will wreck our society. But I guess <br/>\n  &gt;Canadians are different, because theirs seems oddly sound.<br/>\n  &gt;<br/>\n  &gt;Like teenagers, we fiercely idolize individual freedom but really demand <br/>\n  &gt;that everyone be the same. But the Canadians seem more adult -- more <br/>\n  &gt;secure. They aren&#39;t afraid of foreigners. They aren&#39;t afraid of <br/>\n  &gt;homosexuality. Most of all, they&#39;re not afraid of each other.<br/>\n  &gt;<br/>\n  &gt;I wonder if America will ever be that cool.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n              ADVERTISEMENT<br/>\n             <br/>\n       <br/>\n       <br/>\n<br/>\n  &quot;List Posting Policies&quot; are provided in the files area of this group. <br/>\n<br/>\n  To unsubscribe from this send an email to:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\n  Visit the Unschooling website and message boards: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]}],"prevTopicId":82961,"nextTopicId":82675}}