{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":56051484,"authorName":"grlynbl@aol.com","from":"grlynbl@...","profile":"tbb1967","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] prejudices regarding education","postDate":"1045268228","msgId":58821,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI3LjJlNjRkMDQ3LjJiN2VlMTA0QGFvbC5jb20+"},"prevInTopic":58819,"nextInTopic":0,"prevInTime":58820,"nextInTime":58822,"topicId":58764,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/14/03 3:33:17 PM Eastern Standard Time, ... Again, where are you getting the idea that I am against unschooling?  Or that unschooling is","messageBody":"<div id=\"ygrps-yiv-2117593270\">In a message dated 2/14/03 3:33:17 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I do not personally consider &quot;ADD&quot; or &quot;ADHD&quot; to be disabilities.  And even <br/>\n&gt; in <br/>\n&gt; an extreme case of a set of those symptoms, saying unschooling won&#39;t work <br/>\n&gt; is <br/>\n&gt; a massive cop-out.<br/>\n&gt; <br/>\n&gt; If someone doesn&#39;t want to unschool, they shouldn&#39;t unschool.  They <br/>\n&gt; shouldn&#39;t <br/>\n&gt; blame a child who&#39;s already been labelled defective and deficient for THEIR <br/>\n&gt; <br/>\n&gt; failure to understand helping kids to learn in their own way where they are <br/>\n&gt; <br/>\n&gt; today, right now.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Again, where are you getting the idea that I am &quot;against&quot; unschooling?  Or <br/>\nthat unschooling is not working for me?   We still have challanges, <br/>\ndifficulties, and we are learning how to do &quot;this&quot; everyday.. but we&#39;re <br/>\ntrying..  I&#39;ve not blamed my child once for my misunderstandings.    When <br/>\nhave I done that?  You seem to think I am  trying to discount unschooling.. <br/>\nthats not the case at all.. Im trying to learn how it works for MY family.  <br/>\n<br/>\nTeresa<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":56051484,"authorName":"grlynbl@aol.com","from":"grlynbl@...","profile":"tbb1967","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] prejudices regarding education","postDate":"1045267945","msgId":58819,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUuMmNkMzg3MmMuMmI3ZWRmZTlAYW9sLmNvbT4="},"prevInTopic":58764,"nextInTopic":58821,"prevInTime":58818,"nextInTime":58820,"topicId":58764,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/14/03 3:33:17 PM Eastern Standard Time, ... If I didnt think unschooling would work, why would I still be here asking questions?  You","messageBody":"<div id=\"ygrps-yiv-576261936\">In a message dated 2/14/03 3:33:17 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;    And it looks like Teresa&#39;s defense against <br/>\n&gt; unschooling is that her kids have special problems and so it&#39;s not going to <br/>\n&gt; <br/>\n&gt; work.  <br/>\n<br/>\n </span></blockquote>If I didnt think unschooling would work, why would I still be here asking <br/>\nquestions?  You question my motives, and you are way off base.  I dont need a <br/>\n&quot;defense&#39; against unschooling.   Im not against it.  Where did you get that <br/>\nidea?<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;   She pretty much declared that answers other than Mary&#39;s and <br/>\n&gt; Anne&#39;s were going to be condescending criticism she could ignore.<br/>\n<br/>\n </span></blockquote>Is that or is that not exactly what happened?  <br/>\n<br/>\n  It seemed <br/>\n<blockquote><span title=\"ireply\"> &gt; to me to be saying that the advice from this list was ruining her family, <br/>\n&gt; and <br/>\n&gt; was obviously NOT working.  <br/>\n<br/>\n </span></blockquote>Again, a huge misconception on  your part.  You seem to be feeling very <br/>\ndefensive yourself.   If something is &quot;ruining my life&quot; I aint gonna keep <br/>\ndoing it.   Where are you getting your perceptions that unschooling is <br/>\nruining my life??  GOD, you think my life is bad now??.. you should have read <br/>\nabout it when they were in school.. Geez, this is a lot better.. but, still <br/>\nnot as good as it could be.   I&#39;m just trying to do the best I can.<br/>\n<br/>\nTeresa<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"prejudices regarding education","postDate":"1045254665","msgId":58764,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwNS4yN2E2ZmQxZS4yYjdlYWMwOUBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":58819,"prevInTime":58763,"nextInTime":58765,"topicId":58764,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/13/03 4:44:06 PM, encadia@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-1908087647\">In a message dated 2/13/03 4:44:06 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:encadia@...\">encadia@...</a> writes:<br/>\n<br/>\n&lt;&lt; I also, have a child with special needs, and with your education, I <br/>\nexpected <br/>\n<br/>\nmuch more from you. And no, its not always gentic or learned by modeling.<br/>\n<br/>\n<br/>\n&lt;&lt;Its very apparent that You have absolutely no clue of parenting a child <br/>\nwith <br/>\n<br/>\nspecial needs, much less commenting in regards to it.  &gt;&gt;<br/>\n<br/>\nA few weeks ago someone clearly misinterpreted something I wrote in another <br/>\nplace.  Plainly just didn&#39;t read carefully.   When called on that, she said <br/>\nshe had read it twice.  When it was quoted back and pointed out as her <br/>\nmisinterpretation, rather than saying &quot;Sorry--I misunderstood,&quot; a bizarre <br/>\ndefense was employed.  She said she had been on the dean&#39;s list, had a 4.0 in <br/>\ncollege, and so COULD read very well.  <br/>\n<br/>\nShe could have a PhD in remedial reading or philosophy or law, and if she <br/>\nmisread a post about unschooling she STILL misread the post.  Reading <br/>\ncomprehension is internal, and whether someone can do it or not has zip to do <br/>\nwith their formal education.<br/>\n<br/>\nIn the e-mail quoted above, a put-down was couched in such terms:<br/>\n-=- with your education, I expected <br/>\n<br/>\nmuch more from you-=-<br/>\n<br/>\nSome of the wisest and most effective unschooling moms I know don&#39;t have a <br/>\ncollege degree.  Some didn&#39;t finish high school.  Some of the most clue-free <br/>\nand oppressive parents I know have advanced degrees.<br/>\n<br/>\nUnschoolers, of ALL people, need to work to rid themselves of attachment to <br/>\nformal education and the papers that come with that.  <br/>\n<br/>\n-=- with your education, I expected much more from you-=-<br/>\n<br/>\nLike what?<br/>\nExpected me to revert to what I was taught about learning disabilities when I <br/>\nwas taking psychology and education classes in the 1970&#39;s?<br/>\n<br/>\nThose experts didn&#39;t know anything about unschooling.  They were talking <br/>\nabout how teachers in schools can deal with disabilities.  And the answer was <br/>\nbasically &quot;not very well.&quot;   But they WERE saying that in the open classroom <br/>\nmodel, kids of different skill and ability levels could share a classroom <br/>\nbecause it wouldn&#39;t be cooperative and individualized rather than competitive!<br/>\n<br/>\nWhat special education teachers try (unsuccessfully) to do sometimes is to <br/>\nsimulate home conditions more than regular school does.  They deal with <br/>\nrepetition, life skills, alternative exercises to what regular kids are doing <br/>\nin sit-down classrooms down the hall, and above all they try to have only a <br/>\nfew children to each adult.<br/>\n<br/>\nUnschooling does all that, and does it better.<br/>\nUnschooling keeps kids from having to be labelled different, disabled, and <br/>\n&quot;special&quot;<br/>\n   (in a way that is not good-special, but just DIFFERENT special, <br/>\n     and all the other kids know that)<br/>\nUnschooling allows for kids to learn in fits and starts, instead of trying to <br/>\nmaintain or fake the smooth curve that schools&#39; units and sessions and <br/>\nsemesters and report cards and IEPs need.<br/>\n<br/>\nThat&#39;s equally advantageous to ALL children.<br/>\n<br/>\nPam Hartley wrote:<br/>\n&lt;&lt;&quot;Special needs&quot; can be and sometimes is used an excuse for a parent to say<br/>\n<br/>\nsullenly and determinedly, &quot;No, that won&#39;t work here.&quot;&gt;&gt;<br/>\n<br/>\nI&#39;ve seen it happen lots.  And it looks like Teresa&#39;s defense against <br/>\nunschooling is that her kids have special problems and so it&#39;s not going to <br/>\nwork.  The long post about breaking video controllers and doors started off <br/>\ndefensively.  She pretty much declared that answers other than Mary&#39;s and <br/>\nAnne&#39;s were going to be condescending criticism she could ignore.  It seemed <br/>\nto me to be saying that the advice from this list was ruining her family, and <br/>\nwas obviously NOT working.  <br/>\n<br/>\nYet the projection continued with insults that there are people here who <br/>\nfollow advice blindly.<br/>\n<br/>\nDoing something recommended here without understanding WHY and without <br/>\nchanging one&#39;s own thought, attitude and expectations won&#39;t help much.  Doing <br/>\nsomething for two weeks and declaring it a failure doesn&#39;t show much <br/>\ndedication to change either.  It sounds more like justification for reverting <br/>\nto the old behaviors.<br/>\n<br/>\nIf a family is happy with the way things are going, then they&#39;re happy!<br/>\n<br/>\nIf a family is unhappy and wants to learn more about how some  unschooling fa<br/>\nmilies have moved from a similarly unhappy state to a relaxed and &quot;together&quot; <br/>\nfamily life, this list can furnish them LOTS of ideas and examples. <br/>\n<br/>\nI do not personally consider &quot;ADD&quot; or &quot;ADHD&quot; to be disabilities.  And even in <br/>\nan extreme case of a set of those symptoms, saying unschooling won&#39;t work is <br/>\na massive cop-out.<br/>\n<br/>\nIf someone doesn&#39;t want to unschool, they shouldn&#39;t unschool.  They shouldn&#39;t <br/>\nblame a child who&#39;s already been labelled defective and deficient for THEIR <br/>\nfailure to understand helping kids to learn in their own way where they are <br/>\ntoday, right now.<br/>\n<br/>\nThe symptoms of ADD are present in such a large percentage of people that <br/>\nit&#39;s ludicrous to consider it &quot;special needs.&quot;  In school, because school <br/>\ndoesn&#39;t allow for individualization, that set of behaviors called ADHD is <br/>\nproblematical FOR THE SCHOOL.  For the teacher.  For the system.<br/>\n<br/>\nUnschooling removes those strictures and barriers.  <br/>\nWhen the barrier&#39;s gone, barrier-deficiency is not a factor.<br/>\n<br/>\nSo I myself think it&#39;s a waste of unschooling time for us to encourage people <br/>\nto think that &quot;ADHD kids&quot; can&#39;t learn on their own as other kids can.  Let us <br/>\nbe real:  they can probably do it BETTER.  So I have no interest in the <br/>\nsighing of a mother who wants people here to say &quot;There, there, of COURSE you <br/>\ncan&#39;t unschool because youre children have disABILITIES.&quot;<br/>\n<br/>\nI didn&#39;t quit learning after I quit going to school.<br/>\n<br/>\n-=--=- with your education, I expected much more from you-=--=-<br/>\n<br/>\nThat was an insult that revealed more of the prejudice of the writer than <br/>\nanything else.<br/>\n<br/>\nI expect no less of myself than to give the most helpful and honest advice I <br/>\ncan give when people need it.  If we, this list and unschoolers, are going to <br/>\nbe blamed because one family can&#39;t understand unschooling and make it work, <br/>\nit&#39;s worth pointing out that the behavior of children is sometimes genetic.  <br/>\nI see it in my kids, and I see it in other people&#39;s kids, and people here <br/>\ntell stories frequently of seeing their own childhood situations (peeing <br/>\nbeds, food preferences, fears, whatever) in their children.  I see people <br/>\ntalk about traits of bio parents in their adopted children.<br/>\n<br/>\nI expect no less of myself than to care more about the feelings and happiness <br/>\nof children than about the personal comfort levels of their resistant mothers.<br/>\n<br/>\nAnd I DO expect unschoolers to try to dismantle their remaining prejudices <br/>\nregarding formal education.  I&#39;m about to have three adults leave my house, <br/>\nperhaps with no formal education whatsoever.  Perhaps with &quot;some college.&quot;  <br/>\nPerhaps as lawyers or doctors.  Whatever it is, I HOPE I will have learned <br/>\nenough not to value the kid with a college report card over one who chose to <br/>\nput their money and energy into formal education.    Either way will be their <br/>\nchoice.<br/>\n<br/>\nMy children will choose college or not the way they choose TV or not, candy <br/>\nor not, to sleep early or late, to set an alarm or to sleep, whether to play <br/>\nvideo games or not.  And because they have practice making good decisions, <br/>\nthey will not make them spuriously or lightly or ignorantly.  They won&#39;t go <br/>\nto college to make me happy.  They won&#39;t get into debt over their heads just <br/>\nto please a grandmother who&#39;ll be dead before the debt&#39;s gone.  And IF they <br/>\ngo to college, nobody there will suspect they learned to read on their own <br/>\nfrom gaming magazines and card games.   And IF they go to college, nobody <br/>\nwill say to them -=- with your education, I expected <br/>\n<br/>\nmuch more from you-=-.<br/>\n<br/>\nSandra<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":58699,"nextTopicId":58825}}