{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":77070457,"authorName":"Sanguinegirl83@aol.com","from":"Sanguinegirl83@...","profile":"sanguinegirl83","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: The Dire Consequence (TM) of letting children eat to...","postDate":"1258016484","msgId":48573,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNkYS41NmFmN2Q5OC4zODJkMjhlNEBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":48572,"nextInTime":48574,"topicId":48573,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/12/2009 2:37:57 A.M. Eastern Standard Time, Sandra@SandraDodd.com writes: ","messageBody":"<div id=\"ygrps-yiv-33543842\">In a message dated 11/12/2009 2:37:57 A.M. Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a> writes:<br/>\n<br/>\n&lt;&lt;&lt;A friend of mine told me one day that her son was not  allergic to <br/>\nmilk, but she told people he was because she didn&#39;t want him  to have it.<br/>\nOne day she asked me to watch him, and as she was leaving, she  said <br/>\n&quot;He&#39;s allergic to milk.&quot; He was like eight years old; not deaf, not  <br/>\nout of earshot. So he knew his mom was lying. *I* knew his mom was  <br/>\nlying.&gt;&gt;&gt;<br/>\n<br/>\n<br/>\n<br/>\nWhen we first found out that Wyl had trouble with High  Fructose Corn Syrup <br/>\n(HFCS), we had a hard time at restaurants finding out  ingredients in <br/>\nthings so he could chose things without it. We&#39;d ask the waiter  or manager very <br/>\nnicely, tell them we didn&#39;t need to know *all* of the  ingredients (I know <br/>\nhow places are about their secret recipes, sometimes), but a  HFCS <br/>\n*sensitivity* didn&#39;t seem to warrant much attention and they usually told  us they <br/>\ndidn&#39;t have any ingredients list to look at-even for things that I knew  (from <br/>\nworking in restaurants) had lists on them.<br/>\n <br/>\nSome places, like McDonald&#39;s, have websites with *all* the  ingredients in <br/>\ntheir core menu items, so we can go there and check what he can  have-we <br/>\nhave a good deal of what he can have at McDonald&#39;s memorized because our  local <br/>\nhomeschool groups meet there quite often in the cooler months. I wish  all <br/>\nrestaurants did that. <br/>\n <br/>\nOnce, when Wyl was off looking at aquariums or going to the  restroom when <br/>\nthe waiter came over, an idea occurred to me and I asked about  ingredients <br/>\nbecause of an *allergy*. The difference was amazingly different. The  waiter <br/>\nwas very helpful and attentive and even brought me one particular label  to <br/>\nread myself. Since then, I haven&#39;t had disinterest and only once or twice <br/>\nwas  there no label on a particular item we inquired about, but all the <br/>\nothers had  them on that particular day. <br/>\n <br/>\nAfter the second time I tried &quot;allergy&quot;, I explained to  Wyl  and said that <br/>\nby medical definitions, he doesn&#39;t have an allergy, but  using that word <br/>\nreally helps us get what we need to make an informed choice. He  is confident <br/>\nenough to ask for himself, now, and he uses &quot;allergy&quot;, though he or  Dave or <br/>\nI often assure the waiter or manager that it isn&#39;t an anaphylactic-type  <br/>\nallergy and not life-threatening.<br/>\n <br/>\nOne local branch of a national chain has been *so*  friendly and helpful <br/>\nthat they have ordered a special pancake syrup  that hasn&#39;t got aspartame (we <br/>\nlike to avoid, but in avoiding HFCS, sometimes  that&#39;s our only alternative) <br/>\nor HFCS. The manager keeps it in a special place in  his office and when we <br/>\ncome in, we just have to remind the waiter where it is  and they&#39;ll bring <br/>\nit out to us. We didn&#39;t even think to ask that, he offered to  do this for <br/>\nus, in the name of customer service, I guess. Or just because he&#39;s  nice. :~) <br/>\n <br/>\nOccasionally, we talk about him not being &quot;medical definition  allergic&quot;, <br/>\nand that his sensitivity may ease or go away some day (though Dave  still has <br/>\nreactions to it).  He sometimes *does* choose to eat or drink  something <br/>\nwith HFCS in it, and it&#39;s usually a *long* time between those times,  because <br/>\nhe *doesn&#39;t* like how he feels when he&#39;s had it. <br/>\n <br/>\nHis brother doesn&#39;t yet show any signs of being bothered by it  and <br/>\nsometimes people look at us funny when one kid doesn&#39;t have HFCS and the  other <br/>\ndoes.  It&#39;s such a trigger-item in some circles that I think people  assume <br/>\nthat we&#39;re keeping it from our kids because of the natural-political  statement <br/>\nit makes or the &quot;group&quot; it puts us in.<br/>\n <br/>\nThough we&#39;ve never actually discussed that part, Wyl knows I&#39;m  lying (and <br/>\nI suppose he knows he&#39;s lying as well) when we tell staff at a  restaurant <br/>\nthat he&#39;s allergic, but I&#39;m not lying *to him*-I&#39;m being honest with  him. <br/>\nIt&#39;s kind of weird to think of being dishonest to help my kid, but until I  <br/>\nfind something better that works across the board, I guess I&#39;ll stick with <br/>\nwhat  works.<br/>\n <br/>\nPeace,<br/>\nDe<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":48564,"nextTopicId":48575}}