{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Help with how to think about a situation.","postDate":"1130943701","msgId":23299,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIzMS4yOWYzZGYuMzA5YTJlZDVAYW9sLmNvbT4="},"prevInTopic":23296,"nextInTopic":0,"prevInTime":23298,"nextInTime":23300,"topicId":23291,"numMessagesInTopic":0,"msgSnippet":"... My dad told stories of the pushing over of outhouses.   It seemed pretty common to do that, and if you could do it when the man of the house was sitting in","messageBody":"<div id=\"ygrps-yiv-571645488\">In a message dated 11/1/05 7:18:00 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dezigna@...\">dezigna@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-My favorite depiction of Halloween in days gone by is in &quot;Meet Me In <br/>\n&gt; Saint<br/>\n&gt; Louis&quot; (1944 with Judy Garland, Margaret O&#39;Brien).<br/>\n&gt; <br/>\n&gt; The neighborhood kids make a bonfire in what appears to be the middle of the<br/>\n&gt; street, and are in a competition to be the most awful in the tricks they <br/>\n&gt; do.-=-<br/>\n&gt; <br/>\n </span></blockquote>My dad told stories of the pushing over of outhouses.   It seemed pretty <br/>\ncommon to do that, and if you could do it when the man of the house was sitting in <br/>\nit, that was a bonus.   But only to mean neighbors, not nice ones.   <br/>\n<br/>\nIt was judgment day for neighbors who weren&#39;t nice to kids not just that <br/>\nnight, but the rest of the year, it seems.<br/>\n<br/>\nThat was rural west Texas, where houses weren&#39;t so close together and <br/>\nouthouses were pretty easy to set upright again.    And eggs thrown at wood or <br/>\nshingles didn&#39;t do the damage that eggs on modern materials sometimes can do (or <br/>\nmodern cars&#39; paint jobs... that&#39;s bad).   And lawsuits weren&#39;t as prevalent.<br/>\n<br/>\nBut the etiquette in the 30&#39;s and 40&#39;s was to YELL trick or treat, get the <br/>\nstuff and run to the next house with maybe a &quot;Happy Halloween!&quot; over the <br/>\nshoulder on the way.    Popcorn and fruit were common, even in the 50&#39;and early 60&#39;s, <br/>\nbefore the bogus nonesense about the needle in the apple.   We used to get <br/>\ncandied apples sometimes.   One elderly man on our street was rarely seen <br/>\noutside his three-room house the rest of the year (by kids anyway, maybe he came out <br/>\nduring school hours), and at Halloween he would decorate his living room, put <br/>\na circle of chairs, and make little bags of treats.   they varied, but there <br/>\nwas always popcorn to cushion the big candied apple, and then candy corn and <br/>\nsuch loose candy that was also very common then.   He would invite us in and <br/>\nwe&#39;d sit and make a little chit chat, he would distribute the bags, and we&#39;d go <br/>\non.   Being invited in was fairly common too.   Sometimes people would give us <br/>\na warm drink if we came in.   Hot chocolate, half of a small teacup, i or a <br/>\npaper cup, as they knew we wanted to take off quickly. <br/>\n<br/>\nI recalculated and had left out a big group when I took notes, so I think we <br/>\nhad 42 trick or treaters this year.   We&#39;ve had more; we&#39;ve had less.   But <br/>\none thing is that the costumes were better this year than I&#39;ve ever seen.   We <br/>\nwere giving black and silver jelly bracelets, sets of three to each, and then <br/>\ncandy, so a big group came and it was taking two passes.   One little girl left <br/>\nthe porch before I gave her candy, and I called her back and I said <br/>\n&quot;Rabbit... &quot; because she had ears and then I saw she was wearing a princess dress <br/>\n(probably an older relative&#39;s first communion dress) and I added &quot;...Princess!   <br/>\nCome back for candy!&quot;   She came back and I said &quot;Are you a rabbit princess?&quot;    <br/>\nVery sweetly she corrected me and said, &quot;I&#39;m a BUNNY princess.&quot;    <br/>\n<br/>\nThat was so cute.<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":163750020,"authorName":"tuckervill2@aol.com","from":"tuckervill2@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Help with how to think about a situation.","postDate":"1130900280","msgId":23296,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFmMi4xNWQ1MWUwNy4zMDk5ODUzOEBhb2wuY29tPg=="},"prevInTopic":23295,"nextInTopic":23299,"prevInTime":23295,"nextInTime":23297,"topicId":23291,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/1/2005 3:32:04 PM Eastern Standard Time, mozafamily@yahoo.com writes: So off  we go and at almost everyhouse he wrang the doorbell","messageBody":"<div id=\"ygrps-yiv-2046180802\">In a message dated 11/1/2005 3:32:04 PM Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mozafamily@...\">mozafamily@...</a> writes:<br/>\n<br/>\nSo off  we go and at almost everyhouse <br/>\nhe wrang the doorbell repeatedly or fiddled  with their door handle, <br/>\nI had stated again after the first house that it  wasn&#39;t nice to do <br/>\nthose things, to just give the people a little more time  to get to <br/>\ntheir door.<br/>\n<br/>\n<br/>\n~~~<br/>\n <br/>\nWhy don&#39;t you physically restrain him from doing those things?<br/>\n <br/>\nHold his hand or hold him away from the door and ring the doorbell  yourself. <br/>\n I don&#39;t understand people who just talk to their kids  and don&#39;t take <br/>\naction.  You have to touch your kids (not spank them)  to get them to do what they <br/>\nneed to do.  They need to have their mind  connected to their body in concrete <br/>\nways, and using as many senses  as you can is the way to do that.  Touching <br/>\nthe hand that is  jiggling the door handle, or moving the body away from the <br/>\ndoor would be  appropriate.  Constant reminders would not be.<br/>\n <br/>\nI know some children tantrum when they are restrained physically, but that  <br/>\njust means to me they are overloaded by the stimulation of the activity, and  <br/>\nthey just need to go home.<br/>\n <br/>\nKaren<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Help with how to think about a situation.","postDate":"1130897542","msgId":23295,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDFkYy40OGI3N2NlOS4zMDk5MzI0YUBhb2wuY29tPg=="},"prevInTopic":23294,"nextInTopic":23296,"prevInTime":23294,"nextInTime":23296,"topicId":23291,"numMessagesInTopic":0,"msgSnippet":"   Even in the 50 s, that trick or treat meant something.   People who weren t giving candy ","messageBody":"<div id=\"ygrps-yiv-1583421798\">&lt;&lt;&lt;&lt;&lt; Too much courtesy on Halloween is a very new thing. &lt;g&gt;   Even in the<br/>\n50&#39;s, <br/>\nthat &quot;trick or treat&quot; meant something.   People who weren&#39;t giving candy <br/>\nweren&#39;t skipped politely, they got the tricks.&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nMy favorite depiction of Halloween in days gone by is in &quot;Meet Me In Saint<br/>\nLouis&quot; (1944 with Judy Garland, Margaret O&#39;Brien).<br/>\n<br/>\nThe neighborhood kids make a bonfire in what appears to be the middle of the<br/>\nstreet, and are in a competition to be the most awful in the tricks they do.<br/>\n<br/>\nRobyn L. Coburn <br/>\n<br/>\n-- <br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Free Edition.<br/>\nVersion: 7.1.362 / Virus Database: 267.12.7/155 - Release Date: 11/1/2005</div>","specialLinks":[]},{"userId":240085865,"authorName":"NANCY OWENS","from":"NANCY OWENS &lt;nancy-owens@...&gt;","profile":"nancyeddsowens","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Help with how to think about a situation.","postDate":"1130880940","msgId":23294,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUxMTAxMjEzNTQxLjc3NTAyLnFtYWlsQHdlYjgxMTA2Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGRrOGo3cCtsbzgzQGVHcm91cHMuY29tPg=="},"prevInTopic":23293,"nextInTopic":23295,"prevInTime":23293,"nextInTime":23295,"topicId":23291,"numMessagesInTopic":0,"msgSnippet":"Barbara Mullins  wrote: Hello - I ve been enjoying the active listening post. I feel like in some ways we have progressed so far but in","messageBody":"<div id=\"ygrps-yiv-2101544881\">Barbara Mullins &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mozafamily@...\">mozafamily@...</a>&gt; wrote: <br/>\nHello - I&#39;ve been enjoying the active listening post. I feel like in <br/>\nsome ways we have progressed so far but in others we are just <br/>\nfailing. Last night for Halloween, I went over with my 7yo ds some <br/>\nbasic guidelines ie say trick or treat when they open the door, <br/>\nthank them no matter what kind of candy they give you, ring the <br/>\ndoorbell only once, knock if they don&#39;t have a doorbell, don&#39;t open <br/>\ntheir door - wait for them do open it and never go into anyone&#39;s <br/>\nhouse, mom or dad will try to stay close and please don&#39;t run <br/>\nsomewhere that we can&#39;t see you (he had just done ANOTHER of his <br/>\nleaving the area he was supposed to be at looking at toys in a store <br/>\nearlier that day) Anyhow just some basic nicities. Last year he only <br/>\nwent to 3 houses before he said he wanted to stop so he doesn&#39;t <br/>\nreally have much experience. <br/>\n<br/>\n***That is a lot to remember when you are 7 and last year you only went to three houses. Last year for us was just a few months ago, I&#39;m still getting used to writing 2005 and here in a few weeks it will be 2006. Last year for a child was eons and ages ago.***<br/>\n<br/>\nSo off we go and at almost everyhouse <br/>\nhe wrang the doorbell repeatedly or fiddled with their door handle, <br/>\nI had stated again after the first house that it wasn&#39;t nice to do <br/>\nthose things, to just give the people a little more time to get to <br/>\ntheir door. But still at most every house he kept doing it but now <br/>\nmy husband (thinking he&#39;s helping the situation) is now repeating <br/>\nall the suggestions I had made earlier, we just went around one <br/>\nblock and my son was exhausted and so we headed for the van. The <br/>\npeople were nice enough but I feel like my 7yo was really rude and <br/>\nthat he can&#39;t understand or follow simple polite directions. I don&#39;t <br/>\nwant to feel this way! <br/>\n<br/>\n***I wouldn&#39;t want to feel that way either, but did you only have those options? Couldn&#39;t you or your husband held your son&#39;s hand, walked him to the door and rang the bell for him, or let him ring the bell? Then gently, still holding son&#39;s hand step back, out of reach of both door and bell? Modeling proper door etiquette? (Is there such a thing? &lt;g&gt;) Did you remember that he was probably really keyed up about the holiday? AND that your seemingly short, easy &#39;rules&#39; might have just flown in one ear and out the other in his excitement? I&#39;m not saying that what you told him about how to act was wrong, but did he have any past eexperience with actually doing it? <br/>\n<br/>\nIn July, my little brother got married in the Catholic church, he converted a few years ago. My kids have experience in church settings and understood that the wedding was going to be long, longer that the other weddings they had attended. (2) My sister&#39;s daughter, 5, has no church experience and certainly no long Catholic wedding experience. Jack was a Jr. groomsman and at 9 was expected to stand with the other groomsmen through the whole ceremony. Isabelle was a flower girl and luckily my brother and his wife made arraignments for the little ones to go sit with their parents during the main ceremony. Still there was a time before and after the main part that the girls were expected to stand with the rest of the wedding party. There was a rehearsal but my sister and I spent extra time with both Jack and Isabelle standing and sitting quietly in the church. Modeling that &#39;proper church etiquette&#39;. &lt;g&gt; The wedding went off with out a hitch, it was beautiful, the kids did a spectacular<br/>\n job.***<br/>\n<br/>\nI try to be with my son as much as possible <br/>\nand am trying to follow his lead to learn about things when he wants <br/>\nto learn about them, etc. But on situations like this I am just <br/>\nlost, I feel like crying inside. Barbara <br/>\n<br/>\n***Now you have something to work on all this next year. You don&#39;t have to make a big deal out of it either, or even mention that you are practicing. Let your son ring the bell when you go visit your friends and family. Show him the way. There are some things kids won&#39;t learn, or ask to learn, unless you show them. Just because you are following a child led learning way of life doesn&#39;t mean you throw the baby out with the bathwater, so to speak. You are going to have to &#39;teach&#39; him things, and that doesn&#39;t mean you are distracting or taking away from his natural curiosity or making or forcing him to learn something he isn&#39;t ready to learn. <br/>\n<br/>\nIf he said &#39;Mom, I want to make cookies.&#39; you wouldn&#39;t say &#39;Okay, here&#39;s the recipe, the ingredients are in the cabinet, the stove is over there. Don&#39;t forget to read the recipe and don&#39;t forget to preheat the oven, and set the timer, and here are the oven mitts. Mommy will be near by. Have fun!&#39; Obviously ringing door bells at Halloween and making cookies for the first time are two different things, but what you do isn&#39;t. You would help him make the cookies for the first few times before turning him loose in the kitchen, the same should go for ringing door bells, answering the phone, sitting still at church, synagogue, fancy restaurant, or old Aunt Erna&#39;s, keeping seat belts on, and so many other daily life things we do as adults without even thinking on them. <br/>\n<br/>\n~Nancy<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":99936689,"authorName":"Barbara Mullins","from":"&quot;Barbara Mullins&quot; &lt;mozafamily@...&gt;","profile":"mozafamily","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Help with how to think about a situation.","postDate":"1130880743","msgId":23293,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRrOG10Nys5M2tmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFkYy40OGI3N2NlOS4zMDk5MzI0YUBhb2wuY29tPg=="},"prevInTopic":23292,"nextInTopic":23294,"prevInTime":23292,"nextInTime":23294,"topicId":23291,"numMessagesInTopic":0,"msgSnippet":"Well, that makes me fell a little better. It definately shows through that I was brought up to be very polite, it was constantly reinforced that politeness","messageBody":"<div id=\"ygrps-yiv-31514064\">Well, that makes me fell a little better. It definately shows <br/>\nthrough that I was &quot;brought up&quot; to be very polite, it was constantly <br/>\nreinforced that politeness was a very honorable quality. We just <br/>\nwent to the end of their sidewalk or drive and let ds walk up the <br/>\nrest of the way to the door, so I (or we) could have gone up all the <br/>\nway with him and showed him how. We did yell thank you&#39;s whether ds <br/>\nremembered to or not, he was very preoccupied with what they gave <br/>\nhim (more than I would have liked.) <br/>\n  I didn&#39;t set out to make lots of rules just to help him because I <br/>\nwas worried he would forget and go inside someones house. I tried to <br/>\nhave a quick conversation with him beforehand and see if he had <br/>\nquestions before the actual busy stuff started. <br/>\n  I carried his mask after 2 houses becuase after wearing if for <br/>\ndays after we bought it he decided he just couldn&#39;t breath well <br/>\nenough or see well enough with it on to be comfortable. Same with <br/>\nhis flashlight saber that I carried it after a couple of houses. I <br/>\nwas so frustrated that my dh started repeating what I had said <br/>\nbecuase I wanted ds to have some time to think about it for himself, <br/>\nI felt like the situation had all ready been &quot;ragged&quot; on too much. I <br/>\ndidn&#39;t mention it anymore last night or today, but it&#39;s just in me <br/>\nthat I feel like my son behaved inappropriately. Now I think he was <br/>\nexcited that was probably why he just couldn&#39;t relax enought to <br/>\nunderstand what I was trying to say. I try to be so flexable, to be <br/>\nable to help come up with solutions so everyone can have fun, this <br/>\nsituation obviously overwhelmed me. Thank you for listening to me <br/>\nand helping me work this out.</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Help with how to think about a situation.","postDate":"1130879050","msgId":23292,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkYy40OGI3N2NlOS4zMDk5MzI0YUBhb2wuY29tPg=="},"prevInTopic":23291,"nextInTopic":23293,"prevInTime":23291,"nextInTime":23293,"topicId":23291,"numMessagesInTopic":0,"msgSnippet":"... On Halloween of all nights it IS fine to ring the doorbell a lot. And the tradition is not even to ring the doorbell, honestly, but to just yell TRICK OR","messageBody":"<div id=\"ygrps-yiv-165432376\">In a message dated 11/1/05 1:32:13 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mozafamily@...\">mozafamily@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I had stated again after the first house that it wasn&#39;t nice to do<br/>\n&gt; those things, to just give the people a little more time to get to<br/>\n&gt; their door. But still at most every house he kept doing it but now<br/>\n&gt; my husband (thinking he&#39;s helping the situation) is now repeating<br/>\n&gt; all the suggestions I had made earlier, we just went around one<br/>\n&gt; block and my son was exhausted and so we headed for the van.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>On Halloween of all nights it IS fine to ring the doorbell a lot.<br/>\nAnd the tradition is not even to ring the doorbell, honestly, but to just <br/>\nyell TRICK OR TREAT really loudly (or ring it and yell, but not to wait until <br/>\nthey get there and say it politely.<br/>\n<br/>\nToo much courtesy on Halloween is a very new thing. &lt;g&gt;   Even in the 50&#39;s, <br/>\nthat &quot;trick or treat&quot; meant something.   People who weren&#39;t giving candy <br/>\nweren&#39;t skipped politely, they got the tricks.<br/>\n<br/>\nBut it&#39;s dying tradition, and that&#39;s okay too.<br/>\n<br/>\n-=-The<br/>\npeople were nice enough but I feel like my 7yo was really rude and<br/>\nthat he can&#39;t understand or follow simple polite directions. I don&#39;t<br/>\nwant to feel this way!-=-<br/>\n<br/>\nWas he tired from walking, or was he tired from being ragged on?<br/>\nGoing trick or treating isn&#39;t like going to a funeral and greeting the family <br/>\non the front row.   It&#39;s SUPPOSED to be wild and rowdy and scary.<br/>\n<br/>\n-=-. Last night for Halloween, I went over with my 7yo ds some<br/>\nbasic guidelines ie say trick or treat when they open the door,<br/>\nthank them no matter what kind of candy they give you, ring the<br/>\ndoorbell only once, knock if they don&#39;t have a doorbell, don&#39;t open<br/>\ntheir door - wait for them do open it and never go into anyone&#39;s<br/>\nhouse, mom or dad will try to stay close and please don&#39;t run<br/>\nsomewhere that we can&#39;t see you-=-<br/>\n<br/>\nThat&#39;s   a LOT of rules.   <br/>\nYou could ring the doorbell once and then step back and yell trick or treat <br/>\nwith him.<br/>\n<br/>\nYou could say thank you for him.   <br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":99936689,"authorName":"Barbara Mullins","from":"&quot;Barbara Mullins&quot; &lt;mozafamily@...&gt;","profile":"mozafamily","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Help with how to think about a situation.","postDate":"1130876985","msgId":23291,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRrOGo3cCtsbzgzQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":23292,"prevInTime":23290,"nextInTime":23292,"topicId":23291,"numMessagesInTopic":0,"msgSnippet":"Hello - I ve been enjoying the active listening post. I feel like in some ways we have progressed so far but in others we are just failing. Last night for","messageBody":"<div id=\"ygrps-yiv-1555990538\">Hello - I&#39;ve been enjoying the active listening post. I feel like in <br/>\nsome ways we have progressed so far but in others we are just <br/>\nfailing. Last night for Halloween, I went over with my 7yo ds some <br/>\nbasic guidelines ie say trick or treat when they open the door, <br/>\nthank them no matter what kind of candy they give you, ring the <br/>\ndoorbell only once, knock if they don&#39;t have a doorbell, don&#39;t open <br/>\ntheir door - wait for them do open it and never go into anyone&#39;s <br/>\nhouse, mom or dad will try to stay close and please don&#39;t run <br/>\nsomewhere that we can&#39;t see you (he had just done ANOTHER of his <br/>\nleaving the area he was supposed to be at looking at toys in a store <br/>\nearlier that day) Anyhow just some basic nicities. Last year he only <br/>\nwent to 3 houses before he said he wanted to stop so he doesn&#39;t <br/>\nreally have much experience. So off we go and at almost everyhouse <br/>\nhe wrang the doorbell repeatedly or fiddled with their door handle, <br/>\nI had stated again after the first house that it wasn&#39;t nice to do <br/>\nthose things, to just give the people a little more time to get to <br/>\ntheir door. But still at most every house he kept doing it but now <br/>\nmy husband (thinking he&#39;s helping the situation) is now repeating <br/>\nall the suggestions I had made earlier, we just went around one <br/>\nblock and my son was exhausted and so we headed for the van. The <br/>\npeople were nice enough but I feel like my 7yo was really rude and <br/>\nthat he can&#39;t understand or follow simple polite directions. I don&#39;t <br/>\nwant to feel this way! I try to be with my son as much as possible <br/>\nand am trying to follow his lead to learn about things when he wants <br/>\nto learn about them, etc. But on situations like this I am just <br/>\nlost, I feel like crying inside. Barbara</div>","specialLinks":[]}],"prevTopicId":23298,"nextTopicId":23297}}