{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":0,"authorName":"Hsmotgo@xxx.xxx","from":"Hsmotgo@...","replyTo":"LIST","senderId":"SoKCUCAc7saxc6JB1G2nQNDgaXdlnaSGKRiDQSqDPGCw1NrNcWzA_kopdc3OP9ycVbS6rBaG","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Starting your own group-LONG","postDate":"930589750","msgId":1328,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy45OS4xMzI4Ljk1OTI2OTc0MEBlR3JvdXBzLmNvbT4="},"prevInTopic":1296,"nextInTopic":0,"prevInTime":1327,"nextInTime":1329,"topicId":1280,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/27/99 9:31:40 AM EST, jkkddmowery@mindspring.com writes: ","messageBody":"<div id=\"ygrps-yiv-649985082\">In a message dated 6/27/99 9:31:40 AM EST, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jkkddmowery@...\">jkkddmowery@...</a> writes:<br/>\n<br/>\n&lt;&lt; I think the reason it has been so great is that we listen to what each <br/>\nother needs and wants, and we try to come to a group consensus.  No one is <br/>\nthe boss.  When we are trying to find a solution, we remember what brought us <br/>\nall together, and we find an answer. &gt;&gt;<br/>\n<br/>\nKaren,<br/>\nHow awesome!  Where are you at?, I would love to come to that group.  That is <br/>\njust the kind of group I would enjoy.  Just fun, info if and when needed and <br/>\nno one excluded!  Sounds like you have a winner there.<br/>\nTeresa</div>","specialLinks":[]},{"userId":0,"authorName":"stephaniecurrier@xxxxxxxxxx.xxx","from":"stephaniecurrier@...","replyTo":"LIST","senderId":"zrad0cyp0T2MEKhrU9hs2Kj3NJEcjYSyP6Zc6tS-ouquaebonH7TdwsKjGMf9U1E38-n2C6JnoRDYC5IYX1yG302oo18oA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Starting your own group-LONG","postDate":"930507529","msgId":1296,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy45OC4xMjk2Ljk1OTI2OTc0MEBlR3JvdXBzLmNvbT4="},"prevInTopic":1280,"nextInTopic":1328,"prevInTime":1295,"nextInTime":1297,"topicId":1280,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1579698537\">&lt;&lt;&lt;&lt;I think the reason it has been so great is that we listen to what each other needs and wants, and we try to come to a group consensus.  No one is the boss.  When we are trying to find a solution, we remember what brought us all together, and we find an answer.<br/>\n<br/>\nRegards, <br/>\nKaren Mowery&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nAhhhh, The cooperative extended family model. I like this, and will be saving quite a few of these posts since it appears that I may need to start a support group as well.  I have one lead to follow, and if that doesn&#39;t pan out, then it&#39;s flyer time. :)<br/>\n<br/>\nSteph</div>","specialLinks":[]},{"userId":0,"authorName":"Mowery Family","from":"&quot;Mowery Family&quot; &lt;jkkddmowery@...&gt;","replyTo":"LIST","senderId":"BNIREmXeTHDXvR4q2LXJSPnLHzg2At3oGJtsIm6G-Ox-rTOFb9j-DdKNKwfgUkip1VMHKRsBpAIFa0CpkIBojtR8YnaVB-mTCSzHK72UbMB0IQc","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Starting your own group-LONG","postDate":"930479249","msgId":1280,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy45Ny4xMjgwLjk1OTI2OTc0MEBlR3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":1296,"prevInTime":1279,"nextInTime":1281,"topicId":1280,"numMessagesInTopic":0,"msgSnippet":"... League members had had.  We still have two of the original members. Some people will come for just a week or month or season.  Don t take that personally.","messageBody":"<div id=\"ygrps-yiv-19443585\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;Our group is a few years old and evolved from a play group some La Leche <br/>\n </span></blockquote>League members had had.  We still have two of the original members.<br/>\n<br/>\nSome people will come for just a week or month or season.  Don&#39;t take that <br/>\npersonally.  Organizing unschoolers seems to be a bit like herding cats. &lt;&lt;&lt;<br/>\n<br/>\n<br/>\nI started my own group 18 months ago.  It came out of frustration.  I couldn&#39;t find any groups locally that met my needs.  I got on the computer and hunted for parents and children in my area.  The invite email was just questioning if they had kids and were interested in homeschooling.  Boy did I get lucky.<br/>\n<br/>\nThere are six of us original members of &quot;Eastside Moms&quot;, now known as &quot;Eastside Families&quot;.  We began with three of us meeting at my home--the children playing and us moms learning about each other.  Once the weather cleared, we began having park day.  After a year, with all six of us, it got too hard to take turns and meet at each others homes, so one of the moms got industrious after we had a MNO brainstorming session, and she called to local churches and gyms, etc.  We got REALLY lucky--especially since we are a non-denomination/agnostic/atheist/you-name-the-belief group, that a local Nazarene church offered us their activity building.  NO COST, no expectations, except that it be open to their members.<br/>\n<br/>\nFor the past six months we have had space for the kids to run and play.  We (original members so far) take turns, we pick a craft, the kids can do it or not, they don&#39;t have to follow the instructions, etc--it is just something for them to do, and someone else takes a turn bringing a snack (fruit, cookies, etc).  We have no dues, we just have fun.  During the summer, we meet at a park--if it is conducive to our personal schedules.  Sometimes we do go places (i.e.: zoo, art museum, Greenfield Village, etc.)  But it is never an assignment or expected.  Sometimes we do make little scavenger hunts for the kids.  Like if we go to the art museum, one of the mom prints out a page with pictures of babies or doggies, etc, and when the kids see them, they can put a sticker on the picture.  If they don&#39;t want to, who cares, it is just for fun.<br/>\n<br/>\nThis is not an unschooling group, but boy have they eased up since they have seen Dana in action.  At first they were all talking curriculums, etc--none of that business anymore, I think I may convert them after all &lt;g&gt;.<br/>\n<br/>\nAnother one of the moms took it upon herself to place an ad in &quot;Metro Parent&quot;, and on the local cable channel (all free), now we have about 15 families that participate.  They come and go, we never know how many will be there, but us original members contact each other just out of courtesy.  There are no expectations, and we have all grown very close.  Yesterday we had a cookout/swim party at one of the mom&#39;s houses--the kids, mom&#39;s and hubbies all get along, it is weird the way it came together.  We made our own little babysitting co-op too.  Sometimes we camp together, go out to dinner, mom&#39;s go for weekends away, it has developed into something wonderful.<br/>\n<br/>\nI think the reason it has been so great is that we listen to what each other needs and wants, and we try to come to a group consensus.  No one is the boss.  When we are trying to find a solution, we remember what brought us all together, and we find an answer.<br/>\n<br/>\nRegards, <br/>\nKaren Mowery</div>","specialLinks":[]}],"prevTopicId":1302,"nextTopicId":1270}}