{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Being the adult - another angle","postDate":"1119972833","msgId":107033,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkNS4zZWViMWVjMS4yZmYyYzdlMUBhb2wuY29tPg=="},"prevInTopic":107030,"nextInTopic":0,"prevInTime":107032,"nextInTime":107034,"topicId":107030,"numMessagesInTopic":0,"msgSnippet":"... Can t they call you where you re doing books?   Can you call every hour or so and check on her? Is there some kind of Lact-Aid for kids? -=- He dismissed","messageBody":"<div id=\"ygrps-yiv-1854530071\">In a message dated 6/28/05 2:54:45 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sandrewmama@...\">sandrewmama@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Well, Dh had refused to allow her a drink of milk with her lunch.  I <br/>\n&gt; guess the struggle elevated to the point that Dh hid the jug of milk <br/>\n&gt; out of reach on top of the refrigerator (this is where I found it <br/>\n&gt; when I came home.) <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Can&#39;t they call you where you&#39;re doing books?   Can you call every hour or so <br/>\nand check on her?<br/>\nIs there some kind of Lact-Aid for kids?<br/>\n<br/>\n<br/>\n-=- He dismissed me saying that it all worked out in the end. -=-<br/>\n<br/>\nSo did WWII, in a manner of speaking.<br/>\n<br/>\n-=-This isn&#39;t the first time these kinds of power struggles have <br/>\noccurred on Sundays while I&#39;m away.  I&#39;m not sure what to do next.  <br/>\nSuggestions?-=-<br/>\n<br/>\nCalling more, letting it slide, helping her with phrases she might use to <br/>\ntrigger her dad&#39;s cooperation, just discussing it with her later, the next day, <br/>\nand helping empower her to communicate directly with him, instead of reviewing <br/>\nit all in front of both of them and making him feel less like being with her <br/>\nby your rules.     I&#39;ve had the same kinds of problems, but over the years my <br/>\nhusband is more likely to be less like his parents and more like Holly&#39;s own <br/>\npersonal dad.   (And Marty&#39;s, and Kirby&#39;s.)<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"soggyboysmom","from":"&quot;soggyboysmom&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Being the adult - another angle","postDate":"1119970569","msgId":107030,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ5cm9lOSs2NThvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDkyRjFGNjNCLTg4NzYtNDREQS1CREM2LUNGQzhGRkY2NEFCNEBtY2hzaS5jb20+"},"prevInTopic":0,"nextInTopic":107033,"prevInTime":107029,"nextInTime":107031,"topicId":107030,"numMessagesInTopic":0,"msgSnippet":"DH and DS are home all week together while I m at work (I WOH fulltime, DH is home fulltime). Both are Spirited personalities so they can lock in and battle","messageBody":"<div id=\"ygrps-yiv-1823551071\">DH and DS are home all week together while I&#39;m at work (I WOH <br/>\nfulltime, DH is home fulltime). Both are Spirited personalities so <br/>\nthey can &#39;lock in&#39; and battle ensues. What we&#39;ve done is program <br/>\nDH&#39;s cell phone to have my work phone number on speed dial (push 2 <br/>\nand the green Dial button and voila - there&#39;s Mommy!). Before things <br/>\nescalate too far, one or the other will call (DS can handle the <br/>\nspeed dial easily, he&#39;s 7). I can talk to DS, check out the <br/>\nsituation from his perspective, talk to DH and check his <br/>\nperspective, then provide a suggestion or two as &#39;discussion fodder&#39; <br/>\nto help them start to work out the situation - often they just need <br/>\nhelp &#39;unlocking&#39; from their positions to come up with creative ideas <br/>\nto get to a win/win situation. For instance, a month or so ago, DS <br/>\ncalled with a &quot;problem&quot; - he wanted to stay home, DH wanted to go <br/>\nout to pick up lunch somewhere (he just needed to be out of the <br/>\nhouse for a bit). DS called me at work. He explained what the <br/>\nsituation was. I asked what it was that he liked about being home, <br/>\nwhat he didn&#39;t like about going out, those kinds of things to get <br/>\nhis view of the situation. Then I suggested that, since the closest <br/>\nfast food is maybe a 30 minute round trip total, DH could go and <br/>\npick up food and bring it home. DS could stay home with the cell <br/>\nphone to call me if he needed something (it takes me 10 minutes to <br/>\ndrive home from work - probably less in a major emergency cause I&#39;d <br/>\nspeed!) - or he could even just talk to me while DH was gone if it <br/>\nmade him more comfortable (notes: we live in a rural area but on a <br/>\nmain road, not isolated but not a lot of people around either and we <br/>\nhave 2 large dogs and DS has stayed on his own for short periods <br/>\nalready). He was okay with that and said Thanks Love you Bye and I <br/>\ntalked to DH and explained the situation as DS saw it and what we <br/>\nhad discussed, and DH was okay with it too. I called a couple hours <br/>\nlater to see how things went (DS didn&#39;t feel a need to call me). <br/>\nThey were at a local dam/lake area! Once they got &#39;unstuck&#39;, they <br/>\ndecided to go get fast food then go to this area that they really <br/>\nlike - quiet, space to run, waterfall/spillway, ducks and other <br/>\nwaterfowl, nice spot all in all. They ended up spending a few hours <br/>\nthere. DH got to be out of the house, DS got his feelings and needs <br/>\nheard and got to be at a quiet spot where he could play. Everyone <br/>\nwins!<br/>\n<br/>\nSince then, and more each day, they are getting better at doing this <br/>\nkind of thing on their own. Perhaps, if you can be available by <br/>\nphone some of the time, you could help them develop the skills to <br/>\nwork things out - talk to your DD and see what it is she is <br/>\nthinking/feeling/needing, then talk with your DH and see what his <br/>\nperspective is and propose options (small glass of milk; offer <br/>\noption milk or cheesecake and let her decide it; make a Dairy chart <br/>\nthat she is in charge of so she can track how much she&#39;s had and <br/>\nwhere her comfort line is; etc).</div>","specialLinks":[]}],"prevTopicId":107014,"nextTopicId":107016}}