{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"things to do in Columbia/Charleston/SC","postDate":"1060308073","msgId":78146,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRiLjMyM2E0YmI1LjJjNjQ1ZTY5QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":78145,"nextInTime":78147,"topicId":78146,"numMessagesInTopic":0,"msgSnippet":"Columbia. I grew up here--and keep trying to leave again!  But we do have a wonderful zoo---Riverbanks Zoo and Botanical Gardens. Some popular exhibits are","messageBody":"<div id=\"ygrps-yiv-1690843473\">Columbia. I grew up here--and keep trying to leave again! &lt;G&gt;<br/>\n<br/>\nBut we do have a wonderful zoo---Riverbanks Zoo and Botanical Gardens. Some <br/>\npopular exhibits are the gorillas (one female has an injured finger permanently <br/>\nstuck shooting the bird! &lt;G&gt;), the koalas, the elephants, and the lorikeets <br/>\n(you can feed them nectar in a cup for a dollar. There&#39;s also a lovely <br/>\ncarousel!<br/>\nThey have Homeschools Mondays!     <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.riverbanks.org/s04education/homeschool.shtml\">http://www.riverbanks.org/s04education/homeschool.shtml</a><br/>\nThe botanical gardens are just gorgeous---and a nice walk.<br/>\n<br/>\nThe State Museum has a King Tut exhibit that has been held over until <br/>\nJanuary. It also has a hands-on science center, a SC history walkthrough, a dinosaur <br/>\nexhibit, a toddler/young child room and more. Closed Mondays, but open Sunday.<br/>\n<br/>\nThe Art museum on Main Street has a waiting room painted by Christian Thee, <br/>\none of outr presenters. Trompe l&#39;oiel. Again, I think, closed on Mondays.<br/>\n<br/>\nThere&#39;s a tiny firefighter&#39;s museum---it&#39;s not big, but they&#39;ve packed a lot <br/>\ninto it. Sandra actually told ME about it last year before she came. Duncan <br/>\nand I had a good time there! Old fire engine and photos and equipment! Attatched <br/>\nto the firehouse! Fun!<br/>\n<br/>\nThe state house is a nice place to walk and hang out---just down the street <br/>\nfrom the hotel. Anne and her boys and Marty spent several hours there late one <br/>\nnight! &lt;G&gt; There are stars in the walls where Sherman&#39;s cannonballs hit it! <br/>\nCool! If you take peanuts or popcorn or bread, the squirrels will eat out of <br/>\nyour hand. <br/>\n<br/>\nAcross the street is Trinity Cathedral (episcopal) where Ben and I were <br/>\nmarried. There are neat gravestones there.<br/>\n<br/>\nWe have MANY old houses on tour. Just drive around or google  &quot;historic <br/>\nhouses Columbia, SC&quot;.<br/>\n<br/>\nI&#39;m sure that if you google Columbia more places will pop up. These are just <br/>\nthe ones that pop into MY head!<br/>\n<br/>\nCharleston is a romantic southern city. DO try to get there if you&#39;re coming <br/>\nfrom afar! It&#39;s worth the two hour drive from Columbia! <br/>\n<br/>\nWalk along the Battery---lovely little tree-lined park on the waterfront in <br/>\ndowntown Charleston, complete with old cannons to climb! <br/>\n<br/>\nThe Slave Market---where slaves were bought and sold. It is now a touristy <br/>\nspot where they sell all kinds of stuff---but the neatest thing they sell is the <br/>\nsweetgrass baskets. All sorts of baskets and things woven out of sweetgrass <br/>\n(found only on the coast of SC), made by the daughters of daughters of <br/>\ndaughters of slaves. They are quite expensive---and beautiful. Every bride receives at <br/>\nleast one sweetgrass basket as a wedding present! &lt;G&gt; The Salve Market <br/>\nshouldn&#39;t be missed. Like I said, it&#39;s become touristy, but if you stand back, close <br/>\nyour eyes, and breathe deeply, you can imagine what it was like 150 year <br/>\nago!---ghosts.<br/>\n<br/>\nTake a carriage ride---the horses wear diapers, but it&#39;s a nice way to see <br/>\nthe old city, cobblestone streets and all.<br/>\n<br/>\nNext to the Market are a lot of good restaurants. A.W. Shucks is good and <br/>\ncasual for seafood. Garibaldi&#39;s a good for italian, but pricey. Poogan&#39;s Porch is <br/>\n&quot;southern&quot;. Baker&#39;s Dozen, for breakfast & pastries. Charleston is THE place <br/>\nfor food!<br/>\n<br/>\nThere&#39;s an aquarium, and you can see dolphins naturally in the bay on the <br/>\nwater side of the aquarium. They also have an I-Max theatre.<br/>\n<br/>\nThere&#39;s a Pirate museum. I haven&#39;t been since 1973! Sorry. I don&#39;t remember <br/>\nmuch!<br/>\n<br/>\nCharlestowne Landing was built when I was leaving Charlestom in 1970. I&#39;ve <br/>\nnever been, but it&#39;s supposedly a nice glimpse into SC history.<br/>\n<br/>\nThe Citadel, the military college of SC, is a lovely &quot;drive-through&quot;. VERY <br/>\nhistoric, and ummmm---controversial! &lt;G&gt; Ben&#39;s alma mater. Beautiful buildings, <br/>\nif you can look past the bars on the windows!.<br/>\n<br/>\nRainbow Row is a row of VERY colorful houses---painted pinks and blues and <br/>\nyellows and very famous.<br/>\n<br/>\nFort Sumter and Fort Moultrie are cool. Moultrie is a just drive to the <br/>\nbeach. Sumter is a boat ride (take bread---you can fed the seagulls that follow the <br/>\nboat---and dolphins follow it too!)----it&#39;s where the first shots were fired.<br/>\n<br/>\nThere&#39;s an aircraft carrier that you can board--the Yorktown. I went YEARS <br/>\nago---I don&#39;t remember all that much except how incredibly HUGE it is! and that <br/>\nthey have a giant mixing bowl with a recipe for chocolate chip cookies for a <br/>\nmillion! &lt;G&gt; 20 dozen eggs, 25 lbs of butter, 60 bags of flour---I thought that <br/>\nwas NEAT! You can also see where they sleep and eat and everything. A cool <br/>\nstop!<br/>\n<br/>\nBeaches: Folly Beach is quirky and bohemian---a lot of &quot;alternatives&quot; down <br/>\nthere (it&#39;s our favorite---and we&#39;re going for the day tomorrow). Isle of Palms, <br/>\nSullivan&#39;s Island, & Edisto Beach are the most beautiful---and ritzy. There <br/>\nis camping at several state parks (eewre FULL of state parks!). I think you can <br/>\nbuy a membership for very little and camp all over. Google &quot;SC state Parks&quot;.<br/>\n<br/>\nCharleston&#39;s one drawback, for me, is the damned one-way streets! &lt;g&gt;<br/>\n<br/>\nAlong the coast, heading north are MANY beaches. Litchfield is north as you <br/>\napproach Myrtle Beach and Pawley&#39;s Island&#39;s &quot;logo&quot; says &quot;elegantly shabby&quot;! &lt;g&gt; <br/>\n---lots of golf along the coast for those into spoiling a good walk!  <br/>\n<br/>\nBrookgreen Gardens is a must see. Its has the most beautiful sculptures done <br/>\nby the owner of the property many years ago. Her history and the history of <br/>\nthe property is there. Nice shop too. The horses at the entrance are worth the <br/>\nwhole visit for me! &lt;g&gt; And there&#39;s usually an art exhibit available, I <br/>\nbelieve. Lovely gardens, to boot!<br/>\n<br/>\n<br/>\nMyrtle Beach. Well, no self-respecting South Carolinian would be caught dead <br/>\nthere---it&#39;s a tourist trap, and you&#39;re welcome to it! &lt;G&gt;. The beaches aren&#39;t <br/>\nvery pretty, but they have the pavillion--rides and such. Lots of stores and <br/>\nshows. You can STAY busy there! They have an excellent aquarium, so I <br/>\nhear---better than Charleston&#39;s and I really liked Charleston&#39;s! <br/>\n<br/>\nAnother little town that might be of interest: Camden is a small and <br/>\nbeautiful town about 40 minutes northeast of Columbia, Their slogan: &quot;Come spend a few <br/>\npeaceful hours where the British spent a rough year!&quot; Just for you, Shyrley! &lt;<br/>\nG&gt; It&#39;s where Lord Cornwallis and &quot;Bloody&quot; Bannistre Tarleton, a ruthless <br/>\nBrit, struggled to keep the colonies. They were defeated by the Swampfox, Francis <br/>\nMarion (all very loosely portrayed in the Mel Gibson movie, The Patriot).  It <br/>\nwas also the winter home of a bunch of yankees for many years---and they <br/>\nstill come down and winter their racing thoroughbreds here.( I used to exercise <br/>\nracehorses there for Frank Whitely! 50 lbs ago! &lt;G&gt;). It&#39;s a nice place to spend <br/>\na day.<br/>\n<br/>\nI&#39;m sure other locals can chime in on what not to miss. And if you have any <br/>\nparticular questions, I&#39;ll try to find the answers for you.<br/>\n<br/>\nI&#39;m so excited you&#39;re all coming!<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":78051,"nextTopicId":78151}}