{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":87764660,"authorName":"Linda Greene","from":"&quot;Linda Greene&quot; &lt;lhgreene2000@...&gt;","profile":"lhgreene2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Stockholm syndrome and introduction","postDate":"1030976733","msgId":9072,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTEwMWMyNTI4YyRhMDlhNDhjMCQ3ZjAwYThjMEBsaW5kYWdyZWVuZT4=","referencesHeader":"PDIwMDIwOTAyLjA4MDMzMS4tMTMwMDcxLjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":9071,"nextInTime":9073,"topicId":9072,"numMessagesInTopic":0,"msgSnippet":"This reminds me of a stage my oldest son, Thomas, went through a couple years back.  He became very interested in the MaryKate and Ashley series of movies.  He","messageBody":"<div id=\"ygrps-yiv-353443133\">This reminds me of a stage my oldest son, Thomas, went through a couple years back.  He became very interested in the MaryKate and Ashley series of movies.  He would have died if his friends had found out.  But, he rented several of them over a couple week period and watched them in the safety and privacy of our home.  I was so glad he was able to do that.<br/>\n<br/>\nAlso, I don&#39;t think I&#39;ve introduced myself to this group, yet.  I cut and pasted this intro from the unschooling-dotcom list I just joined also:<br/>\n<br/>\nWe homeschooled for the first time this past year.  I have two boys: Thomas age 11 and Daniel age 7 (8 in November).  My oldest really had a rough 3rd and 4th grade in public school.  His grades were poor and his self-esteem even worse.  He was angry, violent, teary all the time.  He was diagnosed ADHD, and depressed by a psychiatrist.  I was not about to put him on drugs, so I pulled him out of school (my husband was somewhat supportive).<br/>\n<br/>\nWe started last year off with Calvert School curriculum....ACK!  What a mistake!  That lasted all of about 1 1/2 weeks.  I quickly backed off to math, science and some language arts workbooks, plus daily reading to my kids (well almost daily).  Many days we didn&#39;t do anything, or we went on field trips.  For the first time ever, Thomas, is reading a book on his own.  He read one book this summer and now is reading &quot;The Two Towers&quot; from the Tokien series to himself!  I am thrilled beyond belief.  We&#39;ve always had to read to him.<br/>\n<br/>\nAnyway, I had promised my husband I would push the kids a bit harder this year.   Oops!  Not a good idea.  Becuase, now I realize that I think unschooling (or at least mostly unschooling) is a really good idea, especially for Thomas.  I am also afraid that Thomas won&#39;t learn how to write papers and Daniel won&#39;t learn things like what verbs are.  Most of you are probably giggling at this.  Hopefully,  I will be, too, someday. ;o)  But, for now, I&#39;m scared and afraid to completely let go, while appeasing my husband who was once described by a friend (this was after the friend saw our garage) as being potty-trained at 3 months by a German Hun!  I think my husband was, too.  Well, he did spend part of his infancy in an orphanage which may explain some of it!!!  My is VERY anal, and VERY worried about the kids getting a proper education which includes testing...AAAAHHH!  His whole life revolves around order and disipline.  <br/>\n<br/>\nAlso, I filed under homeschooling option 1 in Virginia.  This option says that I can homeschool because I (or my spouse) has a degree.  My only requirement is to  give my kids the CAT (or a similar test) test at the end of the year.  I think I could keep a porfolio instead, but I&#39;m not up for that.  I do keep a daily journal for my husband&#39;s.  Not that he&#39;ll ever look at it, and it was my idea.  But, just in case he gets to be a p.i.t.a, I can stick it in his face and say, &quot;SEE!!!  They are learning!&quot;  For those of you that give your kids an end-of-the-year exam, how do your kids do on the tests and what things can I do to help them?<br/>\n<br/>\nI have filled our playroom with lots of interesting stuff - maps, cd&#39;s about space and science, games, tons of books.  I bought almost the entire Horribly History and Horribly Science series!  If nothing else, I&#39;ll read them. hee hee  They seem interested in some of them...especially my youngest whose love for learning hasn&#39;t been squelched.  I plan on just leaving them to find those things that interest them and gently encouraging them.<br/>\n<br/>\nWell, phew!!  I think that&#39;s it...for now. <br/>\n<br/>\nThank you,<br/>\n<br/>\nLinda Greene<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":9065,"nextTopicId":9073}}