{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":337544642,"authorName":"carnationsgalore","from":"&quot;carnationsgalore&quot; &lt;addled.homemaker@...&gt;","profile":"carnationsgalore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Not Sure","postDate":"1258242571","msgId":48613,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhkbmZtYitidXNtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDdmNTRhMGIzMDkxMTEzMDAyMmcxNDExOTdmN2g5NDVlMjM5NDk1ZGM2ODM2QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":48601,"nextInTopic":0,"prevInTime":48612,"nextInTime":48614,"topicId":48582,"numMessagesInTopic":0,"msgSnippet":"... I read through your whole post but I m not sure what was happening and what you were asking? Is there a reason you are purposefully trying to fit in with a","messageBody":"<div id=\"ygrps-yiv-1875151207\"><blockquote><span title=\"ireply\">&gt; Need some perspective with a situation at our park day.<br/>\n<br/>\n </span></blockquote>I read through your whole post but I&#39;m not sure what was happening and what you were asking?<br/>\n<br/>\nIs there a reason you are purposefully trying to fit in with a homeschool group?  Are you looking for opportunities to meet people?  There are other options besides homeschool groups. It&#39;s also possible to be friends with families who are different.  They may parent their children differently, send them to school, or homeschool them.  Is it really possible to find a group of people who think and behave exactly as you do?  I can understand not wanting to be with people who question your choices in a very negative way, but I think it&#39;s important to see if that attitude is going the other way.  You describe some of them as feeling superior, and yet you imply your lifestyle is better than their lifestyles.<br/>\n<br/>\nYou also described your son as not being interested in groups of children, and him not liking the homeschool groups very much.  At that point in your post, I was wondering why you continue to put him in those situations.  My 13 yr. old son doesn&#39;t like groups.  He&#39;s truly fine without them.  Then you were talking about him hanging out with a group of boys that were not part of the homeschool group, and apparently were kids who attended school.  The group was name-calling?  Was your son bothered by it?  Why would you ask another mom to consult with him?  Do you hold the homeschooled kids to some generalized expectation that they should be better behaved than kids who attend school?  If not, why is the park day even an issue for you?  Is the opinion of the group very important to you?<br/>\n<br/>\nBottom line: What are you wanting from a group like that?<br/>\n<br/>\nBeth M.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Not Sure","postDate":"1258158248","msgId":48600,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZBQzQwMTFCLUQ3OUYtNENCMC04OTFFLUIxRjI5M0VEODYwRUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDdmNTRhMGIzMDkxMTEzMDAyMmcxNDExOTdmN2g5NDVlMjM5NDk1ZGM2ODM2QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDdmNTRhMGIzMDkxMTEzMDAyMmcxNDExOTdmN2g5NDVlMjM5NDk1ZGM2ODM2QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":48590,"nextInTopic":48601,"prevInTime":48599,"nextInTime":48601,"topicId":48582,"numMessagesInTopic":0,"msgSnippet":"-=-not usually up this late just wanted to articulate so that I can sleep easier.-=- Sometimes writing is helpful, even if you don t mail it to anyone else.","messageBody":"<div id=\"ygrps-yiv-1513615785\">-=-not usually up this late just wanted to articulate so that I can  <br/>\nsleep<br/>\neasier.-=-<br/>\n<br/>\nSometimes writing is helpful, even if you don&#39;t mail it to anyone  <br/>\nelse.  Journals. Diaries.  Drafts of e-mails.<br/>\n<br/>\nThat post was very, very long.  I don&#39;t usually mind long posts, but  <br/>\nthat one was not easy to read.<br/>\n<br/>\n-=-Maybe I am too tolerant, I do think<br/>\nit is good to let others be themselves, expecting that I would receive  <br/>\nthe<br/>\nsame considerations.-=-<br/>\n<br/>\nJudging from this one post, I don&#39;t think you&#39;re too tolerant. :-)<br/>\n<br/>\nIt&#39;s great to let others be themselves.  It&#39;s really all you can do.<br/>\nIt&#39;s not as good to expect them to give you &quot;the same  <br/>\nconsiderations.&quot;  For one thing, they don&#39;t know you&#39;re &quot;letting them  <br/>\nbe themselves.&quot;  They probably are being the same way they would be  <br/>\nwhether you were there or not, so they don&#39;t see you as magnanimously  <br/>\nallowing it.<br/>\n<br/>\n-=-Unfortunately this is sometimes my own silly notion,<br/>\nbut it is part of who I am so I usually rise above it and move on in a<br/>\nnatural way, away from negativity, or crazy people who appear normal  <br/>\nect.-=-<br/>\n<br/>\nIf you see it as something you usually (not always) &quot;rise above,&quot; then  <br/>\nyou&#39;re seeing it in a negative way.<br/>\n<br/>\n-=-I tend to be easy going thinking that to each his own and to be  <br/>\ntolerant<br/>\nand respectful of others ideas, opinions.-=-<br/>\n<br/>\nThat&#39;s the way you&#39;re presenting yourself in a description to us, but  <br/>\nthe rest of the post seemed to be critical of others in your old group  <br/>\nand your new group both.<br/>\n<br/>\n-=I feel like I am still settling for peoples that don&#39;t quite get it.- <br/>\n=-<br/>\n<br/>\n&quot;Settling for&quot; marks them as all quite below your standards.  Could  <br/>\nyou think of it as being accepting of people who don&#39;t quite get it  <br/>\nyet?  Whether the parents &quot;get it&quot; or not, your children might still  <br/>\nlike their children a lot!<br/>\n<br/>\n-=-This same mom who&#39;s hand raising, writing novels the seemingly  <br/>\nperfect child<br/>\nwho doesn&#39;t eat junk yet his mom brought about 30 homemade oreo balls  <br/>\nto the<br/>\nplayground...-=-<br/>\n<br/>\nPlease proofread your posts before you send them.  I couldn&#39;t manage  <br/>\nto make sense of &quot;who&#39;s hand raising, writing novels the seemingly  <br/>\nperfect child...&quot;   You don&#39;t need to explain it, you just should know  <br/>\nyou&#39;ve send something difficult to get through.<br/>\n<br/>\nThis is very negative:<br/>\n&quot;I was disgusted with the mentality and chalked it up to ignorance.&quot;<br/>\n<br/>\n-=-(I did feel protective but held back a he didn&#39;t seem hindered by  <br/>\ntheir ezspeak)-=-<br/>\n<br/>\nWhat&#39;s &quot;ezspeak&quot;?<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":352394329,"authorName":"Eileen Mahowald","from":"Eileen Mahowald &lt;emahowald@...&gt;","profile":"mahowalde","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Not Sure","postDate":"1258150859","msgId":48601,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdmNTRhMGIzMDkxMTEzMTQyMG0zZjZiOTM4M282YzRmODE0YTE5OTBjNGNiQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDkwMTQ5Ny40MjcxMC5xbUB3ZWIxMTA0MDUubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDdmNTRhMGIzMDkxMTEzMDAyMmcxNDExOTdmN2g5NDVlMjM5NDk1ZGM2ODM2QG1haWwuZ21haWwuY29tPgkgPDkwMTQ5Ny40MjcxMC5xbUB3ZWIxMTA0MDUubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":48600,"nextInTopic":48613,"prevInTime":48600,"nextInTime":48602,"topicId":48582,"numMessagesInTopic":0,"msgSnippet":"Jenny thanks for responding we have actually always been at home except for a year and a half of preschool. we are new to the radical aspect of unschooling and","messageBody":"<div id=\"ygrps-yiv-137267627\">Jenny thanks for responding we have actually always been at home except for<br/>\na year and a half of preschool.<br/>\n<br/>\nwe are new to the radical aspect of unschooling and have in the past had<br/>\ncurriculmns and learning materials and classes that we felt were good for<br/>\nour kids, along with good/healthy food ideas and no tv. that we felt were<br/>\ngood for our kids.<br/>\nI remember several Friday evenings when I would destress from the week by<br/>\nreading Joyce&#39;s Joyful living pages and things began to resonate. Now I have<br/>\na good understanding of letting go of so many levels of what I may think is<br/>\ngood for my kids and now allowing them to be themselves.<br/>\n<br/>\n<br/>\nI think my son is aware of the kids who talk about schooly things or things<br/>\nthere parents find exceptable. He was drawn to the group of  school boys for<br/>\ntheir good energies.<br/>\n<br/>\nI was able to process this today with our local group and one radical<br/>\nunschooler who has been at it for 12+ years.<br/>\n<br/>\nThe woman who left the park abruptly put it out to the local group through<br/>\nemail and her blog and got some feed back. The story was different than mine<br/>\nbecause she left abruptly and I stayed tuned giving my son autonomy and he<br/>\nstepped in and out of the group freely, based upon what was happening.<br/>\n<br/>\nMy impression of the kids was not bad but boistrous.I felt that judging kids<br/>\nbased upon there dress and romping stance wasn&#39;t fair and to pointed<br/>\ngeneralize about schooled kids was harmful in itself and could be dispelled<br/>\nby engaging with them as you described playing games or simply speaking with<br/>\nthem.<br/>\n<br/>\nI wonder about the micromanaging parents sometimes do with kids. I found it<br/>\nvaluable to allow the situation to unfold and let the kids work through it<br/>\nbefore jumping the gun so to speak and leaving abruptly or chalking it up to<br/>\n&quot;bad school kid&quot; behavior.<br/>\n<br/>\n<br/>\nI remember a professor of mine once said, &quot;we have more in common with<br/>\nothers than not&quot;. Just that we are all basic human beings. I like to think<br/>\nthat we can get along equally as well with schoolers as homeschoolers.<br/>\n<br/>\nSometimes I think the lofty ideas some homeschoolers have as I once did are<br/>\nridiculous and harmful.<br/>\n<br/>\neileen<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Fri, Nov 13, 2009 at 2:55 PM, Jenny Cyphers &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jenstarc4@...\">jenstarc4@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; My oldest has never really connected well with other homeschoolers.  She&#39;s<br/>\n&gt; never been to school, yet all of her friends go to school.  She knows a few<br/>\n&gt; unschoolers and homeschoolers, but they are not her best friends.  She never<br/>\n&gt; really jived with the park day crowds.<br/>\n&gt;<br/>\n&gt; Your son was in school.  His relationship with other school kids in a park<br/>\n&gt; is going to feel familiar, even if he decides that they are being mean and<br/>\n&gt; opts out.<br/>\n&gt;<br/>\n&gt; Not everyone at a playground is going to get along and play together.  If<br/>\n&gt; the parents want it to be more cohesive, they&#39;ll proactively involve the<br/>\n&gt; kids in games and play with them, or at the very least, initiate a game and<br/>\n&gt; lay down the common ground rules, so that everyone is on the same page.<br/>\n&gt; I&#39;ve done that lots, start a game with a group of kids and then before I<br/>\n&gt; know it, they are all off doing it on their own without me.<br/>\n&gt;<br/>\n&gt; I rarely sit and talk with the adults at park days.  I&#39;m usually playing<br/>\n&gt; with the kids, and the adults I talk to are the ones doing the same thing.<br/>\n&gt;<br/>\n&gt; Large groups of &quot;schooled&quot; kids that come out and play at parks enjoy adult<br/>\n&gt; company, and in fact are quite used to adults telling them what to do and<br/>\n&gt; how to play.  One can navigate that and use that to their advantage to help<br/>\n&gt; kids play together then find a way to wander off, like a school playground<br/>\n&gt; attendant, but without the whistle and bossiness.<br/>\n&gt;<br/>\n&gt; I&#39;ve met more than a few self righteous homeschoolers that trash<br/>\n&gt; all schooled kids and dismiss them outright as unworthy playmates for their<br/>\n&gt; children.  I don&#39;t believe for a moment that kids don&#39;t pick up on that.<br/>\n&gt; Although, I do see the difference, in general, in how public school kids<br/>\n&gt; behave on playgrounds and how homeschool kids do.  Homeschooled kids are<br/>\n&gt; more likely to create their own rules and include multiple ages and both<br/>\n&gt; genders, while school kids are more likely to dictate rules and be age and<br/>\n&gt; gender exclusive.  That&#39;s just my own observation, and again, I&#39;m<br/>\n&gt; generalizing, so take that for what it&#39;s worth.<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Not Sure","postDate":"1258142146","msgId":48590,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkwMTQ5Ny40MjcxMC5xbUB3ZWIxMTA0MDUubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDdmNTRhMGIzMDkxMTEzMDAyMmcxNDExOTdmN2g5NDVlMjM5NDk1ZGM2ODM2QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDdmNTRhMGIzMDkxMTEzMDAyMmcxNDExOTdmN2g5NDVlMjM5NDk1ZGM2ODM2QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":48582,"nextInTopic":48600,"prevInTime":48589,"nextInTime":48591,"topicId":48582,"numMessagesInTopic":0,"msgSnippet":"My oldest has never really connected well with other homeschoolers.  She s never been to school, yet all of her friends go to school.  She knows a few","messageBody":"<div id=\"ygrps-yiv-409376342\">My oldest has never really connected well with other homeschoolers.  She&#39;s never been to school, yet all of her friends go to school.  She knows a few unschoolers and homeschoolers, but they are not her best friends.  She never really jived with the park day crowds.<br/>\n<br/>\nYour son was in school.  His relationship with other school kids in a park is going to feel familiar, even if he decides that they are being mean and opts out.  <br/>\n<br/>\nNot everyone at a playground is going to get along and play together.  If the parents want it to be more cohesive, they&#39;ll proactively involve the kids in games and play with them, or at the very least, initiate a game and lay down the common ground rules, so that everyone is on the same page.  I&#39;ve done that lots, start a game with a group of kids and then before I know it, they are all off doing it on their own without me.<br/>\n<br/>\nI rarely sit and talk with the adults at park days.  I&#39;m usually playing with the kids, and the adults I talk to are the ones doing the same thing.<br/>\n<br/>\nLarge groups of &quot;schooled&quot; kids that come out and play at parks enjoy adult company, and in fact are quite used to adults telling them what to do and how to play.  One can navigate that and use that to their advantage to help kids play together then find a way to wander off, like a school playground attendant, but without the whistle and bossiness.<br/>\n<br/>\nI&#39;ve met more than a few self righteous homeschoolers that trash all schooled kids and dismiss them outright as unworthy playmates for their children.  I don&#39;t believe for a moment that kids don&#39;t pick up on that.  Although, I do see the difference, in general, in how public school kids behave on playgrounds and how homeschool kids do.  Homeschooled kids are more likely to create their own rules and include multiple ages and both genders, while school kids are more likely to dictate rules and be age and gender exclusive.  That&#39;s just my own observation, and again, I&#39;m generalizing, so take that for what it&#39;s worth.<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":352394329,"authorName":"Eileen Mahowald","from":"Eileen Mahowald &lt;emahowald@...&gt;","profile":"mahowalde","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Not Sure","postDate":"1258100552","msgId":48582,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdmNTRhMGIzMDkxMTEzMDAyMmcxNDExOTdmN2g5NDVlMjM5NDk1ZGM2ODM2QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":0,"nextInTopic":48590,"prevInTime":48581,"nextInTime":48583,"topicId":48582,"numMessagesInTopic":0,"msgSnippet":"Dear Group, Need some perspective with a situation at our park day. My son is among the older in our group and is 9 almost 10. He is a beautiful, free spirited","messageBody":"<div id=\"ygrps-yiv-491399066\">Dear Group,<br/>\n<br/>\nNeed some perspective with a situation at our park day.<br/>\n<br/>\nMy son is among the older in our group and is 9 almost 10.<br/>\nHe is a beautiful, free spirited boy who is somewhat solitary yet loves kind<br/>\nhearted active play. I have tried to put my finger on his lack of interest<br/>\nto come into our homeschool group.<br/>\nHe has expressed shyness, not surprising to me as I grew up incredibly<br/>\nshy.(I got into a lot of trouble in school during my years for fooling<br/>\naround with friends which was my way of fittiing in, not to mention that I<br/>\nwas most likely insanely bored)<br/>\n<br/>\nI do understand his lack of interest in kids who he doesn&#39;t relate to or as<br/>\nhe has said some girls are nice and some aren&#39;t.<br/>\nHe is a child that does not follow rules that are abitrary. I find that he<br/>\ndoesn&#39;t connect with the kids who  sit quietly and he doesn&#39;t easily<br/>\nconnect  when a group is connected to things like Pokemon or Bakugan. He<br/>\nsays he&#39;s not into it.<br/>\n<br/>\nThere are a few other kids in the group that are his age yet he<br/>\ncomplains(lately saying the kids are too young,babies or baby play) and<br/>\nsomewhat struggle to get along or fit in.(sometimes causing trouble because<br/>\nhe get bad vibes or negativity or rejection on the onset)(regular stuff with<br/>\nkids and he can be reactionary)<br/>\n<br/>\nWe are new to radical unschooling and have embraced no limitations(with<br/>\nfood, t.v. ,sleep schedules,and let go academics) within our lives trying to<br/>\nbe joyful in our living together. I love this way of being and my three<br/>\n(twin daughters 6 and son 9) thrive in it. My husband is trying and does a<br/>\ndecent job trusting I am not  nuts.<br/>\n<br/>\nNow that I have educated myself with the ideas and principles of respectul<br/>\nparenting and always learning I see yet another stark contrast in this new<br/>\ngroup of homeschool friends that we hang with.<br/>\nWe have shopped for this new group and are far happier than some of our past<br/>\nrelations.(It has been hard in this way).Maybe I am too tolerant, I do think<br/>\nit is good to let others be themselves, expecting that I would receive the<br/>\nsame considerations. Unfortunately this is sometimes my own silly notion,<br/>\nbut it is part of who I am so I usually rise above it and move on in a<br/>\nnatural way, away from negativity, or crazy people who appear normal ect.<br/>\n<br/>\nWithin our group I notice the &quot;good&quot; behavior of the kids whose parents are<br/>\ncontrolling in many ways.<br/>\nI hear alot of talk about what book series this one is reading and many<br/>\nother discussions that make it challenging for me to fit into our group<br/>\nalso.<br/>\n<br/>\nI have sought out this newer group after coming away from a few other<br/>\nfamilies who (as I look back and understand) were so controlling and<br/>\npunishing. So much so that the kids interactions with my kids were<br/>\ncontrolling of play limiting time with lego to 30 minutes or certain items<br/>\nor ways of playing or too aggressive( and my son and daughter are active and<br/>\nrough and tumble but beyond that).<br/>\nAnd then because the parents thought it healthier to be  forced to play<br/>\noutside/ forbidden to touch the hidden legos. Lots of bossing around<br/>\nbehavior from kids or parent touting how great their kids where with<br/>\nacademics ect. (My son would moan to me about how he just couldn&#39;t<br/>\nunderstand why they wouldn&#39;t let them in their house. It was Crazy!<br/>\n<br/>\n<br/>\n<br/>\nI tend to be easy  going thinking that to each his own and  to be tolerant<br/>\nand respectful of others ideas, opinions. My views have definitely changed<br/>\non this with more experience and knowledge.(though I am wondering how to<br/>\ncope with others so stuck, while I feel like we are growing and beginning to<br/>\nmake real progress in breaking the paradyms.)<br/>\n<br/>\n(I stuck out a co-op for what felt like an eternity to me (My girls liked it<br/>\nmy son hated it and would stay with me and the girls in our space)with a<br/>\ngroup that when I shared how curious my son was about how babies are born.<br/>\nThe retort was a what about it is a &quot;gift from god&quot;.<br/>\nI have some semi-horror stories of the religious folk I have encountered and<br/>\ntheir ideas of how the devil is to cause for my sons spiritness and how I<br/>\ncould implement spanking and even had a book title on the subject<br/>\nrecommended. Some bullying incidents that were physical that the mom thought<br/>\nwas regular horse play. These incidents happened along our journey<br/>\nsporadically and I got away quietly (Except for the bullying I called the<br/>\nmom and let her know that I considered it serious) and quickly from most.<br/>\nWhile I never agreed with the control of play with many a family as we were<br/>\ninvited over for what seemed like a hold out reward for their kids to have<br/>\ndone some school work.)<br/>\n<br/>\nSo our new group that seems to be varied in approaches is better and we<br/>\nenjoy our connectedness to a group. I feel like I am still settling for<br/>\npeoples that don&#39;t quite get it.<br/>\n<br/>\nThe kids that sit perfectly still or the mother who touts that she doesn&#39;t<br/>\nhave to worry about her kids on the play ground because they are not daring.<br/>\n<br/>\nThis same mom who&#39;s hand raising, writing novels the seemingly perfect child<br/>\nwho doesn&#39;t eat junk yet his mom brought about 30 homemade oreo balls to the<br/>\nplayground came whispering that she didn&#39;t have enough for the kids but the<br/>\nadults could eat them on the&quot;sly&quot;. I was disgusted with the mentality and<br/>\nchalked it up to ignorance.<br/>\n<br/>\nthere are so many incidents of parents correcting behavior (facilitating<br/>\nchildrens challenges) woking every thing out publicly that I am getting<br/>\nburnt out some more.<br/>\nSo my view in general of those who seem to be lacking information is that I<br/>\ntolerate and in many ways feel sorry for them and their children.(I ask<br/>\nmyself am I doing that much better?) It doesn&#39;t make it easy to share views<br/>\nand treat your kids with out constant correction.<br/>\n<br/>\nMy specific situation was that a group of (average age 10 yrs. old) boys<br/>\nmade their way onto to the playground (as it was a half a day from school)<br/>\nand my son is drawn to them like a magnet.<br/>\nI felt joyful for him as he quickly eased into this group of boys and also<br/>\nhad one 4 yr, old little girl in his tow from our group. They were a little<br/>\nrough on the edges as they commented that they had never seen celery with<br/>\npeanutbutter and raisins on it that my son was munching. (I did feel<br/>\nprotective but held back a he didn&#39;t seem hindered by their ezspeak)<br/>\n<br/>\nI watched from a distance after checking in to say hello to the group and<br/>\nsee if they were friendly(I felt a pressure to do this thinking I would be<br/>\nthought of as negligent had I just watched), they seemed pretty regular and<br/>\nthe 4 yr old seemed just as welcome so it all seemed good.<br/>\n<br/>\nWe had a ball for kickball and the group of boys decided to play a game.<br/>\nThey did move like a pack with a leader and they &quot;teased&quot; &quot;hey dude&quot; along<br/>\nthe way to a few in the group a little boy about 5 who looked puzzled but<br/>\nseemingly un-bothered and more pointed remarking to the two boys on the<br/>\nbleachers saying something about &quot;oh homeschoolers&quot;(these are the sons(my<br/>\nson chooses to not relate to sometimes) of the moms touting academics and<br/>\nkeeping yummy homemade cookies away from the kids???)<br/>\n<br/>\nMeanwhile my son is in tow with the group(I call the boy herd) to play kick<br/>\nball. I watch not knowing what has been said and seeing that they are<br/>\nsomewhat romping. One mom swoops her sons up and leaves quickly.(The 5 yr.<br/>\nold and the sit still son on the bleacher, leaving the other friend on the<br/>\nbench.)<br/>\n<br/>\nSo I am still observing not judging these mainstream kids(that my son has<br/>\nattached himself to) they begin to play and I am glad to see the 9yr old<br/>\nfemale in our group (along with an age varied group from 4&#39;s to 9)<br/>\nsomehow gain enough interest that our whole group come to join the fun.<br/>\nOne 8yr old girl leaves crying because the boys are yelling all the rules<br/>\nthey have made up in their semi-official game(we had been pitching to our<br/>\ngroup with noone in the outfield and the kids just kicking and running bases<br/>\nfor fun)<br/>\nI speak to her and she says the are calling them babies and lots of yelling<br/>\nrules.<br/>\n<br/>\nMy son I know from recent experience does not like me interferring so I am<br/>\nstill appraising (as I sit on the bleachers)and next thing I know our whole<br/>\ngroup comes disgruntled onto the bleachers moaning that they are not babies<br/>\nand who do those school boys think they are ba, ba, ba, pa da.<br/>\nThese homeschoolers were completely on with coming off the field with lots<br/>\nof opinion about it.<br/>\n<br/>\nSo I have my two 6 yr olds among the other homeschoolers on the bleachers<br/>\nand my son still on the field wanting to play with the boy herd. I listened<br/>\nto the homeschoolers and made a quick judgement call that my son brought the<br/>\nball and said maybe the kids could go off playing as they had been while the<br/>\nherd played kickball.<br/>\n<br/>\nI wasn&#39;t sure of the right thing to do but thought I would give my son the<br/>\nopportunity to do what he wanted.(The herd did not seem pointed yet were<br/>\nloud and obnoxious with their superiority act.)<br/>\nOur beautiful strong minded 9yr. old female with her great facilitating mom<br/>\ncame back to reclaim the game.(Seriously beautiful mom and kids expecting<br/>\nJustice.)<br/>\n<br/>\nI explained the situation from my perspective and my sons possible<br/>\nperspective and she spent time putting the fires out with the firey<br/>\nhomeschoolers.<br/>\nInterestingly, as the homeschool kids came back my son dropped out of the<br/>\ngame.<br/>\nI asked one of the other moms to consult with my son and he said he decided<br/>\nto drop out  also because it was boring and they were yelling.<br/>\nAt that point I stepped in kindly to reclaim the ball and the boys romped<br/>\naway. (I didn&#39;t feel that these boys were being overtly bad. Yet they did<br/>\nhave an air of obnoxiousness.)<br/>\n<br/>\nThere has been a strong opinion against school kids almost stereotyping<br/>\ntheir behavior(valid to a degree)within our homeschool group which seems<br/>\njust as pointed as &quot;hey homeschoolers&quot;.<br/>\nI don&#39;t portray kids in school this way with my kids and they don&#39;t spout<br/>\noff in a way that I think is judgemental and hurtful. These kids are<br/>\nproducts of the institution of school and our parenting culture.(Not really<br/>\ntheir fault)<br/>\n<br/>\nMy sons take in retrospect is that he came in and out of the groups. Playing<br/>\nwith them freely and leaving them freely, and playing again. I think it<br/>\nseems healthy for him but the group overall feels insulted by &quot;the boy<br/>\nherd&quot;. I am on the fence. I had kids on each side. If there are any sides?<br/>\n<br/>\nThe mom who left the playground abruptly talked about the situation today<br/>\nand said she wrote about in her blog and that she discussed it with her<br/>\nkids, they said the (boy herd) was teasing she suggested it was on the verge<br/>\nof bullying (I do tend to agree) as they taunted hello homeschoolers.<br/>\n<br/>\nMy challenge is that I don&#39;t like to generalize about schooled children, my<br/>\nson was part of the romp and innocently enjoyed the choice to come and go<br/>\nfreely from this group.<br/>\n<br/>\nI see inadequateness in each side. I don&#39;t like getting into calling the<br/>\nkettle black and overgeneralizing and sometimes overreacting to situations.<br/>\n<br/>\nWhat would you have done???<br/>\n<br/>\nSome other moms saw this as a good point for discussions I am wondering what<br/>\nyour discusions with your kids would sound like?<br/>\n<br/>\nThanks for any input feeling out in space sometimes with people who aren&#39;t<br/>\nlooking to grow and feel they are superior.<br/>\n<br/>\nnot usually up this late just wanted to articulate so that I can sleep<br/>\neasier.<br/>\nIfell like their are a few issues here my sons  freedom  and  my  ability to<br/>\nco-exist within  mixed groups. Trying .....I don&#39;t feel I can be open with<br/>\nmy opinions of some of the parenting homeschooling  ways.<br/>\nBest Regards,<br/>\nEileen<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":48599,"nextTopicId":48578}}