{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":129256077,"authorName":"yolswandass &lt;bluelotus@att.net&gt;","from":"&quot;yolswandass &lt;bluelotus@...&gt;&quot; &lt;bluelotus@...&gt;","profile":"yolswandass","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: independence/mothering,  was Ned, etc.","postDate":"1042156365","msgId":54142,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGF2bDIwZCtvdXNyQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":54141,"nextInTime":54143,"topicId":54142,"numMessagesInTopic":0,"msgSnippet":" Sorry, should have said You are mature enough to learn how to read. ... What happened to the value of mothering? IMO, kids (and adults too) sometimes","messageBody":"<div id=\"ygrps-yiv-630770742\">&lt;&lt; &gt; Sorry, should have said&quot;You are mature enough to learn how to read.&quot;<br/>\n<blockquote><span title=\"ireply\">   &gt; I don&#39;t know about you, but I know my children and what they are <br/>\n &gt;capable of. Two summers ago, my then 11 year old asked me to please <br/>\n &gt;make him some toast. He&#39;s a smart lad with hands and feet that work, I <br/>\n &gt;told him to make it himself because I was busy. He whined that he <br/>\n &gt;didn&#39;t know<br/>\n  &gt; how. Well, I realized that I was allowing him to become helpless.&gt;&gt;<br/>\n  &gt;<br/>\n<br/>\n </span></blockquote>What happened to the value of mothering? IMO, kids (and adults too)<br/>\nsometimes have a hard time expressing how they feel, and the only way<br/>\nthey find is by *regressing* a bit, if you know what I mean, and asking<br/>\nthings that may seem inappropriate to their age. They simply want to be<br/>\nmothered, taken care of, comforted somehow and if your response is, &quot;you<br/>\ndo it, I don&#39;t have time for you,&quot; or decide to grumpily do what they&#39;re<br/>\nasking you to, the message is, &quot;what you are trying to express here, or<br/>\nwhat you are trying to be comforted for is not important.&quot; I mean, don&#39;t<br/>\nyou feel like that sometimes, too, like being comforted and taken care <br/>\nof? I think it has to do with LOVE and not with maturity.<br/>\n<br/>\n&lt;&lt; So I taught him how to make buttered toast! &gt;&gt;<br/>\n<br/>\nDo you really think he didn&#39;t know how and you had to *teach* him? My<br/>\ndaughter knows how just by seeing me do it  many times, and she is 4. I<br/>\ntruly believe his reasons for asking were different than what you<br/>\nperceived.<br/>\n<br/>\n&lt;&lt; I suppose I could have kept buttering his toast till he turns 49 (and<br/>\n<blockquote><span title=\"ireply\">   &gt; I&#39;m dead), but I have better things to do.&gt;&gt;<br/>\n<br/>\n </span></blockquote>Do you give that same response to your husband if he asks you to butter<br/>\nhis toast, or do something for him, or to a friend? Haven&#39;t you ever <br/>\nasked anyone to do something for you that you can actually do yourself? <br/>\nI am bit surprised by your comments. You sound so cold!<br/>\n<br/>\nI have nothing better to do than being a mom, it is my priority and I <br/>\nlove it (even though I love other things as well). And I have nothing <br/>\nbetter to do than trying to be a better, more loving individual...<br/>\n<br/>\n  &lt;&lt; &gt; I always say to my children, that I am happy to do for you what you<br/>\n<blockquote><span title=\"ireply\">   &gt; cannot do, but----I have a life too, and it&#39;s of equal value, and<br/>\n  &gt; therefore I should not do things for you that you are capable of doing<br/>\n  &gt; yourself.&gt;&gt;<br/>\n  &gt;<br/>\n<br/>\n </span></blockquote>If what we want is to build a relationship based on trust and<br/>\nunderstanding, the attitude that they *should* do it themselves when<br/>\nthey ask for help (read support, love, companionship, comfort,<br/>\ntogetherness, etc.) certainly doesn&#39;t help. I am not sure where you are<br/>\ncoming from and what kind of relationship you want to establish with<br/>\nyour kids, but from what you say I get the impression that it&#39;s one of<br/>\ntotal *independence* (read distance) from each other.<br/>\n<br/>\n  &lt;&lt; &gt; If I&#39;m feeling generous, then I&#39;ll do things and that&#39;s a gift for<br/>\n<blockquote><span title=\"ireply\">   &gt; both of us. Now my son is 13, and can do all kinds of things like<br/>\n  &gt; butter his own toast and read to himself.&gt;&gt;<br/>\n<br/>\n </span></blockquote>Generous??? That sounds more like it&#39;s a gift for him, since you&#39;re only<br/>\nbeing &quot;generous.&quot; Again, you seem so distant and cold to your kids...<br/>\n<br/>\nI personally believe that this culture puts too much stress on kids<br/>\nbecoming &quot;independent.&quot; Right after they&#39;re born they&#39;re supposed to go<br/>\nin a separate bed, in a separate room, separated by school, and later a<br/>\njob and a new family. No wonder why this society is so incredibly<br/>\ndysfunctional. People are continuously pushed away since they&#39;re born!<br/>\n<br/>\nI think it&#39;s great to see your kids grow and become autonomous, but at<br/>\ntheir own pace and within the community of their family. I&#39;ve always<br/>\nwondered, what&#39;s the rush to kick them out???<br/>\n<br/>\n  &lt;&lt; &gt; Just this evening, we snuggled up and I read the last 3 pages<br/>\nof his<br/>\n<blockquote><span title=\"ireply\">   &gt; book to him, the rest of which he read independently. Reading those 3<br/>\n  &gt; pages together were a pleasure for both of us, (followed by an<br/>\n  &gt; interesting discussion) . They were a pleasure because I didn&#39;t have<br/>\n  &gt; to do it, and he didn&#39;t have to ask me to. &gt;&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>Maybe they were a pleasure for you for those reasons, but they might<br/>\nhave been a pleasure for him because in spite of being able to do it on<br/>\nhis own, you were WITH him. Just a thought.<br/>\n<br/>\nYol<br/>\n<br/>\nI&#39;ve been having problems with my e-mail. I had to post this at the<br/>\nyahoo site. I am not changing identities... ;-)<br/>\n<br/>\n<br/>\n-- <br/>\n<br/>\nBlue Lotus Therapeutics -<br/>\nAyurveda, Homeopathy, Yoga & Therapeutic Massage<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bluelotustherapeutics.com\">http://www.bluelotustherapeutics.com</a><br/>\n<br/>\nDhyanyoga Center of NC -<br/>\nMeditation - Kundalini Maha Yoga<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.dyc-nc.org\">http://www.dyc-nc.org</a><br/>\n<br/>\n**********************************<br/>\nWhen nothing is done, nothing is left undone. The world is ruled by<br/>\nletting things take their course. It cannot be ruled by interfering.<br/>\n-- Tao Te Ching<br/>\n**********************************</div>","specialLinks":[]}],"prevTopicId":54139,"nextTopicId":54148}}