{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] dichotomy vs. balance","postDate":"1277754734","msgId":55421,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGltd0pwMlA2TXBCVzRYMXVjT2NSMnBDaDZyeVAzdkNMdDVkVnNpMUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDYzODdEQ0NGLTg4OUQtNEMzOC05NUEwLUEyNTY3ODdEOEFEMEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDYzODdEQ0NGLTg4OUQtNEMzOC05NUEwLUEyNTY3ODdEOEFEMEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":55401,"nextInTopic":0,"prevInTime":55420,"nextInTime":55422,"topicId":55401,"numMessagesInTopic":0,"msgSnippet":"As if happiness is LESS real than unhappiness. I think it s more that people don t notice the drama in happiness the same way they feel the drama in","messageBody":"<div id=\"ygrps-yiv-269858185\">As if happiness is LESS real than unhappiness. I think it&#39;s more that<br/>\npeople don&#39;t notice the drama in happiness the same way they feel the<br/>\ndrama in unhappiness. Neither is more (or less) real than the other.<br/>\n<br/>\nSome people don&#39;t believe in love either. Doesn&#39;t mean it isn&#39;t real.<br/>\nI think it means that many who don&#39;t believe in love, haven&#39;t<br/>\nrecognized it&#39;s quiet presence because perhaps they&#39;re looking for<br/>\nsomething flashier, so that hatred or indifference seems more common<br/>\nin their experience. Doesn&#39;t mean that is or isn&#39;t.<br/>\n<br/>\nEveryone&#39;s life is subjective that way. Feelings do matter and<br/>\nthoughts influence them directly. So hearing people who say &quot;open your<br/>\neyes, look around you&quot; (there&#39;s a song that says that from the 70s)<br/>\ndoesn&#39;t mean you&#39;re hearing bad advice or that there&#39;s no such thing<br/>\nas what they see... love or happiness.<br/>\n<br/>\nOne of my favorites, that I highly recommend, is Chicago&#39;s Saturday in<br/>\nthe Park. Give it a listen if you like.<br/>\n<br/>\n~Katherine</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"dichotomy vs. balance","postDate":"1277743382","msgId":55401,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYzODdEQ0NGLTg4OUQtNEMzOC05NUEwLUEyNTY3ODdEOEFEMEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":55421,"prevInTime":55400,"nextInTime":55402,"topicId":55401,"numMessagesInTopic":0,"msgSnippet":"It has to be one or the other, dichotomy or balance. Nah, that s not even true, either.  I was just using it as an example of extreme thinking, of dividing","messageBody":"<div id=\"ygrps-yiv-1120265651\">It has to be one or the other, dichotomy or balance.<br/>\n<br/>\nNah, that&#39;s not even true, either.  I was just using it as an example  <br/>\nof extreme thinking, of dividing each thought into two.<br/>\n<br/>\nI&#39;ve been criticized about &quot;the happy bubbles of [my] followers.&quot;     <br/>\nFirst, I don&#39;t have &quot;followers.&quot;  I do write, and some people read, so  <br/>\nI suppose I have readers.  I am in discussions and sometimes I make a  <br/>\npoint someone else likes, but the same person might dislike another  <br/>\npoint.   I&#39;m not campaigning for votes.<br/>\n<br/>\nIt&#39;s not about me.    It&#39;s about the ideas, and how they can make  <br/>\nlives better.  And by &quot;better&quot; I usually mean safer, more peaceful,  <br/>\ncalmer, more toward the learning end of life than the suffering end.   <br/>\nMore toward the optimistic end than the sky-is-falling, dark, cloudy  <br/>\nside.  That&#39;s my personal preference, but I don&#39;t own the gate of the  <br/>\nkey to any of this stuff.  I see some people sad because they&#39;re sad,  <br/>\nand sometimes I have ideas for ways they could be happier.  Sometimes  <br/>\nthey want those ideas and sometimes they don&#39;t.   Still, my own family  <br/>\nis happy.<br/>\n<br/>\n&quot;I think it is more important to be honest about our feelings than to  <br/>\ncreate a false happy bubble.&quot;<br/>\n<br/>\nA statement like that lives in the assumption that the opposite of  <br/>\n&quot;honest about our feelings&quot; is &quot;a false happy bubble.&quot;<br/>\n<br/>\nI&#39;ve been honest about my feelings a lot.  And my family is happy.   <br/>\nNot false happy, but real, honest happy.<br/>\nThere are expressions of my feelings I withhold or soften.  That&#39;s not  <br/>\ndishonesty.  That&#39;s compassion and tact.   But I don&#39;t withhold  <br/>\neverything I think, as some people do.  I don&#39;t mind objecting when  <br/>\nsomeone is being so negative that it&#39;s affecting me or my family, or  <br/>\nmy house, or my car.  I do defend this list (and am sorry I&#39;ve had to  <br/>\ndefend it so much the past few days, from people who either can&#39;t or  <br/>\nwon&#39;t read and understand the guidelines).<br/>\n<br/>\nIt would be possible for me, or me and a combination of others on this  <br/>\nlist to share stories from our families of origin, or from our friends  <br/>\nor other relatives, or from our school days, and if we shared the  <br/>\nworst, and the saddest, and painted them in phrases to milk the  <br/>\nemotions of the readers of the list, and went into details...  It  <br/>\nwould be possible for us to induce a depressing, suicidal mood in the  <br/>\ngroup. And many people here would repeat those stories to their  <br/>\npartners, or friends, or children, and so the darkness would spread.   <br/>\nSome people would be angry.  Some would be sad.  Some would feel  <br/>\nempathy, and guilt for not having had so bad a life.  Some would want  <br/>\nto volunteer at rape crisis centers or to adopt children or give all  <br/>\ntheir money to orphanages.    There could be wailing and gnashing of  <br/>\nteeth.<br/>\n<br/>\nBUT WAIT!<br/>\nLet&#39;s don&#39;t.<br/>\nI won&#39;t tell you the details of my sister being raped at 14, though I  <br/>\nknow them.  It&#39;s bad enough that it&#39;s in my head, and much of the  <br/>\nfollow-up and fallout.  She will be no better off if I put it in  <br/>\nwriting and make some of you cry.<br/>\nLet&#39;s don&#39;t do any of that.<br/>\n<br/>\nThe people on this list are here to discuss ways to have better lives  <br/>\nwith their children.  Not false happy bubbles.  Not even happy  <br/>\nbubbles.  Life.  Real-in-the-real-world peaceful lives.<br/>\n<br/>\nNegativity is poison to unschooling.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":55411,"nextTopicId":55422}}