{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":164396504,"authorName":"Elizabeth Roberts","from":"Elizabeth Roberts &lt;mamabethuscg@...&gt;","profile":"mamabethuscg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Our Day Today","postDate":"1068590580","msgId":84535,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMTExMjI0MzAwLjE1ODQ1LnFtYWlsQHdlYjEyNjA2Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDAwMDcwMWMzYTg4NCRlNGUzZjU0MCQ2NTRjZGUxOEBhb2xkc2wubmV0Pg=="},"prevInTopic":84509,"nextInTopic":0,"prevInTime":84534,"nextInTime":84536,"topicId":84393,"numMessagesInTopic":0,"msgSnippet":"We spent time this morning with our Brownie Troop at a Veteran s Day memorial service, which led to a discussion about why some people choose to join the","messageBody":"<div id=\"ygrps-yiv-1644890799\">We spent time this morning with our Brownie Troop at a Veteran&#39;s Day memorial service, which led to a discussion about why some people choose to join the military and others don&#39;t (mostly why Mommy and Daddy and both Grandparents served) and what being a veteran means, and why we honor them. <br/>\n<br/>\nThen at our Troop&#39;s Fall Festival we learned about Louis Braille and writing in &quot;semabraille&quot; which is visual rather than punched. Sarah wants to practice this, so I think we&#39;ll have some fun with it, writing &quot;secret&quot; messages to each other. We&#39;d read about Helen Keller earlier this week, and Sarah remembered that she had also learned to use braille. Her comment &quot;It&#39;s a good thing he had that accident and invented this or Helen wouldn&#39;t have learned to read!&quot; She&#39;s asked to spend tomorrow pretending to be blind, which should be interesting. I have an eye mask I&#39;ll let her wear. <br/>\n<br/>\nIt&#39;ll be interesting to see what she thinks of the experience although it won&#39;t be very accurate at all. <br/>\n<br/>\nElizabeth in MA<br/>\n<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nProtect your identity with Yahoo! Mail AddressGuard<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":45073,"authorName":"amycats2@aol.com","from":"amycats2@...","profile":"amycats2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] unschooling morning","postDate":"1068583658","msgId":84509,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQuMWJkZTM2OWIuMmNlMmE0ZWFAYW9sLmNvbT4="},"prevInTopic":84507,"nextInTopic":84535,"prevInTime":84508,"nextInTime":84510,"topicId":84393,"numMessagesInTopic":0,"msgSnippet":"Here was our Tuesday morning/afternoon: Trevor read books about Romans and endangered species and Brenna watched Stanley (Disney Channel show) while I checked","messageBody":"<div id=\"ygrps-yiv-411306373\">Here was our Tuesday morning/afternoon:<br/>\n   Trevor read books about Romans and endangered species and Brenna watched <br/>\nStanley (Disney Channel show) while I checked my email. We drove to Panera <br/>\nBread for breakfast and then on to the art museum while families from our <br/>\nhomeschool group meet in the resource center on Tuesdays. Brenna did the various <br/>\ncrafts which included sponge painting and leaf rubbing and Trevor started drawing a <br/>\ncomic book titled Ice Boy. It&#39;s about a boy who goes ice skating and falls in <br/>\na hole. The other kids helped him spell the words he didn&#39;t know. We went to <br/>\nlunch afterwards with my aunt (honestly, we don&#39;t normally eat out this much!) <br/>\nto a Chinese restaurant. Trevor enjoyed the place mat which told us which <br/>\nsigns of the Chinese zodiac we are. That&#39;s all so far.....<br/>\n<br/>\nAmy Kagey<br/>\n&lt;A HREF=&quot;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ubah.com/ecommerce/default.asp?sid=Z0939&gid=1684902&quot;\">http://www.ubah.com/ecommerce/default.asp?sid=Z0939&gid=1684902&quot;</a>&gt;Free shipping on &lt;/A&gt;&lt;A HREF=&quot;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ubah.com/ecommerce/default.asp?sid=Z0939&gid=1684902&quot;\">http://www.ubah.com/ecommerce/default.asp?sid=Z0939&gid=1684902&quot;</a>&gt;Usborne Books&lt;/A&gt; !<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":162967824,"authorName":"Dawn Adams","from":"&quot;Dawn Adams&quot; &lt;Wishbone@...&gt;","profile":"bluenosegoddess","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] unschooling morning","postDate":"1068576721","msgId":84507,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDcwMWMzYTg4NCRlNGUzZjU0MCQ2NTRjZGUxOEBhb2xkc2wubmV0Pg==","referencesHeader":"PDE1Ny4yNzQ1OWViMC4yY2UyNDk5OEBhb2wuY29tPiA8MDAyYTAxYzNhODc0JDBkNmVlNTMwJDY0MDJhOGMwQDIwMDJkZXNrdG9wPg=="},"prevInTopic":84482,"nextInTopic":84509,"prevInTime":84506,"nextInTime":84508,"topicId":84393,"numMessagesInTopic":0,"msgSnippet":"On Monday; First order, as always, cartoons. Then nurse the toddler (almost 2) as he s sick and won t eat much. Thank goodness I m too lazy to wean, I ll leave","messageBody":"<div id=\"ygrps-yiv-182791019\">On Monday;<br/>\n<br/>\nFirst order, as always, cartoons. Then nurse the toddler (almost 2) as he&#39;s sick and won&#39;t eat much. Thank goodness I&#39;m too lazy to wean, I&#39;ll leave that up to him. :) Then we had to name and bury a kitten. She was about 5 weeks old and we&#39;re not sure why she got so sick but think the toddler (Harry) stepped on her at some point. At one point the night before I was holding my son with one hand while he nursed himself to sleep and stroked the dying kitten with the other hand trying to comfort her while she died. It was a strange but very clear moment. My husband finally took her and put her to sleep when she began to cry in pain. It was so quick, I noticed she was lethargic that morning, tried to feed her and get her to nurse, and by night she was dehydrated and to weak to move. Anyway, we let Catherine say goodbye to her that night and let her look at her Monday morning. She went from crying to curious about when the &#39;bugs would come&#39; (we&#39;d watched a ground squirrel decompose through early fall) to crying again. Sigh.     <br/>\n    We then went to my husbands grandparents for lunch. While his mom is fearful of HSing, Shannon&#39;s grandparents love it, I think in part because they get to see the kids anytime at all with no need to schedule visits around school. We got home and basically watched movies for the rest of the day as Harry was miserable. <br/>\n    My husband&#39;s an  atheist and I haven&#39;t been to church in years and years but last night Catherine asked to pray for the kitten and Doggy (her first cat that, we think, made a meal for the coyotes). She felt better so I&#39;ll ask her if she&#39;d like to do that more often.<br/>\n    Anyhow...big lessons for Monday...Death, family and comfort.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":149995806,"authorName":"catherine aceto","from":"&quot;catherine aceto&quot; &lt;aceto3@...&gt;","profile":"cat4cat15217","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] unschooling morning","postDate":"1068569488","msgId":84482,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMmEwMWMzYTg3NCQwZDZlZTUzMCQ2NDAyYThjMEAyMDAyZGVza3RvcD4=","referencesHeader":"PDE1Ny4yNzQ1OWViMC4yY2UyNDk5OEBhb2wuY29tPg=="},"prevInTopic":84457,"nextInTopic":84507,"prevInTime":84481,"nextInTime":84483,"topicId":84393,"numMessagesInTopic":0,"msgSnippet":"Our Monday: I got up around 9:00.  Drank tea and checked the computer.  Jonathan (1) woke up around 9:30.  We nursed and played some peekaboo.  He wandered off","messageBody":"<div id=\"ygrps-yiv-1249108778\">Our Monday: <br/>\n <br/>\nI got up around 9:00.  Drank tea and checked the computer.  Jonathan (1) woke up around 9:30.  We nursed and played some peekaboo.  He wandered off to play with fisherprice characters and I worked on finalizing a list of stuff to buy/do before Lydia&#39;s 6th bday party on Saturday. <br/>\n<br/>\nLydia woke up around 11:00.  We played in her room with barbies for awhile.  Got something to eat and began to get ready for her gymnastics class at 1:00.   While I was getting Jonathan ready she got out the paper fairy cut outs that we are going to use for decorating her party and played with them.  She wanted me to come and see that 16 fairies arranged in piles of 2 each was 8 piles.  She went back to playing, arranging fairies in piles and talking to herself.  We left for gymnkhana where she worked (she told me)  on cartwheels and handstands. <br/>\n<br/>\nAfterwords we went to the dollar store to buy stuff for the party.  We bought some silk flowers to make petal fairies at her party and some flowers for decoration and some jewelry that she just wanted to buy with her allowance.<br/>\n<br/>\nWent home and had a friend (Akira) come over for a playdate.  They played cartoonnetwork, then disappeared into her room.  Lydia told me later that in her room they were playing battles with her barbie/scoobydoo characters (barbie characters dressed and somewhat styled as scoobydoo characters).  Lydia was Velma battling Daphne and Akira was Scooby battling Shaggy.  Then they were powerpuff girls bouncing on the bed for a long time.  Lydia tried to teach Akira to count to 30 by 3s, but he was not interested.  Akira left around 8:00.  <br/>\n<br/>\nWe made and ate dinner.  We read some books on the couch. Then Jonathan and I went to bed around 11:30/12:00 and Lydia and her dad stayed up.  Lydia came to bed and woke me enough to get snuggled in close, and back to sleep. <br/>\n<br/>\nA fun day.   <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] unschooling morning","postDate":"1068560280","msgId":84457,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1Ny4yNzQ1OWViMC4yY2UyNDk5OEBhb2wuY29tPg=="},"prevInTopic":84437,"nextInTopic":84482,"prevInTime":84456,"nextInTime":84458,"topicId":84393,"numMessagesInTopic":0,"msgSnippet":"Very busy but not very exciting Monday: Yesterday we had only one car so I took my husband to work at 5:30.  It was a nice morning!   I had an appointment in","messageBody":"<div id=\"ygrps-yiv-1580281614\">Very busy but not very exciting Monday:<br/>\n<br/>\nYesterday we had only one car so I took my husband to work at 5:30.  It was a <br/>\nnice morning!   I had an appointment in the morning concerning my mom, and <br/>\ndidn&#39;t wake my kids up about it.  Came back and they were up and about.  Kirby <br/>\nneeded to go to work at 2:00, but wanted to go to the shop early to play a game <br/>\nwith a friend.  He had Joey spending the night, and going with him and he <br/>\nasked if he could use the car, but I reminded him Keith didn&#39;t have one.<br/>\n<br/>\nHolly had stories for me from the weekend, when she had stayed with a <br/>\nteenaged friend who was babysitting a mutual friend of theirs, and they all hung out <br/>\ntogether for most of two days.  It was easier for her to keep both girls for <br/>\nthe weekend than just one, and they seemed to have had a great time.    The <br/>\nteenager is leaving Thursday for National Guard training, so Holly was glad to <br/>\nhave been able to spend time with her.  She/teen is also somewhat sweet on <br/>\nKirby, so when she brought Holly home they all went with Marty to play Orc ball.  <br/>\nBut that was Sunday.<br/>\n<br/>\nBack to Monday.<br/>\n<br/>\nI was gathering homeschooling info to send my uncle in Texas who has adopted <br/>\na 15 year old relative and she is crushed by school.  I&#39;m glad he had <br/>\nmentioned that.  I had no idea he had a school-aged kid, and he wasn&#39;t aware that <br/>\nhomeschooling was an easy thing.<br/>\n<br/>\nI took Kirby and Joey to the gaming shop, and was waiting to see what about <br/>\nKeith&#39;s car.  <br/>\n<br/>\nThere&#39;s a park we had passed by frequently lately, and it had one of the <br/>\nsteel giraffe climbing things that several Albuquerque parks used to have.  Holly <br/>\nhad been saying she wanted to go there to play.  So Holly, Marty, the dog and <br/>\nI went there.  I had made sandwiches which we shared with the dog, and her <br/>\nball and a raquet.   Holly was a little disappointed that the giraffe was so <br/>\nsmall.  When she was little and had tried one she could only get halfway up, but <br/>\nnow she could zip up to the head.<br/>\n<br/>\nMost of the old steel playground stuff has been removed for being too <br/>\ndangerous.  The giraffe by our old house had been filled in--the loops covered over, <br/>\nwhich made it more dangerous-to-impossible to climb, but this one was still in <br/>\nits original state.  Both Marty and Holly climbed around on the things at the <br/>\npark, and when the dog was tired we went to one other park (with the <br/>\nenclosed-ring giraffe) and then home.  Holly took a long, long bath with toys.  Marty <br/>\nand I took food to Kirby at work.  Keith got a ride home, and I took him to <br/>\npick up his car.  Kids declined to go.  The car was done (they said) but the <br/>\nalternator/battery light was on, so we left it there, drove to pay the tow truck <br/>\nguy, ate at Subway, I took Keith to a music session he runs at another <br/>\nfriend&#39;s house (I&#39;m not involved in this one, which is fine with me) and went home.  <br/>\nIt&#39;s a luxury to have the kids old enough to give them an option to stay or <br/>\ngo, and to have the old enough not to have them worry if I&#39;m later than they <br/>\nthought I would be.<br/>\n<br/>\nI passed where Kirby works to see if he was nearly ready to go home, but he <br/>\nwasn&#39;t.  I called the house to tell Holly were I was and she asked me whether <br/>\ncastle was spelled &quot;el&quot; or &quot;le.&quot;  She was writing e-mail.<br/>\n<br/>\nI hadn&#39;t been home but a few minutes when Kirby called.  I had borrowed his <br/>\ncar key, but that set has the key to the store on it.  It was past closing time <br/>\nand he couldn&#39;t lock the front door so they could clean without anyone coming <br/>\nin.  I had to drive back up there.  Came back home.  (It&#39;s about a mile.)<br/>\n<br/>\nWent back later to get him, but he wasn&#39;t ready, so Holly and I went to the <br/>\nused bookstore next door and looked at lots of things but bought none.  Holly&#39;s <br/>\ngood about saying no to expenditures.  We played with a Care Bears sing along <br/>\nbook.  Each page had the tune play if you pushed a button.  The buttons had <br/>\ndesigns so no reading or even numbers were required.   The music was really <br/>\nnice, not beepy electronic, and it was like a good music box, with sometimes <br/>\nthree notes at once, with harmonies and counterpoints.  Very nice.   They were <br/>\ntraditional songs re-written with Care-Bears words in a few places.   &quot;The Bear <br/>\nWent Over the Mountain&quot; was the bear went over the rainbow, etc.  It had &quot;Make <br/>\nNew Friends,&quot; which Holly knows, and it had the circle&#39;s round, it has no end <br/>\nverse she likes.<br/>\n<br/>\nWe sang through the whole book.<br/>\n<br/>\nShe thought about buying their used Klutz book on string figures (cat&#39;s <br/>\ncradle and such) but decided against it.<br/>\n<br/>\nWe came  home and Kirby and I watched 24 while I messed with kindling <br/>\n(quietly).    <br/>\n<br/>\nHolly and I cleaned the bathroom (there was a mysteriously large amount of <br/>\nsand in the tub, more than she should&#39;ve had on her from the park) and she <br/>\nhelped me a bit with laundry.<br/>\n<br/>\nMarty was playing a video game.  I sat and watched him for a little while and <br/>\nhe was showing me that one of the characters had different underwear with <br/>\ndifferent outfits.  That was interesting. &lt;g&gt;  And one of the options for another <br/>\ncharacter was some armor that looked good, but seemed to leave some important <br/>\nparts uncovered.  <br/>\n<br/>\nI went to bed early because I had to take Keith in to work again at 5:30.   <br/>\nThat&#39;s a longer drive, half an hour each way.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":113028911,"authorName":"Dnowens@aol.com","from":"Dnowens@...","profile":"echomygecko","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] unschooling morning","postDate":"1068543269","msgId":84437,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhYi4xY2IzZjcyOC4yY2UyMDcyNUBhb2wuY29tPg=="},"prevInTopic":84409,"nextInTopic":84457,"prevInTime":84436,"nextInTime":84438,"topicId":84393,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/10/03 06:13:00 PM Central Standard Time, evelynsfarm@msn.com writes: Math, writing and reading? Oh yes that too maybe later on, maybe ","messageBody":"<div id=\"ygrps-yiv-1781696996\">In a message dated 11/10/03 06:13:00 PM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:evelynsfarm@...\">evelynsfarm@...</a> writes:<br/>\nMath, writing and reading? Oh yes that too maybe later on, maybe <br/>\nnot.  What about you on this Monday morning?  Tell me about your <br/>\nunschooling morning today and most days. How do your days unfold and <br/>\ndo you ever feel as if you should be &quot;doing&quot; more &quot;school?&quot; I think <br/>\nwe do school all day, even if we never open a book.  I am new to this <br/>\nbut learning more every day about what feels right so I thought I <br/>\nwould ask for some feedback.  Thanks.<br/>\n############<br/>\n<br/>\nI&#39;ve gotten past the &quot;we should be doing more school&quot; in the past few years. <br/>\nI&#39;m even past the thoughts of, we did this ___ today, if the kids were in <br/>\nschool it would be the same as ___. I hope that comes to you soon too. :o)<br/>\n<br/>\nToday my best friend called at 6:30 like she does every Monday, Tuesday, and <br/>\nWednesday mornings, to wake me up so I can go and watch her kids until their <br/>\nbus comes to pick them up. She told me she was sick and wouldn&#39;t be going into <br/>\nwork so I didn&#39;t need to come over. We chatted for a minute until Darin <br/>\ngroaned about the chatter at that hour. &lt;g&gt; I snuggled down under the covers and the <br/>\ndog pushed down between us too. I woke up at 8:30 when Darin kissed me <br/>\ngood-bye and Moly crawled into bed with me and the dog. Jack woke us up an hour or <br/>\nso later, playing the playstation. He had pulled the covers up from the bottom <br/>\nof the bed at my feet and made a nest to play in. Moly got up and made coffee <br/>\n(bless her!) and took a shower. Jack fixed himself some toast and went back to <br/>\nthe playstation. I took a cup of coffee and read through 80 some emails and <br/>\nthen brushed Moly&#39;s hair. The kids spent the day making a present for their <br/>\ncousin who turns 11 on the 11th, but we went to his party this evening. I fell <br/>\ninto a horrid book I&#39;ve been reading off and on for a few days, that I couldn&#39;t <br/>\nget out of until I finished it. Purely out of morbid curiosity just to see how <br/>\nit turned out. And then Jack beat me at a game of chess. I wonder when he got <br/>\nso good, and then I realize it isn&#39;t too hard to beat me at chess. ;o) Moly <br/>\nmade us ham sandwiches for lunch and Jack took his to the computer to play <br/>\nFinal Fantasy number something or other, and Moly and I watched some Animal Planet <br/>\ntogether, and I helped her get started on a new crosstitch project. I called <br/>\nmy best friend to see how she was feeling and she said she was going to call <br/>\nher Mom to bring the kids some dinner, so I told her I would pick them up and <br/>\nfeed them tonight for her. I went over and got them and all the kids played <br/>\ntogether, building race cars out of empty boxes left over from Girl Scout candy. <br/>\nAll too small for the kids to actually fit in, but interesting anyway. They <br/>\npainted them and now there are four card board cars on my front porch. We all <br/>\nwent out to buy a present for the cousin, and I picked up some things I will <br/>\nneed for my hospital stay later this week and Jack and Moly pooled some money to <br/>\nbuy some new gaming cards, and gave the rest to their friends to buy some <br/>\ncandy. I took all to the cousin&#39;s party and they ate pizza and cake and played <br/>\nvideo games and watched cartoons on the big screen at the pizza place. My SIL was <br/>\nlamenting about her middle child failing every class but one and he got a D <br/>\nin it. He will have to do summer school again next summer if his grades don&#39;t <br/>\nimprove by Christmas break. She wondered aloud what she could do and I again <br/>\noffered to have him &quot;do school&quot; with us. &lt;g&gt; I think one day she may take me up <br/>\non it, but then I might have to explain exactly what it is that we &quot;do&quot;. &lt;VBG&gt; <br/>\nI took my best friend&#39;s kids back home and my kids and I fixed her some soup <br/>\nand cleaned up her living room for her. We passed by Fred Phelps and his <br/>\ncongregation on the way home, they were picketing outside the AAA offices, who know<br/>\ns why, and Moly and I had yet another discussion about them and their signs. <br/>\nJack wanted to know who Matthew Shepard was and so I told them about him, and <br/>\nMoly cried. It was a sad ending to an otherwise peaceful, beautiful day. When <br/>\nDarin got home he and the kids snuggled down to watch a movie in our room and a <br/>\nfriend of mine called and invited the kids out to ride horses with her on <br/>\nWednesday. That was our day, mostly good, once bad, but wonderful just the same. <br/>\n~Nancy<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":164396504,"authorName":"Elizabeth Roberts","from":"Elizabeth Roberts &lt;mamabethuscg@...&gt;","profile":"mamabethuscg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] unschooling morning","postDate":"1068500241","msgId":84409,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMTEwMjEzNzIxLjE0NjE1LnFtYWlsQHdlYjEyNjA0Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGJvb21mYytrYmpzQGVHcm91cHMuY29tPg=="},"prevInTopic":84393,"nextInTopic":84437,"prevInTime":84408,"nextInTime":84410,"topicId":84393,"numMessagesInTopic":0,"msgSnippet":"Our day today ended up a focus in helping others as I ran two friends to two different doctors, and picked up another friend s sick children from their school.","messageBody":"<div id=\"ygrps-yiv-1829785962\">Our day today ended up a focus in helping others as I ran two friends to two different doctors, and picked up another friend&#39;s sick children from their school. Somewhere in there we did manage some home-economics as well (housework LOL!) some imaginative play and Sarah watched that Disney movie about the dragster racing girl...can&#39;t think of the title at the moment.<br/>\n<br/>\nElizabeth in MA<br/>\n<br/>\nevelyns92 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:evelynsfarm@...\">evelynsfarm@...</a>&gt; wrote:<br/>\nIt is 10:30 am and we are in our flannel pjs watching old &quot;Lassie&quot; re-<br/>\nruns on TV Land. It occurs to me again how lucky we are that we did <br/>\nnot have to run to school at 8am,catch a bus or go to &quot;work.&quot; We have <br/>\nplayed with the dogs and cats and must go feed the rest of the <br/>\nanimals here at our little farm, but are under no pressure to do much <br/>\nelse. Yes, there is always the laundry to do and dishes to put away <br/>\nbut the sun is out, the storm has passed and a brisk wind is blowing.<br/>\n<br/>\nMath, writing and reading? Oh yes that too maybe later on, maybe <br/>\nnot.  What about you on this Monday morning?  Tell me about your <br/>\nunschooling morning today and most days. How do your days unfold and <br/>\ndo you ever feel as if you should be &quot;doing&quot; more &quot;school?&quot; I think <br/>\nwe do school all day, even if we never open a book.  I am new to this <br/>\nbut learning more every day about what feels right so I thought I <br/>\nwould ask for some feedback.  Thanks.<br/>\n<br/>\n<br/>\nYahoo! Groups SponsorADVERTISEMENT<br/>\n<br/>\n&quot;List Posting Policies&quot; are provided in the files area of this group. <br/>\n<br/>\nTo unsubscribe from this send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\nVisit the Unschooling website and message boards: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\nYour use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nProtect your identity with Yahoo! Mail AddressGuard<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":133909419,"authorName":"evelyns92","from":"&quot;evelyns92&quot; &lt;evelynsfarm@...&gt;","profile":"evelyns92","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"unschooling morning","postDate":"1068490028","msgId":84393,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJvb21mYytrYmpzQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":84409,"prevInTime":84392,"nextInTime":84394,"topicId":84393,"numMessagesInTopic":0,"msgSnippet":"It is 10:30 am and we are in our flannel pjs watching old Lassie re- runs on TV Land. It occurs to me again how lucky we are that we did not have to run to","messageBody":"<div id=\"ygrps-yiv-1082834710\">It is 10:30 am and we are in our flannel pjs watching old &quot;Lassie&quot; re-<br/>\nruns on TV Land. It occurs to me again how lucky we are that we did <br/>\nnot have to run to school at 8am,catch a bus or go to &quot;work.&quot; We have <br/>\nplayed with the dogs and cats and must go feed the rest of the <br/>\nanimals here at our little farm, but are under no pressure to do much <br/>\nelse. Yes, there is always the laundry to do and dishes to put away <br/>\nbut the sun is out, the storm has passed and a brisk wind is blowing.<br/>\n<br/>\nMath, writing and reading? Oh yes that too maybe later on, maybe <br/>\nnot.  What about you on this Monday morning?  Tell me about your <br/>\nunschooling morning today and most days. How do your days unfold and <br/>\ndo you ever feel as if you should be &quot;doing&quot; more &quot;school?&quot; I think <br/>\nwe do school all day, even if we never open a book.  I am new to this <br/>\nbut learning more every day about what feels right so I thought I <br/>\nwould ask for some feedback.  Thanks.</div>","specialLinks":[]}],"prevTopicId":84512,"nextTopicId":31493}}