{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Update on teen boy (a little long--sorry)","postDate":"1234898376","msgId":42065,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGduZjJrOCs4OTJlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE1MjU2Mjk1MjI4ODQyNjc5NjA5Nzc2NDA3NDQ4ODI3ODU1OTU2OS1XZWJtYWlsQG1lLmNvbT4="},"prevInTopic":42051,"nextInTopic":0,"prevInTime":42064,"nextInTime":42066,"topicId":42049,"numMessagesInTopic":0,"msgSnippet":"... more things to do, but it became clear that the root of the boredom was coming from inside him. I turned the say yes more often phrase around to him,","messageBody":"<div id=\"ygrps-yiv-1370517068\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt; We talked about some options and things I could do to help him find<br/>\n </span></blockquote>more things to do, but it became clear that the root of the &quot;boredom&quot;<br/>\nwas coming from inside him. I turned the &quot;say yes more often&quot; phrase<br/>\naround to him, because he had chosen to limit his world in many ways,<br/>\nand now that was feeling like constriction instead of like comfy cocoon.<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>That&#39;s really interesting!  I&#39;ve seen something similar around here.  I<br/>\nlike the &quot;say yes more often&quot; approach, I&#39;ll have to use that!  I can<br/>\nsee it happening naturally in small ways already, but my daughter had<br/>\ncertainly limited herseld to a very narrow world.<br/>\n<br/>\nIt is and has been very restricting.  It&#39;s been this way with,<br/>\neverything, food, people, clothing, music.  It hasn&#39;t been all bad, in a<br/>\nway, it&#39;s been totally necessary for defining who she is as a person, in<br/>\npart, by defining what she is not.  I can see, now how, she&#39;s really<br/>\ncomfortable with who she is as a person, and is somewhat directionless<br/>\nwithin her self made parameters because they&#39;ve become boring.<br/>\n<br/>\nShe&#39;s starting to consider expanding her world.  It&#39;s her comfort zone,<br/>\nso it&#39;s challenging, but interesting and I see it as inevitable.  At<br/>\nthis point, I wonder which way she&#39;ll go!  If she could, she&#39;d go to<br/>\nbeauty school and learn to cut hair.  That is what she really really<br/>\nwants to do, but she&#39;s too young.  Ahhh that age thing again!  So, we<br/>\nare working towards a driver&#39;s permit, which can happen in a couple of<br/>\nmonths, and that&#39;s exciting!</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Update on teen boy (a little long--sorry)","postDate":"1234814580","msgId":42051,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA5NUVCNTk3LTUxQ0QtNEY1My04MERFLThBNzdCNERGN0M5REBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDE1MjU2Mjk1MjI4ODQyNjc5NjA5Nzc2NDA3NDQ4ODI3ODU1OTU2OS1XZWJtYWlsQG1lLmNvbT4=","referencesHeader":"PDE1MjU2Mjk1MjI4ODQyNjc5NjA5Nzc2NDA3NDQ4ODI3ODU1OTU2OS1XZWJtYWlsQG1lLmNvbT4="},"prevInTopic":42049,"nextInTopic":42065,"prevInTime":42050,"nextInTime":42052,"topicId":42049,"numMessagesInTopic":0,"msgSnippet":"-=- I turned the say yes more often phrase around to him, because he had chosen to limit his world in many ways, and now that was feeling like constriction","messageBody":"<div id=\"ygrps-yiv-1913125706\">-=- I turned the &quot;say yes more often&quot; phrase around to him, because he  <br/>\nhad chosen to limit his world in many ways, and now that was feeling  <br/>\nlike constriction instead of like comfy cocoon. -=-<br/>\n<br/>\nThis is really interesting.   It might be easier for a child whose  <br/>\nparent(s) consciously tried to say &quot;yes&quot; and open up the world to then  <br/>\nrealize that he himself has been saying &quot;no&quot; to the world and himself  <br/>\nmore than he needs to!<br/>\n<br/>\nVery good idea, Joanna!!<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":294520986,"authorName":"Joanna","from":"Joanna &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Update on teen boy (a little long--sorry)","postDate":"1234810201","msgId":42049,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1MjU2Mjk1MjI4ODQyNjc5NjA5Nzc2NDA3NDQ4ODI3ODU1OTU2OS1XZWJtYWlsQG1lLmNvbT4="},"prevInTopic":0,"nextInTopic":42051,"prevInTime":42048,"nextInTime":42050,"topicId":42049,"numMessagesInTopic":0,"msgSnippet":"Hi-- I so appreciated reading Sandra s update that I thought I d post one, since we are having a big shift around here. I ve been patiently watching my 13 1/2","messageBody":"<div id=\"ygrps-yiv-1160882457\">Hi-- <br/>\n<br/>\nI so appreciated reading Sandra&#39;s update that I thought I&#39;d post one, since we are having a big shift around here.   <br/>\n<br/>\nI&#39;ve been patiently watching my 13 1/2 yo son go through waves of interest and boredom/inactivity for a few years now.  When I was concerned, a friend directed me to a talk Sandra gave about tweens.  There was a suggestion that a &quot;percolation&quot; phase (my words, I think, maybe not hers) was normal, followed by a big change as the teen years went underway. <br/>\n<br/>\nWell, sure enough, he&#39;s changing, and it feels kind of like a waking up.  It began with a conversation, about two months ago, in the wee hours where he expressed his boredom in tears.  We talked about some options and things I could do to help him find more things to do, but it became clear that the root of the &quot;boredom&quot; was coming from inside him.  I turned the &quot;say yes more often&quot; phrase around to him, because he had chosen to limit his world in many ways, and now that was feeling like constriction instead of like comfy cocoon. <br/>\n<br/>\nAll of a sudden, he&#39;s bursting forth with his own energy and initiative.  The things he&#39;s actively decided to pursue (and is now already pursing) in the past few days: <br/>\n<br/>\nLearning Spanish with Rosetta Stone--We found it online with the SF public library.  I signed up for a card, and then he downloaded it and started it.  I wish I&#39;d let him sign up for his own card, but I&#39;m so used to doing stuff like that for him that it didn&#39;t occur to me until too late! <br/>\n<br/>\nBody building and excercise--never much interest before beyond having fun, running around with friends.  Now he wants to learn about proper form, and he&#39;s using his ipod to chart out walking/jogging courses.  It&#39;s raining right now, so that will wait until the storms clear. <br/>\n<br/>\nJuggling--he&#39;s been practicing so much that his arms are tired.  We&#39;ll start looking for juggler videos and websites that sell cool stuff to juggle.  He wants to know what the heaviest thing is that anyone has ever juggled, but we haven&#39;t looked it up yet.  Bowling balls didn&#39;t seem to impress him--lol. <br/>\n<br/>\nWho knows what will be coming soon, but the wonderful thing is that I&#39;ve always had a hard time with my son finding things to do that he hooks in to.  We have tons of conversation and watch shows together, etc., but they aren&#39;t &quot;doing&quot; things.  But now he&#39;s coming up with the things that he wants to do.  Or maybe he&#39;s just now interested in doing things, and will be open to suggestions.  I don&#39;t know what the future will hold, but it all feels more interesting and exciting! <br/>\n<br/>\nThrough this whole tween period, I&#39;ve always wondered if I was up to the unschooling challenge.  If I hadn&#39;t heard that talk that Sandra did on a radio program, I would have for sure felt much more insecure. Now that he&#39;s coming out of it, it is becoming so clear that he needed his &quot;percolating time&quot; and that it is all o.k.  It makes me wonder even more about why people buy into the school system, and how it is set up to be &quot;consistent&quot;--no one ever gets a break.  There is no percolating time--no time to day dream for a few months or years--just  work, work, work.  No wonder we are losing our dreamers.  They are constantly being yanked back to earth before they are ready! <br/>\n<br/>\nThanks for all the support on this list!!  And if you have a tween that seems to be in the &quot;doldrums,&quot; hang in there and know that things will happen in due time! <br/>\n<br/>\nJoanna</div>","specialLinks":[]}],"prevTopicId":42061,"nextTopicId":42064}}