{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"more enriching enrichment ideas","postDate":"1013796261","msgId":4866,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhmLjE3NDc5MDgyLjI5OWVhN2E1QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":4865,"nextInTime":4867,"topicId":4866,"numMessagesInTopic":0,"msgSnippet":"I FOUND WHAT I WAS LOOKING FOR.  This isn t it.  This is another thing I found while looking. It was in HEM in the May/June 1999 issue: Your House as a","messageBody":"<div id=\"ygrps-yiv-1992370622\">I FOUND WHAT I WAS LOOKING FOR.  This isn&#39;t it.  This is another thing I <br/>\nfound while looking.<br/>\n<br/>\nIt was in HEM in the May/June 1999 issue:<br/>\n<br/>\n&quot;Your House as a Museum&quot;<br/>\n<br/>\nOnce my kids were watching something or other on TV about woodcuts and block <br/>\nprinting, and somehow the subject turned to printed cloth.  I told them I had <br/>\nsome block-printed cloth and they got pretty excited about seeing it.  <br/>\n<br/>\nI found an Indian bedspread, printed in two passes, with blocks, and we <br/>\nlooked at where they had made some great matches, where they had missed, and <br/>\nhow it all might work (because I don&#39;t know what their work stations look <br/>\nlike, whether they do edges first, or what).  I found two scarves made of <br/>\nfine cotton, block-printed each in one color only.  Then I found some <br/>\nscreen-printed silk handkerchiefs from China that a friend had given me after <br/>\nhis mother died.  Still in the packages, and some matching pairs, so we could <br/>\ncompare.  They might have been mass produced, but still...   Then I found a <br/>\npiece of Hawaiian cloth.  I don&#39;t know the name of it, but my husband&#39;s mom <br/>\nbrought it from Hawaii.   I think it&#39;s a kind of Polynesian kilt <br/>\n<br/>\n I also had a piece of woven paisley, a batik sari and a sari with gold woven <br/>\ninto it.  I didn&#39;t go into details about those except to point out that most <br/>\nof those examples were made in India.  Someday I&#39;ll read them _The Road to <br/>\nAgra_ which is a kids&#39; adventure novel and which deals in passing with the <br/>\nchild labor involved in weaving.<br/>\n<br/>\nWith that my children decided that anything they might want to see, I would <br/>\nhave.  There have been many times that they were right!<br/>\n<br/>\nWhen they asked what pogs were supposed to be REALLY, I found an old <br/>\nmilk-bottle that had been stuck up in the top of a cabinet just in case a kid <br/>\nmight ever want to see it, next to the old molded Pepsi bottle, and the <br/>\nnot-so-old Coca Cola bottle.   I told them stories of picking up bottles to <br/>\nturn in for the two-cent deposit.  It&#39;s the equivalent of picking up aluminum <br/>\ncans now, but they&#39;re heavy and fragile.  The kids had never known about <br/>\nbottle deposits like that, where the bottles were reused instead of melted <br/>\ndown.  I told them about people throwing bottles out of car windows on the <br/>\nhighways, and all the broken glass we walked on and around as kids, and that <br/>\npeople used to shoot at bottles for practice.  <br/>\n<br/>\nKids nowadays take &quot;Keep American Beautiful&quot; for granted.  They can&#39;t believe <br/>\nthere used to be rusting bedsprings and old washing machines dumped all over <br/>\nthe place, and that hamburger wrappers were as likely as not to go out the <br/>\nwindow of a car.  I told them about how the old glass would weather, and what <br/>\nhad been in the sand and sun of New Mexico for long enough would turn into <br/>\nsmooth-edged, opaque little jewels we used for hopscotch markers.  Pogs to <br/>\nhopscotch--full circle, because I had those bottles.<br/>\n<br/>\nMy maiden name was Adams, and I remember being taunted by kids singing the <br/>\ntheme song to The Addams Family TV show, but that line &quot;Their house is a <br/>\nmuseum where people come to see &#39;em&quot; stuck with me always.  When I go to <br/>\nother people&#39;s houses I love to see what they have.  The things they&#39;ve <br/>\nchosen to keep, or collected over the years, teach me a good deal about those <br/>\npeople themselves--their interests, their history, their sense of humor, and <br/>\nphilosophy.<br/>\n<br/>\nSometimes my kids get bored, and I can light up a half hour by digging into <br/>\nsome box or drawer and producing something they&#39;ve never yet seen.  Like a <br/>\nmagician pulling a bouquet of flowers out of a wand, I pull out a little <br/>\ndoll, or some Australian coins, electric curlers (for sorting, putting back <br/>\non the rods, and discussing), muffin tins, poker chips, grandpa&#39;s bow ties, a <br/>\nhand-cranked egg beater to froth up soapy water (I wish I had a hand-cranked <br/>\ndrill; my dad did).  Whenever I pull these things out I tell the kids why I <br/>\nhave them and what I know about them.  I told about the gold strip in <br/>\nAustralian paper money, about ties my dad used to have with cowboys and <br/>\nbucking broncos on them, about patterned muffin tins being pressed kind of <br/>\nlike steel car parts are pressed, of getting my hair stuck in electric <br/>\ncurlers when I was a teenager and crying because I was afraid my long hair <br/>\nwould have to be cut off.<br/>\n<br/>\nCan you remember visiting grandparents or older relatives when you were young <br/>\nand finding cool &quot;stuff&quot; in their storerooms?  My granny had &quot;carding combs&quot; <br/>\nI think she called them--steel brushes for cleaning cotton and lining up the <br/>\nfibres.  She never spun, as far as I know, but she would use raw cotton to <br/>\nput into quilts, taking the seeds out herself and carding the cotton.  When <br/>\nmy mom was little, their whole family had picked cotton by hand for a living, <br/>\nmoving from town to town in West Texas.  My other grandmother, my Mamaw, had <br/>\nan ironing machine, and said they used to iron sheets and pillow cases with <br/>\nit.<br/>\n<br/>\nThere are probably things in your house that would fascinate your children <br/>\nbut you haven&#39;t thought to offer or they haven&#39;t found the good stuff yet.  <br/>\nConsider interesting things you have which might be of interest for being <br/>\nold, foreign, specially made or obtained under special circumstances:<br/>\n<br/>\nornaments<br/>\ndishes / pots /molds<br/>\nsilverware--even one old piece you know something about<br/>\negg beater<br/>\nflour sifter<br/>\ncan openers (&quot;church keys&quot;)<br/>\nold bottles or other containers<br/>\nyour old clothes from the 60&#39;s or 70&#39;s<br/>\nrecordings--reel to reel, 45&#39;s, 78&#39;s, 8-tracks<br/>\nmanual typewriter<br/>\npush mower<br/>\npre-transistor radio<br/>\nmusical instruments<br/>\njewelry (and any old photos of people wearing that actual jewelry)<br/>\nphotos of people with cars (I try to get cars in photos to date them)<br/>\nbooks, magazines<br/>\nclippings<br/>\nribbons from 4-H, scout badges, school certificates, class photos, report <br/>\ncards<br/>\ntoys from your childhood<br/>\nawards / trophies (photos of the activity?)<br/>\nfuneral cards<br/>\nwedding announcements/certificates<br/>\nbirth announcements<br/>\ngames (any old monopoly games in your attic?)<br/>\nteach clapping games or jump rope (living history museum &lt;g&gt;)<br/>\nfoods no longer commonly used (find a fondue pot and make them something)<br/>\npoker chips (patterns, counting, sorting)<br/>\nsewing supplies / buttons<br/>\nold shoes<br/>\nuniforms<br/>\ncurlers / bobby pins <br/>\ndrafting supplies<br/>\ntypewriter eraser with a brush<br/>\nold pens, paper, ancient stationery<br/>\nflip-open address book like people had on desks in 1963<br/>\nold phone<br/>\nold phonebook or school annual with alpha prefixes--find out what your local <br/>\nprefix used to be (if it&#39;s old enough)<br/>\nart<br/>\nmusic<br/>\nthings relating to WWII, Korea, Viet Nam<br/>\n<br/>\nMany people in the southwest have wagon wheels.  They&#39;re not flat—the hub is <br/>\nout at an angle from the wheel, and the spokes hold it at that angle for <br/>\nstrength and stability.  It&#39;s fascinating to look at one, and touch it, and <br/>\nknow that it took an experienced wheelwright to make that wheel, and a <br/>\nblacksmith to put the iron on it, and that the very wheel came here from <br/>\nsomewhere else—maybe Mexico, maybe Missouri, maybe Kansas.  It was made <br/>\nsomewhere, and came here, and now it&#39;s sitting in someone&#39;s yard.<br/>\n<br/>\nDo you have rocks or mineral samples?<br/>\nDo you have an emerald or a ruby or a diamond?<br/>\nDo you have a really old camera?<br/>\nAny leather-bound books or boxes?<br/>\n<br/>\nMy husband has something the kids haven&#39;t seen yet--a set of bongo drums.<br/>\n<br/>\nSo what&#39;s at your house?</div>","specialLinks":[]}],"prevTopicId":4864,"nextTopicId":4840}}