{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":10,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Connection","postDate":"1330958385","msgId":66020,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFDNUYzRUFFLUM0QTYtNEZBQS1COTgyLTEwNjhBMEU5OTBBRkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEYxM0I2QjIxLUQ3NEItNEQ5Mi1CNzI3LTIzRjg5Rjc4QjAxNEB2ZXJpem9uLm5ldD4=","referencesHeader":"PGppdnFkYytqbXEwQGVHcm91cHMuY29tPiA8RjEzQjZCMjEtRDc0Qi00RDkyLUI3MjctMjNGODlGNzhCMDE0QHZlcml6b24ubmV0Pg=="},"prevInTopic":66018,"nextInTopic":0,"prevInTime":66019,"nextInTime":66021,"topicId":65992,"numMessagesInTopic":0,"msgSnippet":"Joyce wrote this and I wanted it repeated (so I m repeating it): (In response to -=-I do believe that she can ask her kids for forgiveness and move on and that","messageBody":"<div id=\"ygrps-yiv-1901206042\">Joyce wrote this and I wanted it repeated (so I&#39;m repeating it):<br/>\n<br/>\n(In response to -=-I do believe that she can ask her kids for forgiveness and move on and that things will be ok. -=-)<br/>\n<br/>\nNot if she keeps making the same mistakes. Then her kids will see that she&#39;s more concerned with feeling better than about doing better. If she doesn&#39;t know how to change, if she doesn&#39;t know what she&#39;s doing that&#39;s harmful, she can&#39;t make better choices.<br/>\n<br/>\n===========================================<br/>\n<br/>\nThere is a flaw in discussion groups like this, in that there&#39;s no clear podium and too many people blast into the meeting without reading the agenda.   Even having a front page that says, in color, &quot;DO NOT POST without reading this&quot; doesn&#39;t seem to slow some people down.<br/>\n<br/>\nThe discussion is about natural learning, about unschooling.  It&#39;s not &quot;whatever@yahoogroups&quot; and it&#39;s not &quot;making parents feel better about whatever.&quot;<br/>\n<br/>\nWhen a parent&#39;s relationship with her child improves materially and substantially, then that mom will feel better.  I don&#39;t WANT moms feeling better about the avoidance of substantial improvement. <br/>\n<br/>\nAnyone who just wants to vaguely feel better without making any changes to her beliefs or practices has come to the wrong place.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Connection","postDate":"1330954277","msgId":66018,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxM0I2QjIxLUQ3NEItNEQ5Mi1CNzI3LTIzRjg5Rjc4QjAxNEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGppdnFkYytqbXEwQGVHcm91cHMuY29tPg==","referencesHeader":"PGppdnFkYytqbXEwQGVHcm91cHMuY29tPg=="},"prevInTopic":66014,"nextInTopic":66020,"prevInTime":66017,"nextInTime":66019,"topicId":65992,"numMessagesInTopic":0,"msgSnippet":"... And lots who parent conventionally don t have close relationships with their kids. Some kids who grow up in the ghetto turn out fine. Would knowing that","messageBody":"<div id=\"ygrps-yiv-575689416\">On Mar 4, 2012, at 8:23 AM, Deborah wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I raised my older two similar to the way that you were raising your older two.<br/>\n&gt; I just want to reassure you that I have a very close relationship with both my older boys.<br/>\n<br/>\n </span></blockquote>And lots who parent conventionally don&#39;t have close relationships with their kids.<br/>\n<br/>\nSome kids who grow up in the ghetto turn out fine. Would knowing that help you bring up great kids in the ghetto?<br/>\n<br/>\nSo what does the reassurance mean? How does it help someone make the choices that lead toward close relationships and avoid the ones that damage relationships?<br/>\n<br/>\nBoth the ghetto and conventional parenting tear at esteem and relationships. For kids to turn out okay, it&#39;s because of the child&#39;s or the parents&#39; personality (neither of which can be passed onto someone else) or because of the choices the parents (or a mentor) make. Which *can* be passed on *if* the parents are aware of what&#39;s working independent of personality and why it&#39;s working. Most parents don&#39;t know. Whether parenting leads to drugs or college seems like chance. Which is why they grasp at magical feel good &quot;charms&quot; like &quot;You&#39;re a great mom,&quot; &quot;Everything will be fine,&quot; and other &quot;support&quot; at Sandra&#39;s support web page. <br/>\n<br/>\nBut it needn&#39;t be chance. There *are* choices parents can make that grow better relationships and choices that can damage the relationships.<br/>\n<br/>\nThis list focuses on analyzing what ideas help and hinder unschooling and relationships and why those ideas work or don&#39;t work. A lot of time is devoted by Sandra and frequent posters to keep the words meaningful, clear and useful, to point out words that uplifting but have no foundation. Words like that are like tossing a person up in a blanket and claiming it will help them climb a mountain. &quot;You&#39;re doing great! You&#39;re up really high!&quot;<br/>\n<br/>\nThere is no way to know &quot;It will all work out for the best&quot;. If she stops looking objectively at what&#39;s not working, critically examining what she&#39;s doing that is leading away from better relationships, stops &quot;Reading a little, trying a little, waiting a while, watching,&quot; it&#39;s a crap shoot whether the situation in her family will get better or get worse.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Forgive yourself and just move forward in parenting them they way you believe you should.<br/>\n<br/>\n </span></blockquote>Does this mean when kids don&#39;t turn out okay that it&#39;s because parents couldn&#39;t forgive themselves? Or because they didn&#39;t parent in the ways they believe they should?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We are all parents on a journey of learning and trying our best.<br/>\n<br/>\n </span></blockquote>I believe that&#39;s what most parents *want*. But they&#39;ve grown up living, reading and watching parenting choices that everyone is sure are right that are really detrimental to kids and relationships. They&#39;ve grown up surrounded by ideas that are essentially like trying to swim your best with iron weights strapped to you. When everyone is swimming with iron weights, when everyone has advice on how to do it better, it takes some amazing insight to realize the weights are the problem. Most parents never figure that out. Given that nearly everyone is saying the iron weights are necessary, given that parents who drop them without knowing what to do instead are clearly failing, it&#39;s understandable why they don&#39;t.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I do believe that she can ask her kids for forgiveness and move on and that things will be ok. <br/>\n<br/>\n </span></blockquote>Not if she keeps making the same mistakes. Then her kids will see that she&#39;s more concerned with feeling better than about doing better. If she doesn&#39;t know how to change, if she doesn&#39;t know what she&#39;s doing that&#39;s harmful, she can&#39;t make better choices.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":252464818,"authorName":"Christina","from":"&quot;Christina&quot; &lt;daharryrc@...&gt;","profile":"daharryrc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Connection","postDate":"1330894211","msgId":66014,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpqMGtpMythajZjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGppdnFkYytqbXEwQGVHcm91cHMuY29tPg=="},"prevInTopic":66011,"nextInTopic":66018,"prevInTime":66013,"nextInTime":66015,"topicId":65992,"numMessagesInTopic":0,"msgSnippet":"*** Go ahead and do things that you would not normally do with a child of that age, if the child is ok with it.  If they want to do much younger activities,","messageBody":"<div id=\"ygrps-yiv-3288037\">*** Go ahead and do things that you would not normally do with a child of that age, if the child is ok with it.  If they want to do much younger activities, encourage it.  Let them sit on your knee while you rock them and read a book.  Curl up in bed or camp out on the floor and watch a movie.  If they don&#39;t want to be in your bed make a place on the floor or a snuggle corner for reading and hanging out.  Get them involved in all the cuddling, nurturing, play, etc that you do with the younger one.***<br/>\n<br/>\nThey are very interested in the younger child things, cuddling, and snuggling.  They have been getting right in there with the 2 yo.  It&#39;s been so amazing to watch.  It&#39;s like they are redoing their preschool years WHILE still very much engaging in their 9 yo and 11 yo interests and beyond.  My son decided to begin a pre-algebra workbook that someone passed it down to us a couple years ago.  He&#39;s worked in it twice and it&#39;s the weekend!  I&#39;ve been quietly shocked, lol.  I guess that&#39;s part of the beauty of everyday being like a Saturday!  :-)<br/>\n<br/>\n***I do think think that the kids need to hear how you feel (in kids terms of course).  They have lived it, so nothing you are going to say will surprise them.  They lived their lives and your parenting style and now they are witnessing the style you use with your younger one.  I also have two older kids, then two younger kids.  My older kids are young adults now and they see the difference in my parenting.  They are old enough to question me and say things like &quot;I never would have got away with that.&quot;  And they are right! But we spend time talking about it.***<br/>\n<br/>\nI have shared some with them too.  My son&#39;s response was, &quot;well, I didn&#39;t even know any other way so I don&#39;t feel like I missed out.&quot;  I know they appreciate the honesty and that I&#39;m trying to do better by them now, but it&#39;s funny to hear how they reflect on their childhoods, keeping in mind they &quot;may&quot; be trying to spare my feelings.  I can&#39;t know that for sure, but I used to do that with my mom.  I would try and smooth things over for her so she wouldn&#39;t feel too badly.  Children tend to be so tender toward their parents until the wounds get so big that some just shut-down.  That&#39;s what I did as a teenager.  I became very hard towards my mom, but prior to that I was ALWAYS thinking more of her feelings than my own.    <br/>\n<br/>\n*** With your kids being younger (then my adult kids)I would think that you need to talk to them to ensure that they are not feeling that you are treating the younger one &quot;better.&quot;***<br/>\n<br/>\nI have treated my youngest better.  We have shared a very different &quot;beginning&quot; and our relationship has just flowed and blossomed from there.  I KNOW her as well as I think I can at this point.  I&#39;m having to rediscover my older two.  Get to really know who they are.  It&#39;s so very strange, but I&#39;m glad I not only became aware of it, but have you and so many others helping me get our relationships back on track.<br/>\n<br/>\n***I think that it is very important to express to them that just because you parented them differently when they were young does not mean that you loved them any less. They just really need to know that they are loved as much as their younger sibling.***<br/>\n<br/>\nI haven&#39;t loved them as much.  I have a very committed love for them, but I have loved the baby better.  I have a parental, &quot;you are my child and I would die for you&quot; commitment to my children, but the wonderful feelings of love that accompany connection are NOT present to the degree that they are with my youngest.  I&#39;ve been in denial about that for a couple years, but denying didn&#39;t help things change.  It is what it is.  I don&#39;t hang around in guilt about it.  I&#39;ve accepted that I was doing the best I knew how at the time, now I&#39;m learning a better way.  <br/>\n<br/>\n***I raised my older two similar to the way that you were raising your older two.  I just want to reassure you that I have a very close relationship with both my older boys.***<br/>\n<br/>\nThank you for all your thoughts.  Very encouraging.  I&#39;m counting on the belief that it isn&#39;t too late to heal and turn things around and that our present and future will be full of connected, loving, relationship.<br/>\n<br/>\nChristina.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Connection","postDate":"1330880357","msgId":66011,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU5MkI0NUJCLTAyQkEtNEYzRC1CQzU4LTA2NEUwNDA5NjY0OEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpqMDRpZCtvZGo1QGVHcm91cHMuY29tPg==","referencesHeader":"PGpqMDRpZCtvZGo1QGVHcm91cHMuY29tPg=="},"prevInTopic":66009,"nextInTopic":66014,"prevInTime":66010,"nextInTime":66012,"topicId":65992,"numMessagesInTopic":0,"msgSnippet":"... Can you tell us about your wonderful son? Try first describing him in purely positive light. No negative sentences. You have an amazing child, now let s","messageBody":"<div id=\"ygrps-yiv-540483278\">On a facebook discussion somewhat related to this group, someone wrote this to a dad who said his kid used to be really interested in things and lately isn&#39;t  (vague paraphrase):   <br/>\n<br/>\n-------------------<br/>\nCan you tell us about your wonderful son? Try first describing him in purely positive light. No negative sentences. You have an amazing child, now let&#39;s hear about him.<br/>\n---------------<br/>\n<br/>\nWe don&#39;t know that the guy has an amazing child.  We don&#39;t know that he&#39;s wonderful.<br/>\nThe dad wanted to move into unschooling, from NOT unschooling.<br/>\n<br/>\n-=-It may seem like tea party fluff to some, but I would personally like to just encourage her to move forward. -=-<br/>\n<br/>\nShould we just put a big note at the front of this yahoogroup that says &quot;EVERYONE, just move forward.&quot;?<br/>\n<br/>\n-=-She also tells us that she now has the new skills to parent better, so therefor I don&#39;t need to give them to her.-=-<br/>\n<br/>\nI don&#39;t think she asked you to give her new skills.  She came to this discussion, which has a clearly stated purpose.  You can <br/>\n<br/>\n-=-We cannot change the past. Dwelling on it will not change anything, but it will surely cause her to feel worse about herself. -=-<br/>\n<br/>\nThese kinds of platitudes are not at all, in any way, not even a little bit, helpful in getting people to see what they ARE doing so they can decide what they might want to change.<br/>\n<br/>\nI prefer to address the discussion/group rather than individuals, but Deborah/sirens117, how long have you unschooled?  The stories you told of now-grown kids, were they unschooled?  Were they homeschooled?<br/>\n<br/>\nIf these comments or questions seem odd, please re-read (or read) this and the first three links from it:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysLearning\">http://groups.yahoo.com/group/AlwaysLearning</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":205946509,"authorName":"Deborah","from":"&quot;Deborah&quot; &lt;sirens117@...&gt;","profile":"sirens117","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Connection","postDate":"1330877837","msgId":66009,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpqMDRpZCtvZGo1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEREQkYxODY2LUI3MTQtNEQxOS05RjFFLTgzNEFBQjM5N0MxQUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":66008,"nextInTopic":66011,"prevInTime":66008,"nextInTime":66010,"topicId":65992,"numMessagesInTopic":0,"msgSnippet":"It may seem like tea party fluff to some, but I would personally like to just encourage her to move forward.  We cannot change the past.  Dwelling on it will","messageBody":"<div id=\"ygrps-yiv-1859986445\">It may seem like tea party fluff to some, but I would personally like to just encourage her to move forward.  We cannot change the past.  Dwelling on it will not change anything, but it will surely cause her to feel worse about herself.  I am sure that she already has enough regrets to last a life time.  If we live in the past we cannot move forward and her children don&#39;t need to have a mom who can&#39;t move forward.  <br/>\n<br/>\nI also know that she said she is treating the younger one better, but again, she knows that.  I don&#39;t need to point it out to her.  She also tells us that she now has the new skills to parent better, so therefor I don&#39;t need to give them to her.  She needs to put them to use with her older kids.  <br/>\n<br/>\nAnd, I do believe that she can ask her kids for forgiveness and move on and that things will be ok.  <br/>\n<br/>\nI wish her all the best and would love to encourage her in a positive way.  It is hard to make change in your life!  She is doing something a lot of people would never do and has publicly confessed something that most people would never say to others.  I think that deserves some acknowledgment.  <br/>\n<br/>\nDeborah <br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I liked most of Deborah&#39;s post, but this is not really helpful:<br/>\n&gt; <br/>\n&gt; -=-It will all work out for the best, don&#39;t be to hard on yourself. Forgive yourself and just move forward in parenting them they way you believe you should. We are all parents on a journey of learning and trying our best. -=-<br/>\n&gt; <br/>\n&gt; Sharing what one has actually experienced, what will help unschooling work, and what will help a parent move toward unschooling IS useful.<br/>\n&gt; <br/>\n&gt; General tea-party fluff can be more harmful than helpful.<br/>\n&gt; <br/>\n&gt; -=-With your kids being younger (then my adult kids)I would think that you need to talk to them to ensure that they are not feeling that you are treating the younger one &quot;better.&quot; Please now that I say that with no judgement at all. It is just that kids always internalize things, compare themselves, etc.-=-<br/>\n&gt; <br/>\n&gt; But the mom being addressed just came and told us that she IS treating her younger one better.  Not &quot;better.&quot;  Better.<br/>\n&gt; Talking <br/>\n&gt; to ensure<br/>\n&gt; they are not feeling<br/>\n&gt; you are treating the younger one better<br/>\n&gt; <br/>\n&gt; is FOUR LEVELS from treating the older ones better.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Connection","postDate":"1330874387","msgId":66008,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEREQkYxODY2LUI3MTQtNEQxOS05RjFFLTgzNEFBQjM5N0MxQUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGppdnFkYytqbXEwQGVHcm91cHMuY29tPg==","referencesHeader":"PGppdnFkYytqbXEwQGVHcm91cHMuY29tPg=="},"prevInTopic":66006,"nextInTopic":66009,"prevInTime":66007,"nextInTime":66009,"topicId":65992,"numMessagesInTopic":0,"msgSnippet":"I liked most of Deborah s post, but this is not really helpful: -=-It will all work out for the best, don t be to hard on yourself. Forgive yourself and just","messageBody":"<div id=\"ygrps-yiv-310579791\">I liked most of Deborah&#39;s post, but this is not really helpful:<br/>\n<br/>\n-=-It will all work out for the best, don&#39;t be to hard on yourself. Forgive yourself and just move forward in parenting them they way you believe you should. We are all parents on a journey of learning and trying our best. -=-<br/>\n<br/>\nSharing what one has actually experienced, what will help unschooling work, and what will help a parent move toward unschooling IS useful.<br/>\n<br/>\nGeneral tea-party fluff can be more harmful than helpful.<br/>\n<br/>\n-=-With your kids being younger (then my adult kids)I would think that you need to talk to them to ensure that they are not feeling that you are treating the younger one &quot;better.&quot; Please now that I say that with no judgement at all. It is just that kids always internalize things, compare themselves, etc.-=-<br/>\n<br/>\nBut the mom being addressed just came and told us that she IS treating her younger one better.  Not &quot;better.&quot;  Better.<br/>\nTalking <br/>\nto ensure<br/>\nthey are not feeling<br/>\nyou are treating the younger one better<br/>\n<br/>\nis FOUR LEVELS from treating the older ones better.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":205946509,"authorName":"Deborah","from":"&quot;Deborah&quot; &lt;sirens117@...&gt;","profile":"sirens117","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Connection","postDate":"1330867436","msgId":66006,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGppdnFkYytqbXEwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGppcjFnZytwdjhpQGVHcm91cHMuY29tPg=="},"prevInTopic":65996,"nextInTopic":66008,"prevInTime":66005,"nextInTime":66007,"topicId":65992,"numMessagesInTopic":0,"msgSnippet":"I have two adopted children.  One came to us as an older child.  The thing that I keep hearing from all Social Workers and courses that I have taken is to back","messageBody":"<div id=\"ygrps-yiv-2055678001\">I have two adopted children.  One came to us as an older child.  The thing that I keep hearing from all Social Workers and courses that I have taken is to back track.  Go ahead and do things that you would not normally do with a child of that age, if the child is ok with it.  If they want to do much younger activities, encourage it.  Let them sit on your knee while you rock them and read a book.  Curl up in bed or camp out on the floor and watch a movie.  If they don&#39;t want to be in your bed make a place on the floor or a snuggle corner for reading and hanging out.  Get them involved in all the cuddling, nurturing, play, etc that you do with the younger one.  I have found that the older your kids get, the more independent that they become, the more apt we are to leave them to do their own thing.  If they love playing video games, then join them or at least be present and showing an interest while they play.  <br/>\n<br/>\nI do think think that the kids need to hear how you feel (in kids terms of course).  They have lived it, so nothing you are going to say will surprise them.  They lived their lives and your parenting style and now they are witnessing the style you use with your younger one.  I also have two older kids, then two younger kids.  My older kids are young adults now and they see the difference in my parenting.  They are old enough to question me and say things like &quot;I never would have got away with that.&quot;  And they are right! But we spend time talking about it.  I also have the added dimension of one of my adoptive kids being older when they came to live with us and one being only a month old. With your kids being younger (then my adult kids)I would think that you need to talk to them to ensure that they are not feeling that you are treating the younger one &quot;better.&quot;  Please now that I say that with no judgement at all.  It is just that kids always internalize things, compare themselves, etc.  Siblings can fight and be upset with each other, or you, because one received a fuller glass of milk then the other.  :)  I know that of my younger two, the older when adopted one (now 13), finds it hard and has expressed at times how much more his brother likes to cuddle and just the difference in them because they were raised the first number of years with different parenting styles.  I have no idea what goes on in your home or how your kids are feeling about it, but I know that in my home and from my experiences, my biggest concern is that one feels more loved then the other.  I think that it is very important to express to them that just because you parented them differently when they were young does not mean that you loved them any less. They just really need to know that they are loved as much as their younger sibling.  <br/>\n<br/>\nI raised my older two similar to the way that you were raising your older two.  I just want to reassure you that I have a very close relationship with both my older boys.  They don&#39;t live at home anymore, but I see them every week, talk to them numerous times in a week.  They call home, they come home to visit, I watch my precious granddaughter, they call for advice, they love us, we love them.  We still go on family holidays with them and their significant others.  I can not imagine being any closer to they then we are. It will all work out for the best, don&#39;t be to hard on yourself.  Forgive yourself and just move forward in parenting them they way you believe you should.  We are all parents on a journey of learning and trying our best.  All of our kids will one day have a story of something that we did as parents that they did not like, as long as the good stories far out weight the bad, you are good!  :)<br/>\n<br/>\nBlessings, <br/>\nDeborah  <br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Christina&quot; &lt;daharryrc@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi,<br/>\n&gt; <br/>\n&gt; We are trucking along here.  Still reading, trying, waiting, watching.   :-)  I allowed myself to face-up to a truth I&#39;ve been avoiding; I do not feel as connected to my first two children as I do to our toddler.  My son Darius, 11 yo.  Daughter Izabella, 9 yo.  I parented them very traditionally as far as American thinking goes...  they slept in their own rooms, were bottle fed, let them cry it out as I felt necessary, I was the &quot;parent&quot;, not their friend.  Adversarial.  Authoritative.  Disciplinarian.  So, we have all these years of history this way.  They toddler was more AP.  Slept with me, nursed, I wore her just about most of the rest of the day, etc...  We are still very close.  She can come to my bed when she wants to.  She sleeps next to me for her nap.  I respond to her needs very differently.  I can&#39;t seem to translate this to my other two.  I need some help.  How do I &quot;fix&quot; this.  I have a harder time relating with my son because his personality at this point has some aspects that I really struggle with in any relationship, not just ours.  It&#39;s easier with Izabella, but certainly not the same as what me and Zoe have shared.  Ugh.  I hate this ,but I must believe it can be turned around.  Thanks for any thoughts.<br/>\n&gt; <br/>\n&gt; Christina.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Connection","postDate":"1330722965","msgId":65996,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGppcmRhbCsxcmE5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGppcjFnZytwdjhpQGVHcm91cHMuY29tPg=="},"prevInTopic":65995,"nextInTopic":66006,"prevInTime":65995,"nextInTime":65997,"topicId":65992,"numMessagesInTopic":0,"msgSnippet":"... ************* Love them up. Be extra thoughtful and generous of their wishes - go out of your way to give and do things with them and for them. Make them","messageBody":"<div id=\"ygrps-yiv-1668387577\">&quot;Christina&quot; &lt;daharryrc@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I do not feel as connected to my first two children as I do to our toddler.<br/>\n </span></blockquote>*************<br/>\n<br/>\nLove them up. Be extra thoughtful and generous of their wishes - go out of your way to give and do things with them and for them. Make them special treats. Offer to take them fun places. If they enjoy things you don&#39;t know much about, make a special effort to learn about those things. Work on being an especially kind and gracious friend to them. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Connection","postDate":"1330716588","msgId":65995,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUyRDY0NzlFLUFDREUtNEEzOS1BOTIxLTQ0N0I4OUI0MTgyMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGppcjFnZytwdjhpQGVHcm91cHMuY29tPg==","referencesHeader":"PGppcjFnZytwdjhpQGVHcm91cHMuY29tPg=="},"prevInTopic":65992,"nextInTopic":65996,"prevInTime":65994,"nextInTime":65996,"topicId":65992,"numMessagesInTopic":0,"msgSnippet":"-=I allowed myself to face-up to a truth I ve been avoiding; I do not feel as connected to my first two children as I do to our toddler. My son Darius, 11 yo.","messageBody":"<div id=\"ygrps-yiv-1763662968\">-=I allowed myself to face-up to a truth I&#39;ve been avoiding; I do not feel as connected to my first two children as I do to our toddler. My son Darius, 11 yo. Daughter Izabella, 9 yo. I parented them very traditionally as far as American thinking goes... they slept in their own rooms, were bottle fed, let them cry it out as I felt necessary, I was the &quot;parent&quot;, not their friend. Adversarial. Authoritative. Disciplinarian. So, we have all these years of history this way.-=-<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling\">http://sandradodd.com/deschooling</a><br/>\nIt will take them many months to recover from having felt helpless and controlled. <br/>\n<br/>\nIt will take you longer, as the mom, so be patient, but be diligent about not reverting to treating them badly.<br/>\n<br/>\nWhen something comes up with one of them, maybe casually mention you wish you had know when they were younger what you know now.<br/>\n<br/>\nDo things to make your life peaceful and joyful.  Plant surprises in your days--happy little gifts, whether it&#39;s a video you&#39;ve found or an interesting breakfast, some happy music, a trip out to lunch...<br/>\n<br/>\nHere&#39;s a list of ideas of things to do:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/strew/deblist\">http://sandradodd.com/strew/deblist</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":252464818,"authorName":"Christina","from":"&quot;Christina&quot; &lt;daharryrc@...&gt;","profile":"daharryrc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Connection","postDate":"1330710864","msgId":65992,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGppcjFnZytwdjhpQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":65995,"prevInTime":65991,"nextInTime":65993,"topicId":65992,"numMessagesInTopic":0,"msgSnippet":"Hi, We are trucking along here.  Still reading, trying, waiting, watching.   :-)  I allowed myself to face-up to a truth I ve been avoiding; I do not feel as","messageBody":"<div id=\"ygrps-yiv-1776875938\">Hi,<br/>\n<br/>\nWe are trucking along here.  Still reading, trying, waiting, watching.   :-)  I allowed myself to face-up to a truth I&#39;ve been avoiding; I do not feel as connected to my first two children as I do to our toddler.  My son Darius, 11 yo.  Daughter Izabella, 9 yo.  I parented them very traditionally as far as American thinking goes...  they slept in their own rooms, were bottle fed, let them cry it out as I felt necessary, I was the &quot;parent&quot;, not their friend.  Adversarial.  Authoritative.  Disciplinarian.  So, we have all these years of history this way.  They toddler was more AP.  Slept with me, nursed, I wore her just about most of the rest of the day, etc...  We are still very close.  She can come to my bed when she wants to.  She sleeps next to me for her nap.  I respond to her needs very differently.  I can&#39;t seem to translate this to my other two.  I need some help.  How do I &quot;fix&quot; this.  I have a harder time relating with my son because his personality at this point has some aspects that I really struggle with in any relationship, not just ours.  It&#39;s easier with Izabella, but certainly not the same as what me and Zoe have shared.  Ugh.  I hate this ,but I must believe it can be turned around.  Thanks for any thoughts.<br/>\n<br/>\nChristina.</div>","specialLinks":[]}],"prevTopicId":65901,"nextTopicId":66019}}