{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":16,"messages":[{"userId":90027250,"authorName":"Penne & Buddies","from":"&quot;Penne & Buddies&quot; &lt;crrbuddy@...&gt;","profile":"crrbuddy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Offenders List; Falsely accused segway into working with society: un-grads","postDate":"1114088255","msgId":105524,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ0ODd2ditiZmtkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDk5LjVjZDljZTJiLjJmOTg0ZjRkQGFvbC5jb20+"},"prevInTopic":105518,"nextInTopic":0,"prevInTime":105523,"nextInTime":105525,"topicId":105488,"numMessagesInTopic":0,"msgSnippet":"... harass him or ... him to have ... person a ... with the ones we ... Actually, sometimes there are falsely accused within our families. CPS trumped up some","messageBody":"<div id=\"ygrps-yiv-1762308621\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, tuckervill2@a... wrote:<br/>\n  <br/>\n<blockquote><span title=\"ireply\"> &gt; Right.  I&#39;d want to KNOW the guy.  To KNOW him by name.  Not  <br/>\n </span></blockquote>harass him or <br/>\n<blockquote><span title=\"ireply\"> &gt; threaten him.  Get to know him.  It&#39;s the best chance I  can give <br/>\n </span></blockquote>him to have <br/>\n<blockquote><span title=\"ireply\"> &gt; an honest shot at living in my neighborhood.  I don&#39;t  consider a <br/>\n </span></blockquote>person a <br/>\n<blockquote><span title=\"ireply\"> &gt; threat just because they&#39;ve been to prison.  I&#39;m more  concerned <br/>\n </span></blockquote>with the ones we <br/>\n<blockquote><span title=\"ireply\"> &gt; DON&#39;T know about.  Sometimes they&#39;re in our  families.<br/>\n&gt;  <br/>\n&gt; Karen<br/>\n&gt; <br/>\n </span></blockquote>-------------------------<br/>\n<br/>\nActually, sometimes there are falsely accused within our families.  <br/>\nCPS trumped up some charges of sexual molestation against the step-<br/>\ngrandfather of my (preschool age) grandniece after he offered to <br/>\nemergency babysit one day, and he spent nearly a year in jail before <br/>\nhe was exonerated of the charges for lack of evidence.  This man had <br/>\nalready raised four kids, one of his own and three of my brother&#39;s, <br/>\nincluding two daughters -- all now in their mid-late thirties.  If <br/>\nhe had been that kind of person, he would have had plenty of <br/>\nopportunity to play that dirty little game when they were growing <br/>\nup. Still, CPS had her mom and grandmother convinced by the time <br/>\nthey were finished unprofessionally interrogating this little girl <br/>\nuntil she finally agreed to their assessment of the situation.<br/>\n<br/>\nMy ex-SIL threatened to divorce him after 30+ years of marriage, his <br/>\nreputation was ruined, he lost his livelihood, and for what?  <br/>\nDespite it all, he hung in there and his family is actually back <br/>\ntogether for the most part (although another marriage of nearly 15 <br/>\nyears broke up after all the turmoil,) but the neighborly <br/>\nspeculation surely goes on and the scars will remain for a <br/>\nlifetime.  You can rest assured that he&#39;s not the first, nor will he <br/>\nbe the last innocent person to be burned at the stake (and I can <br/>\nimagine that includes more than a few Catholic priests, &quot;recovered <br/>\nmemories&quot; and all) by a so-called child-protective system.  <br/>\n<br/>\nOur list has &quot;predator&quot; in red, but doesn&#39;t explain the <br/>\ndesignation.  I looked it up yesterday and promptly forgot the exact <br/>\ndefinition, but I think it was for those who prey on minors and are <br/>\nbelieved to be &quot;at risk&quot; for repeat offense.  As for leaving my <br/>\nbabies at the bus stop or sending them off to walk down a busy <br/>\nstreet to school or the park all alone -- you&#39;ve got to be kidding.  <br/>\nPeople seem to be living in some kind of dream world if they don&#39;t <br/>\nsee problems with that.  How many times do you think Jessica walked <br/>\npast her killer&#39;s abode headed to and from school, where he also <br/>\nhappened to be employed?  <br/>\n<br/>\nThis guy didn&#39;t have to take a chance by walking in her house and <br/>\nstealing her away in the middle of the night (must have been pretty <br/>\nhigh that time) -- he had every opportunity to snatch her without <br/>\nanyone ever being the wiser.  They may never have found her if he <br/>\nhad just gone back to his registered place of residence and played <br/>\ninnocent.  The family had never even seen him hanging around or knew <br/>\nhis sister was one of their neighbors, according to the news. <br/>\n<br/>\nPeople tell their kids never to swim without a capable and skilled <br/>\nbuddy, but encourage them to navigate the waters of society on their <br/>\nown from the earliest ages.  I was glad to hear that Keith gave <br/>\nKirby some straight talk about the pizza delivery, although I really <br/>\nthought the odds of being robbed weren&#39;t really that high (guess it <br/>\ndepends on the area.)  <br/>\n<br/>\nNike was considering the postal service (very short-handed here) and <br/>\nthere are an awful lot of social security checks being delivered in <br/>\nour retirement community, but I was more concerned about dogs (she <br/>\nwasn&#39;t) myself :oP Now the thought of being in close contact with <br/>\nsexual offenders and crackheads is crossing my mind as well.  She&#39;s <br/>\nnot any more keen on college than Kirby after a life of learning in <br/>\nfreedom, so they are both at a crossroad in their lives.  <br/>\n<br/>\nNike applied at a few stores to earn some money for her trip to <br/>\nToronto, but nobody ever called back.  The information she provided <br/>\nwas pretty generic.  Does Kirby really have to take the GED to get a <br/>\n_bona fide_ job after all those years of working in the gaming <br/>\nfield?  I thought that stating their homeschool grad status <br/>\nadequately filled in the blank, but maybe I&#39;m wrong.</div>","specialLinks":[]},{"userId":163750020,"authorName":"tuckervill2@aol.com","from":"tuckervill2@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Offenders List?","postDate":"1114084450","msgId":105518,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5Yy4zMWQ1ZTIyYi4yZjk4ZWU2MkBhb2wuY29tPg=="},"prevInTopic":105517,"nextInTopic":105524,"prevInTime":105517,"nextInTime":105519,"topicId":105488,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/20/2005 11:40:37 P.M. Central Standard Time, pamsoroosh@earthlink.net writes: don t  know the answer - people who molest kids are","messageBody":"<div id=\"ygrps-yiv-1093883354\">In a message dated 4/20/2005 11:40:37 P.M. Central Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a> writes:<br/>\n<br/>\ndon&#39;t  know the answer - people who molest kids are sometimes super <br/>\npersonable,  very trust-inspiring. Given that, I&#39;m not sure what <br/>\n&quot;getting to know him&quot;  would tell you.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n~~~<br/>\nIt&#39;s really not about me knowing him, but about him knowing me.   Sandra <br/>\nmentioned the secrecy that surrounds molestation in families.   That&#39;s why it can <br/>\ngo on.  Secrecy is a key element in almost any  crime.  If my friend is <br/>\ngossiping about me behind my back, I&#39;m going to let  them know I know about it, <br/>\nwhich removes their cover of secrecy, and is the best  way to prevent further <br/>\ngossip.<br/>\n <br/>\nIf a sexual predator moves into my neighborhood, I&#39;m going to let them know  <br/>\nthat I know about them, and remove their cover of secrecy, especially if it  <br/>\ncould possibly involve my own kids. I did say that I  &quot;might&quot; ask him about why <br/>\nhe&#39;s on the registry (could be a woman,  I know).  But likely not.  He&#39;s <br/>\nprobably suspicious about folks  already, just from having to be registered.  If <br/>\nhe&#39;s not remorseful, he  might be playing an angle with me so he can strike <br/>\nagain.  Interaction  would be limited to the conversation we had.  I wouldn&#39;t <br/>\nforce it out of  him.  I&#39;d be neighborly.  Meeting a neighbor across the street <br/>\nis  innocent enough, the same way I know the wife-beater who actually does live <br/>\n across from me.  I know he hits his wife when he&#39;s drunk, because she told  <br/>\nme he does.  I see the police there.  If I can do something to remove  his <br/>\ncover of secrecy, and help my family or someone else (her), I will.  So  far, I <br/>\nhaven&#39;t had the opportunity.  He knows me from when I offered  jalapenos out of <br/>\nmy garden.  Nicest guy in the world.  If he got drunk  and tried to hit *me* <br/>\nwhen I brought over the extra cucumbers, well, isn&#39;t it  better that I already <br/>\n*know* he&#39;s a wife-beater?<br/>\n <br/>\nI do happen to be the kind of person that is aware of people in the  <br/>\nneighborhood and who lives where and what their dog&#39;s name is, etc.  I&#39;m  that way for <br/>\ntwo reasons.  A) I&#39;m naturally curious about my environment,  and B) I&#39;m <br/>\nnaturally helpful, which means I will pick up the neighbor&#39;s trash  can when it <br/>\nblows into the street because I know that she&#39;s been out of town for  a few <br/>\ndays, even though she didn&#39;t tell me.  When I said I would drive by a  registered <br/>\nsex offender&#39;s house, I didn&#39;t mean I&#39;d go out of my way to do  it.  I&#39;d drive <br/>\nby if it was convenient, the same way I would if there were  a particular <br/>\nhouse I like to look at, or street I prefer to drive on because  it&#39;s beautiful, <br/>\nor safer or quicker.  <br/>\n <br/>\nBack to the subject, I don&#39;t know about the first-time molesters or the  ones <br/>\nwho haven&#39;t been caught.  But again, they&#39;re more likely to be someone  the <br/>\nvictim knows already  I can lift the veil of secrecy with the ones I  know <br/>\nabout.  And they should know that I know.  At least assume that  *some* of their <br/>\nneighbors are checking such things.  What else is the  registry for?<br/>\n <br/>\nKaren<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":9543528,"authorName":"Dana Matt","from":"Dana Matt &lt;hoffmanwilson@...&gt;","profile":"hoffmanwilson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Offenders List?","postDate":"1114057551","msgId":105516,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwNDIxMDQyNTUyLjM0NTYzLnFtYWlsQHdlYjQwNDI0Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"NjY2Nw=="},"prevInTopic":105515,"nextInTopic":105517,"prevInTime":105515,"nextInTime":105517,"topicId":105488,"numMessagesInTopic":0,"msgSnippet":"... I looked up mine today, by googling my county name, sex offender list.  It came up with the county s site, and you had to agree NOT to act out against the","messageBody":"<div id=\"ygrps-yiv-930978295\"><blockquote><span title=\"ireply\">&gt; Even if every neighbor goes and asks a guy what he<br/>\n&gt; did, he might not be  <br/>\n&gt; honest, or it might have been a one-shot deal<br/>\n&gt; (statuatory rape is still a crime  <br/>\n&gt; even if the younger person lies like a sonofabitch<br/>\n&gt; about her or his age).  <br/>\n<br/>\n </span></blockquote>I looked up mine today, by googling my county name,<br/>\nsex offender list.  It came up with the county&#39;s site,<br/>\nand you had to agree NOT to act out against the people<br/>\nbefore they would give you information--but I was<br/>\nAMAZED at just how much information they did give. <br/>\nAges and descriptions of the sex acts, and who he was<br/>\nmost likely to be a threat to by sex and age. <br/>\nApparently there are two living together around the<br/>\ncorner from us, who will rape anyone from birth to 14<br/>\n(according to the website), and &quot;are not participating<br/>\nin treatment programs&quot;....<br/>\n<br/>\nBut I was heartened--we just moved from Montana, and I<br/>\nlooked it up there to find page after page after<br/>\npage....literally hundreds of &quot;sex offenders&quot;--I think<br/>\nthey put in the peeing in the park ones, and the 18<br/>\nyos with 17 yo girlfriends, but they didn&#39;t explain<br/>\nthat.  This list was only about 20 names long, but<br/>\nwere actually people that the county thought might<br/>\noffend again.<br/>\n<br/>\nDana<br/>\n<br/>\nGuadalupe&#39;s Coffee Roaster<br/>\n100% Organic Fair Trade Coffee<br/>\nRoasted to Perfection Daily<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.guadalupescoffee.com\">http://www.guadalupescoffee.com</a><br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a></div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Offenders List?","postDate":"1114055515","msgId":105517,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDViYjZkODM4ZmU3MWI3NzgzOTM2MTcxNDU2ODg3MmM2QGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDg2LjI2ODk4YTFjLjJmOTg0ZmMwQGFvbC5jb20+","referencesHeader":"PDg2LjI2ODk4YTFjLjJmOTg0ZmMwQGFvbC5jb20+"},"prevInTopic":105516,"nextInTopic":105518,"prevInTime":105516,"nextInTime":105518,"topicId":105488,"numMessagesInTopic":0,"msgSnippet":"... Sorry - I only know for sure about California. I do know that absolutely for certain - you can get that information by calling the state hotline - before","messageBody":"<div id=\"ygrps-yiv-1477724104\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; It  is  absolutely illegal to USE the information you get off the<br/>\n&gt; registered sex  offenders list to take ANY kind of action like making<br/>\n&gt; contact with the  person based on it or hassling them in ANY way - if<br/>\n&gt; you used that list to  get an address and went to their door and  asked<br/>\n&gt; them about it, you&#39;d be  breaking the  law.<br/>\n&gt; ~~~<br/>\n&gt;<br/>\n&gt; I don&#39;t know if you can actually proclaim that as truth for every <br/>\n&gt; state in<br/>\n&gt; the union.  I&#39;m not going to look up Arkansas now, but I will next <br/>\n&gt; week,<br/>\n&gt; probably.<br/>\n&gt;<br/>\n&gt; Karen<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Sorry - I only know for sure about California. I do know that <br/>\nabsolutely for certain - you can get that information by calling the <br/>\nstate hotline - before you can pay your $10 to have them look somebody <br/>\nup to see if they&#39;re on the list, they make you listen to all the <br/>\nconditions that basically say, &quot;Once you have this information, if you <br/>\ntake any action of any kind based on it, you&#39;re breaking the law.&quot;<br/>\n<br/>\nI don&#39;t know the answer - people who molest kids are sometimes super <br/>\npersonable, very trust-inspiring. Given that, I&#39;m not sure what <br/>\n&quot;getting to know him&quot; would tell you.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":163750020,"authorName":"tuckervill2@aol.com","from":"tuckervill2@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Offenders List?","postDate":"1114043840","msgId":105515,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg2LjI2ODk4YTFjLjJmOTg0ZmMwQGFvbC5jb20+"},"prevInTopic":105514,"nextInTopic":105516,"prevInTime":105514,"nextInTime":105516,"topicId":105488,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/20/2005 1:33:58 P.M. Central Standard Time, SandraDodd@aol.com writes: It  is  absolutely illegal to USE the information you get off the ","messageBody":"<div id=\"ygrps-yiv-1465694350\">In a message dated 4/20/2005 1:33:58 P.M. Central Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\nIt  is  absolutely illegal to USE the information you get off the  <br/>\nregistered sex  offenders list to take ANY kind of action like making  <br/>\ncontact with the  person based on it or hassling them in ANY way - if  <br/>\nyou used that list to  get an address and went to their door and  asked <br/>\nthem about it, you&#39;d be  breaking the  law.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n~~~<br/>\n <br/>\nI don&#39;t know if you can actually proclaim that as truth for every state in  <br/>\nthe union.  I&#39;m not going to look up Arkansas now, but I will next week,  <br/>\nprobably.<br/>\n <br/>\nKaren<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":163750020,"authorName":"tuckervill2@aol.com","from":"tuckervill2@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Offenders List?","postDate":"1114043725","msgId":105514,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk5LjVjZDljZTJiLjJmOTg0ZjRkQGFvbC5jb20+"},"prevInTopic":105511,"nextInTopic":105515,"prevInTime":105513,"nextInTime":105515,"topicId":105488,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/20/2005 1:21:06 P.M. Central Standard Time, SandraDodd@aol.com writes: Even if  every neighbor goes and asks a guy what he did, he might","messageBody":"<div id=\"ygrps-yiv-2127716262\">In a message dated 4/20/2005 1:21:06 P.M. Central Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\nEven if  every neighbor goes and asks a guy what he did, he might not be   <br/>\nhonest, or it might have been a one-shot deal (statuatory rape is still a  <br/>\ncrime  <br/>\neven if the younger person lies like a sonofabitch about her  or his age).  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n~~~<br/>\n <br/>\nRight.  I&#39;d want to KNOW the guy.  To KNOW him by name.  Not  harass him or <br/>\nthreaten him.  Get to know him.  It&#39;s the best chance I  can give him to have <br/>\nan honest shot at living in my neighborhood.  I don&#39;t  consider a person a <br/>\nthreat just because they&#39;ve been to prison.  I&#39;m more  concerned with the ones we <br/>\nDON&#39;T know about.  Sometimes they&#39;re in our  families.<br/>\n <br/>\nKaren<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Offenders List?","postDate":"1114025014","msgId":105510,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDNzEzRjU5NDk2QTY1QS1DQTgtMkE3MDhAbWJsay1yMTYuc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PEJFOEMwQkNELjQ2Q0Elc2FuZHJld21hbWFAbWNoc2kuY29tPg=="},"prevInTopic":105505,"nextInTopic":105511,"prevInTime":105508,"nextInTime":105511,"topicId":105488,"numMessagesInTopic":0,"msgSnippet":"This is also true in Iowa. Chris on 4/20/05 1:30 PM, SandraDodd@aol.com at SandraDodd@aol.com wrote: It is  absolutely illegal to USE the information you get","messageBody":"<div id=\"ygrps-yiv-69580220\">This is also true in Iowa.<br/>\n<br/>\nChris<br/>\n<br/>\non 4/20/05 1:30 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<br/>\nIt is  absolutely illegal to USE the information you get off the<br/>\nregistered sex  offenders list to take ANY kind of action like making<br/>\ncontact with the  person based on it or hassling them in ANY way - if<br/>\nyou used that list to  get an address and went to their door and asked<br/>\nthem about it, you&#39;d be  breaking the law.<br/>\n<br/>\n-=-=-==-=-<br/>\n<br/>\nNOT federal.<br/>\n<br/>\nThere was a story on NPR last week or so about a neighborhood that <br/>\ncollectively bought the house of a guy who was recently released from <br/>\nprison for sex crimes. It must have been a rather exclusive <br/>\nneighborhood. They raised several hundred thousand dollars to buy the <br/>\nhouse as well as an extra $5000 to help the guy move away from their <br/>\nneighborhood.<br/>\n<br/>\nThe concern was that this guy would simply find another neighborhood <br/>\nwhere the residents couldn&#39;t afford such a plan.<br/>\n<br/>\n~Kelly</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Offenders List?","postDate":"1114021859","msgId":105505,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdmLjVjODc5YjBhLjJmOTdmOWUzQGFvbC5jb20+"},"prevInTopic":105504,"nextInTopic":105510,"prevInTime":105504,"nextInTime":105508,"topicId":105488,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/20/2005 12:26:49 PM Mountain Daylight Time, pamsoroosh@earthlink.net writes: It is  absolutely illegal to USE the information you get off","messageBody":"<div id=\"ygrps-yiv-390975032\">In a message dated 4/20/2005 12:26:49 PM Mountain Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a> writes:<br/>\n<br/>\nIt is  absolutely illegal to USE the information you get off the <br/>\nregistered sex  offenders list to take ANY kind of action like making <br/>\ncontact with the  person based on it or hassling them in ANY way - if <br/>\nyou used that list to  get an address and went to their door and asked <br/>\nthem about it, you&#39;d be  breaking the law.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n----------------<br/>\n <br/>\nGood.<br/>\n <br/>\nThere have been a couple of really awful incidents in New Mexico where  <br/>\nneighbors band together to run a guy off.  They&#39;ve tormented some people  here.  <br/>\nThat&#39;s not how the justice system is intended to work.  And I  don&#39;t guess it <br/>\neven occurs to them that other neighbors might have served time  for violent <br/>\ncrimes or theft, and they&#39;re not freaking out about that.<br/>\n <br/>\nAs to illegality or rights, it probably isn&#39;t a federal law, is it?   State <br/>\nby state? Mabye not even statewide everywhere?<br/>\n <br/>\nSandra<br/>\n <br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Offenders List?","postDate":"1114021660","msgId":105504,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGE5Yjc0ZDE0NDNkMWViOGU4NjQ3ZGNkYjNlMGUwODQ2QGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDFhMi4zMWZkNDQ1Ny4yZjk3ZjNkY0Bhb2wuY29tPg==","referencesHeader":"PDFhMi4zMWZkNDQ1Ny4yZjk3ZjNkY0Bhb2wuY29tPg=="},"prevInTopic":105502,"nextInTopic":105505,"prevInTime":105503,"nextInTime":105505,"topicId":105488,"numMessagesInTopic":0,"msgSnippet":"... I looked at our list and saw the father of a girl who had been in the Girl Scout troop I was leader of - he d been along on some of our outings, driving","messageBody":"<div id=\"ygrps-yiv-1087379707\">On Apr 20, 2005, at 11:05 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  Much of rape happens in  homes of people the girl knows, either  by <br/>\n&gt; her relatives or a boyfriend&#39;s<br/>\n&gt; relatives or a female friend&#39;s  relatives.<br/>\n<br/>\n </span></blockquote>I looked at our list and saw the father of a girl who had been in the <br/>\nGirl Scout troop I was leader of - he&#39;d been along on some of our <br/>\noutings, driving girls in his car, etc. He had sole custody of his <br/>\ndaughter. That&#39;s all I know and I have no contact with them, anymore. <br/>\nBut - it seems worth having a quick look, to me, to see if there is <br/>\nsomeone IN your life right now, someone who might sometimes be in your <br/>\nhome or your campsite or whatever, on the list.<br/>\n<br/>\nOtherwise, yeah, there is no point to feeling more safe or less safe <br/>\nbecause you know where some registered sex offenders say they live.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Offenders List?","postDate":"1114021040","msgId":105502,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM1MjFjNjI1ZDgwYjFjNjJjOGUzNDIwNTVkNTRmZjQ0QGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDFlOS4zYTVmODE1Ni4yZjk3ZjJjZUBhb2wuY29tPg==","referencesHeader":"PDFlOS4zYTVmODE1Ni4yZjk3ZjJjZUBhb2wuY29tPg=="},"prevInTopic":105501,"nextInTopic":105504,"prevInTime":105501,"nextInTime":105503,"topicId":105488,"numMessagesInTopic":0,"msgSnippet":"The registered sex offenders information in my state indicates the crime - if it is statutory rape, for example, or lewd acts with a child under 14, or rape,","messageBody":"<div id=\"ygrps-yiv-1712524496\">The registered sex offenders information in my state indicates the <br/>\ncrime - if it is statutory rape, for example, or lewd acts with a child <br/>\nunder 14, or rape, or whatever.<br/>\n<br/>\nIt is absolutely illegal to USE the information you get off the <br/>\nregistered sex offenders list to take ANY kind of action like making <br/>\ncontact with the person based on it or hassling them in ANY way - if <br/>\nyou used that list to get an address and went to their door and asked <br/>\nthem about it, you&#39;d be breaking the law.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Apr 20, 2005, at 11:00 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<br/>\n&gt; Even if every neighbor goes and asks a guy what he did, he might not be<br/>\n&gt; honest, or it might have been a one-shot deal (statuatory rape is <br/>\n&gt; still a crime<br/>\n&gt; even if the younger person lies like a sonofabitch about her or his <br/>\n&gt; age). </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Offenders List?","postDate":"1114020316","msgId":105501,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhMi4zMWZkNDQ1Ny4yZjk3ZjNkY0Bhb2wuY29tPg=="},"prevInTopic":105500,"nextInTopic":105502,"prevInTime":105500,"nextInTime":105502,"topicId":105488,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/20/2005 10:16:11 AM Mountain Daylight Time, crrbuddy@yahoo.com writes: -=-Anyway, see if your registry doesn t turn up on Google.  It s  a","messageBody":"<div id=\"ygrps-yiv-1605670643\">In a message dated 4/20/2005 10:16:11 AM Mountain Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:crrbuddy@...\">crrbuddy@...</a> writes:<br/>\n<br/>\n<br/>\n-=-Anyway, see if your registry doesn&#39;t turn up on Google.  It&#39;s  a bit <br/>\neery to look through all those names and faces and know they&#39;re  <br/>\nhanging out around town while our kids are running errands and  <br/>\nsuch.-=-<br/>\n <br/>\nSometimes when I&#39;m driving my car around town, I think of what the other  <br/>\ndrivers might be thinking, or knowing.  Some are grieving a recent or  impending <br/>\ndeath, and that&#39; can&#39;t be good for their concentration.    Some just became <br/>\nengaged or just got a great job, and I don&#39;t worry about  their driving as much. <br/>\n And then I think that some have been hit and run  drivers, never caught.  <br/>\nSome have murdered someone and not been  caught.<br/>\n <br/>\nEvery now-registered sex offender was once an unregistered innocent guy  who <br/>\nhadn&#39;t commited a crime.  To only worry about registered,  <br/>\npunished-and-released guys is to pretend they&#39;re not making &#39;em like that  anymore.  It&#39;s a way <br/>\nto make the world seem magically safer.  It  doesn&#39;t.  Much of rape happens in <br/>\nhomes of people the girl knows, either  by her relatives or a boyfriend&#39;s <br/>\nrelatives or a female friend&#39;s  relatives.  Stranger-snatching-crazy-movie rapes <br/>\nare not the norm.<br/>\n <br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Offenders List?","postDate":"1114020046","msgId":105500,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlOS4zYTVmODE1Ni4yZjk3ZjJjZUBhb2wuY29tPg=="},"prevInTopic":105490,"nextInTopic":105501,"prevInTime":105499,"nextInTime":105501,"topicId":105488,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/20/2005 9:40:35 AM Mountain Daylight Time, b229d655@cs.com writes: Does  anyone know of an internet site that helps you search your area","messageBody":"<div id=\"ygrps-yiv-1401673997\">In a message dated 4/20/2005 9:40:35 AM Mountain Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:b229d655@...\">b229d655@...</a> writes:<br/>\n<br/>\nDoes  anyone know of an internet site that helps you search your area for  <br/>\nconvicts?<br/>\n<br/>\n<br/>\n===========================<br/>\n <br/>\nGenerally the term &#39;convict&#39; is only used during the term of  imprisonment.<br/>\nIf someone is convicted to ten years in jail and serves that time, I object  <br/>\non principle to his being called &quot;a convict&quot; forever thereafter.<br/>\n <br/>\nOur neighborhoods might be filled with once-convicted car thieves and  <br/>\nburglars and mail-box-pilferers, but do we bar the doors and no longer use  <br/>\nmailboxes and...   <br/>\n <br/>\nI know there are problems with repeat offenses, but that&#39;s not limited to  <br/>\nsex offenders.  I think it&#39;s pretty horrible, the way Americans in general  are <br/>\ntreating one class of past-punishment criminals.  No one before was  convicted <br/>\nto being a parriah for life, having to register and maybe be subjected  to <br/>\npersonal interviews with neighbors and other unreasonable life-long  punishment.<br/>\n <br/>\nEven if every neighbor goes and asks a guy what he did, he might not be  <br/>\nhonest, or it might have been a one-shot deal (statuatory rape is still a crime  <br/>\neven if the younger person lies like a sonofabitch about her or his age).  <br/>\n <br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":172750465,"authorName":"b229d655@cs.com","from":"b229d655@...","profile":"robeyboyz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Offenders List?","postDate":"1114014805","msgId":105490,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFmMi44MjU2MGVhLjJmOTdkZTU1QGNzLmNvbT4="},"prevInTopic":105489,"nextInTopic":105500,"prevInTime":105489,"nextInTime":105491,"topicId":105488,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/20/2005 12:19:21 PM Eastern Standard Time, ... Thanks for the info.  Here in VA there are criminal records checks done for employees in","messageBody":"<div id=\"ygrps-yiv-324116254\">In a message dated 4/20/2005 12:19:21 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:crrbuddy@...\">crrbuddy@...</a> writes: <br/>\n<blockquote><span title=\"ireply\"> &gt; I had heard that <br/>\n&gt; Florida had no policy on screening its teachers or school workers <br/>\n&gt; years and years ago.  Looks like they still have no qualms about <br/>\n&gt; who&#39;s supervising the children in the system.  <br/>\n<br/>\n<br/>\n </span></blockquote>Thanks for the info.  Here in VA there are criminal records checks done for <br/>\nemployees in daycares, preschools, schools but they DO NOT contain any info. on <br/>\nchild related incidences.<br/>\n<br/>\nI had worked at a preschool many years ago when a complaint had come up about <br/>\na co-worker and a whole lot of stink came up about her history of neglect and <br/>\nabuse and that it was not in her criminal records check.<br/>\n<br/>\nYou&#39;d think that if one is trying to work with children in any field that <br/>\nthat would be the first thing available upon hiring.  Strange.<br/>\n<br/>\nPamela<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":90027250,"authorName":"Penne & Buddies","from":"&quot;Penne & Buddies&quot; &lt;crrbuddy@...&gt;","profile":"crrbuddy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Offenders List?","postDate":"1114013165","msgId":105489,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ0NXVsZCtwcHNpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDk3LjVkZDliZjFjLjJmOTdjZjI3QGNzLmNvbT4="},"prevInTopic":105488,"nextInTopic":105490,"prevInTime":105488,"nextInTime":105490,"topicId":105488,"numMessagesInTopic":0,"msgSnippet":"You can Google for your state s sex offender registry, but be forewarned -- the guy who got Jessica down the road from our town was visiting his sister at","messageBody":"<div id=\"ygrps-yiv-634523100\">You can Google for your state&#39;s sex offender registry, but be <br/>\nforewarned -- the guy who got Jessica down the road from our town <br/>\nwas &quot;visiting&quot; his sister at the mobile home park.  He also worked <br/>\nat the elementary school for a while, as I understand it, but the <br/>\nmedia played that one down for some reason.  I had heard that <br/>\nFlorida had no policy on screening its teachers or school workers <br/>\nyears and years ago.  Looks like they still have no qualms about <br/>\nwho&#39;s supervising the children in the system.  <br/>\n<br/>\nThe other guy had dated the teen&#39;s mom, but he could&#39;ve met up with <br/>\nher anywhere.  The predators are out and about, whether they are on <br/>\nour street or the next one over.  We roamed the neighborhood when we <br/>\nwere kids, but most of the moms were still home in the sixties and <br/>\neveryone knew everyone else.  Someone&#39;s preteen knocked on my door <br/>\nthe other day, dressed in full camo-gun, grenade, and all, and <br/>\nintroduced himself as the new kid on the block (heard we were a <br/>\nhomeschooling family and came to find out if we were &quot;normal.&quot;)  <br/>\n<br/>\nThis was just after the Jessica mystery was solved and I wondered <br/>\nhow his parents could feel comfortable sending him off into <br/>\nstrangers homes without coming to meet us first.  Ours wasn&#39;t the <br/>\nfirst and I doubt it will be the last.  I&#39;m sure my reputation as a <br/>\nmom of eight kids preceded me, but still -- they don&#39;t know us from <br/>\nAdam or Eve.  I wouldn&#39;t send my kids over to make a cold call, but <br/>\nmaybe I&#39;m just old-fashioned.  <br/>\n<br/>\nAnyway, see if your registry doesn&#39;t turn up on Google.  It&#39;s a bit <br/>\neery to look through all those names and faces and know they&#39;re <br/>\nhanging out around town while our kids are running errands and <br/>\nsuch.  Hopefully, they&#39;ve got enough common sense and know-how to <br/>\nkeep themselves safe by now (at least as is humanly possible.)  I <br/>\nhave a few adult friends and family who have landed themselves in <br/>\nsome terrible spots, but I can&#39;t live in fear (or keep up with all <br/>\nthe transient felons riding into town) and don&#39;t want my kids to <br/>\nlive that way, either.  <br/>\n<br/>\nVayan con Dios ~<br/>\nPenne<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, b229d655@c... wrote:<br/>\n&gt; Does anyone know of an internet site that helps you search your <br/>\narea for <br/>\n&gt; convicts?<br/>\n&gt; <br/>\n&gt; Once, many years ago, our local paper made a huge list for our <br/>\nsurrounding <br/>\n&gt; areas and at that time we had one on our street for several <br/>\nthings:  rape, sex <br/>\n&gt; with a minor under 14, abuse.  I am curious if he is still listed <br/>\nhere.<br/>\n&gt; <br/>\n&gt; It never occured to me to look on the internet.  But now that my <br/>\nkids are <br/>\n&gt; getting older and may soon want to be getting out on their own, I <br/>\nam curious.<br/>\n&gt; <br/>\n&gt; Pamela  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":213764600,"authorName":"Ahna","from":"&quot;Ahna&quot; &lt;bish0018@...&gt;","profile":"abishopjara","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Offenders List?","postDate":"1114011907","msgId":105511,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ0NXRlMys2MzlrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDk3LjVkZDliZjFjLjJmOTdjZjI3QGNzLmNvbT4="},"prevInTopic":105510,"nextInTopic":105514,"prevInTime":105510,"nextInTime":105512,"topicId":105488,"numMessagesInTopic":0,"msgSnippet":"... I just found this site:  http://www.usatrace.com/sex.html and it lists a site for every state. ahna","messageBody":"<div id=\"ygrps-yiv-2015172308\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, b229d655@c... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Does anyone know of an internet site that helps you search your area for <br/>\n&gt; convicts?<br/>\n<br/>\n </span></blockquote>I just found this site:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.usatrace.com/sex.html\">http://www.usatrace.com/sex.html</a><br/>\nand it lists a site for every state.<br/>\nahna</div>","specialLinks":[]},{"userId":172750465,"authorName":"b229d655@cs.com","from":"b229d655@...","profile":"robeyboyz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Offenders List?","postDate":"1114010919","msgId":105488,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk3LjVkZDliZjFjLjJmOTdjZjI3QGNzLmNvbT4="},"prevInTopic":0,"nextInTopic":105489,"prevInTime":105487,"nextInTime":105489,"topicId":105488,"numMessagesInTopic":0,"msgSnippet":"Does anyone know of an internet site that helps you search your area for convicts? Once, many years ago, our local paper made a huge list for our surrounding ","messageBody":"<div id=\"ygrps-yiv-326379494\">Does anyone know of an internet site that helps you search your area for <br/>\nconvicts?<br/>\n<br/>\nOnce, many years ago, our local paper made a huge list for our surrounding <br/>\nareas and at that time we had one on our street for several things:  rape, sex <br/>\nwith a minor under 14, abuse.  I am curious if he is still listed here.<br/>\n<br/>\nIt never occured to me to look on the internet.  But now that my kids are <br/>\ngetting older and may soon want to be getting out on their own, I am curious.<br/>\n<br/>\nPamela  <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":105402,"nextTopicId":105533}}