{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"John O. Andersen","from":"&quot;John O. Andersen&quot; &lt;andersen@...","replyTo":"LIST","senderId":"ZVq44ERWQ5uXFxCow1bh82XRLtx7qsbpg5htuVDCQtKDsvSmQbMimzSzVNUmrE-4kvyRK8DLDfb88OyWpwBEMgusP0j-lcdo5zHuSJZKJd5YnA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Ah the beauties of the American health care system...","postDate":"941461481","msgId":4141,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4yNzcuNDE0MS45NTkyNjk3NDNAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":4140,"nextInTime":4142,"topicId":4141,"numMessagesInTopic":0,"msgSnippet":"Just a few weeks ago, a bright young 18 year old girl from our community suffered a severe spinal injury which is expected to leave her permanently paralyzed","messageBody":"<div id=\"ygrps-yiv-187738111\">Just a few weeks ago, a bright young 18 year old girl from our community<br/>\nsuffered a severe spinal injury which is expected to leave her permanently<br/>\nparalyzed from the waist down.<br/>\n<br/>\nThis accident occurred while she was away at a college where she had entered<br/>\nas a freshman just last August.  Luckily, she had been wise enough to<br/>\npurchase the medical insurance policy available to students through the<br/>\ncollege.<br/>\n<br/>\nSadly, she has already almost maxed out her benefits.  She will need<br/>\ncontinuing treatment for many months and years to come.  In addition, her<br/>\nparents and younger brother must now move out of the house they were renting<br/>\ninto another house which will be more suitable for their handicapped<br/>\ndaughter.  The new house will need to be fitted with a variety of items just<br/>\nto allow this daughter to function on a daily basis.  Such adaptations will<br/>\neasily add up to tens of thousands of dollars of additional expense.<br/>\n<br/>\nFriends of the family have already started an effort to raise funds to help<br/>\nthis family meet these anticipated gigantic financial obligations.<br/>\n<br/>\nThis is just another example of how getting sick or injured in the United<br/>\nStates can not only devastate your health, but your finances as well.  Hey,<br/>\nI won&#39;t argue that it&#39;s a great country to live in as long as you&#39;re young,<br/>\nhealthy, and have adequate coverage.  It&#39;s just when one or more of those<br/>\nfactors changes that things can get precarious.  Some time ago, I learned<br/>\nthat the<br/>\nUnited States and South Africa are the only two major industrialized<br/>\ncountries<br/>\nwhich don&#39;t provide universal medical coverage for all of their citizens.<br/>\n<br/>\nI understand that around the turn of this century, fire protection in this<br/>\ncountry was available only to those who purchased it through private<br/>\ninsurance.  Along came some people who started saying that it would be in<br/>\nthe best interest of the community for fire protection to be universal.  No<br/>\ndoubt, those vested in the existing system opposed this proposed change.<br/>\nPerhaps they argued that public fire departments were socialist, and ran<br/>\nagainst the<br/>\ngrain of so-called American &quot;rugged individualism.&quot;<br/>\n<br/>\nBut those proposing public fire departments prevailed.  Today, few if anyone<br/>\nquestions the value of and need for public fire departments.  In fact, many<br/>\nself-styled &quot;rugged individualists&quot; would even agree that fire protection is<br/>\none<br/>\nof those things which promotes a feeling of security and well-being in a<br/>\ncommunity.<br/>\n<br/>\nJohn Andersen<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://members.xoom.com/joandersen\">http://members.xoom.com/joandersen</a><br/>\n<br/>\n<br/>\nP.S.  This reminds me of a poem I&#39;ve enjoyed for many years:<br/>\n<br/>\nA Fence or an Ambulance<br/>\n<br/>\n&#39;Twas a dangerous cliff, as they freely confessed,<br/>\nThough to walk near its crest was so pleasant;<br/>\nBut over its terrible edge there had slipped<br/>\nA duke and full many a peasant.<br/>\nSo the people said something would have to be done,<br/>\nBut their projects did not at all tally;<br/>\nSome said, &quot;Put a fence &#39;round the edge of the cliff,&quot;<br/>\nSome, &quot;An ambulance down in the valley.&quot;<br/>\n<br/>\n<br/>\nBut the cry for the ambulance carried the day,<br/>\nFor it spread through the neighboring city;<br/>\nA fence may be useful or not, it is true,<br/>\nBut each heart became full of pity<br/>\nFor those who slipped over the dangerous cliff;<br/>\nAnd the dwellers in highway and alley<br/>\nGave pounds and gave pence, not to put up a fence,<br/>\nBut an ambulance down in the valley.<br/>\n<br/>\n<br/>\n&quot;For the cliff is all right, if your careful,&quot; they said,<br/>\n&quot;And, if folks even slip and are dropping,<br/>\nIt isn&#39;t the slipping that hurts them so much<br/>\nAs the shock down below when they&#39;re stopping.&quot;<br/>\nSo day after day, as these mishaps occurred,<br/>\nQuick forth would those rescuers sally<br/>\nTo pick up the victims who fell off the cliff,<br/>\nWith their ambulance down in the valley.<br/>\n<br/>\n<br/>\nThen an old sage remarked: &quot;It&#39;s a marvel to me<br/>\nThat people give far more attention<br/>\nTo repairing results than to stopping the cause,<br/>\nWhen they&#39;d much better aim at prevention.<br/>\nLet us stop at its source all this mischief,&quot; cried he,<br/>\n&quot;Come, neighbors and friends, let us rally;<br/>\nIf the cliff we will fence, we might almost dispense<br/>\nWith the ambulance down in the valley.&quot;<br/>\n<br/>\n<br/>\n&quot;Oh he&#39;s a fanatic,&quot; the others rejoined,<br/>\n&quot;Dispense with the ambulance? Never!<br/>\nHe&#39;d dispense with all charities, too, if he could;<br/>\nNo! No! We&#39;ll support them forever.<br/>\nAren&#39;t we picking up folks just as fast as they fall?<br/>\nAnd shall this man dictate to us? Shall he?<br/>\nWhy should people of sense stop to put up a fence,<br/>\nWhile the ambulance works in the valley?&quot;<br/>\n<br/>\n<br/>\nBut the sensible few, who are practical too,<br/>\nWill not bear with such nonsense much longer;<br/>\nThey believe that prevention is better than cure,<br/>\nAnd their party will soon be the stronger.<br/>\nEncourage them then, with your purse, voice, and pen,<br/>\nAnd while other philanthropists dally,<br/>\nThey will scorn all pretense, and put up a stout fence<br/>\nOn the cliff that hangs over the valley.<br/>\n<br/>\n<br/>\nBetter guide well the young than reclaim them when old,<br/>\nFor the voice of true wisdom is calling.<br/>\n&quot;To rescue the fallen is good, but &#39;tis best<br/>\nTo prevent other people from falling.&quot;<br/>\nBetter close up the source of temptation and crime<br/>\nThan deliver from dungeon or galley;<br/>\nBetter put a strong fence &#39;round the top of the cliff<br/>\nThan an ambulance down in the valley.<br/>\n<br/>\n<br/>\n-- Joseph Malins (1895)<br/>\n<br/>\n<br/>\n<br/>\nJohn<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://members.xoom.com/joandersen\">http://members.xoom.com/joandersen</a></div>","specialLinks":[]}],"prevTopicId":3710,"nextTopicId":4137}}