{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Don&#39;t be gullible!!","postDate":"1413000801","msgId":74903,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyMUZDNTNBLUUxRUYtNEY0NS1COTZGLTBERTU3Nzc1RURBMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEQ3ODM4MzMwLThCQUMtNDdBNS1CQjVELTk5RjkyMDZBQjc1NkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEQ3ODM4MzMwLThCQUMtNDdBNS1CQjVELTk5RjkyMDZBQjc1NkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":74902,"nextInTopic":0,"prevInTime":74902,"nextInTime":74904,"topicId":74902,"numMessagesInTopic":0,"msgSnippet":"The second example was on a page about unschooling young children (maybe it was supposed to be about that) that was recommended as a resource on my facebook","messageBody":"<div id=\"ygrps-yiv-1211771547\">The second example was on a page about unschooling young children (maybe it was supposed to be about that) that was recommended as a resource on my facebook discussion group.  I went to look at it, since it had been linked there.<br/>\n<br/>\nI found something very odd, and an exchange ensued:<br/>\n<br/>\n<br/>\nPage Owner shared Someone else&#39;s photo.<br/>\nSeptember 22 at 7:14pm · <br/>\nThis is why I&#39;m so unwavering about car safety. You have a 9% chance of getting in an accident every time you leave the house. You never know which time you leave could be that time, so thats why we buckle up every passenger, every time.<br/>\n[Then there was a sad story in words, not images, of a car crash involving a child, graphic, and followed by &quot;I couldn&#39;t not pass it along.&quot;  PLEASE, EVERYBODY, if something is terrible, don&#39;t pass it along.  But that&#39;s not the point of this Always Learning post.]<br/>\nI know Child Passenger Safety Week is now over, but this was posted on a private group (with permission to share) this morning. I couldn&#39;t not pass it along.<br/>\n<br/>\nEvery Ride. Seriously. Every Ride.<br/>\n<br/>\nI know most of you (my friends) just pass this stuff over, but please take a moment to read this. And if you&#39;ve ever wondered whether something I posted about proper use of a child restraint or seat belt was directed at you and a photo you shared, it probably was. I try to bite my tongue and look the other way most of the time, but I honestly care about your kids and I know you do too, but like this dad, you believe it&#39;s &quot;ok&quot; - either you don&#39;t realize the kids&#39; belts aren&#39;t on correctly or you don&#39;t believe it is going to make a difference for &quot;this one ride.&quot;<br/>\n<br/>\nGuys. It matters. Please contact me. I can help. Most adults don&#39;t even wear their seat belts correctly. And it&#39;s even more complicated for kids, because the seat belts weren&#39;t built for them.<br/>\n<br/>\nThe child mentioned will probably be OK. Last word from the parents is that he&#39;s got stitches in his head and they&#39;re sending him for a CT scan as a precaution. If he&#39;d been properly restrained, it&#39;s unlikely he would have had so much as a scratch or a bruise. As it is, they still haven&#39;t totally ruled out brain damage yet.<br/>\n<br/>\n\t• Someone  and 53 others like this.<br/>\n\t• Someone wrote:  THAT is why we do the 5 point harness. Every time<br/>\n<br/>\nSomeone: My son is 4 years old and RFing in a 5 point harness and will stay that way until he is 45 lbs which is the max weight for his carseat RFing. He will then be FFing in a 5 point harness until 80 lbs of he out grows his carseat. Safety first alwaysgor my son!<br/>\n\t• [Two more, sad story, car wreck, agreement]<br/>\n______________<br/>\n<br/>\nSandra Dodd:  Not about the article itself, but about being careful about reading and sharing: &quot;You have a 9% chance of getting in an accident every time you leave the house. &quot;<br/>\n<br/>\nWhat would you think it would mean? Nine of every hundred autos that leave the house have an accident? Clarity is important.<br/>\n______________<br/>\n<br/>\nPage Owner:  You have a 9% chance of getting in an accident any time you are in the car.<br/>\n______________ <br/>\n\t<br/>\nSandra Dodd: What is your source for that statistic?<br/>\n___________<br/>\n<br/>\nPage Owner:  NHTSA<br/>\n______________<br/>\nSandra Dodd:  Be<br/>\ncause it doesn&#39;t make sense, I was hoping you would double check, or give a link to the place you saw it. Or perhaps would look, find out what caused you to make the assertion, and say &quot;oops.&quot;<br/>\n<br/>\nCould you give a link to whatever made you think that NHTSA (National Highway Traffic Safety Administration) said that &quot;You have a 9% chance of getting in an accident any time you are in the car.&quot;<br/>\n______________<br/>\n<br/>\nSylvia Woodman So if you if you take one car trip a day you will take 1000 car trips in 3 years. 9% of 1000 is 90. Are people really getting into 30 accidents a year? Check your sources please!<br/>\n______________<br/>\n<br/>\nPage owner: It was a figure given out in my CPST, training, it is in the curriculum. I do not have time to track it down now. Take it or leave it, or track it down yourself.<br/>\n______________<br/>\n<br/>\nSylvia Woodman How about you take it down if you cannot or will not verify your source?<br/>\n<br/>\nSylvia Woodman Scaring people and making the world appear to be more dangerous than it truly is isn&#39;t helpful for people who are interested in learning more about unschooling.<br/>\n<br/>\nSylvia Woodman So far I&#39;ve only been able to find this statistic that suggests that average drivers will experience 3-4 car accidents where they filed an insurance claim over the course of a lifetime. <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.forbes.com/fdc/welcome_mjx_mobile.html\">http://www.forbes.com/fdc/welcome_mjx_mobile.html</a><br/>\nWelcome to Forbes<br/>\nFORBES.COM<br/>\n<br/>\n______________________________________<br/>\n<br/>\nSite Owner&#39;s husband, although he did not identify himself as such:<br/>\n Or, you could always not nitpick a statistic someone got out of a textbook and does not feel like tracking down on the internet, because focusing on the statistic is completely missing the point of the status. Unless of course you are against car seat safety. She verified her source, you want to see it? Go and take the CPST training.<br/>\n______________<br/>\n<br/>\nSylvia Woodman So you don&#39;t think it&#39;s irresponsible to cite as fact information that it not supported by any evidence ? That&#39;s not nit picking.<br/>\n______________<br/>\n<br/>\nPage Owner: : I am a CPST.<br/>\n______________________<br/>\n<br/>\nTIME OUT:  Sylvia looked it up.  &quot;CPST&quot; is a Child Passenger Safety Technician.  It&#39;s a certification.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://cert.safekids.org\">http://cert.safekids.org</a><br/>\n_______________________<br/>\n<br/>\nSylvia Woodman So this is your research you are presenting? Are you seeing accident statistics in excess of 30 accidents per car riding person per year? It seems to me that you must be misremembering the statistic. 9% is far too high to be accurate and being a technician is not the same as being a source. A resource maybe, but that is not the same thing as being a independently verifiable source.<br/>\n_______________________<br/>\n<br/>\nSandra Dodd :<br/>\n<br/>\n-=- She verified her source, you want to see it? -=-<br/>\n<br/>\nIt was incorrect. It was WILDLY incorrect, but 53 people &quot;liked&quot; it. <br/>\n<br/>\nThat many people who can&#39;t read that statistic and see how wildly wrong it is aren&#39;t reading very carefully. It&#39;s not nitpicking to point out that if 9% of everyone who got into a car had an accident, cars would have been illegal long ago. 90,000 accidents a day in a city of one million (or even 45,000, if each involves two cars? Or, as Sylvia pointed out, 30 accidents per family member per year? Did none of that ring false? If something doesn&#39;t seem right, double check! <br/>\n<br/>\nIt is not a verification when a claim is proven to be false. It turns out that the source is available online. Someone looked it up—a dad I know. Here, a quote from his wife:<br/>\n<br/>\n&quot;I just got a text message from him -- he apparently spent part of his lunch hour looking for it-- and he found it. The whole Car seat passenger safety curriculum is available on line.   [Page Owner] misquoted the stat. You don&#39;t run a 9 % risk every time you get in the car. You have a 9% risk of getting into an accident per year (which would translate into 3-5 accidents over the course of a lifetime) which is much more reasonable figure.&quot;<br/>\n<br/>\n-=-Page Owner: I am a CPST.-=-<br/>\n<br/>\nWhatever the purpose of that accolade might be, you&#39;re not a very good representative of the group if you weren&#39;t able to understand the material and are defending a false claim. Is CPST a certification for putting other people&#39;s children in carseats, or for selling carseats, or what?<br/>\n____________________<br/>\nEnd of that thread.<br/>\nThere was no response.  Rather than correct the information, or respond, they hid the post. It&#39;s still there, but hidden.<br/>\n<br/>\nAnd this is someone who is identifying as an unschooler, and as someone who can help others with young children to understand unschooling (it seems, though it also seems to involve daycare).  <br/>\n<br/>\nBe careful what you believe.  Read what you want to, but read thoughtfully.  If people make mistakes and they won&#39;t even look at them when asked to, beware.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Don&#39;t be gullible!!","postDate":"1412964014","msgId":74902,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ3ODM4MzMwLThCQUMtNDdBNS1CQjVELTk5RjkyMDZBQjc1NkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":74903,"prevInTime":74901,"nextInTime":74903,"topicId":74902,"numMessagesInTopic":0,"msgSnippet":"Think as clearly as possible, and if something sounds wrong, hang back.  Wait for more information.  Check it yourself.  Remember that some people exaggerate","messageBody":"<div id=\"ygrps-yiv-373458876\"><html><head></head>Think as clearly as possible, and if something sounds wrong, hang back. &nbsp;Wait for more information. &nbsp;Check it yourself. &nbsp;Remember that some people exaggerate or aren&#39;t good with numbers or something.<div><br></div><div>I have two examples today and some commentary. &nbsp;</div><div><br></div><div>Example #1 is that today&#39;s Just Add Light had something I wrote a while back, that I found quoted in an e-mail. &nbsp;It was probably from a discussion in this group.</div><div>___________</div><div><br></div><div><p style=\"margin:6px 0px;color:rgb(20, 24, 35);font-family:Helvetica, Arial, 'lucida grande', tahoma, verdana, arial, sans-serif;font-size:14px;line-height:19px;text-align:left;\">Playing a video game is not violent. Playing a game is sitting on a couch with a remote control.</p><p style=\"margin:6px 0px 0px;display:inline;color:rgb(20, 24, 35);font-family:Helvetica, Arial, 'lucida grande', tahoma, verdana, arial, sans-serif;font-size:14px;line-height:19px;text-align:left;\">Shaming a kid who wants to sit on the couch with a remote control, or somehow<br>preventing him from playing, is closer to violence than a kid causing the<br>character he&#39;s controlling to shoot an imaginary weapon at some pixels.</p><div><br></div><div>Then there was a photo of two children playing a video game, intently, at a gathering in France a few years ago.</div><div><br></div><div>It linked to this:&nbsp;<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/violence/\">http://sandradodd.com/violence/</a></div><div>___________________</div></div><div><br></div><div>By accident, someone responded to me (I think she meant to send it to a spouse or friend):</div><div>&quot;What do you think about this?&quot;</div><div><br></div><div>I know she didn&#39;t mean to send it to me, because I just said what I thought about it. &nbsp; I don&#39;t know whether if she had gone to that link and read the other things linked there (by Deb Lewis, by me and other moms) she still would have asked someone. &nbsp;</div><div><br></div><div>The wildest anti-video-game claim I&#39;ve heard is that it&#39;s the same as actually being in a violent situation, emotionally. &nbsp;That pretending is the same as doing.</div><div><br></div><div>In the opinion of whose orphans or widows? &nbsp;And violence usually has as much danger for the attacker as the attacked. &nbsp;Were these game-playing children in real danger? &nbsp;</div><div><br></div><div>Only from gullible parents.&nbsp;</div><div><br></div><div>Parents who want to control their children will fish for and gather justifications for doing so. &nbsp;A collection of justifications for controlling children will not help unschooling. &nbsp;That doesn&#39;t mean I think children should be encouraged or allowed to do things that endanger themselves, others or the family&#39;s continuing right to homeschool. &nbsp;I think that a parent who wants to believe that video game play IS endangerment will have a harder time seeing and thinking clearly enough to be good unscholers.</div><div><br></div><div>I have a second example that I&#39;ll put in another e-mail. &nbsp;It will take some set-up.</div><div><br></div><div>Sandra</div><div><br></div><div><br></div><div><br></div></html></div>","specialLinks":[]}],"prevTopicId":74869,"nextTopicId":74904}}