{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] Re: Attitudes, Cooperation. etc.","postDate":"1062376880","msgId":79623,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2Yy4yMzQ3M2I3Yy4yYzgzZWZiMEBhb2wuY29tPg=="},"prevInTopic":79605,"nextInTopic":0,"prevInTime":79622,"nextInTime":79624,"topicId":79605,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/31/03 5:11:59 PM, schorsewoman@yahoo.com writes: ","messageBody":"<div id=\"ygrps-yiv-1504756499\">In a message dated 8/31/03 5:11:59 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:schorsewoman@...\">schorsewoman@...</a> writes:<br/>\n<br/>\n&lt;&lt; <br/>\nI find this list very helpful because you all challenge my way of seeing <br/>\nthings!  I want to slap myself and say, &quot;Why didn&#39;t I see that??!!!&quot;  LOL &gt;&gt;<br/>\n<br/>\nDon&#39;t slap yourself!  Sets a bad example for the kids!<br/>\n<br/>\n&lt;&lt;Someone on another list mentioned something about Thinking Sticks.  What <br/>\nare they?&gt;&gt;<br/>\n<br/>\nA toy/tool/game I made up.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://SandraDodd.com/thinkingsticks\">http://SandraDodd.com/thinkingsticks</a><br/>\n<br/>\nThe website seems sludgy today; sorry.<br/>\n<br/>\nIf you can&#39;t get in right away, try later.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":134042206,"authorName":"DW","from":"DW &lt;schorsewoman@...&gt;","profile":"schorsewoman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Attitudes, Cooperation. etc.","postDate":"1062371439","msgId":79605,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwODMxMjMxMDM5LjgwMTUzLnFtYWlsQHdlYjQxNjA1Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDEwNjIzNjYwODcuMTgxNy40NzY4MC5tMUB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":79623,"prevInTime":79604,"nextInTime":79606,"topicId":79605,"numMessagesInTopic":0,"msgSnippet":"Hi! I liked the point about wanting to treat our kids the way you wished your parents would have treated you.  This thinking underlies everything I do.  My","messageBody":"<div id=\"ygrps-yiv-421911655\">Hi!<br/>\nI liked the point about wanting to treat our kids the way you wished your parents would have treated you.  This thinking underlies everything I do.  My parents were very authoritarian.  They weren&#39;t fair among us kids either.  I never got to do anything I was interested in as a kid.<br/>\n <br/>\nSo, now I go out of my way to let my kids try whatever it is they want.  I think they need to dabble and experiment.  I don&#39;t get bent out of shape when they don&#39;t like something. I usually have to take a deep breath when they DO like something because sometimes it isn&#39;t something I like or want them to do. Allowing of course that it isn&#39;t overly dangerous for their age or illegal.  I have to remember that they are their own persons and get to pick how they spend time on this planet.<br/>\n <br/>\nThey are pretty good kids, and they do help me out.  The oldest keeps a neat room, but the younger one, well, sometimes you can&#39;t even walk in there! &lt;grin&gt;  We do gently encourage her to clean it up because sometimes she falls from tripping over something or can&#39;t find what she wants.  She gets very upset and will cry.  We tell her those are the consequences of a trashed out room! <br/>\n <br/>\nAs far as showers go...don&#39;t all kids go through that stage about not wanting to shower?  I think kids eventually get feedback that they stink or their hair is gross..or they get scabies or lice or something.  Though I realize you can catch the latter and not be dirty.<br/>\n <br/>\nThis is just me, but I do lay out the choices before my kids and the consequences sometimes.  I am not coercive about it at all. I make it clear that I don&#39;t care which path they take. I have no vested interest in it.  I am comfortable with helping my kids make the connections between choices and connections.<br/>\n <br/>\nFor example, my son has said he might want to go to one of the military academies.  Well, if that is his goal, then there are certain things he could do to make that goal become a reality.  We talk about those things.  Now I don&#39; t really care whether he chooses the military academy or not.  We brainstormed together things that would help---like being involved in activities where leadership skills were utilized, being physically fit, getting decent SAT scores, participating in community service projects, etc.  And sometimes he asks me to help him figure out how to get involved in things or study certain things so he can achieve his goal. <br/>\n <br/>\nI know someone who unschools who says my participation in the process is coercive. I don&#39;t think it is, but I could be wrong.  My kids don&#39;t feel that I am.  I figure that if it is the kids who are asking for help...and they are talking about their own interests, then it is ok to help.  For me, unschooling isn&#39;t no involvement. It is remembering that I can be involved but that it isn&#39;t about ME and what I want for the kids. <br/>\n <br/>\nI don&#39;t know the dynamics in your house, Judie, but we have had talks about cooperation since my kids were young.  We, the parents, often pitch in and help the kids, so it became second nature for the kids to do the same. I don&#39;t think I have ever arrived home from the grocery store when my son didn&#39;t come out to get the groceries.  No one has ever told him to do it.  He just does it.  If he comes home with stuff from a camping trip, I go out and help him unload.  I think it is the same with manners.  My dh and I were always into manners, so we are polite to each other. Our kids picked up on it. We don&#39;t force them to be polite.  <br/>\n <br/>\nI know we have had family meetings where we have talked about how we like having company, but we also like having company come into a house that is lived in, but not trashed.  It is something that is important to all of us. So, we have days where we all pitch in and clean.  But I don&#39;t know what we would do if one kid said he didn&#39;t care if his friends came over to a trashed out house. We never had to face that.  Even my daughter who usually has a mess likes to clean it up before a friend comes over.  My son doesn&#39;t like to go to bed in an unmade bed so he makes his own bed all the time.<br/>\n <br/>\nMy kids get in those teen moods where they don&#39;t feel like moving away from the computer. If I am left to do everything, then I will say something later at a family meeting about how cooperation is breaking down.  No one, not mom, not dad, not any kid should be the only one responsible for cooking and keeping up with household chores. At least not in our house. Everyone needs to do their part. We are not obsessive about cleanliness though. If they do stuff for me, I don&#39;t nitpick what they did.  <br/>\n <br/>\nMy daughter cleaned out the refrigerator yesterday.  She did a great job, except she didn&#39;t remove old food that was in containers. I didn&#39;t say anything about that right off. I thanked her for the help.  She cleaned the drawers and the shelves where stuff had spilled.  She took out a few things that were obviously spoiled.  At a later time I mentioned that it was ok to check all the containers and then compost food that was spoiled. It was no big deal. She didn&#39;t know to do that.<br/>\n <br/>\nI find this list very helpful because you all challenge my way of seeing things!  I want to slap myself and say, &quot;Why didn&#39;t I see that??!!!&quot;  LOL<br/>\n <br/>\nSomeone on another list mentioned something about Thinking Sticks.  What are they?<br/>\n<br/>\nDeana<br/>\n <br/>\n <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nYahoo! SiteBuilder - Free, easy-to-use web site design software<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":79572,"nextTopicId":79626}}