{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"Jonathan Mooney","from":"Jonathan Mooney &lt;jonathanmooney@...&gt;","replyTo":"LIST","senderId":"jz5fyEg1L8mlOEK1BbOJWyceV87C18xyIDaCKTX7cN2y1ecCIrW5mRVSSuXXP1GrZjtQX9uYtnT-x6PwFjjYwTreoQPVP-bikRGoM8V3Y7zm-O6Crg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: introduction","postDate":"964292143","msgId":11471,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMuMC4yLjMyLjIwMDAwNzIyMTQ1NTQzLjAwZTk3NzI0QG1haWwuZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PExBVzItRjgzVGxqQk9oOHM0S1cwMDAwMDAyN0Bob3RtYWlsLmNvbT4="},"prevInTopic":11372,"nextInTopic":0,"prevInTime":11470,"nextInTime":11472,"topicId":11372,"numMessagesInTopic":0,"msgSnippet":"Hey all, righ off the bat you ll going to have to excuse the spelling of anything i post--i just a little on the dyslixic side of things. I also have a little","messageBody":"<div id=\"ygrps-yiv-378098421\">Hey all, <br/>\n<br/>\nrigh off the bat you&#39;ll going to have to excuse the spelling of anything i<br/>\npost--i just a little on the dyslixic side of things. <br/>\n<br/>\nI also have a little confushion to make. I am 22 just over the teen list<br/>\nage. But i thought i&#39;d indroduce myself, my work, and see if you&#39;ll will<br/>\nmake an exception. I joined the list becuase i had a fucking nightmare<br/>\nexsperince in school and i feel that i could be a resouce for people in the<br/>\nunschooling population who stuggle wiht Learning disabities. <br/>\n<br/>\nI was diagnossed with Dyslixia in four grade and depression as a reulst of<br/>\nliving in fucking systmes that can not understand diffrence. I did not<br/>\nactually learn to read untill i was 12--at that point the shame,<br/>\nhummilation, and anger that felt towards a school system that was<br/>\nsystemcially teaching me that i was worthless and stupid was to much to<br/>\nbear--i dorped out with the support of my partents completly. i have to say<br/>\nthat perioed was one of the most difficult times in mylife--sucicde was<br/>\ncerntently on my mind most of the time. our schools have so much power and<br/>\nthis power if very rearlly quested--in the end they are more concered with<br/>\nsocilzaing conformaty then empowering people as thinkers. But when you are<br/>\n12 that shit is to hard to understand specfically when the common<br/>\nassocation with a learning disabilty is that you are stupid that spelling<br/>\nis a direct indication of how your minds works. <br/>\n<br/>\nBut my story does that end there. I was lucky to be a gifted soccer player<br/>\nand reenrooled under that pignoned indenty which schools are so quick to<br/>\ngive out. I ended up barging graduating and reviving a school scholarship....<br/>\n<br/>\n<br/>\nBut i decided to drop soccer a go with of all things writing (there is a<br/>\nlot of shit left out here in the abriged vershion--problmes wiht achohall,<br/>\na coulpe of artsest, tranfersing unversityies, you the good stuff). Now I<br/>\nam a recent graduate for Brown University and author of the forth coming<br/>\nbook entitled Learning Outside the Lines (Simon & Schuster, September<br/>\n2000). It book is based on the success stories of me and my co-author. It<br/>\nstarts with my journey from being a sixth grade drop and  then turns to my<br/>\nco-author--diagnosed with ADHD in second grade, high school drop out turned<br/>\nIVY league student also. Together we then explore and outline the learning<br/>\nstrategies that we have used to be successful as alternative learns, to be<br/>\nsuccessful as people learn out side the lines. <br/>\n<br/>\n<br/>\nThis book dirctly attacks that fucked things about ourschools and its goals<br/>\nit to outline a road map for learning outside the lines, it takes the<br/>\nreader on a journey towards personal empowerment and profound educational<br/>\nchange.<br/>\n<br/>\nI believe that all kids deserve an education that is about freedom,<br/>\nempowerment, and educational revolution. you guys have mad courge for<br/>\npursing an education that is fucking truly outside the lines. i wish this<br/>\ntyep of enviorment would of been around for me. <br/>\n<br/>\nif i can be of any help, around the issue of ld, or aroudn the isseu of<br/>\ngoing to college after untraditional education please feel free to contatct<br/>\nany time. here is my contact information:<br/>\n<br/>\naddress: 46 E29th St. New York, New York 0016<br/>\nwork: 212-889-1868<br/>\ncell: 917-553-4820<br/>\n<br/>\ncheers all<br/>\n<br/>\nJonathan Mooney</div>","specialLinks":[]},{"userId":0,"authorName":"Annette Naake","from":"&quot;Annette Naake&quot; &lt;naake1999@...&gt;","replyTo":"LIST","senderId":"Kz491gARyclUUvpQDbJ39RKkVuXi4D1S02r7BtLizZXjwdEyHo8LxV7XgRHElKuHFXn1kZ207AdUf5pp_ZuRZkufhOpTPcX8H-ynqtln","spamInfo":{"isSpam":false,"reason":"0"},"subject":"fed up-- the ladies","postDate":"964046195","msgId":11372,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PExBVzItRjgzVGxqQk9oOHM0S1cwMDAwMDAyN0Bob3RtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":11471,"prevInTime":11371,"nextInTime":11373,"topicId":11372,"numMessagesInTopic":0,"msgSnippet":"Nance, the ladies are $50 every time they come. We have a small house, 2 bedrooms, 1 bath. So, it costs us $100 a month, and yes, I should be saving that for","messageBody":"<div id=\"ygrps-yiv-55855017\">Nance, the ladies are $50 every time they come. We have a small house, 2 <br/>\nbedrooms, 1 bath. So, it costs us $100 a month, and yes, I should be saving <br/>\nthat for the 3yo&#39;s college, but then I would lose my mind amid the mess long <br/>\nbefore I saw him in his cap and gown. Another thing I love about these <br/>\nhousekeepers is there are six of them and they are done in 45 minutes or <br/>\nless. They pile out of their van and deploy to every room of the house, <br/>\nwhile I grab the boys and flee. I&#39;ve tried having one person do it but it <br/>\ntakes half a day and it&#39;s a bother having someone in the house that long.<br/>\n<br/>\nAnnette<br/>\n________________________________________________________________________<br/>\nGet Your Private, Free E-mail from MSN Hotmail at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.hotmail.com\">http://www.hotmail.com</a></div>","specialLinks":[]}],"prevTopicId":11469,"nextTopicId":11472}}