{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":12,"messages":[{"userId":1294635,"authorName":"Helen Hegener","from":"Helen Hegener &lt;HEM-Editor@...&gt;","profile":"hemhelen","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Whitehorse, Yukon","postDate":"1030486321","msgId":42261,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNTAwMTk4M2I5OTFhOTQ2MTZiOEBbMjA4LjI2LjIyNy4yMTFdPg==","inReplyToHeader":"PDE4OC5kMzA3YWMwLjJhOWQ0ZGY3QGNzLmNvbT4=","referencesHeader":"PDE4OC5kMzA3YWMwLjJhOWQ0ZGY3QGNzLmNvbT4="},"prevInTopic":42251,"nextInTopic":0,"prevInTime":42260,"nextInTime":42262,"topicId":41899,"numMessagesInTopic":0,"msgSnippet":"... I don t recognize the name... Helen","messageBody":"<div id=\"ygrps-yiv-2134999644\">At 5:49 PM -0400 8/27/02, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a> wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Wow!! I thought twice was a lot...:)<br/>\n&gt;There used to be a place called Esthers Inn somewhere in Whitehorse, is it<br/>\n&gt;still there? It was an oasis after a long day driving!  We loved it.<br/>\n<br/>\n </span></blockquote>I don&#39;t recognize the name...<br/>\n<br/>\nHelen</div>","specialLinks":[]},{"userId":90564959,"authorName":"starsuncloud@cs.com","from":"starsuncloud@...","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Moving or staying in one place","postDate":"1030484983","msgId":42251,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4OC5kMzA3YWMwLjJhOWQ0ZGY3QGNzLmNvbT4="},"prevInTopic":42227,"nextInTopic":42261,"prevInTime":42250,"nextInTime":42252,"topicId":41899,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/27/02 4:12:55 PM Central Daylight Time, Unschooling-dotcom@yahoogroups.com writes: ","messageBody":"<div id=\"ygrps-yiv-1822800714\">In a message dated 8/27/02 4:12:55 PM Central Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> writes:<br/>\n<br/>\n&lt;&lt; I love travelling, because I&#39;ve travelled all my life: I&#39;ve been over <br/>\n the Alaska Highway over 200 times &gt;&gt;<br/>\n<br/>\nWow!! I thought twice was a lot...:)<br/>\nThere used to be a place called Esthers Inn somewhere in Whitehorse, is it <br/>\nstill there? It was an oasis after a long day driving!  We loved it.<br/>\n<br/>\nRen</div>","specialLinks":[]},{"userId":1294635,"authorName":"Helen Hegener","from":"Helen Hegener &lt;HEM-Editor@...&gt;","profile":"hemhelen","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[Unschooling-dotcom] Re: Moving or staying in one place","postDate":"1030478599","msgId":42227,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNTAwMTk3YWI5OTE4MTQwYTg5ZUBbMjA4LjI2LjIyNy4yMTFdPg==","inReplyToHeader":"PGY2LjIwNDMwMjk0LjJhOTk3NzYwQGFvbC5jb20+","referencesHeader":"PGY2LjIwNDMwMjk0LjJhOTk3NzYwQGFvbC5jb20+"},"prevInTopic":42102,"nextInTopic":42251,"prevInTime":42226,"nextInTime":42228,"topicId":41899,"numMessagesInTopic":0,"msgSnippet":"... Very interesting post, Pam, and I m sure it s going to generate lots of discussion here. I m just catching up with this list after a couple of days away","messageBody":"<div id=\"ygrps-yiv-1339094078\">At 7:57 PM -0400 8/24/02, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:warblwarbl@...\">warblwarbl@...</a> wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Just some random, and maybe a bit defensive, thoughts on this subject. <br/>\n&gt;People who travel/move a lot get all the glory.  They have lots of<br/>\n&gt;interesting tales to tell and broad experiences.<br/>\n<br/>\n </span></blockquote>Very interesting post, Pam, and I&#39;m sure it&#39;s going to generate lots <br/>\nof discussion here. I&#39;m just catching up with this list after a <br/>\ncouple of days away from the keyboard - came back to almost 250 posts <br/>\nhere last night; I&#39;ll read and reply to what I can but I probably <br/>\nwon&#39;t get through them all. Anyway, I really like what you have to <br/>\nsay.<br/>\n<br/>\nI&#39;m one of those people who travel a LOT - since January I&#39;ve spent <br/>\nmore time away from our home in Washington state than I&#39;ve spent <br/>\nthere. In our case there&#39;s a lot of family dynamics at work: my <br/>\nparents and siblings all live here, and three of our five grown kids <br/>\n(and three grandchildren) are here now. We&#39;ve lived here before, and <br/>\nhave many ties to this area, but we&#39;ve also spent 20+ years in <br/>\nWashington and have two grown kids, two grandkids, horses, boats, two <br/>\nproperties, and many ties there as well. It&#39;s a bit of a juggling act <br/>\n- and we know travels agents in two states on a first name basis. &lt;g&gt;<br/>\n<br/>\nYou&#39;re right, I do have lots of interesting tales to tell, like <br/>\ndriving along near Dawson City with my daughter Jody on this last <br/>\ntrip north and being flagged down by an old man and his wife from <br/>\nCalifornia who had two flat tires on their camper. We ended up <br/>\nmeeting two marvelous old gold miners who taught us how to patch the <br/>\ntires right there alongside the road, then invited us all back to <br/>\ntheir claim which pre-dated the Klondike gold rush and proudly showed <br/>\nus their whole place, showed off the gold they&#39;d sluiced so far this <br/>\nseason (a fruit jar half full!), and insisted we stay for delicious <br/>\ndinner of caribou stew!<br/>\n<br/>\nI love travelling, because I&#39;ve travelled all my life: I&#39;ve been over <br/>\nthe Alaska Highway over 200 times, have been all over the western US <br/>\nand Canada and through most of the rest of the country, and I&#39;ve been <br/>\nto Europe twice. But even when I&#39;m enjoying travelling the most, my <br/>\nthoughts are often of home, and those I&#39;ve left behind. Travelling <br/>\ncan be lonely, and frightening (like last winter on a drive out the <br/>\nHighway - a moose stepped in front of my truck and I veered into a <br/>\nsnowbank 160 miles from the nearest town; two hours of daylight left <br/>\nand temperatures dropping down to the -20&#39;s...). Travelling is <br/>\nexpensive, too, and I&#39;ve often thought that for the price of a trip <br/>\nto Alaska I could have remodeled my kitchen, or bought Mark a new <br/>\ngarden tractor.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   I&#39;m always sure that my<br/>\n&gt;sister-in-law, who hasn&#39;t stayed on one continent for more than about three<br/>\n&gt;months for the last decade or so, thinks Eric and I are boring.  And<br/>\n&gt;sometimes I feel boring.<br/>\n<br/>\n </span></blockquote>Sometimes I feel boring, too, Pam, as people who don&#39;t travel find it <br/>\nhard to really relate to people who do. I mean, after you&#39;ve <br/>\nimpressed people with your latest adventures - then what? The people <br/>\nwho live in one place go back to talking about what they know, who <br/>\ndid what last week and what so-and-so thought about it - and I&#39;m <br/>\nfeeling very much the outsider who just dropped in for tea.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  But I&#39;m also proud of the roots we&#39;ve sunk.  We<br/>\n&gt;know this place.  I walk in my neighborhood enough to recognize the cats,<br/>\n&gt;know how this year&#39;s apricot crop compares to last, to know someone died in<br/>\n&gt;that house not long ago.  We know lots of people here and when we meet new<br/>\n&gt;people, there&#39;s often a connection to someone else we know.<br/>\n<br/>\n </span></blockquote>Just so. And I often miss that feeling of familiar comfortableness, <br/>\nof being in one&#39;s place.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I&#39;ve been thinking a lot about how the United States is almost entirely a<br/>\n&gt;nation of immigrants and movers.<br/>\n<br/>\n </span></blockquote>I think about that quite a bit, too. I find it fascinating to study <br/>\nhow we as a country got to where we are now, and the increasing ease <br/>\nof travel over time plays a huge part in that.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  Now I have complete support for those<br/>\n&gt;who&#39;ve come here to escape oppression, and I don&#39;t even begrudge anyone for<br/>\n&gt;leaving the SF Bay Area because they can&#39;t afford the ridiculous housing<br/>\n&gt;prices for their growing families.  But it&#39;s interesting to think about the<br/>\n&gt;fact that most of us are descended from people who were willing to up and<br/>\n&gt;leave their families thousands of miles behind (and for most of U.S. history<br/>\n&gt;that meant never seeing them again).  What does that say about what our<br/>\n&gt;&quot;family values &quot; really are?  What messages are we giving our children when<br/>\n&gt;we move away from extended family for a promotion or bigger house?<br/>\n<br/>\n </span></blockquote>I&#39;ve asked those questions many times. My travels are primarily an <br/>\neffort to hold our whole extended family together over the years, and <br/>\nI count myself lucky that I&#39;m only dealing with two states, two <br/>\nrelatively smallish areas, and they&#39;re not spread out all over the <br/>\ncountry. And I&#39;m also lucky that there&#39;s been more and more <br/>\ndiscussion this summer of moving everyone closer together again - <br/>\nthis is a close family, and those who&#39;ve been able to travel to <br/>\nAlaska find they really miss those who&#39;ve settled down for good in <br/>\nWashington state. So I think there&#39;s going to be a major shift <br/>\nsouthward this fall.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;And what happens to our communities?  When people move frequently, it&#39;s hard<br/>\n&gt;to know, much less count on your neighbors.  I know that there are other<br/>\n&gt;factors - two parents working, school, long commutes, scheduled lives - that<br/>\n&gt;play into this, but the sense we have that people may only be here short term<br/>\n&gt;plays a role.  It also seems to me that all this moving may not be so<br/>\n&gt;adventurous after all because the more transient we&#39;ve become as a society,<br/>\n&gt;the more the same different places have become.  There&#39;s hardly any local<br/>\n&gt;flavor left anymore; it&#39;s all Gap, Starbucks, McDonalds and Walmart.  We<br/>\n&gt;can&#39;t just blame corporations for that.  Lots and lots of us clearly want<br/>\n&gt;that safety and sameness, that comfort that people used to get from staying<br/>\n&gt;in one place and knowing generations from the same family.<br/>\n<br/>\n </span></blockquote>Very well stated - I&#39;ve seen that sameness, that plastic-coated <br/>\noverlay from city to city to city, and it&#39;s depressing. I remember <br/>\nwhen much of the excitement of travelling was seeing how *different* <br/>\nthings looked in different places, but now it&#39;s homogenizing into the <br/>\nsame franchises and superstores everywhere.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;We might still move (right now we&#39;re looking at Portland), but it&#39;s not going<br/>\n&gt;to be easy for this stick-in-the-mud.<br/>\n<br/>\n </span></blockquote>I&#39;ve lived in Portland (and the suburbs of Lake Oswego, Troutdale, <br/>\nand Hillsboro), and it&#39;s a really cool city - for a city. Lots of <br/>\nbeautiful areas around there, and an amazing variety of things to do. <br/>\nWe spent two weeks there last June and really had a great time!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Berkeley is so awesome in the fall.<br/>\n<br/>\n </span></blockquote>I&#39;m originally from the Healdsburg-Guerneville area over toward the <br/>\ncoast, and I still remember the sounds and smells of fall in that <br/>\ncountry. I&#39;ve never found a place that even comes close to that <br/>\nparticular combination of redwoods, vineyards, oak trees, apples, and <br/>\njust a hint of the sea!<br/>\n<br/>\nHelen</div>","specialLinks":[]},{"userId":8378727,"authorName":"zenmomma *","from":"&quot;zenmomma *&quot; &lt;zenmomma@...&gt;","profile":"zenmomma2kids","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Moving or staying in one place","postDate":"1030413737","msgId":42102,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYyOEdSNmduY3Y4YVNKbHdBcDYwMDAyMDMyZUBob3RtYWlsLmNvbT4="},"prevInTopic":42092,"nextInTopic":42227,"prevInTime":42101,"nextInTime":42103,"topicId":41899,"numMessagesInTopic":0,"msgSnippet":"... Since I made the original comment about moving, I wanted to get back to this now that I ve got a free moment. I hope no one here thought that I was saying","messageBody":"<div id=\"ygrps-yiv-1566189434\"><blockquote><span title=\"ireply\">&gt;&gt;Just some random, and maybe a bit defensive, thoughts on this subject. <br/>\n&gt;&gt;People who travel/move a lot get all the glory.  They have lots of <br/>\n&gt;&gt;interesting tales to tell and broad experiences.&gt;&gt;<br/>\n<br/>\n </span></blockquote>Since I made the original comment about moving, I wanted to get back to this <br/>\nnow that I&#39;ve got a free moment. I hope no one here thought that I was <br/>\nsaying that randomly moving from place to place is the best/only/necessary <br/>\nsolution for any particular difficult situation. I think that the richness <br/>\nof belonging to a community, nearby family and friends and a sense of place <br/>\nfor your family are all really good things.<br/>\n<br/>\nWhat I was trying to say though, was that if I were faced with a situation <br/>\nthat I felt would potentially harm my family, I would look towards moving as <br/>\na possible solution. For my family, that was the situation when we realized <br/>\nwe could not maintain the family on one salary. One salary wouldn&#39;t cut it <br/>\nin NY, where my dh and I grew up. We could live on one income in CO, though. <br/>\nWe moved. It was important *for us* to keep our kids out of daycare and home <br/>\nwith a parent.<br/>\n<br/>\nI feel the same about unschooling now. It&#39;s extremely important that my kids <br/>\nbe free to continue unschooling. If the state I were in seemed so <br/>\nrestrictive as to limit my ability to help them do that, again I&#39;d move. Our <br/>\nmoves have never been for promotions or bigger houses. In fact, several <br/>\ntimes we&#39;ve scaled down our house size when moving. Our moves have been <br/>\nabout &quot;family values&quot;, though, I guess. The value we have placed on keeping <br/>\nour family together. I&#39;m sure your family values have kept you close to <br/>\nextended family and community. It all depends on what each family needs and <br/>\nwhat choices are available to them.<br/>\n<br/>\nLife is good.<br/>\n~Mary<br/>\n<br/>\n<br/>\n_________________________________________________________________<br/>\nMSN Photos is the easiest way to share and print your photos: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://photos.msn.com/support/worldwide.aspx\">http://photos.msn.com/support/worldwide.aspx</a></div>","specialLinks":[]},{"userId":67635345,"authorName":"Dotchi Baker","from":"&quot;Dotchi Baker&quot; &lt;dotchi@...&gt;","profile":"dotchianni","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Moving or staying in one place","postDate":"1030393847","msgId":42092,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNjcwMWMyNGQzZiQ3NjdkNTk4MCQ2OTAxZmYwYUBtZW5kZWw+","referencesHeader":"PGIwLjJiYTBlYThhLjJhOTljOTgxQGNzLmNvbT4="},"prevInTopic":42090,"nextInTopic":42102,"prevInTime":42091,"nextInTime":42093,"topicId":41899,"numMessagesInTopic":0,"msgSnippet":"That s what bothers me around here. We ve lived on this land since 1999. I have never lived in such a bizaare neighborhood... Well, area. We have maybe three","messageBody":"<div id=\"ygrps-yiv-815827857\">That&#39;s what bothers me around here. We&#39;ve lived on this land since 1999. I have never lived in such a bizaare neighborhood... Well, area. We have maybe three neighbors we can see. I was told that when we moved here, we would have a wonderful support network, like I had in the Navy. But it is the exact opposite. I couldn&#39;t even get help after major abdominal surgery. And the gossip here is astronomical. I got pulled into one little gossip session and &quot;he said she told his mom that you told so n so that such n thus told...&quot; stuff. They jump to conclusions, are closed minded, narrow minded, ignorant, and coniving. I put my foot down and told them I would not put up with it. If they had a problem with something I did, say so and let us resolve it like mature adults. This isn&#39;t something I need to have my children around and I will happily burn bridges to keep them away from this idiocy. I think they got the message. I have two friends now.. and many aquaintances that are mad at me b/c I will not &quot;play their game&quot;. I will not tolerate someone threatening harrassment charges on me simply b/c someone said something to someone else that I had NOTHING to do with. I don&#39;t see the kind of interaction here like I saw in the military housing. I don&#39;t see community at all. I see cliques and one-ups-manship. I see people so afraid of seeing their town change that they work hard to run people off who don&#39;t fit into their little mold. I think it&#39;s so sad b/c we could all learn so much from each other, but instead, they build a huge emotional wall to keep everyone away.<br/>\n<br/>\nDotchi<br/>\n*********<br/>\nFreedom of religion means freedom for all religions.  <br/>\n     <br/>\n   <br/>\n     <br/>\n  <br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  ...But the lack of community really bothers us...<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":67635345,"authorName":"Dotchi Baker","from":"&quot;Dotchi Baker&quot; &lt;dotchi@...&gt;","profile":"dotchianni","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Moving or staying in one place","postDate":"1030393183","msgId":42090,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNjEwMWMyNGQzZCRlYWRhMTVlMCQ2OTAxZmYwYUBtZW5kZWw+","referencesHeader":"PGI3LjI1OTQ2MzgzLjJhOTlhZWZjQGFvbC5jb20+"},"prevInTopic":41941,"nextInTopic":42092,"prevInTime":42089,"nextInTime":42091,"topicId":41899,"numMessagesInTopic":0,"msgSnippet":"I grew up a Navy Brat and I always felt like that. Now that I am 27 and settled in Tennessee, I want to move again. I miss the change (which is probably why I","messageBody":"<div id=\"ygrps-yiv-1425369655\">I grew up a Navy Brat and I always felt like that. Now that I am 27 and settled in Tennessee, I want to move again. I miss the change (which is probably why I rearrange the house every month or two). I miss meeting new people and seeing new things, etc. I feel so lost here. I never had a sense of &quot;home&quot;. Home was were the Navy sent you. This doesn&#39;t feel like &quot;home&quot; to me... but then too, I am not sure what &quot;home&quot; feels like either. I think it&#39;s like a lot of people I know. When they are in the country, they long for the city. (That&#39;s ME) and when they are in the city, they long for the country. I think, for myself, that it is I long for the experience. Once I have it, I want a new experience. I would be very content in an RV moving constantly from one place to another (and what an awesome unschooling experience that could be). I have to leave here once a year to really appreciate it. I have to get away from the monotony to be able to handle it. My husband is just the opposite though. He grew up not too far from here and hates moving. He doesn&#39;t want to move. I think my yearly trips are our compromise. Just tell me when and where and I&#39;m packed and ready to go!<br/>\n<br/>\nDotchi<br/>\n*********<br/>\nFreedom of religion means freedom for all religions.  <br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> <br/>\n  Sent: Saturday, August 24, 2002 11:54 PM<br/>\n  Subject: Re: [Unschooling-dotcom] Re: Moving or staying in one place<br/>\n<br/>\n  Almost every single one said they wished they could be like me and stay put <br/>\n  and have longterm friends and keep their rooms and people would know them and <br/>\n  they wouldn&#39;t be &quot;new.&quot;<br/>\n<br/>\n  Maybe it&#39;s just six of one and half a dozen of the other.  <br/>\n<br/>\n  Sandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":101672438,"authorName":"Bill and Diane","from":"Bill and Diane &lt;cen46624@...&gt;","profile":"thegreatdiane","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Moving or staying in one place","postDate":"1030293117","msgId":41941,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNENjkwNjdELjEwODA0MDJAdm9sLmNvbT4=","referencesHeader":"PGY2LjIwNDMwMjk0LjJhOTk3NzYwQGFvbC5jb20+"},"prevInTopic":41927,"nextInTopic":42090,"prevInTime":41940,"nextInTime":41942,"topicId":41899,"numMessagesInTopic":0,"msgSnippet":"I really envy people who can stay put. I ve moved at least every two years and as often as every three months throughout my adulthood, and I m really tired of","messageBody":"<div id=\"ygrps-yiv-1546915893\">I really envy people who can stay put. I&#39;ve moved at least every two <br/>\nyears and as often as every three months throughout my adulthood, and <br/>\nI&#39;m really tired of it. Not only do people who stay put have more social <br/>\nsupport (family, friends, they know how to access resources, etc.) but <br/>\nalso more money--equity in a house, etc.<br/>\n<br/>\nWe moved here (across the country) six months ago, and I&#39;m hoping to <br/>\nsettle down and buy a house. I also hope my kids want to stay close to <br/>\nus as they grow up, unlike my parents&#39; kids--one in town, one in the <br/>\nsame region of the country, and two half a continent away.<br/>\n<br/>\nEach is better than the other. The grass is green, and happy is the <br/>\nperson that likes their own grass.<br/>\n<br/>\n:-) Diane<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;&gt;Lots of people I know stay in the same place all their lives.  I don&#39;t <br/>\n&gt;&gt;understand it a bit. <br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt;I just spent my entire walk around my beloved neighborhood thinking about <br/>\n&gt;&gt;this.  It&#39;s especially topical right now as we&#39;re thinking of moving out of <br/>\n&gt;&gt;Berkeley, where my husband has spent his whole life and I&#39;ve spent all of my <br/>\n&gt;&gt;adult life, because my husband lost his job.<br/>\n&gt;&gt; </span></blockquote></div>","specialLinks":[]},{"userId":59469462,"authorName":"Gerard Westenberg","from":"&quot;Gerard Westenberg&quot; &lt;westen@...&gt;","profile":"leonieann2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Moving or staying in one place","postDate":"1030266488","msgId":41927,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNmUwMWMyNGMxNiRlZWIwMDYyMCRiMmY0OGE5MEBwYz4=","referencesHeader":"PGIwLjJiYTBlYThhLjJhOTljOTgxQGNzLmNvbT4="},"prevInTopic":41924,"nextInTopic":41941,"prevInTime":41926,"nextInTime":41928,"topicId":41899,"numMessagesInTopic":0,"msgSnippet":"... I know and understand what you are saying here -but, my dh is in the military and we move a lot.  I also moved a lot as a child. Yes, we  have  to make","messageBody":"<div id=\"ygrps-yiv-957984829\"><blockquote><span title=\"ireply\">&gt; And what happens to our communities?  When people move frequently, it&#39;s <br/>\n&gt; hard to know, much less count on your neighbors.&gt;<br/>\n<br/>\n </span></blockquote>I know and understand what you are saying here -but, my dh is in the military and we move a lot.  I also moved a lot as a child. Yes, we  have  to make  new friends a lot and try to keep in contact with old friends. Yes, we have difficulty knowing our neighbours. But we also get to see a lot of different communities and  therefore to experience new things and  new people and to question things. We have learned how to meet people and at the same time be strong within ourselves...Some communities in which we have lived have been kind of claustrophobic - apart from us, there was little transient population and there were unwritten codes and mores - &quot;in our community we...&quot;. A bit creepy. When we have lived in more mobile communities, more cosmopolitan communities in a way, there has been more openness and friendlines...Just some observations...Leonie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":61667589,"authorName":"winnierfm@cs.com","from":"winnierfm@...","profile":"andrewsmom4100","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Moving or staying in one place","postDate":"1030254465","msgId":41924,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGIwLjJiYTBlYThhLjJhOTljOTgxQGNzLmNvbT4="},"prevInTopic":41917,"nextInTopic":41927,"prevInTime":41923,"nextInTime":41925,"topicId":41899,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/24/02 4:57:50 PM US Mountain Standard Time, ... In my high school graduating class 75% of the 138 graduates were new to the school","messageBody":"<div id=\"ygrps-yiv-940796358\">In a message dated 8/24/02 4:57:50 PM US Mountain Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:warblwarbl@...\">warblwarbl@...</a> writes: <br/>\n<blockquote><span title=\"ireply\"> &gt; What does that say about what our <br/>\n&gt; &quot;family values &quot; really are?  What messages are we giving our children when <br/>\n&gt; <br/>\n&gt; we move away from extended family for a promotion or bigger house?<br/>\n&gt; <br/>\n&gt; And what happens to our communities?  When people move frequently, it&#39;s <br/>\n&gt; hard <br/>\n&gt; to know, much less count on your neighbors.  I know that there are other <br/>\n&gt; factors - two parents working, school, long commutes, scheduled lives - <br/>\n&gt; that <br/>\n&gt; play into this, but the sense we have that people may only be here short <br/>\n&gt; term <br/>\n&gt; plays a role.  It also seems to me that all this moving may not be so <br/>\n&gt; adventurous after all because the more transient we&#39;ve become as a society, <br/>\n&gt; <br/>\n&gt; the more the same different places have become.<br/>\n<br/>\n </span></blockquote>In my high school graduating class 75% of the 138 graduates were new to the <br/>\nschool district during high school.  Only 3 of our class (myself included) <br/>\nwere Arizona natives.  Our class freshman year started out with 314 <br/>\nstudents...most of the difference were people who moved away.<br/>\n<br/>\nArizona has added roughly 2 million people in the past decade.  Phoenix has <br/>\nabsolutely exploded.  (Total AZ population I believe is 5 1/2 million people <br/>\n-- so 2 million people is a lot.)<br/>\n<br/>\nWhy am I saying all this...I agree with you about community...I have lived in <br/>\nthis house for 2 yrs and I have never met a neighbor in this neighborhood.  <br/>\nNow on one side of us is a group home for delinquent teen boys so people are <br/>\nalways coming and going there.  But I&#39;ve never met anyone else on the street. <br/>\n And I&#39;m not the only SAHM...I&#39;ve seen a lot of them and occasionally tried <br/>\nto talk to them...but people move in and out with astonishing regularity.  <br/>\n<br/>\nOne of the reasons we moved back to AZ from CO was because both our parents <br/>\nwere here and we thought our children should grow up around their <br/>\ngrandparents.  But the lack of community really bothers us...we plan to move <br/>\naway in 3 yrs.  I&#39;m always saying this place is a cross between Chicago and <br/>\nLA.  And they try to bring their plants and things here too...they want it to <br/>\nbe like home without the traffic or the weather or earthquakes.  They forget <br/>\nits a desert.<br/>\n<br/>\nPeople here are always complaining about the lack of roots -- I would love to <br/>\nlive in a place where people stayed.  I spent a year in MN and I LOVED it <br/>\nthere...I had friends who had lived in the same house their whole life...I <br/>\ncan&#39;t even begin to imagine what that is like :)<br/>\nTanya<br/>\nmom to Andrew Jordan 4/1/00 and Eli Hunter 10/29/01<br/>\nYou cannot teach a man anything; you can only help him to find it within <br/>\nhimself <br/>\n--Galileo <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Moving or staying in one place","postDate":"1030247676","msgId":41917,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI3LjI1OTQ2MzgzLjJhOTlhZWZjQGFvbC5jb20+"},"prevInTopic":41908,"nextInTopic":41924,"prevInTime":41916,"nextInTime":41918,"topicId":41899,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/24/02 5:58:34 PM, warblwarbl@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-504891259\">In a message dated 8/24/02 5:58:34 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:warblwarbl@...\">warblwarbl@...</a> writes:<br/>\n<br/>\n&lt;&lt; We might still move (right now we&#39;re looking at Portland), but it&#39;s not <br/>\ngoing <br/>\nto be easy for this stick-in-the-mud. &gt;&gt;<br/>\n<br/>\nJust today my  husband threw away the file he had on Portland, when he had <br/>\ngone up there for a job interview and stayed with Christine/Retromom.  He <br/>\nreally liked the area.  I had been afraid to move, so I said no.  He still <br/>\nthinks about how cool it might have been.  I feel a little bad.<br/>\n<br/>\n<br/>\nWhen I was in elementary, I didnt&#39; like that I came new to 2nd grade from <br/>\nanother state AND changed schools after the first week.  <br/>\n<br/>\nFrom then on, though, it was Espanola Elementary, Espanola Jr. High, Espanola <br/>\nHigh School.  We moved from the rental house to the house my parents bought, <br/>\nand didn&#39;t move.  We had the same dog.  We had the same neighbors (who are <br/>\nstill there).  <br/>\n<br/>\nWhen kids came to school, though, who had moved around, I always found a <br/>\nchance to talk to them about where they&#39;d been, what was different, what <br/>\ntheir first impressions of my same-old town were, etc.<br/>\n<br/>\nAlmost every single one said they wished they could be like me and stay put <br/>\nand have longterm friends and keep their rooms and people would know them and <br/>\nthey wouldn&#39;t be &quot;new.&quot;<br/>\n<br/>\nMaybe it&#39;s just six of one and half a dozen of the other.  <br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1509055,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Moving or staying in one place","postDate":"1030238758","msgId":41908,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMC4yLjEuMC4yMDAyMDgyNDE4MjE0MS4wMWY2Njk2MEBwb3AuaXNsYW5kbmV0LmNvbT4=","inReplyToHeader":"PGY2LjIwNDMwMjk0LjJhOTk3NzYwQGFvbC5jb20+"},"prevInTopic":41899,"nextInTopic":41917,"prevInTime":41907,"nextInTime":41909,"topicId":41899,"numMessagesInTopic":0,"msgSnippet":"... That it is.  You ve almost got me homesick.   Tia No one can make you feel inferior without your consent. Eleanor Roosevelt ","messageBody":"<div id=\"ygrps-yiv-2023424975\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt;I just spent my entire walk around my beloved neighborhood thinking about<br/>\n&gt;this.  It&#39;s especially topical right now as we&#39;re thinking of moving out of<br/>\n&gt;Berkeley, where my husband has spent his whole life and I&#39;ve spent all of my<br/>\n&gt;adult life, because my husband lost his job.<br/>\n<br/>\n<br/>\n<br/>\n&gt;Berkeley is so awesome in the fall.<br/>\n<br/>\n </span></blockquote>That it is.  You&#39;ve almost got me homesick.  &lt;g&gt;<br/>\nTia<br/>\n<br/>\nNo one can make you feel inferior without your consent.<br/>\nEleanor Roosevelt<br/>\n*********************************************<br/>\nTia Leschke<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a><br/>\nOn Vancouver Island</div>","specialLinks":[]},{"userId":78954203,"authorName":"warblwarbl@aol.com","from":"warblwarbl@...","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Moving or staying in one place","postDate":"1030233440","msgId":41899,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY2LjIwNDMwMjk0LjJhOTk3NzYwQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":41908,"prevInTime":41898,"nextInTime":41900,"topicId":41899,"numMessagesInTopic":0,"msgSnippet":"... I just spent my entire walk around my beloved neighborhood thinking about this.  It s especially topical right now as we re thinking of moving out of ","messageBody":"<div id=\"ygrps-yiv-1524311131\">Tuck wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Lots of people I know stay in the same place all their lives.  I don&#39;t <br/>\n&gt; understand it a bit.  <br/>\n<br/>\n </span></blockquote>I just spent my entire walk around my beloved neighborhood thinking about <br/>\nthis.  It&#39;s especially topical right now as we&#39;re thinking of moving out of <br/>\nBerkeley, where my husband has spent his whole life and I&#39;ve spent all of my <br/>\nadult life, because my husband lost his job.<br/>\n<br/>\nJust some random, and maybe a bit defensive, thoughts on this subject.  <br/>\nPeople who travel/move a lot get all the glory.  They have lots of <br/>\ninteresting tales to tell and broad experiences.  I&#39;m always sure that my <br/>\nsister-in-law, who hasn&#39;t stayed on one continent for more than about three <br/>\nmonths for the last decade or so, thinks Eric and I are boring.  And <br/>\nsometimes I feel boring.  But I&#39;m also proud of the roots we&#39;ve sunk.  We <br/>\nknow this place.  I walk in my neighborhood enough to recognize the cats, <br/>\nknow how this year&#39;s apricot crop compares to last, to know someone died in <br/>\nthat house not long ago.  We know lots of people here and when we meet new <br/>\npeople, there&#39;s often a connection to someone else we know.  That happens <br/>\nworldwide too, I know, but it happens more locally and it happens more the <br/>\nlonger I&#39;ve stayed in one place.  We have a sense of history.  We understand <br/>\na little about change.  In unschooling terms, we&#39;ve gone deeply into our <br/>\ntopic instead of doing Spain this month and Egypt next.<br/>\n<br/>\nI&#39;ve been thinking a lot about how the United States is almost entirely a <br/>\nnation of immigrants and movers.  Now I have complete support for those <br/>\nwho&#39;ve come here to escape oppression, and I don&#39;t even begrudge anyone for <br/>\nleaving the SF Bay Area because they can&#39;t afford the ridiculous housing <br/>\nprices for their growing families.  But it&#39;s interesting to think about the <br/>\nfact that most of us are descended from people who were willing to up and <br/>\nleave their families thousands of miles behind (and for most of U.S. history <br/>\nthat meant never seeing them again).  What does that say about what our <br/>\n&quot;family values &quot; really are?  What messages are we giving our children when <br/>\nwe move away from extended family for a promotion or bigger house?<br/>\n<br/>\nAnd what happens to our communities?  When people move frequently, it&#39;s hard <br/>\nto know, much less count on your neighbors.  I know that there are other <br/>\nfactors - two parents working, school, long commutes, scheduled lives - that <br/>\nplay into this, but the sense we have that people may only be here short term <br/>\nplays a role.  It also seems to me that all this moving may not be so <br/>\nadventurous after all because the more transient we&#39;ve become as a society, <br/>\nthe more the same different places have become.  There&#39;s hardly any local <br/>\nflavor left anymore; it&#39;s all Gap, Starbucks, McDonalds and Walmart.  We <br/>\ncan&#39;t just blame corporations for that.  Lots and lots of us clearly want <br/>\nthat safety and sameness, that comfort that people used to get from staying <br/>\nin one place and knowing generations from the same family.<br/>\n<br/>\nWe might still move (right now we&#39;re looking at Portland), but it&#39;s not going <br/>\nto be easy for this stick-in-the-mud.<br/>\n<br/>\nBerkeley is so awesome in the fall.<br/>\n<br/>\n-Pam Tellew<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":42259,"nextTopicId":42133}}