{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":90346753,"authorName":"Marey","from":"&quot;Marey&quot; &lt;la_chica_libre@...&gt;","profile":"lady_marey","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"NOT BACK TO SCHOOL CAMP 2002","postDate":"1017199907","msgId":33776,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTYwMWMxZDUzZiRlZDgyOWFlMCRmMGM1ZmVhOUBkZWZhdWx0Pg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":33775,"nextInTime":33777,"topicId":33776,"numMessagesInTopic":0,"msgSnippet":"Start your unschooling year with high hopes, new interests, a big bang, a loud splash, and a tribe of new friends! Don t miss the seventh annual Not Back to","messageBody":"<div id=\"ygrps-yiv-2080495441\">Start your unschooling year with <br/>\nhigh hopes, <br/>\nnew interests, <br/>\na big bang, <br/>\na loud splash, <br/>\nand a tribe of new friends! <br/>\nDon&#39;t miss the seventh annual <br/>\nNot Back to School <br/>\nCamp 2002 <br/>\nfor unschoolers ages 13-18. <br/>\nCamp Myrtlewood, Oregon <br/>\nBuffalo Gap Community Camp, West Virginia <br/>\nSession 1, August 26-September 2, Oregon <br/>\nSession 2, September 5-12, Oregon <br/>\nSession 3, October 8-15, West Virginia <br/>\n <br/>\njust the facts <br/>\n*                     what: Not Back to School Camp <br/>\n*                     who: About 105-115 unschoolers ages 13 to 18. An<br/>\nadult staff of 13-22, led by Grace Llewellyn and Taber Shadburne. <br/>\n*                     when: Session 1, August 26-September 2, Session 2,<br/>\nSeptember 5-12, Session 3, October 8-15. <br/>\n*                     where: Sessions 1-2, Camp Myrtlewood, approx. 120<br/>\nmiles from Eugene, Oregon, Session 3, Buffalo Gap, approx. 80 miles from<br/>\nCumberland, Maryland. <br/>\n*                     how much: $485. $25 additional if you register<br/>\nafter March 18, 2002. An additional fee (about $25) for an optional day<br/>\ntrip to the coast. 12 half-price scholarships and 5 work-trade<br/>\nscholarships are available. We also have some flexible, extra<br/>\nscholarship money which may be used for full scholarships, possibly even<br/>\ntravel stipends.  ***Updated Infomation: Grace and Maya need your help<br/>\nin getting a lot more registrations for<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nbtsc.org/wiki/NBTSC/18\">http://www.nbtsc.org/wiki/NBTSC/18</a>&gt; NBTSC East as soon as possible or<br/>\nwe will have to cancel that session. (oh no!) So we have a business<br/>\nproposition for you; for every person (can include yourself) you<br/>\nconvince to register for session 3 of<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nbtsc.org/wiki/NBTSC/18\">http://www.nbtsc.org/wiki/NBTSC/18</a>&gt; NBTSC in West Virginia, between<br/>\nmarch 19th and April 7th, we will give you a $25 credit towards your<br/>\ncamp fee.  &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nbtsc.org/wiki/AND/1\">http://www.nbtsc.org/wiki/AND/1</a>&gt; AND there is no limit to<br/>\nhow many credits you can get. So, if you get 20 people registered, you<br/>\njust paid your way to camp. If you are not coming to camp, well just<br/>\nmail you $25. To qualify for the credit, make sure you tell your session<br/>\n3 friend to let us know you referred them. The disclaimer: if we dont<br/>\nget enough registrations to make session 3 happen, nobody will get $25<br/>\ncredits. Go forth and proselytize!***  <br/>\n*                     why: To change ourselves and the world, teach each<br/>\nother great things, and sleep under the moon.... <br/>\n*                     how to reach us: P0 Box 1014, Eugene, OR 97440.<br/>\nPhone 541-686-2315. (If you have questions, our office hours are 9a.m.<br/>\nto 2 p.m. Mon and Wed., Pacific Time.) Fax 509-696-3310. Email<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:NBTSC@...\">NBTSC@...</a> <br/>\n*                     web site: www.nbtsc.org &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nbtsc.org/\">http://www.nbtsc.org/</a>&gt;  <br/>\n  _____  <br/>\n<br/>\nParents say: <br/>\n&quot;[My son] has never experienced such openness, such honesty and such<br/>\nloveand he is renewed. He feels accepted, uplifted, empowered and,<br/>\nabove all else, valued! Y ou are working magic at NBTSC.nurturing<br/>\nwings. I applaud you and thank you.&quot; <br/>\n&quot;My kids really love NBTSC and all of their new friends. It makes<br/>\nhomeschooling a lot less lonely for them when they meet a diverse group<br/>\nof open minded homeschoolers. Thank you for your part in helping my<br/>\nchildren achieve strength, confidence, and independence.&quot; <br/>\n&quot;I have seen so many of the Vancouver kids come back from camp with<br/>\nsubtle (or not so subtle) changes in maturity, confidence etc. I can&#39;t<br/>\nthank you enough for what you do by giving these kids the chance to be<br/>\ntogether and spread their wings like this.&quot; <br/>\n&quot;The camp was fabulous for [my daughter] and the kids were too -- very<br/>\ndifferent from her high school friends, in maturity, drive,<br/>\nself-assuredness, openness and vulnerability.&quot; <br/>\n&quot;Just a quick note of appreciation from a very pleased parent! I know<br/>\n[my son] had one of the best weeks of his life and he&#39;s had a lot of<br/>\nexcellent weeks in his 17 years back he comes from camp with a zillion<br/>\nnew friendshe promptly hooked us up to email and in the last 3-4 weeks<br/>\nhas written well over 100 letters!&quot; <br/>\n&quot;My son returned from your camp with renewed enthusiasm for life and<br/>\nlearning! Thank you so much for having this get-together of, apparently,<br/>\nsome of the most gifted and interesting people on earth!&quot; <br/>\n&quot;[Our daughter] returned to us full of self-assurance, excitement, and<br/>\npositive loving energy. The revelation that there are other teenagers<br/>\nout there with her unschooler ideas was a delightful awakening for her.&quot;<br/>\n<br/>\n&quot;I should tell you that [my son] had a wonderful time at NBTSC. It&#39;s<br/>\nresulted in some significant changes in how [he] approaches life, and<br/>\nhe&#39;s enthusiastic about going back next year.&quot; <br/>\n  _____  <br/>\n<br/>\nHello! <br/>\nThis booklet contains lots of information about Not Back to School Camp,<br/>\nso you can make an informed decision as to whether you want to join the<br/>\nruckus. We&#39;ve had a blast during our first six camp seasons and plan to<br/>\ndo so again in 2002! If you have questions, please check first to see<br/>\nwhether we&#39;ve already answered them in this booklet or on our website<br/>\n(www.nbtsc.org). If we haven&#39;t, feel free to phone, fax, write, or<br/>\nemail, and we&#39;ll get back to you ASAP. <br/>\nWho <br/>\nYou: Unschoolers/homeschoolers from anywhere on this planet are invited,<br/>\nif they speak English and are between the ages of 13 and 18. Can you<br/>\nstill come if you go to school part time? Or if you&#39;re not yet a<br/>\nhomeschooler, but are about to become one? Or if you&#39;ve &quot;graduated&quot; from<br/>\nhomeschooling and now attend college or hold a job? Or if you have<br/>\nsmelly feet? Sure. The maximum number of campers possible is about 105<br/>\nin Oregon, 115 in West Virginia. <br/>\nYour staff: Your hosts are Grace Llewellyn and Taber Shadburne. Grace is<br/>\nbest known as the author of The Teenage Liberation Handbook: how to quit<br/>\nschool and get a real life and education and the founder of NBTSC. Taber<br/>\nis a psychotherapist and personal growth workshop leader. He&#39;s worked at<br/>\nNBTSC since 1998 and this will be his third year co-directing. We will<br/>\nbe joined by a terrific staff of 11 in West Virginia, 20 in Oregon. <br/>\n(Non) religious orientation: NBTSC is a non-denominational,<br/>\nnon-religious camp. We strive to honor each person&#39;s religious beliefs<br/>\nor lack thereof, and ask that all campers do likewise. <br/>\nNot Back to School Camp welcomes diversity. We are open to homeschoolers<br/>\nand unschoolers of all races, ethnic backgrounds, genders, religious<br/>\nbeliefs, sexual orientations, economic backgrounds, and physical<br/>\ncapabilities. <br/>\nWhere <br/>\nSessions 1 and 2: We meet in Eugene, Oregon. Our buses will deliver you<br/>\nto our home for the week, and back to Eugene at the end of the week.<br/>\nCamp Myrtlewood is near the tiny town of Bridge, Oregon. It&#39;s about 120<br/>\nmiles Southwest of Eugene, in the coastal mountain range. <br/>\nSession 3: We meet in Cumberland, Maryland. As in Oregon, our buses will<br/>\ndeliver you to our camp home and then back to Cumberland again. Buffalo<br/>\nGap is nestled in the mountains near the tiny town of Capon Bridge, West<br/>\nVirginia. It&#39;s about 80 miles Southwest of Cumberland. (It&#39;s also just a<br/>\nfew hours&#39; drive from either Washington, Baltimore, or Pittsburgh.) <br/>\nLodging and facilities: You&#39;ll stay in a clean, simple cabin. Girls and<br/>\nboys have separate cabins; all ages are mixed together. Bathrooms are in<br/>\nseparate buildings a few yards away. Staff generally stays in separate<br/>\ncabins or rooms. Both sites have all the facilities we need for a great<br/>\nweek, plenty of room for eating, workshops, dances, games, sports,<br/>\nhiking, and enjoying nature. Camp Myrtlewood offers a pretty creek with<br/>\na swimming hole; Buffalo Gap offers a 2-acre spring-fed lake (with a<br/>\ndiving platform, sliding board, and sandy beach), a sauna, and 2 big<br/>\ndance halls (one is also a basketball gym). <br/>\nWeather: In both Oregon and West Virginia, chances are good we&#39;ll have<br/>\nwarm weather with coldish nights. It may rain a bit, particularly in<br/>\nOregonit often does, but we just keep on playing anyway. <br/>\nWhat We&#39;re Gonna Do <br/>\nSwim; talk; sing; drum; dance; hike; stare at the sky; play volleyball<br/>\nand softball and soccer; take creative, emotional, and intellectual<br/>\nrisks; encourage each other to do amazing things; have talent shows;<br/>\nteach and learn from each other. Each camper will be encouraged to<br/>\ncontribute both creatively (teach a workshop, lead a sport or group<br/>\nsinging, etc.) and not-quite-so-creatively (wash dishes, cut vegetables,<br/>\npick up trash, etc.). <br/>\nDaily schedule: Each day we have a morning meeting and a brief evening<br/>\nmeeting; everyone is required to attend both, during which important<br/>\nannouncements are made and campers and staff are able to raise concerns.<br/>\nEveryone is also encouraged, but not forced, to participate in evening<br/>\ngroup activities. And we share mealtimes, of course. Beyond this, there<br/>\nare many scheduled daytime activities, sports games, and workshopsled<br/>\nboth by staff and by you and your peers. You can choose among these<br/>\ndaytime activitiesor nap, talk with a new friend, or create your own<br/>\nfun. <br/>\nEvening events: are specialsometimes simple, sometimes elaborate... .a<br/>\ncampfire sing-along, talent shows, dancing, and other good stuff. <br/>\nWorkshopsa sampling: We&#39;ll have literally dozens of workshops to choose<br/>\nfrom during the week. They&#39;ll reflect the talents and interests of all<br/>\nstaff and campers. At previous camps, we&#39;ve had about 100 workshops per<br/>\nweek, including breakdancing, solar cooking, kung fu, orienteering,<br/>\nyoga, cob-oven building, web-page designing, surrealist games,<br/>\nco-counseling, VW engine fixing, drama, poetry, getting published and<br/>\nself-publishing, origami, art booklets, swing dancing, youth rights,<br/>\ntree identification, beading, and photography. You can decide each day<br/>\nwhat you want to do. We do offer a lot of really good workshops and we<br/>\nexpect that each of you will go home with new skills you&#39;re excited<br/>\nabout. But the point is not to be frantically busy, and it&#39;s fine if you<br/>\ndon&#39;t want to participate in lots of these organized activities. The sun<br/>\nand the forest will have plenty of suggestions of their own. <br/>\nYour workshop or sport: Each camper is strongly encouraged to lead a<br/>\nworkshop or coach/teach a game/sport. Most workshops run 1 to 1 continue<br/>\na discussion over lunch. You do NOT necessarily have to be an expert in<br/>\nyour field to teach a workshop. As many NBTSC campers have discovered,<br/>\neven if you are a beginner, you can be a good workshop teacher. If you<br/>\nneed supplies, we can provide basic art and office supplies, a boom box,<br/>\nsports equipment, and a few other items, but you will need to provide<br/>\nmost other materials. <br/>\nSports: We typically play volleyball, basketball, soccer, ultimate<br/>\nfrisbee, and softball. If there&#39;s another sport you want to play,<br/>\nvolunteer to start a game. <br/>\nUnscheduled activities: Most of the time you&#39;re free to make your own<br/>\nfun if you don&#39;t feel like participating in a group activity. You can<br/>\nswim whenever the swimming hole or lake is supervised, hike on trails,<br/>\ntalk with new friends, read, nap, swing, practice a new skill... <br/>\nShow and tell nights: Talent shows are a great highlight of camp. You<br/>\ncan play music, balance on a ping pong ball, dance, sing, show your<br/>\nartwork, do stand up comedy, turn cartwheels, juggle forks, tell us the<br/>\nwildest thing that ever happened to your family, swallow a sword, read<br/>\nyour poetry or a very short story, or just stand up and tell us what<br/>\nmakes you tick. You might consider getting up and performing or sharing<br/>\nsomething related to your workshop. You&#39;ll have up to 4 minutes if<br/>\nyou&#39;re going solo, or up to 7 minutes if you&#39;re in a group of 2 or more.<br/>\n<br/>\nStaff <br/>\nOur multi-faceted, caring, funny, altogether delightful staff is one of<br/>\nthe best things about NBTSC. They teach outstanding workshops and coach<br/>\nsports, lead group singing, facilitate discussions, cook great food, and<br/>\nthose who aren&#39;t exhausted sometimes stay up late and join in the<br/>\nafter-midnight revels. For the most part, our experience is that the<br/>\nstaff adores the campers and the campers adore the staff. <br/>\nAdvisors: One staff person will be your designated &quot;advisor&quot; during the<br/>\nweek. Although you are welcome to talk with any of us about concerns or<br/>\nquestions, this person is responsible for checking in with you<br/>\nregularly, making sure you&#39;re accounted for several times a day, etc.<br/>\nYou&#39;ll also meet briefly with your advisor (and about 10 other campers)<br/>\neach morning as part of our meeting, to check in, discuss concerns, ask<br/>\nquestions. <br/>\nFood <br/>\nThree yummy, simple vegetarian meals each day. Vegan alternatives for<br/>\npeople who request them in advance, and we can usually accommodate<br/>\nwheat-free diets too. People with numerous allergies or other special<br/>\ndiets may need to supply some or all of their own food. (In Oregon, we<br/>\nprepare our own food and use mostly organically grown ingredients. In<br/>\nWest Virginia, the Buffalo Gap staff will cook for us, and<br/>\nunfortunately, organic ingredients would knock the price tag of camp up<br/>\ntoo high. In future years we hope to jiggle the budget in order to<br/>\nprovide OG food there without raising camp fees.) <br/>\nmoney <br/>\nThe cost of NBTSC (including supplies, food, local transportation, staff<br/>\nsalaries, labor, lodging, overhead, etc.) is $485 per person. The camp<br/>\nfee includes just about everything: travel from and to Eugene or<br/>\nCumberland, hearty meals, lodging, almost all activities. (Some campers<br/>\nor staff may plan workshops with a small additional materials fee, and<br/>\nwe&#39;ll offer an optional day trip which will require a $25 transportation<br/>\nfee. In Oregon, our field trip goes to the coast; we&#39;ll let you know our<br/>\nWest Virginia destination later.) You&#39;ll also receive a directory of all<br/>\ncampers and staff, and a &quot;bliss book&quot;a zine full of notes on workshops<br/>\nand other stuff people feel passionate about. <br/>\nPlease register (with a deposit) by March 18. After that date, your cost<br/>\nincreases by $25. You may want to register much sooner to get into the<br/>\nsession of your choice. A $75 non-refundable deposit is due with your<br/>\nregistration. The balance is due 6 weeks before the start of camp, and<br/>\nit is very important that you get it in on time. If your balance is not<br/>\nreceived on time, we will add a $25 late fee, and if it&#39;s not in one<br/>\nmonth before camp starts we&#39;ll have to drop you from the roster and give<br/>\nyour spot to someone else. If your plans change, the balance (if paid<br/>\nearly) can be refunded up until 6 weeks before camp starts. If you<br/>\nprefer, you are welcome to pay the whole camp fee at the time of<br/>\nregistration. <br/>\nAbout refunds: While in the past we had a strict policy of not giving<br/>\nrefunds of deposits at all, and not of other camp funds past a certain<br/>\ndate, we now charge enough money for camp that we generally cover all<br/>\nour costs when all sessions of camp are full, and are therefore able to<br/>\ngive partial refunds in some cases. In a nutshell: we do not give ANY<br/>\nrefunds until after camp is over. At that point, we will give refunds in<br/>\nthis priority: <br/>\n1.                  anyone who got contagiously sick enough at the last<br/>\nminute that we asked them not to come to camp gets a refund of all but<br/>\n$40 of their camp fees. (We may require a written and signed statement<br/>\nfrom a healthcare provider. And, sorry, but we are talking only about<br/>\ncontagious diseases here, not broken legs or non-contagious illnesses.) <br/>\n2.                  if all sessions of camp were full, then we may give<br/>\nsome partial refunds with priority going to people who canceled<br/>\nearliest. We will always retain a $40 processing fee, but at our<br/>\ndiscretion may refund everything else, including the initial deposit. Be<br/>\nsure to make a written request (email or fax is fine) if you want a<br/>\nrefund; otherwise we will keep your full deposit or camp fees and use<br/>\nthem for miscellaneous camp expensesor, if there are none, your fees<br/>\nwill go into our scholarship fund. <br/>\nScholarships and work trade positions: We offer 12 half-price<br/>\nscholarships for families who couldn&#39;t otherwise afford NBTSC. Also, we<br/>\nhave 5 work-trade positions available. These, too, are for families who<br/>\nwould otherwise have trouble paying for camp. If you&#39;d like an<br/>\napplication for either a scholarship or work-trade, send a SASE to our<br/>\noffice or see our website. We may have a few additional scholarships<br/>\navailable also, of varying amounts, thanks to our new scholarship fund<br/>\n(see below). The deadline to apply for these scholarships is March 18,<br/>\n2002. However, we may also have some additional scholarship money<br/>\navailable after that point. <br/>\nFundraising: People earn camp money in all kinds of waysone girl sells<br/>\ncandy in her yard, right after the nearby school gets out in the<br/>\nafternoon, while kids are walking home. Some people get jobs. One girl<br/>\nearned all of her 1999 money by playing her violin on street corners.<br/>\nYou could also ask for a group of your friends and relativesor your<br/>\nlocal homeschool support groupto sponsor you, spreading the cost among<br/>\nlots of people. <br/>\nSome people earn money by selling copies of Grace&#39;s books (The Teenage<br/>\nLiberation Handbook, Real Lives, and Freedom Challenge) to friends,<br/>\nrelatives, school friends, local homeschoolers, whoever. (Several<br/>\ncampers have sold over 50 copies of the TLH to their friends.) You earn<br/>\napproximately 35%, or $6-$6.60, for each copy. Contact us for more info.<br/>\n(Sorry, but Genius Tribe book fairs are no longer an option, since the<br/>\nGenius Tribe catalog is going extinct.) <br/>\nDonating to our tax-deductible scholarship fund!!! <br/>\nThanks to the Self-Education Foundation, you or your parents or your<br/>\nfairy godfathers can give money that will be in turn given to people who<br/>\ncouldn&#39;t otherwise afford to come to camp. This fund is in addition to<br/>\nour standard practice of offering a set number of half-scholarships and<br/>\nworktrades each year. With this fund, we do whatever feels most<br/>\nappropriatein one case that means contributing $100 to someone&#39;s camp<br/>\nfees; in another case it could mean a full scholarship plus a $200<br/>\ntravel stipend. Please consider giving to this fund, or asking other<br/>\npeople to, now or in the future. (We know a lot of you are gonna get<br/>\nrich 10 or 20 years from now, and we hope that when you do, you remember<br/>\nyour good old alma mater in your hearts and your wills and your<br/>\ncheckbooks.) <br/>\nTo support this fund, please make out your check to the Self Education<br/>\nFoundation and mark in your check&#39;s memo line (or in an accompanying<br/>\nnote) that the money is specifically for the NBTSC scholarship fund.<br/>\nMail to us or to the Self Education Foundation, P.O. Box 30790,<br/>\nPhiladelphia, PA 19104. Thank you!!! <br/>\nThe Self-Education Foundation, by the way, is a fantastic philanthropic<br/>\norganization. (It was founded by Billy Wimsatt, who was a NBTSC staffer<br/>\nin &#39;96 and &#39;97 and is the author of Bomb the Suburbs and No More<br/>\nPrisons, 2 of Grace&#39;s favorite books. And I, Grace, serve on its board.)<br/>\nIt works to build and support a cohesive movement, across cultures and<br/>\ndisciplines, of people initiating their own education. It funds,<br/>\nsupports, and networks unschoolers and education mavericks from tough<br/>\nbackgrounds who have added barriers to successfully educating<br/>\nthemselves, their kids, their communities, and the world. For more info,<br/>\ncheck out www.selfeducation.org. <br/>\nYou should also know that another source of scholarship donations is our<br/>\nbeloved NBTSC stafferseach year one or two staffers give up some or all<br/>\nof their pay, and it goes directly toward camp scholarships instead. <br/>\nThe Fine Print <br/>\nResponsibilities: Each person contributes to the spiffiness of camp in<br/>\ntwo major ways: <br/>\n1) fun, possibly creative work which draws on your unique talents. Each<br/>\nof you will be asked to coach a game or sport, lifeguard for an<br/>\nafternoon at the swimming hole, teach a workshop, lead the singing<br/>\naround the campfire one night, or some such. <br/>\n2) You&#39;ll get to perform a few grungy, possibly even disgusting menial<br/>\nchores too! We help prepare meals, clean up after them, keep the<br/>\nbathrooms clean, and clean our cabins before we leave. You may have to<br/>\nscrub a toilet or 2, but hey, you&#39;ll have partners and you can whistle<br/>\nwhile you work. Each camper has about 4-5 hours of chores during the<br/>\nweek. <br/>\nTravel arrangements: You can fly, drive, train, bicycle, or bus into<br/>\nEugene or Cumberland. (In Oregon, some people fly into Portland and then<br/>\ntake the bus or train down to Eugene. In West Virginia, you may find it<br/>\ncheaper to fly into Pittsburgh, Baltimore, or Washington DC and then<br/>\ntake the bus or train from there.) In both Oregon and West Virginia, our<br/>\nbuses will pick campers up at the Greyhound bus depot, the Amtrak train<br/>\nstation, the airport, and a city park. On our last day, we&#39;ll return you<br/>\nto your pick of those same locations. You should arrive by 2:30 if<br/>\npossible, and 4:00 at the absolute latest. On our last day, you should<br/>\narrive back in Eugene or Cumberland by noon. You can also drive<br/>\nyourself, or have someone else drive you, directly to Camp Myrtlewood or<br/>\nBuffalo Gap. If you have a car with you during the week, you absolutely<br/>\nmay not drive itno matter how old you areand must turn your keys over<br/>\nto us until camp is over. <br/>\nEugene has a small commercial airport serviced by several major airlines<br/>\nincluding United; many campers fly into Eugene directly. Others fly into<br/>\nPortland, 100 miles north, and then take the bus or train down to<br/>\nEugene. Cumberland has a smallish airport serviced by US Airways<br/>\nExpress, with frequent flights in from Pittsburgh. You may want to fly<br/>\ninto a larger nearby airport (such as Pittsburgh, Dulles, or Reagan) and<br/>\ntake the bus or train from there. <br/>\nIf you can&#39;t arrive early enough on the first day, or leave late enough<br/>\non the last day, we can make arrangements for you to stay in a hotel<br/>\nroom with other campers and a staff person; cost will be approximately<br/>\n$35. Please do not take advantage of this offer unless your travel<br/>\nschedule really requires it! It is a pain for us to supervise hotel<br/>\nrooms and play taxi. Be aware that hotel rooms will probably be<br/>\nsupervised (at least in the past, the hotel we have worked with has<br/>\nrequired that) and we will enforce a curfew. <br/>\nA logistical note for people attending both sessions 1 and 2: You may<br/>\neither ride the buses back to Eugene in between the two sessions, or for<br/>\nabout $80 you can stay at Camp Myrtlewood for the 3 extra nights. If you<br/>\ndo, you&#39;ll need to do some chores, be mellowstaff will be in long<br/>\nmeetings and deep comasand move temporarily into a different cabin.<br/>\nYou&#39;ll have a chance to do laundry and we&#39;ll feed you. If you go back to<br/>\nEugene, you&#39;re on your ownsorry, but we can&#39;t help you make hotel<br/>\narrangements or provide any transportation except for the bus ride from<br/>\nand to camp. <br/>\nIf you have special needs: Both Camp Myrtlewood and Buffalo Gap can<br/>\naccommodate wheelchairs, though like any outdoor setting they can pose<br/>\nchallenges to anyone (including people in &quot;normal&quot; physical condition).<br/>\nEducate us about your needs, and we&#39;ll do our best to make your week<br/>\ncomfortable, safe, and exciting. <br/>\nHealth and safety: There is no camp nurse or other medical person on<br/>\nstaff. There will, however, be at least one staff person trained in<br/>\nfirst aid and CPR. In case of emergency, you will be taken by ambulance<br/>\nto the nearest hospital (approximately 45 minutes away). You must<br/>\nbasically be responsible for your own health, bring any (regular)<br/>\nnecessary medications with you, etc. Your camp fee does include<br/>\ninsurance for accidents/injuries that take place on the camp grounds. <br/>\nWhat if you get sick when it&#39;s time to come to camp? <br/>\nDepending on how sick you are and what you have, we may ask you not to<br/>\ncome. We will consider on a case-by-case basis whether people who are<br/>\nalready sick (and contagious) should attend. If we ask you not to<br/>\nattend, we will give you a refund of all your money, minus a $40<br/>\nprocessing fee. (Before sending the refund we may request that you send<br/>\na signed statement from a healthcare provider.) <br/>\nMore information later <br/>\nIn approximately June 2002 you&#39;ll receive a handbook which includes a<br/>\nlist of what to bring and plenty of other information to help you<br/>\nprepare for and get the most out of camp. In the meantime, hang onto<br/>\nthis booklet. <br/>\nAnswers to questions some people ask, or are gonna ask <br/>\nWhy can&#39;t each session of NBTSC be longer? <br/>\n1) Because that would make it too expensive for many people. <br/>\n2) Because that would make it harder to find staff (many staff people<br/>\ncome to <br/>\nNBTSC on their vacations). <br/>\n3) Because the staff gets tired and needs a break. <br/>\nWhy is NBTSC vegetarian? <br/>\nWe do not intend to make any kind of moral or political statement about<br/>\ndiet. NBTSC staff includes vegetarians, vegans, and carnivores. Your<br/>\nco-directors, Grace and Taber, have at different times in their lives<br/>\nbeen vegetarians, vegans, raw foodists, and carnivores. But for our<br/>\npurposes at camp, meat is both too expensive and too unsanitary. We are<br/>\nsticklers about providing healthy, mostly organically grown ingredients<br/>\nwhenever possible, and organic and chemical-free meat is way expensive.<br/>\nAlso, because many campers are vegetarian, our vegetarian menu helps us<br/>\nto satisfy the largest number of people without preparing a ton of<br/>\ndifferent dishes at each meal. You are welcome to bring your own meat<br/>\nsupplements (jerky, tuna in cans, dried fish, etc.) if you want. (At<br/>\nBuffalo Gap, our meals will not be prepared by NBTSC staff, and will not<br/>\nbe mostly organic, at least not in 2002.) <br/>\nHow will the West Virginia camp be different from the Oregon camp? <br/>\nWe have a big swimming lake rather than a sweet little creek (though in<br/>\nOctober, some of us may feel a little borderline about swimming). There<br/>\nare more (and larger) indoor spaces available to us. Their staff will be<br/>\ncooking for usthey&#39;ll serve vegetarian and vegan meals (they won&#39;t,<br/>\nunfortunately, have much in the way of organic ingredients). Hopefully,<br/>\nwe&#39;ll attract more east coast folks. And, of course, there&#39;ll just be<br/>\nthe adventure of a new place. <br/>\nRules <br/>\nFor people who have attended NBTSC in the past: this year we will be<br/>\nmaking a sincere effort to simplify our rules and agreements. No, this<br/>\ndoesn&#39;t mean that now it is ok for people to walk on the tables; it does<br/>\nmean that we will convey some of our expectations in other ways besides<br/>\nrules. <br/>\nAn overwhelming number of past campers have commented that with our<br/>\npolicies and attitudes they felt free, trusted, and yet safe and well<br/>\ncared for. The rules we do have are very importantdesigned to protect<br/>\neveryone&#39;s safety and peace, and to ensure that we can continue to have<br/>\nNBTSC, yet without limiting freedom unnecessarily. Please do be aware<br/>\nthat for any serious rule infractions, we always contact parents. Our<br/>\npast experience has been that for the most part, we get along superbly<br/>\nand people respect each other and the rules. <br/>\nOur rules are relatively lax compared to those of most other camps and<br/>\nyouth activities. In particular, we have very few required activities on<br/>\nthe schedule, and we do not have a set bedtime or require you to sleep<br/>\nin your assigned bed. Instead, we ask you to use your time well<br/>\naccording to your own values, and we ask you to create, and then use, a<br/>\n&quot;bedtime policy&quot; that serves your own particular needs and goals at<br/>\ncamp, and regardless of where you sleep, we expect you to honor our &quot;no<br/>\nsex at camp&quot; rule. <br/>\nWe often refer to our rules as agreements. Camp is not something we, the<br/>\ngovernment, your parents, or your friends require you to doit is<br/>\nsomething you choose to do. (In fact, our first and most important rule<br/>\nis that you cannot come to camp unless it is your own free choice to do<br/>\nso.) In choosing to be there, we expect you to agree to act in the way<br/>\nthat we ask you to, in order to help co-create the best possible camp<br/>\nfor you and everyone else. <br/>\nan important note for parents and campers <br/>\non bedtimes and sleeping arrangements <br/>\nWe want to clarify a few things in light of some questions and concerns<br/>\nexpressed by parents, and in light of some (rather different) questions<br/>\nand concerns expressed by campers. We have carefully considered and<br/>\nreconsidered our goals for camp, and at least for 2002, this is where we<br/>\nstand: <br/>\nAs in the past, we do not plan to enforce a bedtime at camp. We will<br/>\ncontinue to require lights out/quiet in cabins from midnight to 8 a.m.,<br/>\nbut allow people to stay up later in the lodge, at the campfire circle,<br/>\netc. <br/>\nWe do, however, ask each camper to write up a personal policy that they<br/>\nwill use to determine when to go to bed each night, based on what they<br/>\nunderstand about themselves and what is important to them during the<br/>\ncamp week. This is a new program, which we started in 2001; it was very<br/>\neffective at Session 1, and somewhat effective at Session 2. (We didn&#39;t<br/>\nwork so hard to convey its importance at Session 2, largely because it<br/>\nwent so well Session 1 that we wrongly assumed we didn&#39;t need to work at<br/>\nit for Session 2.) We do this because while we don&#39;t want to<br/>\nunnecessarily limit freedom, we do want campers to take good care of<br/>\nthemselves and get enough sleep. And, we want to encourage more<br/>\nparticipation in daytime workshops and activities. <br/>\nAlso (and as in the past), we do not plan to require campers to sleep in<br/>\ntheir assigned beds. (We don&#39;t allow girls in boys&#39; cabins or vice<br/>\nversa, though.) Most campers sleep in their beds most of the time. Some<br/>\ncampers, however, sleep in groups (which are often mixed-gender) in<br/>\npublic spaces or outside. Sometimes these groups are affectionate and<br/>\ncuddly. To be a little more blunt, at times they are just heaps of<br/>\npeopleto those of us on staff, they sometimes look quite uncomfortable.<br/>\nWhile we firmly expect campers to observe our &quot;no sex at camp&quot; and &quot;no<br/>\nnudity&quot; rules (and initiate plenty of dialogue when that seems called<br/>\nfor), we do not police these groups. Our observation (borne out by many<br/>\ncandid reports from individual campers) is that while occasionally there<br/>\nis some mildly sexual behavior, by and large these &quot;people piles&quot; are<br/>\ninnocent. We feel that while they do make it possible for people to bend<br/>\nthe rules, there are other ways for people to bend the rules who have<br/>\ndecided to do so, and that to tighten our policy in this regard would be<br/>\nmore of a detriment than a benefit to camp and campers. <br/>\nBecause we know that some campers may not be fully ready to make their<br/>\nown healthiest choices about this (and other) matters, and because as<br/>\nparents you know your kids better than we do, we suggest that you talk<br/>\nabout this subject as a family, and perhaps clarify your own<br/>\nexpectations or agreements independently of camp rules and policies. In<br/>\nother words, we do stand behind the rules that we set, and take<br/>\nreasonable steps to ensure that they are followed, but we cannot be<br/>\nresponsible for making sure that your kids behave the way that you think<br/>\nis best for them. <br/>\nIn the past, we have swung to different sides of the pendulumtightening<br/>\nthings up at parents&#39; requests, then seeing (and hearing from campers)<br/>\nthat we&#39;ve caused more harm than good, preventing innocent affection<br/>\nmore than anything else, and so swinging back to a looser stance. We&#39;re<br/>\nhoping to strike a better balance, in part by asking youthe parentsto<br/>\nget involved by having your own family discussions. (It might also be<br/>\nhelpful for you to talk, as a family, about what kind of a bedtime<br/>\npolicy might work best. In our spring mailing we will include some<br/>\nexamples of policies that worked well in 2001.) <br/>\nGrace says: If your family runs into road blocks in negotiating this<br/>\nterritory (or any other, for that matter), or you simply want some help<br/>\nin creating a win-win agreement, I&#39;d highly recommend a phone<br/>\nconsultation with Taber Shadburne, my co-director. He&#39;s a<br/>\npsychotherapist and family counselor who specializes in this sort of<br/>\nthing and I think he&#39;s about as skilled and insightful as they come. If<br/>\nmoney is an issue, he may be able to work out a discount or partial<br/>\ntrade or some such. You can reach him at 510-336-3391, or<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HeyTaber@...\">HeyTaber@...</a>. <br/>\nOne more note. Our experience at camp has always been that most campers<br/>\nare extremely maturethat is, cooperative, beyond the need to rebel for<br/>\nrebellion&#39;s sake, and kind and empathetic to staff as well as to each<br/>\nother. When we envision our policies at future camps, it is always with<br/>\nthis kind of maturity in mind. In the unlikely event that we ever find<br/>\nourselves with a different quality of camp community, we will need to<br/>\nshift the way we do things. We are committed to creating the best<br/>\npossible balance of freedom and caretaking, given the particular group<br/>\nof human beings that we find ourselves serving. <br/>\n  _____  <br/>\n<br/>\nCampers say: <br/>\n&quot;I feel genuine kinship and community here. I&#39;m going back to my usual<br/>\nhome with feelings of hope and inspiration and a clearer vision for my<br/>\nhorizons.&quot; <br/>\n&quot;Wonderful people, and everyone following their bliss. Camp is an<br/>\nenergizing bath of joyful energy that left me full of awe and<br/>\ninspiration for my own life.&quot; <br/>\n&quot;Camp was one of the most inspiring and purifying experiences I&#39;ve ever<br/>\nhad. It makes me hungry for life again.&quot; <br/>\n&quot;This camp was by far the best thing that ever happened to me.&quot; <br/>\n&quot;The only thing I don&#39;t like about camp is leaving at the end. I mean I<br/>\nknow that we have to leave at some point, but I wish we didn`t. I just<br/>\nlove camp that much.&quot; <br/>\n&quot;I had never been in such a big group of people that were so open,<br/>\nnonjudgmental, loving, honest, and just wonderful to be around! The<br/>\nenergy of it all was so incredibly awesome! It was the best experience I<br/>\nhave ever had.&quot; <br/>\n&quot;I will definitely be coming back next year and for both sessions!!! I<br/>\nhad the time of my life at NBTSC!&quot; <br/>\n&quot;1 just want to let you all know how much of a great time 1 had at camp.<br/>\nI really think the people at camp were the most open, loving, fun and<br/>\nsupportive group of young adults. Thank you all for the things I learned<br/>\nat camp. I really, really, really want to be there next year!&quot; <br/>\n&quot;Overall, I think this was the best week of my life. The energy of<br/>\nvibrant, thinking, life-loving people is the most intensely powerful<br/>\nthing I can imagine.&quot; <br/>\n&quot;Camp is good for me. It&#39;s good for my spirit. It totally rejuvenates<br/>\nme, and inspires me. This is partly who Jam, camp affects everyone a<br/>\nlittle differently, of course. Don`t send your kid here thinking they&#39;ll<br/>\ncome home some kind of superkid. Camp isn`t for the parent. It`s for the<br/>\nkid. It&#39;s an experience they won`t forget. But everyone processes<br/>\ndifferently, and every kid may NOT come home totally inspired. The<br/>\nmajority will, I suppose....&quot; <br/>\n&quot;Never before has a camp had such an effect on me as this one. I was so<br/>\nat peace with myself and others, it was incredible. I never wanted to<br/>\nleave.&quot; <br/>\n&quot;This camp gives you the feeling that no matter who you are or wherever<br/>\nyou re from, you will always be welcome!&quot; <br/>\n&quot;Camp has been the best three weeks of the last three years of my life.<br/>\nSome of my very favorite people are the people I&#39;ve met here in the last<br/>\nthree years.&quot; <br/>\n&quot;Every year it continues to amaze me how so many wonderful, accepting<br/>\npeople there really are. I&#39;ve made more lasting friends at camp than in<br/>\nthe whole rest of my life put together.&quot; <br/>\n&quot;I&#39;m writing to say again how thrilled lam with camp. You get together<br/>\nsuch a great group of wonderful, talented people. I&#39;m really amazed at<br/>\nyour ability to make it work so well.&quot; &quot;I feel like a different and<br/>\nbetter person! I haven`t even fought with my sister who also went to<br/>\ncamp. Or my other siblings for that matter.&quot; <br/>\n&quot;Camp is the high point of my unschool year. Each time I make new<br/>\nfriends, learn new things, and leave with a beautiful feeling.&quot; <br/>\n&quot;To be at NBTSC is a life changing experience. It sounds like a cliché<br/>\nbut it&#39;s never been more genuine than in this case.&quot; <br/>\n&quot;This was the funnest camp I&#39;ve ever been to and everyone was so nice!&quot; <br/>\n&quot;Not Back to School Camp has consistently and persistently demanded that<br/>\nI try new things and challenge the way I look at the world. I have come<br/>\nacross so many amazing people with amazing talents, I think I have a new<br/>\nfamily of 120 people!&quot; <br/>\n&quot;I was thrilled by everything: the idea, the staff the campers, the<br/>\nopenness, the inspiration that lasts all year. Thank you.&quot; <br/>\n&quot;Like last year, I came home totally inspired. 1 feel like the days are<br/>\nnot long enough for all the things I want to learn/study now. 1 feel<br/>\nlike I can change the world. I know I can change the world. 120 campers<br/>\nand advisors felt the same way that week, I think, and many of them have<br/>\ncarried that feeling home. It was worth every bit of money and time, I<br/>\nlove camp. I highly recommend it, especially to those who are wondering<br/>\nif they&#39;re doing the right thing and to those who feel apathetic and<br/>\nunenthusiastic about learning, life, whatever. There is a joy in life at<br/>\ncamp. A warning however: you can&#39;t get much out of camp if you don&#39;t put<br/>\nmuch in. The more you participate in things, try talking to new people,<br/>\nand explore, the better time you will have. And personally, I find that<br/>\nby the end of camp, what energy I put into being there has come back,<br/>\nmultiplied, a hundredfold.&quot; <br/>\n&quot;This camp totally changed my life. I feel confident and proud to walk<br/>\nthe path I chose.&quot; <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":33748,"nextTopicId":33778}}