{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":74604204,"authorName":"ddzimlew@juno.com","from":"ddzimlew@...","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"More stuff.","postDate":"1017422476","msgId":5936,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwMzI5LjEwMjEyMy4tMzE2NTMuMTAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":5935,"nextInTime":5937,"topicId":5936,"numMessagesInTopic":0,"msgSnippet":"There s more.  My husband asked at the local furniture store when their shipment of new stuff comes in.  He made arrangements for Dylan to be there and they","messageBody":"<div id=\"ygrps-yiv-874213461\">There&#39;s more.  My husband asked at the local furniture store when their<br/>\nshipment of new stuff comes in.  He made arrangements for Dylan to be<br/>\nthere and they watched and helped assemble some of the pieces.  There<br/>\nwere bookshelves and bunk beds and coffee tables.  They had a good time. <br/>\n<br/>\nWe also watched while a house was lifted off it&#39;s foundation in<br/>\npreparation to be moved.  If you hang around with a cooler full of soda,<br/>\nyou&#39;d be surprised at how many of the crew will come over and talk to you<br/>\nabout what&#39;s going on.  <br/>\n<br/>\nWe butted in on the city crew when they were cutting down dead cottonwood<br/>\ntrees two weeks ago on our street.   Dylan got to climb on the front end<br/>\nloader.  They wouldn&#39;t let him be on it when it was running, but when<br/>\nthey shut down, he got to check out the dump truck, too.  <br/>\n<br/>\nThe ranchers Arga supply gets a load of corn every other day and we can<br/>\ngo watch it be unloaded from the trains any time we like.  They&#39;ll take<br/>\nkids around on tours if they&#39;re not busy and this year one of the guys<br/>\ncalled Dylan when the baby ducks and chicks were hatching so we got to<br/>\nwatch that. <br/>\n<br/>\nWe are lucky in this way to be in a small town because not too many<br/>\npeople here think about or worry about insurance liability.   I still<br/>\nthink it&#39;s possible in other places, if you just go and ask, on the spot,<br/>\nnot giving them time to think of the other stuff.  It&#39;s more fun that way<br/>\ntoo.<br/>\n<br/>\nThere are folks with rock shops and jewelry making businesses that love<br/>\nto talk to kids.<br/>\n<br/>\nThere are usually people in any town who have small engine repair shops<br/>\nor small appliance repair shops, sometimes in their home or garage and<br/>\nthey are usually not so busy that they can&#39;t stop and talk.  Dig out some<br/>\nold broken radio and go.  Ask if your kids can watch them take it apart. <br/>\n Or just let the kids have it and do whatever.  <br/>\n<br/>\nDylan has taken apart all kinds of things. ( some things we didn&#39;t<br/>\nactually want him to!  )  One homeshooling boy here learned about<br/>\ncomputers this way, collecting old dead ones from people he knew and<br/>\ndissecting them.  <br/>\n<br/>\nWe were looking for a piece of brass to use as a kick plate on an old<br/>\ndoor.  No one had brass that size but the adventure of checking out all<br/>\nthe recycling places and metal working shops was wonderful.   We finally<br/>\nthought about a trophy shop and found a piece just the right size.  We<br/>\nalso got to watch while they cut different pieces of brass and while<br/>\nthings were being engraved and the guy gave Dylan an old book about how<br/>\ntrophy&#39;s are made, and some little scraps of copper and brass and some<br/>\nblocks of wood.  I don&#39;t know what he&#39;ll do with them but I&#39;m sure he&#39;ll<br/>\nthink of something.  <br/>\n<br/>\nDeb</div>","specialLinks":[]}],"prevTopicId":5868,"nextTopicId":5679}}