{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Valerie","from":"&quot;Valerie&quot; &lt;valfitz@...&gt;","replyTo":"LIST","senderId":"AD-kZcwzKfL-vPeoCx2Tjfu5okqKpy5nUQVZRCpEycbGsvNPNmwZI5EgnE2AOSXFcNSDMTbpvgqERpmJ4JoRf4xKcdQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Developing Genius Abilities (long) from education article","postDate":"989551564","msgId":21111,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlkZm00YytsZGZwQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":21110,"nextInTime":21112,"topicId":21111,"numMessagesInTopic":0,"msgSnippet":"Spirit of Ma at Vol 2 May 2001 Bronnikov Update Developing Genius Abilities by Kostya Kovalenko In October, we reported on the work being done in the","messageBody":"<div id=\"ygrps-yiv-529457269\">Spirit of Ma&#39;at Vol 2 May 2001 <br/>\nBronnikov Update Developing Genius Abilities by Kostya Kovalenko<br/>\nIn October, we reported on the work being done in the former-Soviet <br/>\nUnion in the development of superpsychic powers for those who really <br/>\nneed them (see The Bronnikov Method: Teaching Blind Children to See). <br/>\nAs we might suspect, Bronnikov&#39;s work extends far beyond this single <br/>\napplication. It also involves &#39;&#39;the preservation of genius qualities <br/>\nin the child,&#39;&#39; and the development of those qualities in older <br/>\nchildren and adults.<br/>\nThe heart of Bronnikov&#39;s teaching is what he calls the &#39;&#39;inner <br/>\nbiocomputer.&#39;&#39; In Bronnikov&#39;s view, we do not teach ourselves <br/>\ninformation. Rather, we program our inner biocomputer to absorb the <br/>\ninformation, then we simply access it as needed.<br/>\nAnd the biocomputer, in Bronnikov&#39;s view, is able to access all of <br/>\nthe information in the universe. This accords with what Western <br/>\nspiritual sources have long believed about the Akashic Records as a <br/>\nstorehouse of all knowledge and all history in the universe, <br/>\navailable to each one of us - if only we knew how to access it. What <br/>\nis so unbelievable about Bronnikov&#39;s approach is that he has <br/>\napparently developed practical, repeatable methods for teaching <br/>\nanyone at all how to achieve this feat of accessing knowledge <br/>\ndirectly. He is proving that anyone who chooses to take the time to <br/>\nlearn how can tap into the Akashic Records at will.<br/>\nSpirit of Ma&#39;at reporter Kostya Kovalenko, who lives in Kiev near <br/>\nBronnikov&#39;s native Feodosia, has stayed close to this story. Here, he <br/>\ntells us more about the work that is being done by this amazing man.<br/>\nNew Education<br/>\nViacheslav Bronnikov has created an international project <br/>\ncalled &#39;&#39;Informational and Social Ecology for the 21st Century.&#39;&#39; He <br/>\nand his colleagues are working in several directions, and one of them <br/>\nis &#39;&#39;new education.&#39;&#39; Several base programs have been developed in <br/>\nthis area.<br/>\n&#39;&#39;Minus One Year,&#39;&#39; for example, deals with pre-birth informational <br/>\ndevelopment! Using this system, parents begin working with their <br/>\nchild even before it is born, and learn to follow their child&#39;s in <br/>\nutero development.<br/>\nAnother direction of Bronnikov&#39;s work is in pre-school education. The <br/>\nchild, in Bronnikov&#39;s understanding, is so close to the Divine at <br/>\nthis age, so complete, that developing genius is simply a question of <br/>\npreserving the qualities that are already present - instead of <br/>\ndeforming our children by our ways of bringing them up.<br/>\nA third direction that Bronnikov&#39;s work has taken involves a proposed <br/>\nnew type of school for developing the qualities of genius in older <br/>\nchildren and adults. Such schools make it possible for children and <br/>\nadults to go beyond the standards set by society. Teachers, instead <br/>\nof communicating their own ideas to students, would be &#39;&#39;looking into <br/>\nthe mysteries of the Divine plan, and fulfilling it.&#39;&#39;<br/>\nThe Inner Biocomputer<br/>\nTeachers and students in a Bronnikov school are allies. Together, <br/>\nthey train the inner biocomputer, and that, in its turn, does the <br/>\nactual learning, providing knowledge upon request. The role of a <br/>\nteacher in this case is a combination of analyst, mediator, and <br/>\nsomething like the conductor of an orchestra.<br/>\nBronnikov&#39;s new school format fosters a relationship between teacher <br/>\nand student based on this &#39;&#39;biocomputer&#39;&#39; model of the brain. It&#39;s <br/>\nalso based on advances in what he calls &#39;&#39;virtual psychology,&#39;&#39; <br/>\nwherein the Self is seen in a spiritual light - that we all are <br/>\nbeings with access to all knowledge, everywhere, and that we are here <br/>\non Earth for a purpose. One of the results of attending a Bronnikov <br/>\nschool is reportedly that students, through working with the levels <br/>\nof mind that this work taps into, are able to realize their life&#39;s <br/>\nmission at a very early age.<br/>\nBronnikov has achieved unique results in working with his students. <br/>\nIn Moscow alone, his methods have been taught to more than 2,500 <br/>\nchildren, with about 500 people going through the first three stages <br/>\nof the course. Some children are even being taught the new methods in <br/>\nSunday school. Students of a school that opened its doors last <br/>\nSeptember already are far exceeding the test scores of those in other <br/>\nschools, while having a more active social life - and seeing the <br/>\nworld around them in a new light.<br/>\nAt the new Special Center for Social Ecology Of Human Informational <br/>\nEvolution at Moscow State University for Service, students in the <br/>\nsociology and social services department are now being offered a <br/>\nBronnikov course entitled &#39;&#39;Human Life Info-Ecological Safety.&#39;&#39; The <br/>\npractical experience they receive in the Bronnikov Method is <br/>\nsomething they can then use with their other university courses.<br/>\nHere is a description from the International Academy for Human <br/>\nDevelopment, describing what children gain through learning the <br/>\nBronnikov Method:<br/>\nThrough special exercises, you will strengthen your normal memory and <br/>\nyou will develop new types of memory:<br/>\n* biocomputer memory - you&#39;ll learn how to mentally &#39;&#39;record&#39;&#39; big <br/>\namounts of data and later &#39;&#39;access&#39;&#39; those records: numbers, <br/>\nformulas, rules, texts, etc.; you&#39;ll learn how to manipulate them and <br/>\nhow to use it in the school<br/>\n* photographic memory - you&#39;ll learn to take a mental picture of how <br/>\nobjects are laid out and of their number; the same for poems and <br/>\nstories.<br/>\nThrough V. M. Bronnikov method you will discover new virtual kinds of <br/>\nsight, that will let you have fun while learning in school. You will <br/>\nbe able:<br/>\n* In Geography class - to travel through the continents and the <br/>\noceans, &#39;&#39;submerging&#39;&#39; to the bottom of the Mariana Trench, feel the <br/>\ntemperature, salinity, flow of the waters, &#39;&#39;see&#39;&#39; the plants and the <br/>\nfishes of this underwater kingdom -- all this while remaining in the <br/>\nclassroom; <br/>\n* In History class - mentally access historical events. For example <br/>\nyou can &#39;&#39;watch&#39;&#39; the Kulikovo Field battle or how Suvorov brought <br/>\nhis troops through the Alps [these are examples from Russian history <br/>\nfamiliar to any school child]<br/>\n* In Biology class - explore the cell structure of plants, watch the <br/>\nflow of nutritiments into the living organisms;<br/>\n* In Physics class - &#39;&#39;create&#39;&#39; virtual laboratories, where you can <br/>\ncarry out any experiments. <br/>\nAmazingly, your feelings when you learn these different subjects will <br/>\nbe just what you would feel if all of these things were really <br/>\nhappening. All your senses will be engaged, and will evolve further <br/>\nthrough these experiences.<br/>\nLearning those newest technologies for the development of your <br/>\nabilities will empower you to achieve your potential and more. You&#39;ll <br/>\nbe able to learn school courses in a much shorter time, or even take <br/>\nexams without attending classes. It will let you carry out scientific <br/>\nresearch in the field of your interest.<br/>\nYour new abilities also will allow you to learn several foreign <br/>\nlanguages simultaneously, achieve better performance in sports, and <br/>\ndevelop talents in music, painting, and other art forms. <br/>\nScientific Validation<br/>\nL. Y. Lozhnikova, academic council chairperson for the International <br/>\nAcademy for Human Development, in an article describing her <br/>\nexperiences with teaching the Bronnikov method, [1], writes, &#39;&#39;Our <br/>\nchildren know as much about anatomy and physiology as a fourth- or <br/>\nfifth-year medical student. And of course, as to knowledge of man&#39;s <br/>\netheric body, they go beyond what professional doctors know.&#39;&#39;<br/>\nLozhnikova tells this story:<br/>\nNadya Piskareva&#39;s little sister was born with heart disease - a <br/>\ncongenital defect in a partition between the heart chambers. There <br/>\nwas need for a surgical operation. At that time, Nadya had just <br/>\nfinished the 3rd stage of the Bronnikov method. So Viacheslav <br/>\nBronnikov explained to Nadya how she could work with her little <br/>\nsister.<br/>\nNadya did only a few sessions - and to the wonder of the doctors the <br/>\nhole in the partition shrank to several times less than it had been <br/>\nbefore. They still went for the surgical operation, but there was <br/>\nmuch less to do, and the child responded well. <br/>\nIn an article titled &#39;&#39;Step-by-Step Methods of Vision-Formation <br/>\nSuccessful Through Bronnikov Method,&#39;&#39;[2] the internationally-<br/>\nrecognized medical scientist Natalia Petrovna Behtereva comments on <br/>\nthe case of Larisa Pavlova, who had lost her eyesight after a <br/>\nchildhood accident. Behtereva says:<br/>\nThere were three stages in the sight development process. ... The <br/>\nprocess itself was very consecutive and logical. It had all been well <br/>\ndefined. The process stages include teaching a person to control his <br/>\nor her own free energy (first stage), then development of internal <br/>\n(second stage) and external (third stage) sight. The process of sight <br/>\ndevelopment for Larisa is not finished yet, it&#39;s still going on, but <br/>\nthe Bronnikov Method results we now have allow us to say that it&#39;s <br/>\nvery real for a person who has lost eyesight to develop the ability <br/>\nto &#39;&#39;see.&#39;&#39;<br/>\nI was present at almost all of Larisa&#39;s exercise sessions. My <br/>\nemployees S. G. Danko and L. A. Melucheva, and others, performed <br/>\nbiofeedback monitoring of the processes in her brain, and a computer <br/>\nanalysis of those processes.<br/>\nLarisa&#39;s brain monitoring showed the following results:<br/>\n* during the process of learning, her brain began reacting to light <br/>\nsignals;<br/>\n* with time, her brain characteristics slowly began to approach the <br/>\nvalues normal for a sighted person;<br/>\n* Repetitive reactions appeared in the brain areas when inner vision <br/>\nwas being used;<br/>\n* There was substantial initial brain activation with the elements of <br/>\nhyperactivation;<br/>\n* The brain&#39;s defense mechanisms appeared highly effective<br/>\nFuture Plans<br/>\nAccording to L. D. Bronnikova, it&#39;s obvious to everybody that the old <br/>\nlearning system doesn&#39;t work any longer. &#39;&#39;All around the world <br/>\npeople, are looking for new human development and learning <br/>\ntechnologies. We created a technology that allows us to create an <br/>\nentire computer system inside ourselves. It&#39;s simply awesome. We open <br/>\nup new brain resources - and a man becomes free.&#39;&#39;<br/>\n&#39;&#39;When studying a biological cell,&#39;&#39; Bronnikova explains, &#39;&#39;our kids <br/>\ndon&#39;t search for the materials in their textbooks - they &#39;get&#39; <br/>\ndirectly into the cell and watch what&#39;s going on there.<br/>\n&#39;&#39;When kids master alternate sight and develop photographic and <br/>\nbiocomputer memory, they forget about being tired. They get rid of <br/>\nillnesses. Their natural talents flourish and creativity comes to the <br/>\nfore.&#39;&#39;<br/>\nInterestingly enough, Bronnikova adds, &#39;&#39;It often happens that the <br/>\nmore neglected a child was, the brighter the results.&quot;&#39;<br/>\nAt the present time, only the first three stages of the Bronnikov <br/>\nMethod are taught in Moscow and in schools other than Bronnikov&#39;s <br/>\nown. Stage four and five, Bronnikov maintains, require his own input, <br/>\nwhich will take place at his new school in Feodosia (Ukraine). But <br/>\nthe schools in Moscow already give education in business, economics, <br/>\nsciences, and the arts.<br/>\nFootnotes:<br/>\n1. &#39;&#39;New medicine: opportunities for diagnostics, medical treatment <br/>\nand rehabilitation&#39;&#39;<br/>\n2. Behtereva, a recognized figure in official Russian medical <br/>\nscience, was a director for The Soviet Academy for Medical Science&#39;s <br/>\nExperimental Medicine Institute from 1970 to 1990, when she became <br/>\nscientific director of the Brain Institute of the Russian Academy of <br/>\nSciences. The article in question was published in the Bronnikov <br/>\nCenter&#39;s newsletter The Beginning (Feodosia, Crimea, Ukraine).</div>","specialLinks":[]}],"prevTopicId":21066,"nextTopicId":21053}}