{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"susan","from":"susan &lt;fxfireob@...&gt;","replyTo":"LIST","senderId":"lNeYwRNy06a5GlJ5_DO3lQjy4x7Q_c-J4Ld0Z3pm49tcBNLSGjcSIYFQcoMniNCV3-8gWK9RPBey9SJZWlp0o3Y","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Re; Great Idea/diffcult chidhood","postDate":"950918484","msgId":6670,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy40MjcuNjY3MC45NTkyNjk3NDZAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":6669,"nextInTime":6671,"topicId":6670,"numMessagesInTopic":0,"msgSnippet":"hi, i think you re right.   i wish difficult childhoods would always lead to profound understand and compassion but i think more often than not it leads to ","messageBody":"<div id=\"ygrps-yiv-464815734\">hi,<br/>\n<br/>\ni think you&#39;re right.   i wish difficult childhoods would always lead to<br/>\nprofound understand and compassion but i think more often than not it leads to<br/>\ntremendous stress and distortions which make it very difficult to perceive the<br/>\nworld as a safe place full of potential.   in my family, which i&#39;m the<br/>\nyoungest of 5,  the abuse still continues (though much more subtle) and some<br/>\nof us have developed compassion and other have developed a hypersensitivity to<br/>\nthemselves and their own pain, making it impossible to see things from<br/>\nanother&#39;s point of view, leaving them with twisted perceptions and a sad take<br/>\non the world.<br/>\n<br/>\nit is so sad to experience the loss and/or lack of love especially when one is<br/>\na child but when you can, as an adult, allow it in your life, it is a<br/>\nwonderful triumph of the spirit.  it&#39;s nice that after 30 years you can purge<br/>\nthis from your being.  i had to be stricken with an autoimmune disease ( i<br/>\nwould recommend a less stubborn way of learning:) to begin to break down the<br/>\ntremendous armor i had built to protect myself from the destruction of abuse.<br/>\nbut anything is possible if you desire it - as a kid, around 7,  i remember<br/>\nfighting with my mother about happiness.  she said &#39;life is not to be happy&#39;<br/>\nand i said &#39;maybe yours isn&#39;t but mine is&#39; - it was one of those pivotal<br/>\nmoments - and the search for happiness had begun though it took me a long time<br/>\nmy life is completely about happiness even the saddest event are now shrouded<br/>\nin it.<br/>\n<br/>\n-susan<br/>\naustin,tx<br/>\nalways have dessert first<br/>\n<br/>\nSue wrote:<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; From: Sue &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sue.m.e@...\">sue.m.e@...</a>&gt;<br/>\n<br/>\n&gt; No Betsy,<br/>\n&gt;<br/>\n&gt; Thankyou for your sensitive email.<br/>\n&gt;<br/>\n&gt; You did not overstep any bounds, you expressed compassion from what I<br/>\n&gt; perceive to be a Christian viewpoint, and that is fine with me.  I have no<br/>\n&gt; problems with anyone elses faith or convictions.  What I do have problems<br/>\n&gt; is with the way some try to force their beliefs down the throats of others<br/>\n&gt; and by doing so they devalue the beliefs of others.<br/>\n&gt;<br/>\n&gt; Everyone&#39;s own beliefs are very important and very personal and should not<br/>\n&gt; be belittled by others.  I know many fine Chrisitians and like their<br/>\n&gt; company, they are able to accept that I do not believe what they do and<br/>\n&gt; just get on with our relationship, whatever that may be.<br/>\n&gt;<br/>\n&gt; BTW I suffered at the hands of more than one person, for some strange<br/>\n&gt; reason working in a children&#39;s home seems to dehumanize people, or maybe it<br/>\n&gt; attracts the type of people who feel powerless in their own lives and<br/>\n&gt; realize that when in control of a group of orphans, unwanted children etc<br/>\n&gt; they are all powerfull.<br/>\n&gt;<br/>\n&gt; I think I&#39;m mostly over it now, it took me over 30 years before I could<br/>\n&gt; talk about it, and only then could the healing really start to take effect.<br/>\n&gt;  In some ways I do think a difficult childhood can lead to increased<br/>\n&gt; compassion for others, but I think it more often goes the other way and<br/>\n&gt; produces people who pass the suffering on to their own children.<br/>\n&gt;<br/>\n&gt; -  Sue   - </span></blockquote></div>","specialLinks":[]}],"prevTopicId":6495,"nextTopicId":6515}}