{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":10233546,"authorName":"ummezahid@aol.com","from":"ummezahid@...","profile":"jamiliah2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"my name is autism","postDate":"1083630248","msgId":19534,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1YS4zM2VmMWNiOS4yZGM4M2NhOEBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":19533,"nextInTime":19535,"topicId":19534,"numMessagesInTopic":0,"msgSnippet":"My Name is Autism Written By: Omri Fiman/Marty Murphy Hello. Allow me to introduce myself to you. My name is autism. Perhaps you know me or know of me. I am a","messageBody":"<div id=\"ygrps-yiv-388901563\">My Name is Autism<br/>\nWritten By: Omri Fiman/Marty Murphy<br/>\n<br/>\nHello. Allow me to introduce myself to you. My name is autism. Perhaps you <br/>\nknow me or know of me. I am a condition, a &quot;disorder&quot; that affects many people. <br/>\nI strike at will, when and where I want. Unlike Downs Syndrome or other birth <br/>\n&quot;defects&quot;, I leave no marks on those I strike. In fact, I pride myself on the <br/>\nability to infiltrate a child&#39;s life, while leaving him or her strikingly <br/>\nhandsome. Many people may not even know I am there. They blame the child for what <br/>\nI cause him or her to do. I am autism and I do as I please.<br/>\n  I am autism. I strike boys and girls. infants and toddlers. I find my best <br/>\nvictims to be boys around the age of 2, but any child will do. I like children <br/>\nand they are always the true victims, though I take hostage the others in the <br/>\nchild&#39;s family as well. It<br/>\nis a bit like getting 2 for the price of one. I affect one child and &quot;infect&quot; <br/>\nthe entire family.<br/>\n  I am autism. I strike rich and poor alike. The rich combat me with <br/>\neducation and therapy. The poor shut their children away and cannot afford to fight <br/>\nme. I am able to win in the lives of poor children more than I am those of the <br/>\nwealthy, but I will try to take root anywhere.<br/>\n<br/>\n  I am autism. I am an equal opportunity disorder. I strike whites, blacks, <br/>\nMexicans, Ukrainians, Russians,Poles, Slavs, Japanese, Koreans and Fins. In <br/>\nfact, I strike everywhere on Earth. I know no geographical<br/>\nbounds.<br/>\n<br/>\n  I am autism. I do not discriminate based upon religion<br/>\neither. I strike Jews and Christians, Muslims and Buddhists, Atheists and <br/>\nAgnostics. I do not care what religion a person is or what beliefs he may hold. <br/>\nWhen<br/>\nI strike, there will be little time for any of that anyway. When they find <br/>\nme, they will question<br/>\neverything they believe in, so why would I strike only one group? I have <br/>\naffected followers of every religion on the planet.<br/>\n<br/>\nI am autism and I am strong and getting stronger every year, every month, <br/>\nevery day, every minute and every second. I am concerned that money might be <br/>\nallotted to combat me and my takeover of children, but so far, I have little to <br/>\nfear. Some countries like Kuwait, are<br/>\nspending quite a bit of money to assist those who I have targeted and some, <br/>\nlike the United States, would rather spend money on such ludicrous things as <br/>\ndiscovering the number of American Indians who<br/>\npractice Voodoo, as opposed to combating me. In an atmosphere such as that, I <br/>\ncan flourish and wreck havoc at will. In places such as that, I rub my hands<br/>\nwith glee at the problems I can cause to children, their families and to the <br/>\nsociety at large.<br/>\n<br/>\nI am autism. When I come, I come to stay. I take the dreams and hopes of <br/>\nfamilies and trample them with delight. I see the fear and confusion in the eyes <br/>\nof my victims and the see the formation of wrinkles, the worries and pain on <br/>\nthe face of their parents. I see the embarrassment their child causes because of <br/>\nme and the parents unsuccessful attempt to hide their child, and me. I see <br/>\ntears the parents cry and feel the tears of their child. I am autism. I leave <br/>\nsorrow in my wake.<br/>\n<br/>\nI am autism. I taketh away and give nothing but bewilderment and loathing in <br/>\nreturn. I take speech and learning. I take socialization and understanding. I <br/>\ntake away &quot;common sense&quot; and, if I am allowed to flourish, I take away all but <br/>\ntheir physical life.<br/>\nWhat I leave behind, is almost worse than death.<br/>\nI am autism. I fear nothing except courage, which I thankfully see little of. <br/>\nI fear those who take a stand against me and attempt to fight me and bring <br/>\nothers into the fight as well. I fear those who try to make it safe and easier <br/>\nfor my victims in the community, and their families. I fear those who push <br/>\nahead, despite the fact that I am in tow. I fear the day I will be eradicated from <br/>\nthe planet. Yet, I do not fear too much right now. There is no need.<br/>\n<br/>\nI am autism and I bet you know me or know of me. If you don&#39;t, you probably <br/>\nwill soon. I am marching forward faster than I ever have before. I am looking <br/>\nfor new children all the time. I am looking for new children to consume and new <br/>\nlives to destroy. I dread the day I will be looked upon with pity or worse <br/>\nyet, understanding, for that day, is the day I will begin to die.<br/>\n<br/>\nBut in the mean time I am safe, free to prowl onward. Free to cause the pain <br/>\nand suffering that I do so well. I am on a mission and have much work to do <br/>\nand thankfully no one is stopping me yet.<br/>\n<br/>\nHello. Allow me to introduce myself. My name is autism. Perhaps you know me <br/>\nof know of me, if not<br/>\ndon&#39;t worry, you will meet me soon....<br/>\n<br/>\n<br/>\nThe best thing you can spend on your children is time. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nationalautismassociation.org/\">http://www.nationalautismassociation.org/</a><br/>\nThink Autism.<br/>\nThink Cure. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.mercola.com/2001/sep/15/vaccines.htm\">http://www.mercola.com/2001/sep/15/vaccines.htm</a><br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":19533,"nextTopicId":18452}}