{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":81986835,"authorName":"Diana E","from":"Diana E &lt;dianasheart@...&gt;","profile":"dianasheart","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest Number 1838","postDate":"1016210706","msgId":32521,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwMzE1MTY0NTA2LjkwNDYxLnFtYWlsQHdlYjEyNTAzLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDEwMTYyMDQ4MjEuMjIyLjU5OTYubTEyQHlhaG9vZ3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":32520,"nextInTime":32522,"topicId":32521,"numMessagesInTopic":0,"msgSnippet":"Kolleen, I agree about the paperwork.  That s why, when we moved to the Cincinnati area, I chose the Kentucky side.  KY homeschool law is pretty much hands-off","messageBody":"<div id=\"ygrps-yiv-160878528\">Kolleen, I agree about the paperwork.  That&#39;s why,<br/>\nwhen we moved to the Cincinnati area, I chose the<br/>\nKentucky side.  KY homeschool law is pretty much<br/>\nhands-off but Ohio is invasive.  There are a couple of<br/>\nlawmakers who try repeatedly to introduce various new<br/>\ncompulsory education laws in KY, but I hope things<br/>\nwill remain as they are.  We moved from Missouri last<br/>\nyear, where the law is similar to KY.  There are<br/>\ndocumentation and time requirements for homeschoolers,<br/>\nbut the homeschooler is not questioned unless the<br/>\nindividual child is reported as neglected in some<br/>\nobvious way. I provide materials and activities in all<br/>\nacademic and non-academic areas and keep just about<br/>\nevery piece of paper my daughters have written or<br/>\ndoodled on.  I keep lists of the books they read, the<br/>\nfilms they watch, the websites they use, craft<br/>\nprojects, activities away from home. I&#39;ve never<br/>\nfollowed a schedule, but I do keep an outline of the<br/>\napproximate hours she spends on each subject area.  So<br/>\nif we need it one day there is documentation.  <br/>\n<br/>\nIf the state in which we reside does eventually<br/>\nrequire paperwork I&#39;d just bite the bullet, but the<br/>\ntrend I&#39;ve seen over the eighteen years since my first<br/>\ndaughter was kindergarten age is toward easing of<br/>\nrestrictions.  At that time homeschooling was illegal<br/>\nin some states, in other states the parents were<br/>\nrequired to be licensed teachers.  Missouri was in the<br/>\nprocess of making homeschooling legal the year my<br/>\nfirst turned seven, so we were asked to report once to<br/>\nthe local superintendent just to show that we had a<br/>\nplan and some form of textbooks.  Previously, Family<br/>\nServices and the local school district governed<br/>\nhomeschoolers and were actually putting people in jail<br/>\nfor keeping their kids out of school.  The<br/>\nsuperintendent was a manipulative and insulting jerk,<br/>\nbut with the old law off the books I knew he had no<br/>\npower over me, so I listened for a few minutes and<br/>\nthen spread my books, workbooks, lists of books and<br/>\nactivities, etc., all over his desk, and enjoyed the<br/>\nfact that he was at last speechless.  I had material<br/>\nfrom the conservation dept that was designed for<br/>\npublic schools, but he had never seen it and asked how<br/>\nhe could obtain it.  The next year the new law went<br/>\ninto effect, requiring 1000 hrs per year, 600 of them<br/>\nin academic areas and at home, the balance could be<br/>\nnon-academic and outside activities.  Some kind of<br/>\nplan or schedule had to be written each year, sample<br/>\nwork had to be kept, and this was to show a judge in<br/>\nthe case of a neglect report which was at that point<br/>\nstrongly discouraged. KY law is similar.   <br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nYahoo! Sports - live college hoops coverage<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sports.yahoo.com/\">http://sports.yahoo.com/</a></div>","specialLinks":[]}],"prevTopicId":32520,"nextTopicId":32422}}