{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1123183,"authorName":"DACunefare@aol.com","from":"DACunefare@...","profile":"undermom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"school environment","postDate":"1111033321","msgId":104586,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0Ni40MGUyM2QwMy4yZjZhNWZlOUBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":104585,"nextInTime":104587,"topicId":104586,"numMessagesInTopic":0,"msgSnippet":"**The problem with choosing school, even part time, is that the school itself is an environment that is highly coercive and demeaning to learners. So you","messageBody":"<div id=\"ygrps-yiv-1274095054\">**The problem with &quot;choosing&quot; school, even part time, is that the school <br/>\nitself is an <br/>\n<br/>\nenvironment that is highly coercive and demeaning to learners. So you &quot;pay a <br/>\nprice&quot; for <br/>\n<br/>\nthat kind of &quot;teaching&quot; whereas in other places we&#39;ve taken lessons (like <br/>\nacting school, sax lessons, learning to shoot rifles, vintage dance) we have not <br/>\nfelt that same kind of coercive and condescending context that overbears, like <br/>\nit does in the public school.**<br/>\n<br/>\nSometimes you don&#39;t even have to enroll in school part time to be exposed to <br/>\nthe negative context. When Patrick was eight he joined a wrestling team <br/>\nthrough our park district, for kids ages 5 to 12. It met in the high school <br/>\nwrestling room in the evening. One night while we were there the assistant principal <br/>\nof the high school came in and searched all the student&#39;s wrestling bags, <br/>\nannouncing before hand &quot;If you have anything in your bag you shouldn&#39;t have, let us <br/>\nknow before we search.&quot; Several of the boys announced they had candy in their <br/>\nbags, causing the principal to laugh, as she didn&#39;t think of candy as <br/>\ncontraband, although the coach did. It was clear to the kids that they either <br/>\nconsented to the search or they&#39;d be unable to remain on the team because they would <br/>\nno longer be allowed in the high school. None of the adults sitting around the <br/>\nroom had their possesions searched, and nothing was searched but the <br/>\nwrestling bags. The reason given for the search was &quot;fairness&quot;, because the high <br/>\nschool had recently instituted bag searches at the entrances during the day for <br/>\nstudents. Patrick and I had several long talks about this afterward, why the <br/>\nschool didn&#39;t trust kids, the pointlessness of the wrestling bag search, how since <br/>\nthe students know what will be searched in the mornings it&#39;s unlikely to keep <br/>\nanything out, why they didn&#39;t search the adults possesions, and probably a <br/>\nlot more that I&#39;ve forgotten. We&#39;ve also had to deal with the &quot;no hats&quot; rule  <br/>\nand sometimes other parts of a very convoluted dress code.<br/>\n<br/>\nI couldn&#39;t have made school look that bad if I&#39;d tried. It is apalling to my <br/>\nkids just how badly kids are often treated in the schools that are supposedly <br/>\nthere for their benefit.<br/>\n<br/>\nDeborah in IL</div>","specialLinks":[]}],"prevTopicId":104517,"nextTopicId":104493}}