{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Wendalina1@aol.com","from":"Wendalina1@...","replyTo":"LIST","senderId":"3sUDw2XUPvYgtx9Ilc3b55739S3KsPIM0eYXX1arvMUERu4gr25yuqz807hsLKUoGIYRroSet7Mq","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom]","postDate":"981127323","msgId":15751,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4LjExN2ZjOWFkLjI3YWMyYTliQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":15750,"nextInTime":15752,"topicId":15751,"numMessagesInTopic":0,"msgSnippet":"I find the post below very interesting. It kind of relates to a discussion happening right now in my life with a book group. We have been reading the book","messageBody":"<div id=\"ygrps-yiv-1938484771\"><html><font FACE=\"arial,helvetica\"><font SIZE=\"2\">I find the post below very interesting. It kind of relates to a discussion \n<br>happening right now in my life with a book group. We have been reading the \n<br>book &quot;Women Without Superstition, No Gods, No Masters.&quot; It is the history of \n<br>freethinking women in the past two centuries. We have 15 women in this group \n<br>consisting of atheists, Catholics, Baptists, etc., and we have been able to \n<br>have a respectful discussion about our differences. It is so rare when women \n<br>can talk about such sensitive issues as religion and abortion, and still love \n<br>eachother. I don&#39;t post to this loop often, but I do read most messages. I \n<br>have found that this group resembles our book group. It has always seemed to \n<br>be open and accepting, and many controversial views have been shared but \n<br>respected. My question now is why can&#39;t we discuss abortion without people \n<br>getting all upset? In all the posts that I read, I never got the impression \n<br>that someone was attacking another person personally. I took it as someone&#39;s \n<br>opinion. IMO, many women tend to want to keep the peace all the time. I \n<br>actually used to be one of those women. I think unschooling changed me \n<br>somehow. Anyway, religion and abortion are sensitive issues, but they do \n<br>relate to my life, and I don&#39;t see the problem in discussing these issues \n<br>with other adult women. I certainly don&#39;t expect everyone on this list to \n<br>agree with my views, but we learn to appreciate others by listening to their \n<br>views. We learn that our views aren&#39;t necessarily the correct views for \n<br>everyone else out there. There have been many times while reading the digest \n<br>that I&#39;ve starting reading something, found it of little interest, skipped \n<br>the rest and moved on. The same can be done about the abortion or religion \n<br>issues if it makes someone uncomfortable. &nbsp;Now it is possible that all \n<br>discussions other than unschooling be &quot;officially&quot; banned from this list, but \n<br>we would lose so much, and someone would be very busy deleting messages. We \n<br>may not all agree with everything on this list, but I personally think that \n<br>it is healthy to have discussions where we don&#39;t all agree. I have actually \n<br>learned to be more accepting by listening to &nbsp;&nbsp;people with differing views. \n<br>Let&#39;s not be fearful of these subjects. Let&#39;s learn from them.\n<br>\n<br>Wendy\n<br>n a message dated 2/2/01 7:45:41 AM Central Standard Time, \n<br>Unschooling-dotcom@yahoogroups.com writes:\n<br><blockquote><span title=\"qreply\"> <blockquote TYPE=\"CITE\" style=\"BORDER-LEFT:#0000ff 2px solid;MARGIN-LEFT:5px;MARGIN-RIGHT:0px;PADDING-LEFT:5px;\">Hi all! After the last week of bickering , I decided\n<br>&gt; to start a new email list for unschoolers on a more\n<br>&gt; peaceful, less argumentative path.\n<br>&gt; go to yahoo groups, check out unschoolkingdom.\n<br>&gt; If political debates dont fuel your fire, come on\n<br>&gt; over!\n<br></blockquote></span></blockquote></font><font COLOR=\"#000000\" SIZE=\"3\" FAMILY=\"SANSSERIF\" FACE=\"Arial\">\n<br></font><font COLOR=\"#000000\" SIZE=\"2\" FAMILY=\"SANSSERIF\" FACE=\"Arial\">\n<br></font></font></html>\n</div>","specialLinks":[]}],"prevTopicId":15683,"nextTopicId":15713}}