{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] neighbors (was leaving children, again)","postDate":"1057598373","msgId":76315,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDliLjNiM2JiNzAyLjJjM2IwNWE1QGFvbC5jb20+"},"prevInTopic":76314,"nextInTopic":0,"prevInTime":76314,"nextInTime":76316,"topicId":76305,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/7/03 10:32:19 AM, mummy124@bellsouth.net writes: ","messageBody":"<div id=\"ygrps-yiv-71742038\">In a message dated 7/7/03 10:32:19 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mummy124@...\">mummy124@...</a> writes:<br/>\n<br/>\n&lt;&lt; Then I was impressed again when you kept your mouth shut. I think that<br/>\n<br/>\nimpressed me more than the first one. I couldn&#39;t have just walked away like<br/>\n<br/>\nthat. Okay, I guess I could have, I would have chosen not to. &gt;&gt;<br/>\n<br/>\nWell I did shouting back at him to keep it in his own yard or it WAS my <br/>\nbusiness, so it wasn&#39;t quite a model of personal composure.<br/>\n<br/>\n<br/>\n<br/>\nAnd the more I think about it the more I think he probably DOES think he&#39;s <br/>\nbeing a good dad not to whip them with a belt (or whatever his upbringing was).  <br/>\nAnd maybe he&#39;s just from a long line of mean.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] neighbors (was leaving children, again)","postDate":"1057598216","msgId":76314,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGIwLjNiYjZmZDdlLjJjM2IwNTA4QGFvbC5jb20+"},"prevInTopic":76307,"nextInTopic":76315,"prevInTime":76313,"nextInTime":76315,"topicId":76305,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/7/03 10:32:19 AM, mummy124@bellsouth.net writes: ","messageBody":"<div id=\"ygrps-yiv-579220717\">In a message dated 7/7/03 10:32:19 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mummy124@...\">mummy124@...</a> writes:<br/>\n<br/>\n&lt;&lt;  I&#39;m not sure if you know him or not. If it&#39;s<br/>\n<br/>\nsomeone I know, I will say something.  &gt;&gt;<br/>\n<br/>\nI don&#39;t even know his name.  He came to my door a couple of weeks ago with a <br/>\nfound puppy they&#39;d been keeping for nearly a week.  Someone had told him it <br/>\nmight belong behind him, and we were home so he checked with us first. I thought <br/>\nit belonged to Jerry  next door, but I wasn&#39;t sure, so I took it in and asked <br/>\nhim if it was NOT our neighbor&#39;s did they maybe want to take it back and keep <br/>\nit and he said yes.  I introduced myself and I even gave him a business card <br/>\nso he would have my phone number in case that puppy got out again or anything. <br/>\n He didn&#39;t even think to tell me his name at the time, though it was a <br/>\npleasant exchange and he had three kids with him that day.<br/>\n<br/>\nIt was my neighbor&#39;s puppy.   My kids confirmed it.  A tiny pit bull puppy.  <br/>\nIt spent several hours having a great time at our house before we had to <br/>\nreturn it to its depressing back yard.  It will get grown and be a grown pit bull <br/>\nin a depressing back yard it can obviously escape from.  I&#39;m no longer keen on <br/>\nreturning it if it gets out now.  <br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":141102765,"authorName":"Mary","from":"&quot;Mary&quot; &lt;mummy124@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] neighbors (was leaving children, again)","postDate":"1057595301","msgId":76307,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNjAwMWMzNDRhNCRjODBjOTkyMCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+","referencesHeader":"PGE3LjMzYzliNzViLjJjM2FmNjAyQGFvbC5jb20+"},"prevInTopic":76305,"nextInTopic":76314,"prevInTime":76306,"nextInTime":76308,"topicId":76305,"numMessagesInTopic":0,"msgSnippet":"From:  ","messageBody":"<div id=\"ygrps-yiv-95819994\">From: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a>&gt;<br/>\n<br/>\n&lt;&lt; I told off a neighbor yesterday .  Very gently gave him a piece of<br/>\nadvice,<br/>\n actually, and he started yelling at me!  Imagine. &lt;g&gt;&gt;<br/>\n<br/>\n<br/>\nI wouldn&#39;t say I&#39;m impressed often. But I was inmpressed twice while reading<br/>\nyour story.<br/>\nFirst, that you opened your mouth and said something about how the father<br/>\nspoke to the child. I have heard similar things and haven&#39;t had the guts to<br/>\nsay something to that person. I&#39;m not sure if you know him or not. If it&#39;s<br/>\nsomeone I know, I will say something. But just a neighbor or someone out in<br/>\npublic, I just can&#39;t seem to find the words.<br/>\n<br/>\nThen I was impressed again when you kept your mouth shut. I think that<br/>\nimpressed me more than the first one. I couldn&#39;t have just walked away like<br/>\nthat. Okay, I guess I could have, I would have chosen not to. &lt;BG&gt; And I<br/>\nwould have had a really hard time keeping Joe out of it. So good for you<br/>\nboth.<br/>\n<br/>\nI need to manage my mouth better. I&#39;m going to remember this story.<br/>\n<br/>\nMary B</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"neighbors (was leaving children, again)","postDate":"1057594370","msgId":76305,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGE3LjMzYzliNzViLjJjM2FmNjAyQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":76307,"prevInTime":76304,"nextInTime":76306,"topicId":76305,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/7/03 1:10:02 AM, abtleo@earthlink.net writes: ","messageBody":"<div id=\"ygrps-yiv-434208848\">In a message dated 7/7/03 1:10:02 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:abtleo@...\">abtleo@...</a> writes:<br/>\n<br/>\n&lt;&lt; There&#39;s a political connnection with this person, militarily speaking, so I<br/>\ncan&#39;t really do that without my husband hearing about it, and then there&#39;d<br/>\nbe trouble.  Not from him to me, he&#39;d agree!  But between the guys.  &gt;&gt;<br/>\n<br/>\nI understand.  Forgot about that.<br/>\n<br/>\nI told off a neighbor yesterday .  Very gently gave him a piece of advice, <br/>\nactually, and he started yelling at me!  Imagine. &lt;g&gt;<br/>\n<br/>\nI had walked out into the vacant lot behind our house where he had just <br/>\nyelled horribly at a boy about ten years old and told him he was a dumb ass, and to <br/>\nget the hell away from him.  It had to do with the boy not following the <br/>\ndad&#39;s bad directions which, the dad imagined, would have gotten a kite in the air <br/>\non a windless day.<br/>\n<br/>\nThe tone of voice was really horrible.  There was another, younger boy, still <br/>\nholding the kite and looking none too hopeful but still following his dad&#39;s <br/>\nworthless directives.  I walked over to the dad and said something (SOFTLY) li<br/>\nke &quot;If you call your kid dumbass, he&#39;s going to be really unhappy and it won&#39;t <br/>\nmake him a good kid.&quot;  Kind of awkward, but there it was.  He said it was none <br/>\nof my business.  I said it wouldn&#39;t have been, if I couldn&#39;t hear it all from <br/>\nmy yard, and he should be nicer to his kids.  I was standing close enough for <br/>\nhim to hit me, and he was thinking about it, but he had the kite string in <br/>\nhis hands.  <br/>\n<br/>\nHis wife was there, looking like a total blank, poor woman, and the kid with <br/>\nthe kite was too far away to hear, but he and probably six neighboring houses <br/>\ncould have heard the dad yelling at me.  I didn&#39;t take off just yet.  I told <br/>\nhim if he didn&#39;t like what I was saying, imagine how his KID must feel being <br/>\ncalled a dumbass.<br/>\n<br/>\nThen I figured I could do as much as I could do and when he yelled after me <br/>\n&quot;Mind your own fucking business,&quot; I said &quot;Then keep it out of my yard. I don&#39;t <br/>\nwant to hear it.&quot;<br/>\n<br/>\nHolly had been going through my old clothes and wearing things I had when I <br/>\nwas in my teens and 20&#39;s.  I was a scrawny kid and pretty small until I started <br/>\nhaving kids.  After kids, I didn&#39;t small-up again.  So he called me a name I <br/>\nhad never been called.  It didn&#39;t really hurt my feelings, it just made me <br/>\nrealize why his kids are so horrible to my kids and every other kid who passes <br/>\ntheir house.<br/>\n<br/>\nHe yelled, after I was twenty yards away, &quot;FAT ASS!&quot;<br/>\n<br/>\nI wasn&#39;t sure I heard him right.  I hadn&#39;t heard an insult like that since <br/>\nelementary school, and it had never been directed at me.  I got to the gate of <br/>\nmy back yard and he yelled the same thing again louder.<br/>\n<br/>\nI couldn&#39;t stop smiling.  What a doofus!  <br/>\n<br/>\nAnd I realize that it&#39;s probably that he himself was abused probably MUCH <br/>\nworse than the verbal stuff his kids are doing, and he&#39;s probably feeling really <br/>\nresponsible and a good parent because he&#39;s stayed with his wife, he got them a <br/>\nhouse in a decent (not fancy) neighborhood, and it even has a swimming pool <br/>\n(where the kids are yelled at ALL the time), and he&#39;s still at home taking care <br/>\nof his kids and not run off or in prison.  (Just guessing, again, at his <br/>\npossible mindset.)<br/>\n<br/>\nAnd when he was yelling I was thinking a horrible level of thought, a <br/>\nprobably instinctive thing beyond conscious sensible thinking.    I was thinking  <br/>\n&quot;Keith could take him.&quot;<br/>\n<br/>\nStill amused, but starting to feel sorry for the guy, I went up to the front <br/>\nof the house and saw that Keith had returned from his five days in Colorado.  <br/>\nI told him he had just missed my altercation with the neighbor.  I&#39;m sure <br/>\nKeith was glad to hear that.  :-/<br/>\n<br/>\nI said &quot;You could take him in a heartbeat.&quot;<br/>\n<br/>\nI&#39;m sure Keith wasn&#39;t so glad to hear I had even imagined the possibility of <br/>\nsuch necessity or opportunity.<br/>\n<br/>\nSo the worst is they&#39;ll throw crap into our yard or be even meaner to the <br/>\nkids, I guess.<br/>\nThe best might be that the dad will be quieter and the kids will realize that <br/>\nsomeone does think their dad&#39;s too mean besides them.<br/>\n<br/>\nHe WAS out trying to fly a kite, and maybe he&#39;s just not smart enough to know <br/>\nyou do truly need wind.  Maybe he wanted to watch TV but had promised the <br/>\nkids and was keeping his promise.  It had been REALLY windy the day before and <br/>\nmaybe that&#39;s what inspired the kid to get a kite out. Maybe he was hoping wind <br/>\nwould come.  But his fury was so huge and so aimed straight at his child&#39;s head <br/>\nthat I couldn&#39;t just watch that boy walk sadly home under the umbrella of <br/>\nthat insult.  <br/>\n<br/>\nAnd I realized his dad was just of limited thought and vocabulary when the <br/>\nbest he could think of to say to me was &quot;fatass,&quot; and no wonder his children are <br/>\nso hurtful and mean to other kids.  I guess they&#39;ll be nicer, even, to their <br/>\nown children, maybe.  But how many generations will it be before someone is <br/>\nsmart enough or brave enough to change that pattern?<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":76302,"nextTopicId":76254}}