{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":46,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: keeping the peace","postDate":"1296927470","msgId":59503,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA3N0U1OTAyLTZDODgtNDQ3MC05NEJBLTZCRTY1NjkzN0I2Q0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlpanE0YytyZmhjQGVHcm91cHMuY29tPg==","referencesHeader":"PGlpanE0YytyZmhjQGVHcm91cHMuY29tPg=="},"prevInTopic":59502,"nextInTopic":59504,"prevInTime":59502,"nextInTime":59504,"topicId":59459,"numMessagesInTopic":0,"msgSnippet":"-=-It s pretty heavy handed you big dummy kinds of stuff, but it does stop when someone expresses unhappiness - when the game goes a bit too far. I ve never","messageBody":"<div id=\"ygrps-yiv-386990985\">-=-It&#39;s pretty heavy handed &quot;you big dummy&quot; kinds of stuff, but it does stop when someone expresses unhappiness - when the game goes a bit too far. I&#39;ve never seen her tease a girl friend, though and she doesn&#39;t tease me, although George and I tease each other. There&#39;s some dynamic in there about the ways girls and boys play, I think. -=-<br/>\n<br/>\nIt&#39;s known that kids can only take so much of being called &quot;dummy&quot; or &quot;stupid&quot; before they believe it.  I asked my kids not to do that, and reminded them when it came up.   If other kids were over and said &quot;stupid&quot; to one of my kids, I wouldn&#39;t wonder whether I should say something or wait to see if they said it a second time.  I would say calmly but not tentatively &quot;Logan, don&#39;t call Marty that.&quot;  No more.  No lecture.  Just &#39;stop.&#39;&quot;   What if he didn&#39;t stop, some might be asking.  Then I would say, &quot;I told you not to do that.   Are you ready to go home, or do you want to stay a while?&quot;  And the answer would always be &quot;stay&quot; because our house was cool, and I would say &quot;Okay.&quot;  And the behavior would stop.  At least for that session.<br/>\n<br/>\nPart of the reason our house was cool was that I kept it peaceful.  <br/>\n<br/>\nWhen I was in India I was surprised at how many people and things were being called &quot;stupid.&quot;  It makes the world a stupid place when people accept that and do it.  I don&#39;t see how it can be beneficial.  I do see how harmful it can be.<br/>\n<br/>\n-=-Playing with the idea of &quot;if it sounds hollow&quot; (your brain is mush) along with some zombie-humor (I&#39;m going to eat your brain). A combination pretend insult and mock agression.-=-<br/>\n<br/>\nThat sounds like playing.  <br/>\n<br/>\n&quot;You big dummy&quot; I would categorize with things like &quot;stupid bitch&quot; and &quot;f***ing retard,&quot; because those are just one step up on the scale of insult of intelligence.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: keeping the peace","postDate":"1296926766","msgId":59502,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyNTQ1RDk4LUYwRkYtNEM1My05MzJDLUUxNDk2REE4MzBBQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDk3MzFBREIyLUYyRDQtNDJCNC1CREU4LTk2MUI1N0UxNjhBRkBnbWFpbC5jb20+","referencesHeader":"PDk3MzFBREIyLUYyRDQtNDJCNC1CREU4LTk2MUI1N0UxNjhBRkBnbWFpbC5jb20+"},"prevInTopic":59501,"nextInTopic":59503,"prevInTime":59501,"nextInTime":59503,"topicId":59459,"numMessagesInTopic":0,"msgSnippet":"-=- A very bright child,she often engages the 6yrs old and plays nicely with him, but just as often the play deteriorates in some struggle and her first","messageBody":"<div id=\"ygrps-yiv-46367203\">-=- A very bright child,she often engages the 6yrs old and plays nicely with him, but just as often the play deteriorates in some struggle and her first reaction is both verbal and physical.-=-<br/>\n<br/>\nMy first thought was that you&#39;re not near enough.   When it starts to deteriorate, an adult should be there immediately.<br/>\n<br/>\nMaybe give the older child phrases to use that indicate that the younger one is about to blow, if he&#39;s not coming up with effective &quot;Stop&quot; phrases on his own, and when you hear that, make a dash for them.  <br/>\n<br/>\n-=- I usually separate the two,listen to what happened and suggest alternative behaviours,but somehow it does not stick. -=-<br/>\n<br/>\n&quot;It&quot; meaning what does not &quot;stick&quot; meaning what?<br/>\n<br/>\nThey&#39;re very young.  They will learn gradually, over many situations that might seem similar to you but are totally different from their point of view.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] keeping the peace","postDate":"1296926467","msgId":59501,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU1MTM2MzJDLUIxQTEtNDBBNS1BODVCLTU4MzdDRjdCMDAxQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDc4MTFGQTlFLUNBQzktNEE1OC1CQzkyLTUzMDQ0NjBFOUQ0REB2ZXJpem9uLm5ldD4=","referencesHeader":"PDUyNUMwRTZDLTI3NDItNEFGRC04M0M3LTNBNDlCQzFFOEFDOUBTYW5kcmFkb2RkLmNvbT4gPDc4MTFGQTlFLUNBQzktNEE1OC1CQzkyLTUzMDQ0NjBFOUQ0REB2ZXJpem9uLm5ldD4="},"prevInTopic":59499,"nextInTopic":59502,"prevInTime":59500,"nextInTime":59502,"topicId":59459,"numMessagesInTopic":0,"msgSnippet":"-=-So if the mine-field of a phrase is steered clear of, maybe the problem of how and when to step in when kids are being rude, mean and hurtful can be","messageBody":"<div id=\"ygrps-yiv-1301551997\">-=-So if the mine-field of a phrase is steered clear of, maybe the <br/>\nproblem of how and when to step in when kids are being rude, mean and <br/>\nhurtful can be discussed.-=-<br/>\n<br/>\nIf a parent has thought, or decide, or TOLD a child, &quot;this is as much your house as it is mine,&quot; along with &quot;I know yesterday I said I knew more about food and things than you did, and made you eat, and didn&#39;t let you have candy, today I&#39;m saying it&#39;s as much your house as mine and you can eat all the candy you want,&quot; and if in addition to those things the parent says &quot;You never have to go to bed again, EVER, in your entire life,&quot; then whose house is it?   Who&#39;s the mom?  Who&#39;s taking care of people&#39;s safety and security there?  WHAT security?<br/>\n<br/>\nThe only way a parent can reassure a child that he&#39;s safe is not to say &quot;We are all equally responsible for the safety of the others in this house, and if bad guys come to the door I expect you to do your part to protect me and your dad/mom.&quot;   It&#39;s to BE a real, honest-to-god, strong, intelligent, responsible adult.  That&#39;s not what I was seeing in the chat.  It started to feel like people were either whining or frolicking but not seeing (or at least not talking about or addressing) how to create and maintain a safe place full of peace and choices, but they were either &quot;I have no idea&quot; or &quot;Just let them do ANYthing!!   TraLa!&quot;<br/>\n<br/>\nAnyone who just read this will have done so in relative peace.  During the chat, that much couldn&#39;t be said without fifteen interruptions and people changing the topic or misinterpretting words before they were even out.  It was overwhelming and exhausting, and when I got out of the room, I told Holly and Keith I felt like I had just done as much as I usually do in a week, but in two hours. I used the example of The Traveller on Star Trek, exhausted after phasing.   But half the things that were written were important and good and could use further examination and discussion.  It&#39;s just no one had time, and people were coming and going.<br/>\n<br/>\nWe used to have unschoolers (and people interested in unschooling sometimes) over here once a week, or to the park near our house, when we first moved here, when Holly was five.  One day a man threatened to spank his young daughter, and I said &quot;Not at my house.&quot;<br/>\n<br/>\nIt was the same me and the same house I was talking about in the chat, when someone was asking but *how* do you get your child not to hit another child (or tease, or torment, or whatever it was) and I said I would say &quot;not in my house.&quot;<br/>\n<br/>\nI&#39;m not apologizing for that.   My kids rarely hit or tormented.  People are asking how I did that.  I&#39;m honestly trying to share with them how I did or how I would, and I got jumped on as thought the majority could vote my answer out.<br/>\n<br/>\nAnd here&#39;s another reason (and I said so in the chat) that I was cranky about that.  When I&#39;ve been unable to be in the chat and asked someone else to run it, people have tended not to stay in there.  I&#39;m going to be unavailable a couple of times in the next two weeks, and while I would like to think they will continue without me, I&#39;m not fully confident they will.  And that&#39;s not terrible.  What is relatively terrible is that when I was in there I was being told, &quot;No, wrong, you can&#39;t say that.&quot;   <br/>\n<br/>\nI HAVE said that, and I would say it again, and my kids are fine. <br/>\n<br/>\nTo say &quot;Not in THIS house&quot; is only enforceable if and because it&#39;s that person&#39;s house.<br/>\n<br/>\nI wouldn&#39;t say &quot;not in this house&quot; to my husband.<br/>\nOur rental tenants wouldn&#39;t probably say &quot;not in this house&quot; to him either.  :-)<br/>\n<br/>\nThere IS a solid reality to whose house, territory, place, list, chat something is.  &quot;It&#39;s my party&quot; is a real concept.  One can cry, one can ask people to leave, one can say &quot;no more beer for you.&quot;  And legally and morally, has an obligation at times to do so.  (Not to cry, maybe.)   Pretending there&#39;s no such thing does not lead toward clarity of thought or understanding.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: keeping the peace","postDate":"1296923176","msgId":59499,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlpanRuOCtrODJwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE4NzQ4NS42MTY4Ny5xbUB3ZWI4NjIwOC5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":59498,"nextInTopic":59501,"prevInTime":59498,"nextInTime":59500,"topicId":59459,"numMessagesInTopic":0,"msgSnippet":"Wow, the banana story brought back some memories... My dad had a favorite brand of chocolate chip cookies and each night would sit and eat a pile of them,","messageBody":"<div id=\"ygrps-yiv-2136024159\">Wow, the banana story brought back some memories...<br/>\nMy dad had a favorite brand of chocolate chip cookies and each night would sit and eat a pile of them, along with a glass of milk. My brother and I were strictly limited as to how many cookies we could have - like one or two, compared to the ten to twelve my dad ate. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&quot;but he  was permanently marked down in my <br/>\n&gt; estimation from that moment.&quot;<br/>\n<br/>\n </span></blockquote>It wasn&#39;t as much a big deal in my life, as one of the hundred perfectly &quot;normal&quot; things that moved me away from respecting my parents. It seemed like such an Obnoxious thing to do, and my dad seemed smaller and less worthy as a result. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: keeping the peace","postDate":"1296923076","msgId":59497,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkyNjk5My45OTQxNC5xbUB3ZWI4MTUwNi5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGlpanE0YytyZmhjQGVHcm91cHMuY29tPg==","referencesHeader":"PGlpanE0YytyZmhjQGVHcm91cHMuY29tPg=="},"prevInTopic":59494,"nextInTopic":59498,"prevInTime":59496,"nextInTime":59498,"topicId":59459,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-820303718\">&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;An example of me and George teasing would be... oh, Addams family sorts <br/>\nof humor I guess you could say. I&#39;ll kiss him on the forehead and then pretend <br/>\nto check to see if his head is &quot;ripe&quot; yet... like a melon. Playing with the idea <br/>\nof &quot;if it sounds hollow&quot; (your brain is mush) along with some zombie-humor (I&#39;m <br/>\ngoing to eat your brain). A combination pretend insult and mock <br/>\nagression.&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n And that is the kind of joking around that may go on here too but I don&#39;t <br/>\npersonally see that as teasing.<br/>\nTeasing for me, even if done in a funny or sweetly voice, has an underlying <br/>\nmeaness.<br/>\nSee again it is probably language and I cannot explain it!<br/>\n<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] keeping the peace","postDate":"1296922998","msgId":59498,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVFOTNGQTdBLTgzOUUtNEFFOC05QjQ5LTE3MTMwNjc5RDNENUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEFBTkxrVGluWmR5aFp5TDl0aFpfOHdyeWNZWmt4clBpSzdXR3dRZmd2UUFlYUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PDUyNUMwRTZDLTI3NDItNEFGRC04M0M3LTNBNDlCQzFFOEFDOUBTYW5kcmFkb2RkLmNvbT4gPDMzMjkyNS43NDc3MS5xbUB3ZWI4NjIwMi5tYWlsLmlyZC55YWhvby5jb20+IDxBQU5Ma1RpblpkeWhaeUw5dGhaXzh3cnljWVpreHJQaUs3V0d3UWZndlFBZWFAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":59497,"nextInTopic":59499,"prevInTime":59497,"nextInTime":59499,"topicId":59459,"numMessagesInTopic":0,"msgSnippet":"-=-As I understand this pattern is that unless one person stops and makes an effort to do it differently it is going to continue.-=- It s not what was going on","messageBody":"<div id=\"ygrps-yiv-465140215\">-=-As I understand this pattern is that unless one person stops and makes an<br/>\neffort to do it differently it is going to continue.-=-<br/>\n<br/>\nIt&#39;s not what was going on in my house, in my home of origin or in the discussion in the chat.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: keeping the peace","postDate":"1296922417","msgId":59494,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlpanN2aCtxajZtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDk3MzFBREIyLUYyRDQtNDJCNC1CREU4LTk2MUI1N0UxNjhBRkBnbWFpbC5jb20+"},"prevInTopic":59493,"nextInTopic":59497,"prevInTime":59493,"nextInTime":59495,"topicId":59459,"numMessagesInTopic":0,"msgSnippet":"... ****************** I think part of your problem is you re expecting it to stick ! With young children, especially, you re dealing with their ability to","messageBody":"<div id=\"ygrps-yiv-1964730862\">Antonella &lt;anto40@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I am not sure how to approach this,but clearly my &quot;strategy&quot; is not the right one. I usually separate the two,listen to      what happened and suggest alternative behaviours,but somehow it does not stick.<br/>\n </span></blockquote>******************<br/>\n<br/>\nI think part of your problem is you&#39;re expecting it to &quot;stick&quot;! With young children, especially, you&#39;re dealing with their ability to understand the situation from another&#39;s perspective, their communication skills, and their ability to stop in the middle of an emotional reaction and think about what to do next - all of which are fairly limited. <br/>\n<br/>\nThe more you can do to get your 4yos needs met proactively, the better chance you&#39;ll have of avoiding some of this. It could be she wants attention from her older brother and is getting in his way in order to get it, so look for ways to help them do things together. Chances are, too, the baby is getting very inconvenient, these days, getting into anything the older siblings are doing - so you&#39;ll want to look for ways to help them include the baby *and* look for ways for them to get breaks from the baby&#39;s inquisitiveness. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;just as often the play deteriorates in some struggle and her first reaction is both verbal and physical<br/>\n </span></blockquote>***************<br/>\n<br/>\nIf the play starts well and falls apart, then maybe one or the other is needing a break or snack or some more attention from mom. It&#39;s good to offer that Before things blow up, so if there&#39;s a regular pattern, you&#39;re ahead of things. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I know that there must be an  &quot;unmet need&quot; that I am overlooking<br/>\n<br/>\n </span></blockquote>It could be that what your kids need is to do what you&#39;ve been doing - separate them and help them see that better choices exist. Even with being proactive in terms of meeting needs, these are human beings trying to figure out how to get along without a lot of skills to do so gracefully. Right now, they&#39;ll depend on you to be the graceful one while protecting them from one another. Set them up for better relationships as much as you can! But don&#39;t expect the &quot;set up&quot; to do your job as a parent. They need you to be right there with them to help out. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] keeping the peace","postDate":"1296922253","msgId":59493,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4NzQ4NS42MTY4Ny5xbUB3ZWI4NjIwOC5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PDc4MTFGQTlFLUNBQzktNEE1OC1CQzkyLTUzMDQ0NjBFOUQ0REB2ZXJpem9uLm5ldD4=","referencesHeader":"PDUyNUMwRTZDLTI3NDItNEFGRC04M0M3LTNBNDlCQzFFOEFDOUBTYW5kcmFkb2RkLmNvbT4gPDc4MTFGQTlFLUNBQzktNEE1OC1CQzkyLTUzMDQ0NjBFOUQ0REB2ZXJpem9uLm5ldD4="},"prevInTopic":59491,"nextInTopic":59494,"prevInTime":59492,"nextInTime":59494,"topicId":59459,"numMessagesInTopic":0,"msgSnippet":"Reading a piece about the Waugh family (http://www.guardian.co.uk/lifeandstyle/2011/feb/05/evelyn-waugh-dynasties-ian-sansom) I thought this story of how to","messageBody":"<div id=\"ygrps-yiv-1196192150\">Reading a piece about the Waugh family <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.guardian.co.uk/lifeandstyle/2011/feb/05/evelyn-waugh-dynasties-ian-sansom)\">http://www.guardian.co.uk/lifeandstyle/2011/feb/05/evelyn-waugh-dynasties-ian-sansom)</a><br/>\n I thought this story of how to lose a child&#39;s esteem might help to see what <br/>\ntrust and respect are: <br/>\n<br/>\n<br/>\nYou might know the banana story. During the second world war, Evelyn Waugh&#39;s  <br/>\nwife managed to procure three bananas for their children. When she  brought the <br/>\nfruit home, Evelyn sat down in front of the children, peeled  the bananas, <br/>\npoured on cream and sugar, and ate them all. &quot;It would be  absurd to say that I <br/>\nnever forgave him,&quot; wrote Waugh&#39;s son Auberon many years later, in his <br/>\nautobiography, Will This Do? (1991), &quot;but he  was permanently marked down in my <br/>\nestimation from that moment.&quot;<br/>\n<br/>\nSchuyler<br/>\n<br/>\n---------------------------------<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;You can use the phrase because with your kids it doesn&#39;t have that  <br/>\n </span></blockquote>emotional baggage. You can use it because your relationship with your  <br/>\nkids is different than conventional parents. It *sounds* different to  <br/>\nyour kids. It means something different to them. Most people on the  <br/>\nlist haven&#39;t been practicing radical unschooling since their kids were  <br/>\nlittle so they&#39;re not going to be able to get the same effect from the  <br/>\nphrase.&lt;&lt;<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":274801552,"authorName":"HA","from":"&quot;HA&quot; &lt;verbiosa@...&gt;","profile":"verbiosa","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: keeping the peace","postDate":"1296921498","msgId":59504,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlpanMycSszdWxzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEyN0FDMTk3LUU1OTktNDFFRC05QTFCLTlEMDYzMjIyMThGN0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":59503,"nextInTopic":59506,"prevInTime":59503,"nextInTime":59505,"topicId":59459,"numMessagesInTopic":0,"msgSnippet":"*** I think lots of things are funny, but if someone feels violated, it s time to stop laughing and move the joking elsewhere, I think. *** This is usually","messageBody":"<div id=\"ygrps-yiv-1582143245\">***<br/>\nI think lots of things are funny, but if someone feels violated, it&#39;s time to stop laughing and move the joking elsewhere, I think.<br/>\n***<br/>\n<br/>\nThis is usually true, but some people use oversensitivity as a way to abuse and control. That shouldn&#39;t be tolerated anymore than other types of bullying.<br/>\n<br/>\nI was raised by a very uptight woman, and in turn became a very uptight person. It wasn&#39;t until a few years ago that I realized how I was using it against other people - I would get hurt feelings over something clearly meant in an innocent way, shame or guilt the person, they would apologize or TRY make it up to me or avoid something to avoid making me angry, and I would feel important. :( When I realized what I was doing, I immediately took steps to stop. It&#39;s an ingrained habit, but there are ways to change anything. Unfortunately, undoing the damage is a really L-O-N-G process.<br/>\n<br/>\nFor me, I know this is linked to insecurity and low self-esteem, so when I&#39;m feeling edgy I start doing things to beef myself up. I complete a project. I go see a friend. I do something kind. I work on myself, and then I take stock of the good qualities of the people around me. I show them appreciation, and work to improve the situation. I&#39;ve also been doing the HEALS program developed by Steve Stonsky for almost a year, and it has definitely helped. <br/>\n<br/>\nObviously, this is advice for adults who can choose to be reasonable (or not). Children can&#39;t always do that on their own. And sometimes, people are teasing in a mean way and need to be stopped. That doesn&#39;t mean we should never joke around with our kids, or that any teasing is harmful. Finding humor in our own circumstances can help solve problems and help people feel better.<br/>\n<br/>\nHilary E.</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: keeping the peace","postDate":"1296919500","msgId":59491,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlpanE0YytyZmhjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ5NzQ5OS41NDIucW1Ad2ViODE1MDcubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":59489,"nextInTopic":59493,"prevInTime":59490,"nextInTime":59492,"topicId":59459,"numMessagesInTopic":0,"msgSnippet":"... Mo and George tease each other - George does it much, much more gently, pretending to mis-hear her and twisting her words to mean something silly, but Mo","messageBody":"<div id=\"ygrps-yiv-1302499010\">BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Can you give an example of your  loving teasing?<br/>\n<br/>\n </span></blockquote>Mo and George tease each other - George does it much, much more gently, pretending to mis-hear her and twisting her words to mean something silly, but Mo isn&#39;t as graceful, yet. Her teasing could be seen as rude or even hurtful - making fun of him - but I haven&#39;t seen her tease others that way, just George, who takes it in stride. Oh! wait, she has a couple friends who are two brothers (not unschoolers), one older and one younger than she is, and sometimes gets in the midst of Their teasing. It&#39;s pretty heavy handed &quot;you big dummy&quot; kinds of stuff, but  it does stop when someone expresses unhappiness - when the game goes a bit too far. I&#39;ve never seen her tease a girl friend, though and she doesn&#39;t tease me, although George and I tease each other. There&#39;s some dynamic in there about the ways girls and boys play, I think. <br/>\n<br/>\nAn example of me and George teasing would be... oh, Addams family sorts of humor I guess you could say. I&#39;ll kiss him on the forehead and then pretend to check to see if his head is &quot;ripe&quot; yet... like a melon. Playing with the idea of &quot;if it sounds hollow&quot; (your brain is mush) along with some zombie-humor (I&#39;m going to eat your brain). A combination pretend insult and mock agression.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: keeping the peace","postDate":"1296916015","msgId":59489,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU4QTRENjAyLTRGMDgtNDQ0NS1BOUM3LUYzRTQ0NTExRTE2M0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDk3MzFBREIyLUYyRDQtNDJCNC1CREU4LTk2MUI1N0UxNjhBRkBnbWFpbC5jb20+","referencesHeader":"PDk3MzFBREIyLUYyRDQtNDJCNC1CREU4LTk2MUI1N0UxNjhBRkBnbWFpbC5jb20+"},"prevInTopic":59488,"nextInTopic":59491,"prevInTime":59488,"nextInTime":59490,"topicId":59459,"numMessagesInTopic":0,"msgSnippet":"... Two things: One, you re expecting behavior beyond her ability. Just because she understands it s wrong doesn t mean she has the ability to not only not","messageBody":"<div id=\"ygrps-yiv-1618697904\">On Feb 4, 2011, at 4:44 PM, Antonella wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I know that there must be an &quot;unmet need&quot; that I am overlooking, but  <br/>\n&gt; I am clearly not able to find it . I feel pretty discouraged by the  <br/>\n&gt; situation,these days.<br/>\n<br/>\n </span></blockquote>Two things:<br/>\n<br/>\nOne, you&#39;re expecting behavior beyond her ability. Just because she  <br/>\nunderstands it&#39;s wrong doesn&#39;t mean she has the ability to not only  <br/>\nnot react to her emotions but to choose something different during  <br/>\nthat heightened emotion.<br/>\n<br/>\nTwo, you need to be more present. And while being present, be aware of  <br/>\nrising tensions, hunger, tiredness, irritation and failing patience.  <br/>\nRedirect things before they head that way. Bring food. Call one away  <br/>\nto do something with you. Bring in something different.<br/>\n<br/>\nYou&#39;re seeing her behavior as indication she&#39;s broken and in need of  <br/>\nfixing. She&#39;s 4. She need you to be the change she&#39;s trying to make in  <br/>\nthe world until she shows she&#39;s able to do it herself.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: keeping the peace","postDate":"1296915811","msgId":59488,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU5ODcwOS4xNTk2OC5xbUB3ZWI4NjIwNy5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PDk3MzFBREIyLUYyRDQtNDJCNC1CREU4LTk2MUI1N0UxNjhBRkBnbWFpbC5jb20+","referencesHeader":"PDk3MzFBREIyLUYyRDQtNDJCNC1CREU4LTk2MUI1N0UxNjhBRkBnbWFpbC5jb20+"},"prevInTopic":59487,"nextInTopic":59489,"prevInTime":59487,"nextInTime":59489,"topicId":59459,"numMessagesInTopic":0,"msgSnippet":"Be there more. Be there playing and engaging with them so much that you can see when things are moving even a bit downhill and you can swirl life up and around","messageBody":"<div id=\"ygrps-yiv-1673674626\">Be there more. Be there playing and engaging with them so much that you can see <br/>\nwhen things are moving even a bit downhill and you can swirl life up and around <br/>\nthem so that it doesn&#39;t go far enough downhill for you daughter to get <br/>\nfrustrated and reactive. The more time you put in the less likely that things <br/>\nwill need to be dealt with in a separate and discuss manner. At 4 your daughter <br/>\nis probably not capable of holding on to the ideas for moderating her behaviour <br/>\nthat you and she are coming up with. At 10 my daughter still needs my help and <br/>\nmy presence to deal with tense moments. <br/>\n<br/>\n<br/>\nBe more present more of the time.  <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n<br/>\n<br/>\nI am a bit concerned about my middle child&#39;reactions to those around her. She (4 <br/>\nyrs old) behaves aggresssively toward her older brother(6) and has recently <br/>\nstarted to do the same with the baby(13mo). A very bright child,she often <br/>\nengages the 6yrs old and plays nicely with him, but just as often the play <br/>\ndeteriorates in some struggle and her first reaction is both verbal and <br/>\nphysical.<br/>\n<br/>\nI am not sure how to approach this,but clearly my &quot;strategy&quot; is not the right <br/>\none. I usually separate the two,listen to      what happened and suggest <br/>\nalternative behaviours,but somehow it does not stick. I know that there must be <br/>\nan  &quot;unmet need&quot; that I am overlooking, but I am clearly not able to find it . I <br/>\nfeel pretty discouraged by the situation,these days.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] keeping the peace","postDate":"1296911884","msgId":59485,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc4MTFGQTlFLUNBQzktNEE1OC1CQzkyLTUzMDQ0NjBFOUQ0REB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDUyNUMwRTZDLTI3NDItNEFGRC04M0M3LTNBNDlCQzFFOEFDOUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDUyNUMwRTZDLTI3NDItNEFGRC04M0M3LTNBNDlCQzFFOEFDOUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":59481,"nextInTopic":59487,"prevInTime":59484,"nextInTime":59486,"topicId":59459,"numMessagesInTopic":0,"msgSnippet":"... Often when I try to explain why kids will -- as all humans will -- react badly to someone deciding what they can eat and how they can spend their time, I","messageBody":"<div id=\"ygrps-yiv-1086108637\">On Feb 4, 2011, at 2:20 PM, Sandra Dodd wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I had said if my kids weren&#39;t being nice I would say they couldn&#39;t  <br/>\n&gt; be that way in my house. (I&#39;ll find the exact quote if someone else  <br/>\n&gt; doesn&#39;t, but I need to get up and take a break from thinking about  <br/>\n&gt; it right now.) Someone asked whether that wasn&#39;t authoritarian.<br/>\n<br/>\n </span></blockquote>Often when I try to explain why kids will -- as all humans will --  <br/>\nreact badly to someone deciding what they can eat and how they can  <br/>\nspend their time, I can hear your voice noting the exception about  <br/>\nsocial behavior. And my own voice about safety.<br/>\n<br/>\nMaybe this is a good opportunity to discuss why there&#39;s a reaction  <br/>\ndifference inside the kids (and other people too) between the child  <br/>\nbeing steered away from the &quot;dangerous&quot; TV or &quot;dangerous&quot; high  <br/>\nfructose corn syrup or the definitely dangerous tipping bookcase  <br/>\nthey&#39;re climbing and definitely &quot;dangerous to their ability to get  <br/>\nalong in the world&quot; meanness to others.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I want to get back to this. I got very cranky in the chat because it  <br/>\n&gt; seemed people were accepting rudeness and meanness from and between  <br/>\n&gt; their kids, or of their kids to strangers.<br/>\n<br/>\n </span></blockquote>Well the first bit above and this bit aren&#39;t one and the same. As the  <br/>\nresponses on the list indicate, there&#39;s a strong emotional reaction to  <br/>\n&quot;not in my house.&quot; Lots of baggage in that phrase for many people.<br/>\n<br/>\nI&#39;m seeing your cranky reaction as tangling the two as though people&#39;s  <br/>\nrejection of &quot;not in my house&quot; is rejection of stopping kids from  <br/>\nbeing rude. And your reaction is bolstered by parents who actually  <br/>\naren&#39;t stopping kids from being mean and rude.<br/>\n<br/>\nBut using that phrase isn&#39;t the only option to stop kids from being  <br/>\nrude and mean!<br/>\n<br/>\nYou can use the phrase because with your kids it doesn&#39;t have that  <br/>\nemotional baggage. You can use it because your relationship with your  <br/>\nkids is different than conventional parents. It *sounds* different to  <br/>\nyour kids. It means something different to them. Most people on the  <br/>\nlist haven&#39;t been practicing radical unschooling since their kids were  <br/>\nlittle so they&#39;re not going to be able to get the same effect from the  <br/>\nphrase.<br/>\n<br/>\nSo if the mine-field of a phrase is steered clear of, maybe the  <br/>\nproblem of how and when to step in when kids are being rude, mean and  <br/>\nhurtful can be discussed.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":458624268,"authorName":"dola dasgupta-banerji","from":"dola dasgupta-banerji &lt;doladg@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] keeping the peace","postDate":"1296888187","msgId":59481,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGluWmR5aFp5TDl0aFpfOHdyeWNZWmt4clBpSzdXR3dRZmd2UUFlYUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDMzMjkyNS43NDc3MS5xbUB3ZWI4NjIwMi5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PDUyNUMwRTZDLTI3NDItNEFGRC04M0M3LTNBNDlCQzFFOEFDOUBTYW5kcmFkb2RkLmNvbT4JPDMzMjkyNS43NDc3MS5xbUB3ZWI4NjIwMi5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":59479,"nextInTopic":59485,"prevInTime":59480,"nextInTime":59482,"topicId":59459,"numMessagesInTopic":0,"msgSnippet":"The other day my niece called me (she is 16) late at night and asked if she could spend the night with us. So I asked her what happened. She said her mom and","messageBody":"<div id=\"ygrps-yiv-1631759965\">The other day my niece called me (she is 16) late at night and asked if she<br/>\ncould spend the night with us. So I asked her what happened. She said her<br/>\nmom and she had an argument over something and her mom asked her to get out<br/>\nof &#39;her house&#39;. So my niece got out!<br/>\n<br/>\nI asked her to go back home and sleep it over and next morning speak to her<br/>\nmom and tell her to not repeat those words ever again in an argument. And<br/>\neven if she or anyone else did, then not to &#39;actually leave home&#39;, since<br/>\nthat home belonged to all the members.<br/>\n<br/>\nShe went back home slept over it and next day spoke about it to her mom. Her<br/>\nmom called me up later and thanked me said this was a habit with her because<br/>\nshe grew up listening to this all the time in her home when she was kid and<br/>\nthat her husband (my husband&#39;s brother) always used that phrase too. Then I<br/>\nrealised that my father -in-law and my husband used that phrase with each<br/>\nother even when we were all living together in a &#39;rented&#39; house early in my<br/>\nmarriage. Many times either my husband left or my father-in-law. They stayed<br/>\naway for a few days and then came back!!<br/>\n<br/>\nOnce my husband even used the phrase &quot;Now I pay the bills so you leave DAD.&quot;<br/>\nAnd dad-in-law left. My in laws now live in an old-age home.<br/>\n<br/>\nAs I understand this pattern is that unless one person stops and makes an<br/>\neffort to do it differently it is going to continue.<br/>\n<br/>\nDola<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sat, Feb 5, 2011 at 1:15 AM, Schuyler &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:s.waynforth@...\">s.waynforth@...</a>&gt;wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I&#39;m not terribly concerned about the notion of authoritarian. I am the<br/>\n&gt; authority, or at least among the authority, in my family, in our family. I<br/>\n&gt; am<br/>\n&gt; the responsible party. I find myself bristling at the notion of &quot;my house&quot;.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I don&#39;t think my parents pulled the &quot;not under my roof&quot; thing very often,<br/>\n&gt; but<br/>\n&gt; when they kicked me out at 17 it was very clear that they didn&#39;t see it as<br/>\n&gt; my<br/>\n&gt; house. It was their house. And then it was my dad&#39;s house and he was so<br/>\n&gt; angry at<br/>\n&gt; me when I expressed a sense of loss when he told me he was selling it. It<br/>\n&gt; wasn&#39;t<br/>\n&gt; my house. I didn&#39;t get to have a home in that way. So I have never said not<br/>\n&gt; in<br/>\n&gt; &quot;my house&quot; to Simon or Linnaea. I&#39;ve said it a couple of times to other<br/>\n&gt; people,<br/>\n&gt; but not to Simon or Linnaea.<br/>\n&gt;<br/>\n&gt; Not resorting to rights of ownership hasn&#39;t left me without tools when<br/>\n&gt; dealing<br/>\n&gt; with tension or rudeness or anger or violence. I&#39;m not without authority.<br/>\n&gt; Linnaea said today that she wouldn&#39;t say something I was jokingly saying<br/>\n&gt; she<br/>\n&gt; could have said, I don&#39;t remember the precise thing, but something<br/>\n&gt; enormously<br/>\n&gt; disrespectful. She said that would mean she didn&#39;t respect me. I have<br/>\n&gt; earned<br/>\n&gt; Simon&#39;s and Linnaea&#39;s respect. My guess is that your not going on in my<br/>\n&gt; house<br/>\n&gt; thing only works if you already have your audiences respect. Without that<br/>\n&gt; your<br/>\n&gt; words would have meant nothing.<br/>\n&gt;<br/>\n&gt; Schuyler<br/>\n&gt;<br/>\n&gt; ________________________________<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I had said if my kids weren&#39;t being nice I would say they couldn&#39;t be that<br/>\n&gt; way<br/>\n&gt; in my house. (I&#39;ll find the exact quote if someone else doesn&#39;t, but I need<br/>\n&gt; to<br/>\n&gt; get up and take a break from thinking about it right now.) Someone asked<br/>\n&gt; whether that wasn&#39;t authoritarian.<br/>\n&gt;<br/>\n&gt; I want to get back to this. I got very cranky in the chat because it seemed<br/>\n&gt;<br/>\n&gt; people were accepting rudeness and meanness from and between their kids, or<br/>\n&gt; of<br/>\n&gt; their kids to strangers. It was going VERY quickly, with 22, 23 people<br/>\n&gt; sometimes.<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] keeping the peace","postDate":"1296877967","msgId":59479,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyN0FDMTk3LUU1OTktNDFFRC05QTFCLTlEMDYzMjIyMThGN0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDQ3MjUxMy42MDE5Ni5xbUB3ZWIxMTA0MTEubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDUyNUMwRTZDLTI3NDItNEFGRC04M0M3LTNBNDlCQzFFOEFDOUBTYW5kcmFkb2RkLmNvbT4gPDQ3MjUxMy42MDE5Ni5xbUB3ZWIxMTA0MTEubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":59478,"nextInTopic":59481,"prevInTime":59478,"nextInTime":59480,"topicId":59459,"numMessagesInTopic":0,"msgSnippet":"-=- Some things people do are very wrong. Violating another is wrong. That much seems clear. Yet, I ve seen some people feel totally violated and offended by","messageBody":"<div id=\"ygrps-yiv-786515429\">-=- Some things people do are <br/>\nvery wrong. Violating another is wrong. That much seems clear. Yet, I&#39;ve seen <br/>\nsome people feel totally violated and offended by things that I find really <br/>\namusing. -=-<br/>\n<br/>\nI think lots of things are funny, but if someone feels violated, it&#39;s time to stop laughing and move the joking elsewhere, I think.<br/>\n<br/>\nI don&#39;t like jokes about rape.  They were pretty common before the mid 1970&#39;s, when the women&#39;s movement pointed out (repeatedly, individually, LOTS of people) that those jokes added to an environment that kept men from thinking that women&#39;s feelings and safety were important or real.  Before that time, in most places it was legal for a man to rape his wife.  Or rather the legal definition of &quot;rape&quot; said &quot;a man not the woman&#39;s husband&quot; or some such (different different places).<br/>\n<br/>\nNowadays, decades later, I don&#39;t like jokes about children, that make children seem little or stupid or unimportant, so that adults laugh and children are made smaller in those people&#39;s minds and hearts.<br/>\n<br/>\nIf I&#39;m offended at someone else&#39;s house, I should just leave.<br/>\nIf I&#39;m being offended in my own house (or on my own list, or in my car, or at a party or conference I host), I should not have to leave.<br/>\n<br/>\nLocation matters for many things.  The relative value of another person within a situation is important, and those values vary.  If six people are on a road trip, the last one who joined the party is less important than the owner of the vehicle, or the one who most needs to reach the destination.  If one of those people is able to repair the vehicle, his value for that trip is high.  When they get there, if it&#39;s a rodeo, the one who can ride or who is on the court, is more important for the next few hours or days than the one who doesn&#39;t know calf roping from steer riding.  The conditions of &quot;the peace&quot; will change again when they get into the van to go back home.<br/>\n<br/>\n-=- If there are things that <br/>\nmake a parent uncomfortable, how should it be addressed? -=-<br/>\n<br/>\nIt depends where it&#39;s happening and what the level of danger is.<br/>\n<br/>\n-=-Rudeness too, is so variable. What offends some people totally does not offend others.-=-<br/>\n<br/>\nIf someone act the same way at a funeral that she acted at a wedding, that will be rude.   Many things are fine in one context (or place, or time) and entirely inappropriate in another.  Some things are not okay anytime.  Spitting on another person.  Hitting a pregnant woman or an infant.  (Hitting any woman, though there are boxing matches and military realities, armored fighting, martial arts...)<br/>\n<br/>\n-=- It is very difficult to offend me. I find most of the world, the way people are, the <br/>\nthings people do, fascinating, the good and the bad.-=--<br/>\n<br/>\nI&#39;m not very easily offended, but in that chat I was nearly livid.<br/>\nI don&#39;t find good and bad equally fascinating.   There are advantages to me and my children of seeing, knowing and preferring good over bad.  I don&#39;t choose my friends without regard to the ideas of good and bad.  I don&#39;t welcome all of my relatives over with equal joy or acceptance.  A few aren&#39;t welcome at all.  I didn&#39;t invite my own mother to my wedding when Keith and I got married.  It would not have kept the peace of the wedding.  I cared more about my guests and the work that went into the preparations of the day than I cared about giving my mother yet another chance to get drunk and abusive and give me another horrible memory.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] keeping the peace","postDate":"1296876905","msgId":59478,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU0RkNBMUU3LTRENkQtNDkxQS1CRjA0LTY1RTNGODJBMUNEN0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEIyNzc5MDc1MTA1RDQyMzg4N0NEQkYzMkRCM0JBQUUxQENvbm5pZVBDPg==","referencesHeader":"PDUyNUMwRTZDLTI3NDItNEFGRC04M0M3LTNBNDlCQzFFOEFDOUBTYW5kcmFkb2RkLmNvbT4gPDMzMjkyNS43NDc3MS5xbUB3ZWI4NjIwMi5tYWlsLmlyZC55YWhvby5jb20+IDxCMjc3OTA3NTEwNUQ0MjM4ODdDREJGMzJEQjNCQUFFMUBDb25uaWVQQz4="},"prevInTopic":59477,"nextInTopic":59479,"prevInTime":59477,"nextInTime":59479,"topicId":59459,"numMessagesInTopic":0,"msgSnippet":"I don t like the extension of the authority of a published work to parental authority. Parents become parents through accident more often than design.  There","messageBody":"<div id=\"ygrps-yiv-1772818832\">I don&#39;t like the extension of the authority of a published work to parental authority.   <br/>\n<br/>\nParents become parents through accident more often than design.  There are genetics involved.  Or a child is adopted.  Or a child is planned or accepted as God&#39;s will.  It&#39;s not like a child shops for a good book in which to place his faith, or that he decides St. Martin&#39;s Press is going to appeal to him more than Random House.<br/>\n<br/>\nParents have legal authority and responsibility that has nothing to do with any of the things on that list.<br/>\n<br/>\n-=-<br/>\nAn author&#39;s authority is established by looking at all of these factors. If a parent doesn&#39;t make a conscious effort to establish his/her authority, then the kids will not trust them and there will not be peace. A parent&#39;s authority is established over time by being reliable and trusting. -=-<br/>\n<br/>\n&quot;Authority&quot; isn&#39;t the right word to be using.  Even unreliable dipwads have authority over their children.<br/>\n<br/>\n-=-A parent&#39;s authority is established by making good choices and by being a good role model for the children. As a parent, I am the &quot;author&quot; of my child so to speak but in order to have authority, I need to address all of the things mentioned above. If I don&#39;t create a peaceful environment and actively protect my children from each other, themselves, or outsiders, then I lose my authority and the peace of the home slowly deteriorates.-=-<br/>\n<br/>\nIt was an interesting parallel, but not a good model for what makes for good unschooling.   It seems to be trying to amend a bad document to try to make it fit the characteristics of a good one.  Like shaving a square peg to fit a round hole.  <br/>\n<br/>\nThe summary for all of that long analogy would be &quot;be a good person; make thoughtful choices; live in the moment directly with your child.&quot;<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] keeping the peace","postDate":"1296876495","msgId":59477,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJCQTQ5Qjg3LTlDOUMtNDM1MS04QTE5LTZBRTczODZCODE3OEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDU5OTg3My42NDMxOS5xbUB3ZWI4MTUwNS5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDUyNUMwRTZDLTI3NDItNEFGRC04M0M3LTNBNDlCQzFFOEFDOUBTYW5kcmFkb2RkLmNvbT4gPDFCRUY5N0FBMEYyMzQ3QTRCNUNFQTU5OTM4RDc1MjU4QEx5bGFQQz4gPDU5OTg3My42NDMxOS5xbUB3ZWI4MTUwNS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":59476,"nextInTopic":59478,"prevInTime":59476,"nextInTime":59478,"topicId":59459,"numMessagesInTopic":0,"msgSnippet":"-=-I remember long ago on another list a mom coming ( with very young kids) and saying she just did not do anything when one of her young children hit the","messageBody":"<div id=\"ygrps-yiv-1511960743\">-=-I remember long ago on another list a mom coming ( with very young kids) and <br/>\nsaying she just did not do anything when one of her young children hit the other because he/she was expressing her feelings or some BS like that.-=-<br/>\n<br/>\nYes.  She wasn&#39;t keeping the peace.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] keeping the peace","postDate":"1296872631","msgId":59476,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIyMDk1Ny4zNjk2NS5xbUB3ZWI4MTUwMy5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDQ3NEI1ODE2LUZBMkMtNDUxNS04OTA0LTRGRTkzNjE5ODVGQ0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDUyNUMwRTZDLTI3NDItNEFGRC04M0M3LTNBNDlCQzFFOEFDOUBTYW5kcmFkb2RkLmNvbT4gPDFCRUY5N0FBMEYyMzQ3QTRCNUNFQTU5OTM4RDc1MjU4QEx5bGFQQz4gPDU5OTg3My42NDMxOS5xbUB3ZWI4MTUwNS5tYWlsLm11ZC55YWhvby5jb20+IDw0NzRCNTgxNi1GQTJDLTQ1MTUtODkwNC00RkU5MzYxOTg1RkNAU2FuZHJhZG9kZC5jb20+"},"prevInTopic":59475,"nextInTopic":59477,"prevInTime":59475,"nextInTime":59477,"topicId":59459,"numMessagesInTopic":0,"msgSnippet":"I asked Jenny for examples because :  ","messageBody":"<div id=\"ygrps-yiv-873325906\">I asked Jenny for examples because :<br/>\n<br/>\n &lt;&lt;&lt;&lt;&lt; It&#39;s not okay to tease in the sense of &quot;tease a dog&quot;--to goad a person <br/>\nrepeatedly to get a reaction, or to keep on and on and on until the person <br/>\nerupts defensively. That is the teasing that&#39;s not okay. <br/>\n<br/>\n<br/>\nBelittling humor is something that people will accept sometimes if they feel the <br/>\nalternative is that the conversation ends or the other person &quot;is mad at them.&quot; <br/>\nIf the cost of a continued conversation is that one person has to suck up to <br/>\nanother one or accept being made fun of, that&#39;s on the edge of abuse (or past <br/>\nthe edge, in some cases).&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\nThat is what I was envisioning when talking about teasing<br/>\n<br/>\n. A sense of humor is great.  It has defused many conversations that were <br/>\ngetting a little heated.<br/>\n<br/>\n<br/>\nI have used sarcastic teasing in a very passive agressive way and I have seen <br/>\nmany do it.<br/>\nNot a good thing.<br/>\nI have also seen some parents tease their kids &quot;sweetly&quot; but it was not a joke. <br/>\nThey really meant what they said.<br/>\n Its hard to explain. <br/>\nWe maybe calling funny lovingly teasing  &quot;joking&quot; in my house. <br/>\nWhen it is  the teasing described above we call it teasing.<br/>\n<br/>\n Probably language.  <br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] keeping the peace","postDate":"1296871184","msgId":59475,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3NEI1ODE2LUZBMkMtNDUxNS04OTA0LTRGRTkzNjE5ODVGQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDU5OTg3My42NDMxOS5xbUB3ZWI4MTUwNS5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDUyNUMwRTZDLTI3NDItNEFGRC04M0M3LTNBNDlCQzFFOEFDOUBTYW5kcmFkb2RkLmNvbT4gPDFCRUY5N0FBMEYyMzQ3QTRCNUNFQTU5OTM4RDc1MjU4QEx5bGFQQz4gPDU5OTg3My42NDMxOS5xbUB3ZWI4MTUwNS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":59472,"nextInTopic":59476,"prevInTime":59474,"nextInTime":59476,"topicId":59459,"numMessagesInTopic":0,"msgSnippet":"-=No it is not OK to tease others. Sense of humor is great but teasing is not. Its passive agressive and not funny for the person being made fun or teased.-=- ","messageBody":"<div id=\"ygrps-yiv-386214493\">-=No it is not OK to tease others. Sense of humor is great but teasing is not. Its <br/>\npassive agressive and not funny for the person being made fun or teased.-=-<br/>\n<br/>\nLanguage problem, maybe?  It&#39;s not okay to tease in the sense of &quot;tease a dog&quot;--to goad a person repeatedly to get a reaction, or to keep on and on and on until the person erupts defensively.   That is the teasing that&#39;s not okay. <br/>\n<br/>\nBelittling humor is something that people will accept sometimes if they feel the alternative is that the conversation ends or the other person &quot;is mad at them.&quot;  If the cost of a continued conversation is that one person has to suck up to another one or accept being made fun of, that&#39;s on the edge of abuse (or past the edge, in some cases).<br/>\n<br/>\nKeith and I have sweetly humorous exchanges all the time.  Today we both dodged frustrating comments with humor.  He&#39;s stuck home for two months without the use of both arms.  I&#39;m trying to get ready to leave town and feeling uncomfortable about it.  It&#39;s been below freezing for three days (it got up to 35 degrees today, but I had house plants freeze INSIDE THE HOUSE....   the cat&#39;s water froze in the dish, near the back door).   On a rough day, humor is not going to be as fun as on a warm, happy, safe-feeling day.  Some people can&#39;t tell the difference, and a person who objects to &quot;humor&quot; will be further insulted for &quot;not having a sense of humor.&quot;  In such cases humor=bullying.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] keeping the peace","postDate":"1296867589","msgId":59472,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3MjUxMy42MDE5Ni5xbUB3ZWIxMTA0MTEubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDUyNUMwRTZDLTI3NDItNEFGRC04M0M3LTNBNDlCQzFFOEFDOUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDUyNUMwRTZDLTI3NDItNEFGRC04M0M3LTNBNDlCQzFFOEFDOUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":59471,"nextInTopic":59475,"prevInTime":59471,"nextInTime":59473,"topicId":59459,"numMessagesInTopic":0,"msgSnippet":"***I want to get back to this. I got very cranky in the chat because it seemed people were accepting rudeness and meanness from and between their kids, or of ","messageBody":"<div id=\"ygrps-yiv-695721413\">***I want to get back to this. I got very cranky in the chat because it seemed <br/>\npeople were accepting rudeness and meanness from and between their kids, or of <br/>\ntheir kids to strangers.***<br/>\n<br/>\nI think this goes back to the topic of the chat too.  If there are things that <br/>\nmake a parent uncomfortable, how should it be addressed?  Rudeness too, is so <br/>\nvariable.  What offends some people totally does not offend others.  It is very <br/>\ndifficult to offend me.  I find most of the world, the way people are, the <br/>\nthings people do, fascinating, the good and the bad.  Some things people do are <br/>\nvery wrong.  Violating another is wrong.  That much seems clear.  Yet, I&#39;ve seen <br/>\nsome people feel totally violated and offended by things that I find really <br/>\namusing. <br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] keeping the peace","postDate":"1296866623","msgId":59471,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5NzQ5OS41NDIucW1Ad2ViODE1MDcubWFpbC5tdWQueWFob28uY29tPg==","inReplyToHeader":"PDgyMjczMC4yNTk2MC5xbUB3ZWIxMTA0MTYubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDUyNUMwRTZDLTI3NDItNEFGRC04M0M3LTNBNDlCQzFFOEFDOUBTYW5kcmFkb2RkLmNvbT4gPDFCRUY5N0FBMEYyMzQ3QTRCNUNFQTU5OTM4RDc1MjU4QEx5bGFQQz4gPDU5OTg3My42NDMxOS5xbUB3ZWI4MTUwNS5tYWlsLm11ZC55YWhvby5jb20+IDw4MjI3MzAuMjU5NjAucW1Ad2ViMTEwNDE2Lm1haWwuZ3ExLnlhaG9vLmNvbT4="},"prevInTopic":59470,"nextInTopic":59472,"prevInTime":59470,"nextInTime":59472,"topicId":59459,"numMessagesInTopic":0,"msgSnippet":"Can you give an example of your  loving teasing?  and how can you lovingly tease a child or a child tease each other lovingly?   Alex Polikowsky [Non-text","messageBody":"<div id=\"ygrps-yiv-551804076\">Can you give an example of your  loving teasing?<br/>\n and how can you lovingly tease a child or a child tease each other lovingly?<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] keeping the peace","postDate":"1296865372","msgId":59467,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgyMjczMC4yNTk2MC5xbUB3ZWIxMTA0MTYubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDU5OTg3My42NDMxOS5xbUB3ZWI4MTUwNS5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDUyNUMwRTZDLTI3NDItNEFGRC04M0M3LTNBNDlCQzFFOEFDOUBTYW5kcmFkb2RkLmNvbT4gPDFCRUY5N0FBMEYyMzQ3QTRCNUNFQTU5OTM4RDc1MjU4QEx5bGFQQz4gPDU5OTg3My42NDMxOS5xbUB3ZWI4MTUwNS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":59466,"nextInTopic":59470,"prevInTime":59466,"nextInTime":59468,"topicId":59459,"numMessagesInTopic":0,"msgSnippet":"***No it is not OK to tease others. Sense of humor is great but teasing is not. Its passive agressive and not funny for the person being made fun or teased.***","messageBody":"<div id=\"ygrps-yiv-1326364280\">***No it is not OK to tease others. Sense of humor is great but teasing is not. <br/>\nIts <br/>\npassive agressive and not funny for the person being made fun or teased.***<br/>\n<br/>\nI think there is such a thing as sweet and gentle teasing.  My husband and I <br/>\ntease each other.  It&#39;s part of how we relate to each other.  Margaux doesn&#39;t <br/>\nalways like teasing, so we discourage teasing Margaux.  She&#39;s just not in a <br/>\nplace to find humor about herself.  To me, teasing and the ability to accept <br/>\nteasing is the ability to look at oneself and be able to laugh about our own <br/>\nquirks and weirdnesses.  Some people can do that and some people really can&#39;t.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] keeping the peace","postDate":"1296863391","msgId":59466,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIyNzc5MDc1MTA1RDQyMzg4N0NEQkYzMkRCM0JBQUUxQENvbm5pZVBDPg==","inReplyToHeader":"PDMzMjkyNS43NDc3MS5xbUB3ZWI4NjIwMi5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PDUyNUMwRTZDLTI3NDItNEFGRC04M0M3LTNBNDlCQzFFOEFDOUBTYW5kcmFkb2RkLmNvbT4gPDMzMjkyNS43NDc3MS5xbUB3ZWI4NjIwMi5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":59465,"nextInTopic":59467,"prevInTime":59465,"nextInTime":59467,"topicId":59459,"numMessagesInTopic":0,"msgSnippet":"... I wasn t part of the chat but I wanted to respond to the idea of authority as I understand it. A person can be authoritarian but have absolutely no","messageBody":"<div id=\"ygrps-yiv-838570358\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;I am the authority, or at least among the authority, in my family, in our family.&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I wasn&#39;t part of the chat but I wanted to respond to the idea of authority as I understand it. A person can be authoritarian but have absolutely no authority. A person can be completely passive yet have tons of authority. When I was looking up some information about evaluating information the other day, it hit me how an unschooling parent needs to have authority. If you go to <a rel=\"nofollow\" target=\"_blank\" href=\"http://libweb.uoregon.edu/guides/findarticles/credibility.html\">http://libweb.uoregon.edu/guides/findarticles/credibility.html</a> you will see that authority is one of the criteria for evaluating information sources. (I posted a variation of this on another list. I have since thought it out a bit more and expanded on a few things.)<br/>\n<br/>\nIf you apply the questions of &quot;authority&quot; on an unschooling level it looks something like this: <br/>\n<br/>\nWho is the author? translates to &quot;Who are my parents?&quot; Are they transparent in their decision making or do they do everything in secret? Do they share their lives with the children or do they set themselves up as being something they are not? Do they insist on blind control or do they give the children some level of autonomy? Do they create a safe environment for the kids? Are they honest and trustworthy? Are they peaceful people or do they seem to be angry and agitated?<br/>\n<br/>\nWhat are the author&#39;s credentials? translates to &quot;How have my parents made themselves believable?&quot; Have they been honest with me or have I caught them in lies? What kind of credentials do my parents have? Have they read anything or do they blindly follow whatever other people tell them? Do they use &quot;because I said so&quot; or do they seem to have good reasons for what they do? Have they demonstrated the ability to protect me physically, emotionally, and intellectually? <br/>\n<br/>\nWhat is the author&#39;s reputation among his/her peers? translates to &quot;What do other people think of my parents?&quot; Do people tend to think my parents are jerks? Do people ask my parents for advice? Do people trust my parents with important things? Do other kids like my parents? <br/>\n<br/>\nWho is the publisher translates to &quot;What kind of information are parents giving children?&quot; Are they giving them reasonable information or are they giving them information that is fear mongering and controlling? Are parents giving children information with a hidden (or not so hidden) agenda? <br/>\n<br/>\nIs the author associated with a reputable institution or organization? translates to &quot;Do I like the people that my parents hang around?&quot; Do my parents hang out with losers that scare me or do they hang out with decent people that I am comfortable to be around? If somebody makes me uncomfortable, are my parents willing to protect me by not hanging around those people? <br/>\n<br/>\nAn author&#39;s authority is established by looking at all of these factors. If a parent doesn&#39;t make a conscious effort to establish his/her authority, then the kids will not trust them and there will not be peace. A parent&#39;s authority is established over time by being reliable and trusting. A parent&#39;s authority is established by making good choices and by being a good role model for the children. As a parent, I am the &quot;author&quot; of my child so to speak but in order to have authority, I need to address all of the things mentioned above. If I don&#39;t create a peaceful environment and actively protect my children from each other, themselves, or outsiders, then I lose my authority and the peace of the home slowly deteriorates.<br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] keeping the peace","postDate":"1296859425","msgId":59465,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU5OTg3My42NDMxOS5xbUB3ZWI4MTUwNS5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDFCRUY5N0FBMEYyMzQ3QTRCNUNFQTU5OTM4RDc1MjU4QEx5bGFQQz4=","referencesHeader":"PDUyNUMwRTZDLTI3NDItNEFGRC04M0M3LTNBNDlCQzFFOEFDOUBTYW5kcmFkb2RkLmNvbT4gPDFCRUY5N0FBMEYyMzQ3QTRCNUNFQTU5OTM4RDc1MjU4QEx5bGFQQz4="},"prevInTopic":59463,"nextInTopic":59466,"prevInTime":59464,"nextInTime":59466,"topicId":59459,"numMessagesInTopic":0,"msgSnippet":"It may go back to people coming to unschooling and then reading about freedom, children making choices and decisions, saying yes more, not being punished and","messageBody":"<div id=\"ygrps-yiv-5129545\">It may go back to people coming to unschooling and then reading about freedom, <br/>\nchildren making choices and decisions, saying yes more, not being punished and<br/>\nthey don&#39;t know what to do instead and they do nothing afraid that if they do <br/>\nsay: &quot;hey Do not hit your brother&quot; or if they stop something they are doing <br/>\nsomething that is not unschooling.<br/>\nThere are those questions: Is this unschoolling? <br/>\n<br/>\nFor some they are looking for what to do instead. How to follow it step by step  <br/>\nthe rules of unschooling. But there are no rules.<br/>\nThere are principles and many times the answer to something will be: &quot;It <br/>\ndepends&quot;<br/>\n Only when you understand  and use principles that you can think of better ways <br/>\nto handle unexpected situations without following a scrip like many types of <br/>\nparenting do.<br/>\nI remember long ago on another list a mom coming ( with very young kids) and <br/>\nsaying she just did not do anything when one of her young children hit the other <br/>\n<br/>\nbecause he/she was expressing her feelings or some BS like that.<br/>\n<br/>\n It may be very different for people who came to unschooling and mindful <br/>\nparenting than it is for me and my kids. My kids have always trusted me. I have <br/>\nmade many mistakes but I am lucky I was reading from early on about Attachment <br/>\nParenting and Unschooling.<br/>\nThere has been some issues I had to work hard on it and I do everyday try to be <br/>\nbetter and make better choices.<br/>\nI see with my sister that her kids don&#39;t trust her like mine trust me.<br/>\nThey have been punished with time outs, gone to school, spanked and she used to <br/>\ntell her oldest ( a very daring kind of boy) that he was going to get hurt all <br/>\nthe time. So he fugure very early on that she was wrong.  He pushes it and <br/>\ndefies as much as he can. IT has gotten better for her and her boys but I can <br/>\nsee how much easier is for me with my kids  for them to listen to me.<br/>\n<br/>\nI have had friends call me and ask me things like: What do I do when x does y ? <br/>\nI can only give ideas or try to figure out things that will help but it really <br/>\ndepends.<br/>\nI am not in their home and I don;t know  how and why things are happening and <br/>\nhow the parent is responding to it.<br/>\n<br/>\nBut no it is not OK for a child to hit another. Not that you are going to punish <br/>\nthe child but you are not going to let it happen and you will adress the<br/>\nsituation however is necessary.<br/>\nNo it is not OK to tease others. Sense of humor is great but teasing is not. Its <br/>\npassive agressive and not funny for the person being made fun or teased.<br/>\n  <br/>\nOh gosh I think this e-mail is going in all directions, sorry. I hope it does <br/>\nnot make things more confusing. I may need some help with clarity here.<br/>\n<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":112891150,"authorName":"michmag5@earthlink.net","from":"michmag5@...","profile":"michelle_baum","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] keeping the peace","postDate":"1296858914","msgId":59470,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2NTgyMTIxLjEyOTY4NTg5MTUwMzAuSmF2YU1haWwucm9vdEB3YW11aS1jeW5pY2FsLmF0bC5zYS5lYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":59467,"nextInTopic":59471,"prevInTime":59469,"nextInTime":59471,"topicId":59459,"numMessagesInTopic":0,"msgSnippet":"... Just wanted to point out that they feel just fine about calling me and my husband on rudeness, too. ; ) Michelle Wife to Bob Momma to George (12), Theo","messageBody":"<div id=\"ygrps-yiv-244046217\">-----Original Message-----<br/>\n<blockquote><span title=\"ireply\"> &gt;From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:michmag5@...\">michmag5@...</a><br/>\n<br/>\n </span></blockquote>I said:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And I feel just fine about calling them on rudeness.<br/>\n<br/>\n </span></blockquote>Just wanted to point out that they feel just fine about calling me and my husband on rudeness, too. ; )<br/>\n<br/>\nMichelle<br/>\n<br/>\nWife to Bob<br/>\nMomma to George (12), Theo (9), Eli (6), and Oliver (18 mo)<br/>\n<br/>\nIf my life wasn&#39;t funny, it would just be true, and that&#39;s unacceptable.<br/>\n                                                            -- Carrie Fisher</div>","specialLinks":[]},{"userId":442614894,"authorName":"Antonella","from":"Antonella &lt;anto40@...&gt;","profile":"antonelladallatorre","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: keeping the peace","postDate":"1296855856","msgId":59487,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk3MzFBREIyLUYyRDQtNDJCNC1CREU4LTk2MUI1N0UxNjhBRkBnbWFpbC5jb20+"},"prevInTopic":59485,"nextInTopic":59488,"prevInTime":59486,"nextInTime":59488,"topicId":59459,"numMessagesInTopic":0,"msgSnippet":"This is my first post, and I hope it is not inappropriate to infiltrate an existing thread,but I feel my question fits in with the topic at hand (keeping","messageBody":"<div id=\"ygrps-yiv-1237395205\">This is my first post, and I hope it is not inappropriate to&#39; &quot;infiltrate&quot; an existing thread,but I feel my question fits in with the topic at hand (keeping the peace).<br/>\n<br/>\nI am a bit concerned about my middle child&#39;reactions to those around her. She (4 yrs old) behaves aggresssively toward her older brother(6) and has recently started to do the same with the baby(13mo). A very bright child,she often engages the 6yrs old and plays nicely with him, but just as often the play deteriorates in some struggle and her first reaction is both verbal and physical.<br/>\n<br/>\nI am not sure how to approach this,but clearly my &quot;strategy&quot; is not the right one. I usually separate the two,listen to      what happened and suggest alternative behaviours,but somehow it does not stick. I know that there must be an  &quot;unmet need&quot; that I am overlooking, but I am clearly not able to find it . I feel pretty discouraged by the situation,these days.<br/>\n<br/>\nI realize that it is hard for anyone reading this to glimpse into our family life from this little window,(no,we Are not violent adults-Someone might wonder)and I am not looking for that.Would people  be willing to volunteer some &quot;succesful&quot;stories f rom their own experiences or indicate maybe some,new,unexplored path for me to venture along?<br/>\n Thankfully,<br/>\nA.<br/>\nInviato da iPod</div>","specialLinks":[]},{"userId":185586397,"authorName":"lylaw","from":"&quot;lylaw&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] keeping the peace","postDate":"1296855579","msgId":59462,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFCRUY5N0FBMEYyMzQ3QTRCNUNFQTU5OTM4RDc1MjU4QEx5bGFQQz4=","inReplyToHeader":"PDUyNUMwRTZDLTI3NDItNEFGRC04M0M3LTNBNDlCQzFFOEFDOUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDUyNUMwRTZDLTI3NDItNEFGRC04M0M3LTNBNDlCQzFFOEFDOUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":59460,"nextInTopic":59463,"prevInTime":59461,"nextInTime":59463,"topicId":59459,"numMessagesInTopic":0,"msgSnippet":"I’m sorry I had to leave before the meatier part of the chat! I went back and read it and I found it really fascinating.  I think there IS a lot of confusion","messageBody":"<div id=\"ygrps-yiv-2107298567\">I’m sorry I had to leave before the meatier part of the chat! I went back and read it and I found it really fascinating.  I think there IS a lot of confusion about how to not be a dictator and to allow children the freedom to explore and get to know themselves and trust themselves and you, while still maintaining peace and safety in the home. <br/>\nI KNOW I struggled with this when my kids were younger, and we were also not unschooling, and therefore, as a result (I believe), when we made the switch to unschooling, it took both tolerating a bit more drama and intensity and pain than one would normally find acceptable because there was NOT that trust that alex mentoned:<br/>\n“My guess is that your not going on in my house <br/>\nthing only works if you already have your audiences respect. Without that your <br/>\nwords would have meant nothing. “<br/>\n<br/>\nseveral people in the chat asked “but what do you do if you tell them “not in my house” or some variant, and they don’t listen/respond – they keep doing it.  THAT is the most common question I get from others, and what I struggled with the most when my kids were younger, and things were less peaceful here.  <br/>\n<br/>\nIn retrospect, I think that’s a glaring red flag that there’s trust to be built up between parent and child AND that the parent needs to make some changes in to prevent the OPPORTUNITY for meanness, aggression, teasing, or whatever the issue.  <br/>\n<br/>\nif it’s in groups or with friends, then it might mean NOT putting the child in that situation for a good long while.  pulling in and being together at home, or out but just parent and child, etc.  <br/>\n<br/>\nif it’s in groups but one or two friends works then stick to that for a bit.  if it’s with siblings, find ways to create more space for the siblings, or to be more involved with them, and to keep a keen ear out for the escalating voices, body tension, etc.    <br/>\n<br/>\nsomeone else in the chat (pamela?) mentioned looking behind the behavior for what’s driving it – the unmet need.  that’s critical in my experience.  kids don’t just lash out for no reason.  sometimes the reasons are immediate and short lived (hungry, tired, lonely, stressed by a recent experience) and sometimes they are more chronic (bullying, parental pressure, mental health issue, etc.) but in any case it’s up to the parent to address.  and preferably to prevent/diminish impact by being a buffer and creating as gentle and supportive a day, week, year, life for the child as possible.<br/>\n<br/>\nwarmly, lyla<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":112891150,"authorName":"michmag5@earthlink.net","from":"michmag5@...","profile":"michelle_baum","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] keeping the peace","postDate":"1296852521","msgId":59463,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMzNTIwMjMyLjEyOTY4NTI1MjE1MDQuSmF2YU1haWwucm9vdEB3YW11aS1qdW5lLmF0bC5zYS5lYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":59462,"nextInTopic":59465,"prevInTime":59462,"nextInTime":59464,"topicId":59459,"numMessagesInTopic":0,"msgSnippet":"... I do too.  For much the same reason you said, about not feeling like your house was your house as a teenager. I *definitely* felt that way with my mother","messageBody":"<div id=\"ygrps-yiv-1876595964\">-----Original Message-----<br/>\n<blockquote><span title=\"ireply\"> &gt;From: Schuyler &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:s.waynforth@...\">s.waynforth@...</a>&gt;<br/>\n<br/>\n&gt;I&#39;m not terribly concerned about the notion of authoritarian. I am the <br/>\n&gt;authority, or at least among the authority, in my family, in our family. I am <br/>\n&gt;the responsible party. I find myself bristling at the notion of &quot;my house&quot;. <br/>\n<br/>\n </span></blockquote>I do too.  For much the same reason you said, about not feeling like your house was your house as a teenager. I *definitely* felt that way with my mother and stepfather...it was his.  I didn&#39;t have a key, he turned off all lights at 9:30 pm., he threw away anything left out, etc. <br/>\n<br/>\nWhen talking about ugly words, fighting, slamming doors, whatever, I think it makes more sense to talk about how we all as a family want to be treated, etc.  I will admit to having slipped and said, &quot;As soon as you start paying the rent in this house!&quot; but realized how stupid I sounded.  ; )<br/>\n<br/>\nI will do my best to put a stop to a behavior that&#39;s hurting someone else.  I believe that&#39;s my responsibility.  I&#39;m certainly not going to let one boy punch another and keep on punching him because I don&#39;t want to be authoritarian. And I feel just fine about calling them on rudeness.<br/>\n<br/>\nMichelle<br/>\n<br/>\nWife to Bob<br/>\nMomma to George (12), Theo (9), Eli (6), and Oliver (18 mo)<br/>\n<br/>\nIf my life wasn&#39;t funny, it would just be true, and that&#39;s unacceptable.<br/>\n                                                            -- Carrie Fisher</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] keeping the peace","postDate":"1296848733","msgId":59460,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMzMjkyNS43NDc3MS5xbUB3ZWI4NjIwMi5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PDUyNUMwRTZDLTI3NDItNEFGRC04M0M3LTNBNDlCQzFFOEFDOUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDUyNUMwRTZDLTI3NDItNEFGRC04M0M3LTNBNDlCQzFFOEFDOUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":59459,"nextInTopic":59462,"prevInTime":59459,"nextInTime":59461,"topicId":59459,"numMessagesInTopic":0,"msgSnippet":"I m not terribly concerned about the notion of authoritarian. I am the authority, or at least among the authority, in my family, in our family. I am the","messageBody":"<div id=\"ygrps-yiv-1910623057\">I&#39;m not terribly concerned about the notion of authoritarian. I am the <br/>\nauthority, or at least among the authority, in my family, in our family. I am <br/>\nthe responsible party. I find myself bristling at the notion of &quot;my house&quot;. <br/>\n<br/>\n<br/>\nI don&#39;t think my parents pulled the &quot;not under my roof&quot; thing very often, but <br/>\nwhen they kicked me out at 17 it was very clear that they didn&#39;t see it as my <br/>\nhouse. It was their house. And then it was my dad&#39;s house and he was so angry at <br/>\nme when I expressed a sense of loss when he told me he was selling it. It wasn&#39;t <br/>\nmy house. I didn&#39;t get to have a home in that way. So I have never said not in <br/>\n&quot;my house&quot; to Simon or Linnaea. I&#39;ve said it a couple of times to other people, <br/>\nbut not to Simon or Linnaea. <br/>\n<br/>\n<br/>\nNot resorting to rights of ownership hasn&#39;t left me without tools when dealing <br/>\nwith tension or rudeness or anger or violence. I&#39;m not without authority. <br/>\nLinnaea said today that she wouldn&#39;t say something I was jokingly saying she <br/>\ncould have said, I don&#39;t remember the precise thing, but something enormously <br/>\ndisrespectful. She said that would mean she didn&#39;t respect me. I have earned <br/>\nSimon&#39;s and Linnaea&#39;s respect. My guess is that your not going on in my house <br/>\nthing only works if you already have your audiences respect. Without that your <br/>\nwords would have meant nothing. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n<br/>\nI had said if my kids weren&#39;t being nice I would say they couldn&#39;t be that way <br/>\nin my house.  (I&#39;ll find the exact quote if someone else doesn&#39;t, but I need to <br/>\nget up and take a break from thinking about it right now.)  Someone asked <br/>\nwhether that wasn&#39;t authoritarian.<br/>\n<br/>\nI want to get back to this.  I got very cranky in the chat because it seemed <br/>\npeople were accepting rudeness and meanness from and between their kids, or of <br/>\ntheir kids to strangers.   It was going VERY quickly, with 22, 23 people <br/>\nsometimes.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"keeping the peace","postDate":"1296847254","msgId":59459,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUyNUMwRTZDLTI3NDItNEFGRC04M0M3LTNBNDlCQzFFOEFDOUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":59460,"prevInTime":59458,"nextInTime":59460,"topicId":59459,"numMessagesInTopic":0,"msgSnippet":"Today in the regular Friday chat at http://sandradodd.com/room , there was a frustration.  Several regular list members were there.  I wanted to bring some of","messageBody":"<div id=\"ygrps-yiv-1309851826\">Today in the regular Friday chat at <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/room\">http://sandradodd.com/room</a> ,<br/>\nthere was a frustration.  Several regular list members were there.  I wanted to bring some of the important parts here for discussion.  <br/>\n<br/>\nI had said if my kids weren&#39;t being nice I would say they couldn&#39;t be that way in my house.  (I&#39;ll find the exact quote if someone else doesn&#39;t, but I need to get up and take a break from thinking about it right now.)  Someone asked whether that wasn&#39;t authoritarian.<br/>\n<br/>\nI want to get back to this.  I got very cranky in the chat because it seemed people were accepting rudeness and meanness from and between their kids, or of their kids to strangers.   It was going VERY quickly, with 22, 23 people sometimes.<br/>\n<br/>\nI wanted to start this topic, though, and come back to it.  Maybe others will have filled it all in.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":59419,"nextTopicId":59542}}