{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] earning money was two concerns to discuss","postDate":"1205445291","msgId":33036,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM3NUJGQTUwLTZGNzctNEYwNS1BMjE0LThBNUY2MDcxMjk5OEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDAzMTMyMDA4MjE0NS42MDcwLjQ3RDlBMDk1MDAwMDQyOEUwMDAwMTdCNjIyMTIwMjA3ODQwQTAwMDAwNzA0MEM5QjlBOUMwQTAyMEUwNkBjb21jYXN0Lm5ldD4=","referencesHeader":"PDAzMTMyMDA4MjE0NS42MDcwLjQ3RDlBMDk1MDAwMDQyOEUwMDAwMTdCNjIyMTIwMjA3ODQwQTAwMDAwNzA0MEM5QjlBOUMwQTAyMEUwNkBjb21jYXN0Lm5ldD4="},"prevInTopic":33034,"nextInTopic":0,"prevInTime":33035,"nextInTime":33037,"topicId":33034,"numMessagesInTopic":0,"msgSnippet":"-=-They say that the flowers will sell better with a charity however, I suggested that telling people that you had a horse to support might be a selling point,","messageBody":"<div id=\"ygrps-yiv-1311096963\">-=-They say that the flowers will sell better with a charity however,  <br/>\nI suggested that telling people that you had a horse to support might  <br/>\nbe a selling point, too-=-<br/>\n<br/>\nCan you drive manure around and offer to sell it to people doing  <br/>\nspring gardening?<br/>\n<br/>\n-=-It&#39;s not your job to give him money neccessarily.... but you can  <br/>\nsupport him in getting his own.....-=-<br/>\n<br/>\nI think it&#39;s an unschooling parent&#39;s job to provide access to the  <br/>\nworld, and that always costs some money.<br/>\n<br/>\nIt doesn&#39;t seem to me that it&#39;s productive to tell an unschooled kid  <br/>\n&quot;If you want something, get a job,&quot; or &quot;If you want money, make your  <br/>\nown.&quot;  I&#39;m not just pulling this idea out of my ass, either.  My boys  <br/>\nhave had thousands of dollars in savings from money they earned.   <br/>\nHolly worked babysitting, making a little over $100 a week.  She  <br/>\nbought a ticket to Rhode Island to visit her friend Quinn, and took  <br/>\n$300 or so with her to spend.  I offered to help with the ticket but  <br/>\nshe wanted to do it herself.<br/>\n<br/>\nNone of them had a job because they had to.  The advantage of that is  <br/>\nthat they&#39;re working out of the joy and desire to be there, not out  <br/>\nof fear of quitting.  Even now, Kirby doesn&#39;t have to be afraid to  <br/>\nquit his job.  He has no car payments (inherited a car when his uncle  <br/>\ndied) and we&#39;d be glad to have him move back here.  So he&#39;s working  <br/>\nbecause he wants to.  He LIKES his job.<br/>\n<br/>\nUntil a child decides to want to work, pressing him to do it seems  <br/>\nlike pressing a child to read or &quot;do math,&quot; instead of waiting for it  <br/>\nto come naturally.<br/>\n<br/>\nPeople who think the desire to work won&#39;t come naturally haven&#39;t seen  <br/>\nmany unschooled teens, I think.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":239259628,"authorName":"janesutcliffe@comcast.net","from":"janesutcliffe@...","profile":"jsutfran","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"earning money was two concerns to discuss","postDate":"1205444757","msgId":33034,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAzMTMyMDA4MjE0NS42MDcwLjQ3RDlBMDk1MDAwMDQyOEUwMDAwMTdCNjIyMTIwMjA3ODQwQTAwMDAwNzA0MEM5QjlBOUMwQTAyMEUwNkBjb21jYXN0Lm5ldD4="},"prevInTopic":0,"nextInTopic":33036,"prevInTime":33033,"nextInTime":33035,"topicId":33034,"numMessagesInTopic":0,"msgSnippet":"Beth M. wrote: 1. How do I help ds11 earn money from outside our family?  You could honestly tell your son that you don t know how to make money and refer","messageBody":"<div id=\"ygrps-yiv-1267625069\">Beth M. wrote: <br/>\n&quot;1. How do I help ds11 earn money from outside our family? &quot;<br/>\n<br/>\nYou could honestly tell your son that you don&#39;t know how to make money and refer him to the &#39;experts&#39; who have written books about it or who have websites or anything.    There&#39;s the movie &quot;The Secret&quot;, too.   I&#39;ve seen books at the library about earning money for kids....<br/>\n<br/>\nOnce I was in a store with a kid (about 7yo) and he stood there in front of the candy counter with the following dilemma:  &quot;I want to keep my dollar bill but I want some candy.&quot;  I thought to myself, &quot;bummer, there&#39;s no way!&quot;  I didn&#39;t have any money with me at all... I had walked him to the store bec. HE wanted to buy something.....I turned to a man in line and repeated the boy&#39;s dilemma and he said, &quot;well, here&#39;s 4 quarters, you can get something with that.&quot;    I became a &#39;believer&#39; after that in POSSIBILITIES.  Just when you think nothing will work... along comes a solution from nowhere!<br/>\n<br/>\nMy kids (9,11, and 13yo) have earned money selling flowers through Dutch Mill Bulbs .... (dutchmillbulbs.com)  sell the flowers for $5 and keep $2.50....   we used to do it as a fundraiser for charities but I&#39;ve more recently decided that they should keep some of the money as commission.   They hadn&#39;t thought of that!  So, they keep some of the money and some of it goes to charities (one is our non-profit &#39;homeschool&#39; group) and they&#39;ll choose another.  They say that the flowers will sell better with a charity however, I suggested that telling people that you had a horse to support might be a selling point, too... whatever.... I have it going for all the kids in our &#39;group&#39; and am hopeful that they will sell a lot of flowers and make a lot of money for themselves.   I hope, too, that they will feel more empowered about getting money and whatever they want with that money....<br/>\n<br/>\nIf you don&#39;t have the energy, inclination, or whatever to earn money, then he can be pointed into directions where he can earn money or get his &#39;stuff&#39; without money.  <br/>\n<br/>\nTo me, it comes down to identifying a problem (wanting money) and brainstorming solutions.... and there&#39;s always the internet and library for ideas....<br/>\n<br/>\nAlso, I had to get out of their way... one of my kids is starting a pet-sitting business out here in the country and I think I sometimes have my stuff show up in how I talk to her.... I have to remember that her starting this business is HER business - whether she makes a ton or not... I&#39;m just here to support her... the mistakes and successes are hers to make.....  <br/>\n<br/>\nIMO, there&#39;s great power in identifying one&#39;s &#39;problem&#39; and working towards it - whether one is successful or &#39;not&#39;... and those &#39;nots&#39; fall under Einstein&#39;s comment about knowing what doesn&#39;t work and thus is not an unsuccessful endeavor.... <br/>\n<br/>\nIt&#39;s not your job to give him money neccessarily.... but you can support him in getting his own.....<br/>\n<br/>\ndon&#39;t know if I&#39;m making sense here but it&#39;s a beautiful evening so I&#39;m going out to walk with the dogs before we go bowling with friends at &#39;buck fifty&#39; night at 930pm...<br/>\n<br/>\nThat&#39;s all for now...<br/>\nGood luck!<br/>\nJane<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":33001,"nextTopicId":33039}}