{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"Olivia","from":"Olivia &lt;liv2learn@...&gt;","replyTo":"LIST","senderId":"wvEcIhGeh30RqsQPhDd4OW9whGc6f2Qwptp580gZciOpYXXaTkDLlBI__AvLwJOXT4zqXDJ7CU8QHOg55i81ko-G_w","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] unschooling support","postDate":"968218665","msgId":12864,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQuMS4yMDAwMDkwNjAwMjcyNS4wMDkyMmE3MEBwb3AubWFpbC55YWhvby5jb20+","inReplyToHeader":"PDk2ODEzNzc2Mi4xNjc5NUBlZ3JvdXBzLmNvbT4="},"prevInTopic":12548,"nextInTopic":0,"prevInTime":12863,"nextInTime":12865,"topicId":12548,"numMessagesInTopic":0,"msgSnippet":"Erin: I hope you had that hidden tape recorder ready to record DH s pro-unschooling comments to save them for later. LOL My husband can be supportive in one","messageBody":"<div id=\"ygrps-yiv-1527553616\">Erin:<br/>\nI hope you had that hidden tape recorder ready to record DH&#39;s<br/>\npro-unschooling comments to save them for later. LOL My husband can be<br/>\nsupportive in one breath, then turn around and tell ds that he needs to do<br/>\nmore math practice or he&#39;ll need to go to school. Well, he is TRYING to<br/>\nbecome more supportive...<br/>\n<br/>\nAs far as unschooling support goes within local homeschool groups, I have<br/>\nmet quite a few people who would like to be more unschoolish but just can&#39;t<br/>\nquite go there. I admit, if questioned by a non-homeschooler (and some<br/>\nhomeschoolers too) about what we are doing for &quot;schoolwork&quot;, I usually<br/>\nsidestep the issue by saying we are &quot;going with my son&#39;s interests&quot; and<br/>\n&quot;doing a lot of hands-on activities&quot; or that I obtained the local school<br/>\ncurriculum. (Of course I don&#39;t say we are actually following it!) I am<br/>\nusually too chicken to use the &quot;unschooling&quot; word. But this is only our<br/>\nsecond official year homeschooling, so maybe someday I&#39;ll utter that &quot;u&quot;<br/>\nword in public. Ha, ha... <br/>\n<br/>\nWhen talking to other homeschoolers I usually first assess their<br/>\nperspectives on learning before I disclose our approach. One thing that is<br/>\ndiscouraging is when another homschooler tells me that they cannot attend<br/>\nsome great activity or arrange a play date because a certain time slot<br/>\n(usually 8-12 AM) is reserved for school work and they don&#39;t leave the<br/>\nhouse during that time. I first think &quot;that&#39;s too bad&quot;, then I think<br/>\n&quot;should I be doing that or my child will be uneducated in comparison?&quot;<br/>\nAlthough I realize that wouldn&#39;t work for us anyway, even if I ever wanted<br/>\nto schedule our lives like that. But I do experience these confusing and<br/>\nconflicting feelings about our way of learning. <br/>\n<br/>\nIt is funny to read about your daughter&#39;s excitement over the novelty of<br/>\nthe history class. I think if it was an everyday thing the excitement would<br/>\nwear off pretty quickly. I was surprised when ds recently asked for math<br/>\nflashcards. I nearly did a double-take. This is a kid who HATES every term<br/>\nrelated to &quot;school&quot;. So, we bought him some triangle flash cards. I don&#39;t<br/>\nthink he&#39;ll really use them beyond the the day we bought them. (I am afraid<br/>\nhe is like me: planning and shopping for educational supplies is more<br/>\nexciting than actually using them!) I guess we all go through stages in our<br/>\nlives when our need for structure ebbs and flows. At least with unschooling<br/>\nyou can allow yourself to ebb occasionally, whereas in school you always<br/>\nhave to go with their flow. <br/>\n<br/>\nOlivia<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;   Date: Tue, 5 Sep 2000 01:07:14 EDT<br/>\n&gt;   From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:MorelFam@...\">MorelFam@...</a><br/>\n&gt;Subject: unschooling support<br/>\n&gt;<br/>\n&gt;ty olivia.  nice to know someone empathized with my decidedly on-topic post! <br/>\n&gt;haha!  some topics are more interesting than others...  do you have have <br/>\n&gt;unschooling support where you live or a pro-unschooling spouse?  tonite at <br/>\n&gt;dinner, i heard dh make some comments that could be construed as supportive <br/>\n&gt;of unschooling!  i was delighted, but acted calm!  :)  i still get somewhat <br/>\n&gt;uncomfortable at trying to explain/defend our unschooling to anyone, esp <br/>\n&gt;other homeschoolers...   <br/>\n&gt;my dd(10.11) is has just begun taking a history class once a wk w/other <br/>\n&gt;hmschoolers and it is much too schooly (style) for my taste.  but she is so <br/>\n&gt;thrilled with being assigned homework, presentations, etc.  she is extremely <br/>\n&gt;motivated, taking it all very seriously, and says, &quot;mom!  now i&#39;ll finally <br/>\n&gt;get to use those homework tips i read about it my american girl magazine!&quot;  <br/>\n&gt;LOL!  it is so funny to watch her... the novelty of it all, having been <br/>\n&gt;unschooled her whole life-- it is &quot;fun&quot; to her, so far...<br/>\n&gt;erin </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"Olivia","from":"Olivia &lt;liv2learn@...&gt;","replyTo":"LIST","senderId":"yqBX2xJh1I7aE-QR-JhCYJgisooLU8CFpL0Mm6c_cqxdO1vw9oGHU9QG0Kjl7vWRIq199PjZ5-6pAVDNV1EwuE7A0A","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] unschooling support","postDate":"968023723","msgId":12548,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQuMS4yMDAwMDkwMzE4MjA0MC4wMDkxZTEwMEBwb3AubWFpbC55YWhvby5jb20+","inReplyToHeader":"PDk2NzkyMzcyOC4xMzEwNkBlZ3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":12864,"prevInTime":12547,"nextInTime":12549,"topicId":12548,"numMessagesInTopic":0,"msgSnippet":"... No, Erin, you are not the only one who feels this way sometimes! I had wanted to respond to your post (I am correct in remembering it was whine right?),","messageBody":"<div id=\"ygrps-yiv-1502153328\"><blockquote><span title=\"ireply\">&gt;Message: 9<br/>\n&gt;   Date: Sat, 2 Sep 2000 13:54:19 EDT<br/>\n&gt;   From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:MorelFam@...\">MorelFam@...</a><br/>\n&gt;Subject: Re: unschooling support<br/>\n<br/>\n&gt;it wasnt just a frustrating day, i get this way occasionally, am i the only <br/>\n&gt;one?  especially when the school year begins and my dd wants &quot;homework&quot; and <br/>\n&gt;everyone else has such a neat &quot;plan.&quot;<br/>\n<br/>\n<br/>\n </span></blockquote>No, Erin, you are not the only one who feels this way sometimes! I had<br/>\nwanted to respond to your post (I am correct in remembering it was &quot;whine&quot;<br/>\nright?), but I got sidetracked and the earlier mail got deleted. I copied<br/>\nit and sent it to a friend and we both empathized with you. We can<br/>\nDEFINITELY understand those feelings, especially at this time of year when<br/>\nother homeschoolers are getting full swing into their &quot;wonderful&quot; unit<br/>\nstudies and curriculum plans and have to tell you all about them. Then<br/>\nthere&#39;s the back-to-school thing. (We won&#39;t even go there!) Unschooling is<br/>\nhard sometimes because it requires a lot of faith and a lot of<br/>\nspur-of-the-moment creativity, and a lot of paying attention and quick<br/>\nchanges in plans when the kids&#39; interests change. And so much of its value<br/>\ncan&#39;t be pinned down on paper and it won&#39;t be evident for years. Then I am<br/>\nusually reassured by some small glimmer of real learning, when it peeks<br/>\nout, that unschooling REALLY does work. But, oh those days of doubt in<br/>\nbetween glimmers can be hard!<br/>\n<br/>\nSo, I am glad you posted what we all feel at times.<br/>\n<br/>\nOlivia</div>","specialLinks":[]}],"prevTopicId":12863,"nextTopicId":12866}}