{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":12,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Responsibility?","postDate":"1209574989","msgId":34576,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJCRjU4RkQ4LTA3MzYtNERGRS05NDgxLTQxNTJGMTBFQTA5RUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGZ2OGJzNCtqb3V0QGVHcm91cHMuY29tPg==","referencesHeader":"PGZ2OGJzNCtqb3V0QGVHcm91cHMuY29tPg=="},"prevInTopic":34572,"nextInTopic":0,"prevInTime":34575,"nextInTime":34577,"topicId":34544,"numMessagesInTopic":0,"msgSnippet":"-=-. Once I realized that mopping the floor wasn t so bad. I actually kind of enjoyed it because I was doing something I wanted to do. (and now I m just going","messageBody":"<div id=\"ygrps-yiv-607737623\">-=-. Once I realized that mopping the<br/>\nfloor wasn&#39;t so bad. I actually kind of enjoyed it because I was<br/>\ndoing something I wanted to do. (and now I&#39;m just going around in<br/>\ncircles)-=-<br/>\n<br/>\n<br/>\n<br/>\nBut going around in circles around the main point!!<br/>\n<br/>\n<br/>\n<br/>\nWhat if your kids could understand that from the very beginning and  <br/>\nnot wait to get it until they think they&#39;ve been martyrs for dozens  <br/>\nof years, doing things they didn&#39;t want to do?<br/>\n<br/>\n<br/>\n<br/>\nThat&#39;s what unschooling can be and why unschooling can blossom when  <br/>\nthe parents understand that choices and choosing don&#39;t mean always  <br/>\nchoosing ice cream for breakfast.  Realizing and providing tons of  <br/>\nchoices make the choices we do make clearer and happier.<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":244242275,"authorName":"Joanna Wilkinson","from":"&quot;Joanna Wilkinson&quot; &lt;jbwilkinson6@...&gt;","profile":"joanna514","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Responsibility?","postDate":"1209561573","msgId":34572,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ2OXJsNSs2aGV1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDliY2E5ZTMwODA0MjcyMzA5aDMyMmIzNjk4eDNkNzE0ZjE2MTY1OTk0YzdAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":34566,"nextInTopic":34576,"prevInTime":34571,"nextInTime":34573,"topicId":34544,"numMessagesInTopic":0,"msgSnippet":"... When my unschooled dd decided to try highschool, I supported her, but I did not ever make her comply with any of the rules or requirements.  I never had to","messageBody":"<div id=\"ygrps-yiv-1968714472\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; But then I thought of &quot;responsibility.&quot;  Are unschooled children<br/>\n&gt; &quot;responsible?&quot;<br/>\n<br/>\n </span></blockquote>When my unschooled dd decided to try highschool, I supported her, but I <br/>\ndid not ever make her comply with any of the rules or requirements.  I <br/>\nnever had to wake her up in the morning, make her study or do homework, <br/>\nor any other thing that parents complain about.  Any time she didn&#39;t <br/>\nwant to go, I was happy and said, &quot;you never have to go!&quot;  but she did.<br/>\nShe is responsible for the things that matter to her.  <br/>\nA clean room isn&#39;t one of them.;-)<br/>\nKeeping her word is.<br/>\nShe has done very well.  She is considered very responsible by teachers.<br/>\nWhen she got her first job, it was the same experience.  I don&#39;t have <br/>\nto make her get there on time.  She does her job well, and gets <br/>\ncomplimented on her poise and maturity.<br/>\nSame thing when she started driving (though that was a lot harder for <br/>\nme to deal with).  I don&#39;t trust the other drivers out there.  But she <br/>\nis a good/responsible driver.<br/>\nI never had to give her stuff to do to make sure she would learn to be <br/>\nresponsible in the future.  You are responsible when you care about the <br/>\nthings you are doing.  When it is self motivated.<br/>\n<br/>\nJoanna W.</div>","specialLinks":[]},{"userId":332901363,"authorName":"keetry","from":"&quot;keetry&quot; &lt;keetry@...&gt;","profile":"keetry","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Responsibility?","postDate":"1209512644","msgId":34566,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ2OGJzNCtqb3V0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDgwMTI4NC43OTM1My5xbUB3ZWI4NjIwOS5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":34554,"nextInTopic":34572,"prevInTime":34565,"nextInTime":34567,"topicId":34544,"numMessagesInTopic":0,"msgSnippet":"... When I first read this, I thought, I sure do! I do stuff I don t want to do all the time. It s called housework. Later that same day I was mopping the","messageBody":"<div id=\"ygrps-yiv-805600480\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Schuyler &lt;s.waynforth@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; I don&#39;t do things I don&#39;t want to do. Really. <br/>\n<br/>\n </span></blockquote>When I first read this, I thought, &quot;I sure do!&quot; I do stuff I don&#39;t <br/>\nwant to do all the time. It&#39;s called housework. Later that same day <br/>\nI was mopping the bathroom floor and this idea occured to me again. <br/>\nWas I really mopping the floor because I had to even though I didn&#39;t <br/>\nreally want to? The answer was no. I WANTED to mop the floor because <br/>\nI WANTED it clean before I put the rugs I just washed back down. I <br/>\ncould&#39;ve just as easily put the rugs back down and no one would&#39;ve <br/>\nbeen the wiser. <br/>\n<br/>\nThen I finally got this idea. I don&#39;t particularly like mopping the <br/>\nfloor but I don&#39;t do it in spite of not wanting to. I do it because <br/>\nI DO want to for my own reason. Once I realized that mopping the <br/>\nfloor wasn&#39;t so bad. I actually kind of enjoyed it because I was <br/>\ndoing something I wanted to do. (and now I&#39;m just going around in <br/>\ncircles)<br/>\n<br/>\nAlysia</div>","specialLinks":[]},{"userId":193844353,"authorName":"Nicole Willoughby","from":"Nicole Willoughby &lt;cncnawilloughby@...&gt;","profile":"cncnawilloughby","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Responsibility?","postDate":"1209392233","msgId":34554,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc3Mzc1NC4zNTM4Ny5xbUB3ZWIzMTkxMy5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGZ2NGtmaCs5aWtvQGVHcm91cHMuY29tPg=="},"prevInTopic":34552,"nextInTopic":34566,"prevInTime":34553,"nextInTime":34555,"topicId":34544,"numMessagesInTopic":0,"msgSnippet":"Love the pics. I wish you guys were in dallas Id love to meet you. Nicole ... Be a better friend, newshound, and know-it-all with Yahoo! Mobile.  Try it now. ","messageBody":"<div id=\"ygrps-yiv-1622162014\">Love the pics. I wish you guys were in dallas Id love to meet you. <br/>\n   <br/>\n  Nicole <br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nBe a better friend, newshound, and know-it-all with Yahoo! Mobile.  Try it now.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"&quot;Sandra Dodd&quot; &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Responsibility?","postDate":"1209390385","msgId":34552,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ2NGtmaCs5aWtvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDliY2E5ZTMwODA0MjcyMzA5aDMyMmIzNjk4eDNkNzE0ZjE2MTY1OTk0YzdAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":34551,"nextInTopic":34554,"prevInTime":34551,"nextInTime":34553,"topicId":34544,"numMessagesInTopic":0,"msgSnippet":"... do they ... Others have given great responses to these good questions. My kids are 16, 19 and 21. They are all very responsible.  That says very little, ","messageBody":"<div id=\"ygrps-yiv-744078872\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Kim Musolff&quot; &lt;kmoose75@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; So now I&#39;m stuck again.  How do unschoolers become responsible?  How<br/>\n </span></blockquote>do they<br/>\n<blockquote><span title=\"ireply\"> &gt; do things that they don&#39;t want to do, and not take the easy way out?  <br/>\n<br/>\n </span></blockquote>Others have given great responses to these good questions. My kids are<br/>\n16, 19 and 21. They are all very responsible.  That says very little,<br/>\nthough, unless we&#39;re agreeing on terms and ideas.<br/>\n<br/>\nLiterally, &quot;responsible&quot; means &quot;answerable.&quot;  Respond=answer.  If I&#39;m<br/>\nresponsible to someone, it means I need to report to and defend myself<br/>\nto them.  I think that&#39;s what most people mean when they say<br/>\n&quot;responsible,&quot; though few of them will be so analytical as to look<br/>\nbelow the surface or to even think of the meanings of the words<br/>\nthey&#39;re using.<br/>\n<br/>\nIf I&#39;m responsible for something, it means I&#39;m answerable for the<br/>\nchoices and actions I took while that thing was in my care.  A best<br/>\nman will take responsibility for the wedding ring for a while on the<br/>\nwedding day.  The bride is responsible for the ring after that.  The<br/>\nmanager of a restaurant is responsible for the building, the money,<br/>\nthe people, the safety of the customers.  The postman is responsible<br/>\nfor the mail he&#39;s taken on to deliver.  I&#39;m responsible for my<br/>\nchildren.  Kirby&#39;s responsible for this apartment (we&#39;re visiting;<br/>\nphotos and details are at <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.blogspot.com\">http://sandradodd.blogspot.com</a> ), and for<br/>\nshowing up to work and doing what he has agreed to do and is being<br/>\npaid to do.  <br/>\n<br/>\nYesterday, back home, Marty had a dilemma and I don&#39;t know yet how it<br/>\nwas handled.  He had planned to go to an SCA event in Cuba, New<br/>\nMexico, two or three hours away.  He hadn&#39;t known he was scheduled to<br/>\nwork at 4:30 or so in the afternoon.  He told me if he couldn&#39;t get<br/>\nout of work, he would miss the event. Because he&#39;s &quot;a responsible<br/>\nguy,&quot; I&#39;m not too worried about whether he did the right thing. I&#39;m<br/>\nsure he didn&#39;t ditch work.  I&#39;m sure he didn&#39;t stand anyone up, about<br/>\ndriving or riding to that event.  I&#39;m sure he didn&#39;t forget to feed<br/>\nthe pets or to lock the house, although it&#39;s possible he forgot to put<br/>\nthe trash out this morning.  I&#39;m not going to call him and check,<br/>\nthough.  I&#39;m going to let him sleep, if he&#39;s sleeping.<br/>\n<br/>\nMarty&#39;s responsibility isn&#39;t to me.  It&#39;s to himself, and to what&#39;s<br/>\nright and good.  He&#39;s becoming a man and he wants to be a good man.<br/>\n<br/>\n<br/>\n-=-Do they just turn out that way because they are loved and<br/>\nsupported?  If we&#39;re not telling them what to do, and not giving them<br/>\nresponsibilities, how do they know how to act responsibly?-=-<br/>\n<br/>\nI didn&#39;t give them English responsibilities, but they are good with<br/>\nEnglish.  Holly asked me the other day what words are called that tell<br/>\nyou you did something.  Adverbs.  She was asking me about adverbs. <br/>\nShe didn&#39;t want a long lesson, just a quick answer, so I used &quot;every<br/>\nday&quot; and &quot;everyday&quot; as an example of the difference between adverbs<br/>\nand adjectives.  On the way here we were listening to Buddy Holly, and<br/>\n&quot;Every Day&quot; came on.  I asked her if it was one word or two.  Two. <br/>\n&quot;Adverbial phrase,&quot; I said.  That was all.  <br/>\n<br/>\nThat wasn&#39;t about &quot;responsibility,&quot; it was about conversation and<br/>\ncuriosity and answering questions and pointing out examples.  It was<br/>\npainless, it was non-pressuring.  <br/>\n<br/>\nSame with anything, in my kids&#39; lives.  Holly said she would call<br/>\nBrett within a certain window, and she did.  I told Keith I would look<br/>\nsome things up this morning on the internet, and I have.  We&#39;re used<br/>\nto keeping our word, we see other people do it, and we see the ill<br/>\neffects of people NOT keeping their word sometimes.  No sense faking<br/>\nany of that up or setting up practice situations.  The world is full<br/>\nof real responsibility and real irresponsibility.<br/>\n<br/>\nWe already know some stories about slight damage to Kirby&#39;s apartment.<br/>\n A scruff on the wall from the back of his futon couch.  He put<br/>\npadding there with duct tape, after it scratched.  There&#39;s a<br/>\nlow-hanging lamp they&#39;ve run into.  It&#39;s not broken, no one&#39;s hurt,<br/>\nbut they did notify the management that it&#39;s loose.  They didn&#39;t do<br/>\nthat because they&#39;re afraid of disapproval from their parents.  They<br/>\ndid that because they&#39;re responsible people.<br/>\n<br/>\nMaybe thinking of &quot;responsibility&quot; as &quot;trustworthiness&quot; will make it<br/>\neasier to see in an unschooling light.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Responsibility?","postDate":"1209389660","msgId":34551,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgwMTI4NC43OTM1My5xbUB3ZWI4NjIwOS5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":34550,"nextInTopic":34552,"prevInTime":34550,"nextInTime":34552,"topicId":34544,"numMessagesInTopic":0,"msgSnippet":"... I ve been sitting here making a list of qualities I want my children to have as they grow up.  Things like kindness, passion, happiness, fulfillment, etc.","messageBody":"<div id=\"ygrps-yiv-992551793\">-----------------------------------------------------<br/>\nI&#39;ve been sitting here making a list of qualities I want my children to have<br/>\nas they grow up.  Things like kindness, passion, happiness, fulfillment,<br/>\netc.  I&#39;m doing this, not as a &quot;checklist&quot; for what my kids need to<br/>\naccomplish, but to help me remember that compliance is not a quality I want<br/>\nfor my children.  (My current unschooling hurdle!)   Anyway, after reading<br/>\ntons of books and having lots of discussions about unschooling, I am<br/>\nstarting to believe that unschooling is probably the best way for my<br/>\nchildren to achieve these qualities.<br/>\n<br/>\nBut then I thought of &quot;responsibility.&quot;  Are unschooled children<br/>\n&quot;responsible&quot;?<br/>\n---------------------------<br/>\nAre schooled children responsible? Is there a method that you know of that will &quot;teach&quot; responsiblity? I don&#39;t think I&#39;m more responsible because my parents spanked me or made me take piano lessons even when I wanted to quit or because my mom would make a chore chart for me in the summer and I&#39;d get stars for every chore that I did without having to be nagged to do it. Is it being responsible if someone else is dictating your actions to you? <br/>\n<br/>\nThat said, I think both Simon(11) and Linnaea (8) are largely responsible people. Yesterday, as I lay down for a much needed nap I listened to Simon and Linnaea chatting in the other room. Linnaea was saying to Simon that she preferred his room. And they talked about why, in the end they both concluded it was because her room was messy so they went, together, and cleaned it. They moved boxes that have been waiting to be unpacked into the spare room and set it up so that they could watch a movie on a portable DVD player. They shared the responsibility of making Linnaea&#39;s room more pleasant for her to be in. The other day Simon went to a castle with a friend. We gave him 10 pounds to pay for entry and whatever else he needed (he had a packed lunch and water, so didn&#39;t have to eat what was in the cafe if he didn&#39;t want to). Without our prompting him, he offered to pay his way into the castle. His host paid for him. Other boys he knew were there. When the<br/>\n friend he&#39;d come with got upset about an incident with another friend, Simon went to him and just hung out with him. I figure those things are pretty responsible. <br/>\n<br/>\n<br/>\n-----------------------------<br/>\nWe always hear that children should grow up to become &quot;responsible adults.&quot;<br/>\nMy old thinking would say that by giving them chores, making them take care<br/>\nof and clean up their toys, etc, (ie. giving them responsibilities) would<br/>\nmake them responsible.<br/>\n<br/>\nSo now I&#39;m stuck again.  How do unschoolers become responsible?  How do they<br/>\ndo things that they don&#39;t want to do, and not take the easy way out?  Do<br/>\nthey just turn out that way because they are loved and supported?  If we&#39;re<br/>\nnot telling them what to do, and not giving them responsibilities, how do<br/>\nthey know how to act responsibly?<br/>\n<br/>\n---------------------------------------------<br/>\n<br/>\nI don&#39;t do things I don&#39;t want to do. Really. If there is something that I might be reticent to do I either don&#39;t do it or I find ways that I want to do it. It takes a little bit of rethinking, seeing other possibilities, seeing payoffs for my actions, for me to see a way that I want to choose to do something. There is very little that I feel I have to do. Simon and Linnaea wanted to go biking today, so I got everything ready and we started biking to the next village along to get to the store. Halfway there Simon had a bike accident and scraped up his knees. After sitting for a little while we turned around and went home. There was no reason to continue to the store, we were on our way for our own pleasure. It doesn&#39;t make us more or less responsible for having not overcome the hurdle of scraped knees to get to the store to buy a candybar or an ice cream cone. They didn&#39;t learn that they are quitters in that action, or that they can shrug off<br/>\n responsibility, or that somethings are too hard to overcome. What they may have come away with is the idea that they like biking, even if they get hurt, or that I listen when they say they are done, or that their choices are honored. Or something completely other. But I don&#39;t think unschooling isn&#39;t helping them to become responsible adults. I think it is much harder to come to truly be responsible when your choices are limited and dictated to you.<br/>\n<br/>\nSchuyler<br/>\nwww.waynforth.blogspot.com<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":321729783,"authorName":"Angela Shaw","from":"&quot;Angela Shaw&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Re: Responsibility?","postDate":"1209389553","msgId":34550,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDUwMWM4YTkzNCQ1MGViZTZkMCQ2NTAwYThjMEBFYm9ueT4=","inReplyToHeader":"PGZ2NGZzOSs4cjEwQGVHcm91cHMuY29tPg=="},"prevInTopic":34548,"nextInTopic":34551,"prevInTime":34549,"nextInTime":34551,"topicId":34544,"numMessagesInTopic":0,"msgSnippet":"Ren said: Responsible behavior comes from people who have it modeled for them, are treated with kindness and respect and get lots of opportunities to ","messageBody":"<div id=\"ygrps-yiv-826006028\">Ren said:<br/>\n<br/>\nResponsible behavior comes from people who have it modeled for them,<br/>\nare treated with kindness and respect and get lots of opportunities to<br/>\nexperiment with choice. The rest of us learned it by default...in<br/>\nSPITE of being coerced, not because of it.<br/>\n<br/>\n <br/>\n<br/>\nI was going to write and say something similar to what Ren said above but<br/>\nshe said it really well.  <br/>\n<br/>\n <br/>\n<br/>\nMany times I&#39;ve volunteered to do something that needed to be done (for a<br/>\nclub or a relative) because it felt like the right thing to do.  When it<br/>\ncame time to do it, sometimes I didn&#39;t feel like it.  My kids have asked in<br/>\nthe past when they heard me grumbling why I was going to bother then.  I&#39;ve<br/>\nresponded that I signed up to do it and I would not feel good about myself<br/>\nif I didn&#39;t fulfill my commitment.  It is important to me to keep my word<br/>\nand I don&#39;t like to leave people hanging.  Even though those were just<br/>\npassing conversations, I know that it makes an impact on them.  I did not<br/>\nsay those things in order to teach my children to be responsible, it is just<br/>\nwho I am and I am always sharing how I think with my kids.  (It is also what<br/>\nmy parents modeled)<br/>\n<br/>\n <br/>\n<br/>\nMy kids take their own responsibilities very seriously.  We as a family are<br/>\nresponsible for our horses, cats, and bunnies.  Each and every day they see<br/>\nme model responsibility in caring for these animals and they partake in the<br/>\ncare of them to a large degree as well.  (I don&#39;t make them)  <br/>\n<br/>\n <br/>\n<br/>\nThey know that I get upset when I am late for something.  They know that<br/>\nwhen we schedule riding lessons or anything else that has an appointment<br/>\ntime that it is our responsibility to be on time or it can mess up someone<br/>\nelse&#39;s schedule.  (been on the other end of that when other people are late<br/>\nand it affects us)<br/>\n<br/>\n <br/>\n<br/>\nWhen they sign up to go to a pony club rally they know the other members of<br/>\nthe team are counting on them to do their best, to be prepared, and to act<br/>\nas part of the team for the well being of the team and not only for<br/>\nthemselves.  That is being responsible<br/>\n<br/>\n <br/>\n<br/>\nIt really comes down to modeling, imo.  My girls have always been unschooled<br/>\nand I take my own responsibilities very seriously and so do they at ages 11<br/>\nand 13.<br/>\n<br/>\n <br/>\n<br/>\nAngela Shaw<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a><br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Responsibility?","postDate":"1209385673","msgId":34548,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ2NGZzOSs4cjEwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDA4QjY4QUUxLUVCRjktNDA4Ni05MjQ5LTA4RTNFMzRDMDEwQ0B2ZXJpem9uLm5ldD4="},"prevInTopic":34547,"nextInTopic":34550,"prevInTime":34547,"nextInTime":34549,"topicId":34544,"numMessagesInTopic":0,"msgSnippet":"~~But then I thought of responsibility. Are unschooled children responsible? ~~ Humans grow into responsibilty if they have opportunities to do so. They","messageBody":"<div id=\"ygrps-yiv-1208166698\">~~But then I thought of &quot;responsibility.&quot; Are unschooled children<br/>\n&quot;responsible?&quot;~~<br/>\n<br/>\nHumans grow into responsibilty if they have opportunities to do so.<br/>\nThey WANT to be part of the world/tribe they live in. I think parents<br/>\nshort-circuit the desire for responsibility when they &quot;fix&quot; after a<br/>\nchild has done some task because the child didn&#39;t do it to the<br/>\nparent&#39;s standard.<br/>\n<br/>\nTrevor (18) just spent the last couple of weeks helping his<br/>\ngirfriend&#39;s family pack up and move into a new house. He did a ton of<br/>\nlifting and other exhausting work. He wanted to do it. <br/>\n<br/>\nPeople can make better choices, take on real responsibility when they<br/>\nare given the freedom to actually choose. People talk about kids<br/>\nmaking better choices but how do they think children learn that skill?<br/>\nBy choosing.:)<br/>\n<br/>\nResponsible behavior comes from people who have it modeled for them,<br/>\nare treated with kindness and respect and get lots of opportunities to<br/>\nexperiment with choice. The rest of us learned it by default...in<br/>\nSPITE of being coerced, not because of it.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Responsibility?","postDate":"1209376438","msgId":34547,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA4QjY4QUUxLUVCRjktNDA4Ni05MjQ5LTA4RTNFMzRDMDEwQ0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDliY2E5ZTMwODA0MjcyMzA5aDMyMmIzNjk4eDNkNzE0ZjE2MTY1OTk0YzdAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PDliY2E5ZTMwODA0MjcyMzA5aDMyMmIzNjk4eDNkNzE0ZjE2MTY1OTk0YzdAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":34546,"nextInTopic":34548,"prevInTime":34546,"nextInTime":34548,"topicId":34544,"numMessagesInTopic":0,"msgSnippet":"... Most people equate handing a task to a child and the child handling it to the parent s satisfaction as being responsible. When in life as adults are tasks","messageBody":"<div id=\"ygrps-yiv-1237712941\">On Apr 28, 2008, at 2:09 AM, Kim Musolff wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My old thinking would say that by giving them chores, making them  <br/>\n&gt; take care<br/>\n&gt; of and clean up their toys, etc, (ie. giving them responsibilities)  <br/>\n&gt; would<br/>\n&gt; make them responsible.<br/>\n<br/>\n </span></blockquote>Most people equate handing a task to a child and the child handling  <br/>\nit to the parent&#39;s satisfaction as being responsible.<br/>\n<br/>\nWhen in life as adults are tasks forced on us that we can&#39;t walk away  <br/>\nfrom or say no to? Slavery? Prison? (Even prison was a series of  <br/>\nchoices.)<br/>\n<br/>\nResponsibility is choosing to take on a burden and make that your own  <br/>\nto keep to your own standards. A real responsibility we can choose to  <br/>\ndrop if we want (and bear the consequences).<br/>\n<br/>\nWe can make children *act* responsible but we can&#39;t make them *feel*  <br/>\nresponsible. And by the time they&#39;re old enough to feel responsible,  <br/>\ntheir feelings about responsibilities are all tangled up with  <br/>\nfeelings of force and pressure.<br/>\n<br/>\nWe can nurture the feeling of being responsible by being responsible  <br/>\nourselves (especially to them, and giving them the reasons why we&#39;re  <br/>\ndoing something and involving them &quot;Maggie is counting on us picking  <br/>\nup the cake for the party, want to help me deliver it?&quot;) Also by  <br/>\nhelping them and making the tasks they take on more pleasant.  <br/>\n(Animals are a biggie. Parents should assume responsibility for pets  <br/>\nand invite kids along to help.)<br/>\n<br/>\nIf you go here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/\">http://joyfullyrejoycing.com/</a><br/>\n<br/>\nand scroll down on the right there&#39;s a section on Commitments,  <br/>\nObligations and Responsibilities.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":41664632,"authorName":"Barbara Chase","from":"Barbara Chase &lt;bc@...&gt;","profile":"mahalo_spirit","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Responsibility?","postDate":"1209372982","msgId":34546,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc0M0NBOTZCLUU4MEItNDMxRC04REY4LTQ1MTBFMzY5RjdDOEBuZXRjZXRlcmEuY29tPg==","inReplyToHeader":"PDliY2E5ZTMwODA0MjcyMzA5aDMyMmIzNjk4eDNkNzE0ZjE2MTY1OTk0YzdAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PDliY2E5ZTMwODA0MjcyMzA5aDMyMmIzNjk4eDNkNzE0ZjE2MTY1OTk0YzdAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":34545,"nextInTopic":34547,"prevInTime":34545,"nextInTime":34547,"topicId":34544,"numMessagesInTopic":0,"msgSnippet":"... It sounds like you have equated responsibility with doing what you don t want to do.  I view it more along the lines of having a greater capacity to make","messageBody":"<div id=\"ygrps-yiv-1285244549\"><blockquote><span title=\"ireply\">&gt; How do unschoolers become responsible? How do they<br/>\n&gt; do things that they don&#39;t want to do, and not take the easy way out?<br/>\n<br/>\n </span></blockquote>It sounds like you have equated responsibility with doing what you  <br/>\ndon&#39;t want to do.  I view it more along the lines of having a greater  <br/>\ncapacity to make better choices, and the awareness that we are  <br/>\nactually doing exactly what we want to do.<br/>\n<br/>\nI remember when I first read Sandra&#39;s discussion (either on her  <br/>\nwebsite or online, don&#39;t recall which) about making choices.  I had  <br/>\njust gotten a speeding ticket (first one in years and years, and it  <br/>\nwasn&#39;t particularly fair imho... I had the misfortune to be driving a  <br/>\nred car.... I don&#39;t recommend red cars!)  The county wouldn&#39;t allow  <br/>\nme to do traffic school online, and my dd wasn&#39;t keen on having me  <br/>\ngone for 10+ hours (she was still quite little), and I didn&#39;t want an  <br/>\nincrease in my insurance.  I was feeling pretty grumpy about the  <br/>\nwhole thing -- and then I remembered Sandra&#39;s discussion.  I was at  <br/>\nchoice, especially with the way I chose to feel about it!<br/>\n<br/>\nI ended up finding a traffic school that split the class up into 2  <br/>\nevenings, had an interesting conversation with my dd about balancing  <br/>\nthe different needs and the different choices that we could make, and  <br/>\nin the end I felt really good about going to the class.  It was even  <br/>\none of those humor classes, and I did laugh.  I was following my  <br/>\nchoices and doing what I wanted to do, and have since made better  <br/>\nchoices about car colors!<br/>\n<br/>\nI am becoming more responsible each day.... like other aspects of my  <br/>\nunschooling life, there isn&#39;t a specific end point.  There isn&#39;t a  <br/>\nparticular point in my life where I can say -- yep, that&#39;s where I  <br/>\nbecame responsible.  It&#39;s a growing, learning process for me as well  <br/>\nas my dd.  She became responsible for picking out her own clothes  <br/>\nwhen she was 2, and was responsible enough tonight when she decided  <br/>\nnot to move my laptop off my desk because she didn&#39;t feel ready to be  <br/>\nresponsible with the procedure to safely dismount my hard drive.   <br/>\nShe&#39;s already responsible, and is learning more about it each day --  <br/>\njust like I am.<br/>\n<br/>\nmahalo,<br/>\nBarbara<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":294520986,"authorName":"Joanna Murphy","from":"&quot;Joanna Murphy&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Responsibility?","postDate":"1209368358","msgId":34545,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ2M3V2Nitjc2RoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDliY2E5ZTMwODA0MjcyMzA5aDMyMmIzNjk4eDNkNzE0ZjE2MTY1OTk0YzdAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":34544,"nextInTopic":34546,"prevInTime":34544,"nextInTime":34546,"topicId":34544,"numMessagesInTopic":0,"msgSnippet":"... They become responsible by growing up and being able to take on more responsibility.  It goes back to the core--do you have to teach them to be all of","messageBody":"<div id=\"ygrps-yiv-675638448\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; But then I thought of &quot;responsibility.&quot;  Are unschooled children<br/>\n&gt; &quot;responsible?&quot;<br/>\n&gt; <br/>\n&gt; We always hear that children should grow up to become &quot;responsible adults.&quot;<br/>\n&gt; My old thinking would say that by giving them chores, making them take care<br/>\n&gt; of and clean up their toys, etc, (ie. giving them responsibilities) would<br/>\n&gt; make them responsible.<br/>\n&gt; <br/>\n&gt; So now I&#39;m stuck again.  How do unschoolers become responsible?  <br/>\n<br/>\n </span></blockquote>They become responsible by growing up and being able to take on more responsibility.  It <br/>\ngoes back to the core--do you have to teach them to be all of those other qualities you <br/>\nvalue, or will they grow into them in a nurturing environment, surrounded by adults that <br/>\nare modeling those qualities.  Behavior modification vs. becoming as they are <br/>\ndevelopmentally ready.<br/>\n<br/>\nIt&#39;s been easier and easier to keep this in mind with my daughter (9) who does not <br/>\nembody those qualities that I know she will as an adult, because I see flashes of them.  <br/>\nThe flashes have always been there, but my perspective has changed to one of trust and <br/>\nacceptance of her where she is at, so I can see them now differently.  I used to see the <br/>\nflashes and wonder why she couldn&#39;t act &quot;better&quot; more often.  Now I see the flashes and <br/>\nhave complete trust that those are the road markers that point the way to her becoming <br/>\nthe adult that will embody all of those qualities someday.<br/>\n<br/>\nAnd both of my children are helping out more around the house of their own accord--<br/>\nboth according to their personalities.  And they have both indicated, in various <br/>\nconversations, a complete awareness of the responsibilities of adulthood.  We just talk <br/>\nabout stuff and they see the adults around them living life, and they get it.  It really doesn&#39;t <br/>\nhave to be the painful process that many would have you believe!  :-)<br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":333194003,"authorName":"Kim Musolff","from":"&quot;Kim Musolff&quot; &lt;kmoose75@...&gt;","profile":"kimmusolff","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Responsibility?","postDate":"1209362943","msgId":34544,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDliY2E5ZTMwODA0MjcyMzA5aDMyMmIzNjk4eDNkNzE0ZjE2MTY1OTk0YzdAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":0,"nextInTopic":34545,"prevInTime":34543,"nextInTime":34545,"topicId":34544,"numMessagesInTopic":0,"msgSnippet":"I ve been sitting here making a list of qualities I want my children to have as they grow up.  Things like kindness, passion, happiness, fulfillment, etc.  I m","messageBody":"<div id=\"ygrps-yiv-256491743\">I&#39;ve been sitting here making a list of qualities I want my children to have<br/>\nas they grow up.  Things like kindness, passion, happiness, fulfillment,<br/>\netc.  I&#39;m doing this, not as a &quot;checklist&quot; for what my kids need to<br/>\naccomplish, but to help me remember that compliance is not a quality I want<br/>\nfor my children.  (My current unschooling hurdle!)   Anyway, after reading<br/>\ntons of books and having lots of discussions about unschooling, I am<br/>\nstarting to believe that unschooling is probably the best way for my<br/>\nchildren to achieve these qualities.<br/>\n<br/>\nBut then I thought of &quot;responsibility.&quot;  Are unschooled children<br/>\n&quot;responsible?&quot;<br/>\n<br/>\nWe always hear that children should grow up to become &quot;responsible adults.&quot;<br/>\nMy old thinking would say that by giving them chores, making them take care<br/>\nof and clean up their toys, etc, (ie. giving them responsibilities) would<br/>\nmake them responsible.<br/>\n<br/>\nSo now I&#39;m stuck again.  How do unschoolers become responsible?  How do they<br/>\ndo things that they don&#39;t want to do, and not take the easy way out?  Do<br/>\nthey just turn out that way because they are loved and supported?  If we&#39;re<br/>\nnot telling them what to do, and not giving them responsibilities, how do<br/>\nthey know how to act responsibly?<br/>\n<br/>\n<br/>\nI know you guys will help me with this.  I just need a little boost in my<br/>\nthinking!<br/>\nKim<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":34514,"nextTopicId":34567}}