{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":118944723,"authorName":"tarasine","from":"&quot;tarasine&quot; &lt;tarasine@...&gt;","profile":"tarasine","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Library as School","postDate":"1028643408","msgId":39942,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFpb2xvZytpcW12QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":39941,"nextInTime":39943,"topicId":39942,"numMessagesInTopic":0,"msgSnippet":"... In libraries, the attitude is ALWAYS, How can I help you? There is an understanding that the patron is seeking information, and the purpose of the","messageBody":"<div id=\"ygrps-yiv-236130354\">Ned wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n </span></blockquote>In libraries, the attitude is ALWAYS, &quot;How can I help you?&quot; There is an<br/>\nunderstanding that the patron is seeking information, and the purpose<br/>\nof the employee is to help the patron find it. No questions asked. No<br/>\nmention of the patron being too young or not being dressed properly;<br/>\nno discussion about the appropriateness of the information or the<br/>\n&quot;readiness&quot; of the patron to learn it; no mention of testing or<br/>\njudging, no timetables, no hall passes, no arbitrary rules, no need to<br/>\nask permission to go pee. The library attitude is benevolence and service.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n </span></blockquote>Unfortunately, this isn&#39;t always the case. I have one particularly<br/>\nnightmarish memory involving the librarian in the small town where I<br/>\ngrew up. It happened when I was 7 years old. I had read C.S. Lewis&#39;<br/>\n&quot;The Lion, the Witch, and the Wardrobe,&quot; and wanted to read the other<br/>\nbooks in the Chronicles of Narnia series. For some unfathomable<br/>\nreason, those books happened to be behind the librarians desk. While<br/>\nmy mother was in the &quot;children&#39;s room&quot; helping my little brothers find<br/>\nsome books, I timidly approached the librarian and asked her if she<br/>\nwould hand me the book I wanted. She smiled indulgently and asked,<br/>\n&quot;How old<br/>\nare you?&quot; When I told her, she smiled again and said (in one of those<br/>\nsickeningly sweet voices some adults use with children), &quot;Maybe you<br/>\nshould look for a book in there [pointing to the children&#39;s room]<br/>\ninstead.&quot; <br/>\n<br/>\nI was so shy at the time that, even though I KNEW she was wrong, I<br/>\njust went in and stood by my mother, miserable. I can&#39;t BELIEVE I<br/>\ndidn&#39;t tell my mother what happened. I know she would have had<br/>\nsomething to say to that woman! I&#39;ve imagined many different scenarios<br/>\ninvolving what I should have said and done, but the respect for<br/>\nauthority had been so ingrained in me that I wasn&#39;t confident enough<br/>\nto act on my feelings. <br/>\n<br/>\nFortunately, although this memory is quite painful to me even today,<br/>\nthe experience didn&#39;t have any effect on my love or ability for<br/>\nreading. (Interestingly, though, it wasn&#39;t until I was in my twenties<br/>\nwhen I finally read the other books in the Narnia series!)<br/>\n<br/>\nAnyway, I really hope this was a unique experience, and that no other<br/>\nchild has been treated in this way at a public library.  <br/>\n<br/>\nTarasine</div>","specialLinks":[]}],"prevTopicId":39938,"nextTopicId":39946}}