{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Joshua Heath","from":"&quot;Joshua Heath&quot; &lt;heathfam@...&gt;","replyTo":"LIST","senderId":"AQszRZ1qqLayV1LsGlinrO3l0-82RMV9_d5DDWthv4ZR5vO0iMmM3yeeupUg3w22NU27DFiRjtSIvoiHtHKUH5kd0jGyQbymMNk","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: computers,ebus","postDate":"950771242","msgId":6598,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy40MjMuNjU5OC45NTkyNjk3NDZAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":6597,"nextInTime":6599,"topicId":6598,"numMessagesInTopic":0,"msgSnippet":"Tina thanks for a very thoughtful message.  I have been reading the thread about computers and wondering a lot about the ups and the downs of their infuluence","messageBody":"<div id=\"ygrps-yiv-679517662\">Tina thanks for a very thoughtful message.  I have been reading the thread<br/>\nabout computers and wondering a lot about the ups and the downs of their<br/>\ninfuluence on our children.  I know my 7 yo son **loves** them and it can<br/>\nget a little obsessive and litterally take over his imagintion for periods<br/>\nof time.  What disturbs me is the loss of other imaginative activities (real<br/>\nactivities as opposed to elecronic simulations... )  (now i am going to get<br/>\nit)<br/>\nWe had resorted to imposing time limits.... recently we have decided this<br/>\nrestriction may have been making things worse... and so at a family meeting<br/>\nwe arrived at the idea of allowing constructive activities any time, and<br/>\nallowing games for a half hour per 2 computer hours logged on &quot;constuctive&quot;<br/>\nactivities.<br/>\nBut I still share your concerns about the losses inherent in encouraging<br/>\ncomputer literacy.  I agree as well the only thing to do is strive for a<br/>\nbalance and be sure to prestent lots of alternative opportunites to use<br/>\n&quot;real&quot; materials.<br/>\nJoshua<br/>\n<blockquote><span title=\"qreply\"> &gt; From: Tina Pearson &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ebus89@...\">ebus89@...</a>&gt;<br/>\n&gt;<br/>\n&gt; computers, computers... thoughts<br/>\n&gt;<br/>\n&gt; We are relatively new to the world of computers and world wiiiiiiide<br/>\n&gt; web.  I noticed in my own first forays, which were in using the word<br/>\n&gt; processor and a little networking, that my thought process was decidedly<br/>\n&gt; different when I wrote on the computer than when I wrote with a pen.  My<br/>\n&gt; fingers, although not rapid like a pro&#39;s are fairly fast because of<br/>\n&gt; piano playing, so the words can actually slip out faster than what my<br/>\n&gt; brain is accustomed to in my pen writing.  I found this both exciting<br/>\n&gt; and disconcerting. I  noticed that sometimes it was just a little too<br/>\n&gt; easy to type a lot of words without my usual contemplation, again which<br/>\n&gt; could be either good or bad, I suppose.<br/>\n&gt;<br/>\n&gt; I like words.  I started to think that perhaps the possibility of a glut<br/>\n&gt; of meaningless words might actually obscure any truth there might be in<br/>\n&gt; my communicating.  I&#39;ve  read some thoughtful writings from literary<br/>\n&gt; figures who are wary of this same thing.  Many writers do their work in<br/>\n&gt; long hand and then edit on the computer.  One well-respected and<br/>\n&gt; seasoned fiction writer recently said that he could tell within the<br/>\n&gt; first few paragraphs if a book was actually created on the computer or<br/>\n&gt; written by hand, and has yet to be proven wrong.  He bemoans this new<br/>\n&gt; ability we now have to spew out many words very fast, and the resulting<br/>\n&gt; proliferation of not-very-well-written books.<br/>\n&gt;      I have been thinking also about highschool teachers who only accept<br/>\n&gt; assignments completed on computer word processing, graphics and other<br/>\n&gt; programs.   When I heard about this and thought about it, I came to the<br/>\n&gt; conclusion that I would probably do the opposite -- I would want to see<br/>\n&gt; the physical manifestation, in all its awkwardness and/or flowing<br/>\n&gt; beauty, of a student&#39;s thought process and creativity as written with a<br/>\n&gt; pen or pencil, with drawings and lines on a piece of paper.  But maybe<br/>\n&gt; I&#39;m just old ...<br/>\n&gt;      Yes, computers are a part of this reality now, and they are a<br/>\n&gt; powerful tool.  I am wondering, though, about creativity and all those<br/>\n&gt; zillions of  little spaces and thoughts and ideas that don&#39;t fit into<br/>\n&gt; the paradigm of one program of another.  I know my daughter can be<br/>\n&gt; creative with MSPaint, and I&#39;ve had fun with it too, but the creativity<br/>\n&gt; is within extremely limited parameters.  Is it okay for a child to type<br/>\n&gt; e-mail messages and stories on the computer if she doesn&#39;t want to learn<br/>\n&gt; to write with a pen?   I don&#39;t know.  I know that we have spent less<br/>\n&gt; time smelling tempura, getting our hands all mucky with clay, smearing<br/>\n&gt; oil pastels and making our creative picture letters for friends and<br/>\n&gt; family.  So I worry that forms of communicating and thinking and working<br/>\n&gt; through things that don&#39;t lend themselves to digital electronics may be<br/>\n&gt; used less and less.  Not a good thought.  But reveals the need for a<br/>\n&gt; balance.<br/>\n&gt;<br/>\n&gt; I guess I am trying to be careful about this world of computers, while<br/>\n&gt; at the same time appreciating the access it has given me to information<br/>\n&gt; and worlds I otherwise wouldn&#39;t know about, etc.   I am hoping that the<br/>\n&gt; computer world will evolve through the input of the most brilliantly<br/>\n&gt; creative minds around -- probably unschoolers, who value diversity,<br/>\n&gt; autonomy, process, and all the rest ...<br/>\n&gt;<br/>\n&gt; Tina in cyberlimbo.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; --------------------------- ONElist Sponsor ----------------------------<br/>\n&gt;<br/>\n&gt; GET A NEXTCARD VISA, in 30 seconds!  Get rates as low as 2.9 percent<br/>\n&gt; Intro or 9.9 percent Fixed APR and no hidden fees.  Apply NOW!<br/>\n&gt; &lt;a href=&quot; <a rel=\"nofollow\" target=\"_blank\" href=\"http://clickme.onelist.com/ad/NextcardCreative4\">http://clickme.onelist.com/ad/NextcardCreative4</a> &quot;&gt;Click Here&lt;/a&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------------------------------------------<br/>\n&gt;<br/>\n&gt; Message boards, timely articles, a free newsletter and more!<br/>\n&gt; Check it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]}],"prevTopicId":6597,"nextTopicId":6600}}