{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Unschooling as music (and learning to hear it)","postDate":"1361826238","msgId":70685,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFEQkI1RTEzLTFDNDUtNDA4MS05MTA2LUY4QzVFNTU1N0ZGMEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":70684,"nextInTime":70686,"topicId":70685,"numMessagesInTopic":0,"msgSnippet":"Someone was involved in unschooling discussions for a long time sent me a note, and let me share it.  There s something by me, and more by her, below: ","messageBody":"<div id=\"ygrps-yiv-587492888\">Someone was involved in unschooling discussions for a long time sent me a note, and let me share it.  There&#39;s something by me, and more by her, below:<br/>\n<br/>\n________________<br/>\n<br/>\nDo you still have a copy of &quot;Whole Child/Whole Parent&quot; around? I was reading a passage about Isaac Stern teaching and conducting Chinese musicians who had never played or heard Western music, and it reminded me very much of you and your work with unschooling parents. I hope you get a chance to read it. It begins on page 160. Thank you for all that you do to help unschooling parents see what is and isn&#39;t unschooling. &quot;Music has forbidden what is not music to go on. Stern&#39;s very refusal to let her go on playing what isn&#39;t music expresses his confidence in her ability to recognize what music really is.&quot;<br/>\n<br/>\n________________<br/>\n<br/>\nI wrote:<br/>\n________________<br/>\n<br/>\nI do have the book. I&#39;ve re-read this passage. Thanks for thinking of me.<br/>\nSome of the musicians had played western music (the older musicians must have), but (I suppose the author was trying to say) were playing it from sheet music without having heard it. They were already proficient at their instruments. I guess they weren&#39;t getting recordings or video of western music and musicians.<br/>\nThe problem with her summary of a documentary I haven&#39;t seen (but might look for) is that the musicians were playing western instruments with western notation, even if they weren&#39;t playing &quot;western music,&quot; so I question her understanding of what was going on. Stern wasn&#39;t going to advise them about how to play Chinese music.<br/>\n<br/>\nI like the line &quot;Before it was correct; now it is alive.&quot;<br/>\n<br/>\nThe analogy breaks down, as regards helping unschoolers, though, because we don&#39;t have a master class. He was helping proficient musicians. Because we mix experienced unschoolers with beginners and skeptics, it&#39;s hard to avoid the bafflement and objection.<br/>\n<br/>\nFor a while, years back, Unschooling Basics was intended to be a lower-level feeder group to Always Learning. It never did work out that way, though. So after a few years of having said that Always Learning was a discussion for those who were already unschooling, we went ahead and invited beginners in.<br/>\nI love group discussions and I don&#39;t love one-on-one help as much, for several reasons, but I do get tired of reactionary, negative people who don&#39;t want to hear the music. <br/>\n_______________<br/>\n<br/>\nResponse:<br/>\n________________<br/>\n<br/>\nI think one thing that stood out for me was that it wasn&#39;t personal. It was about the music. When Stern stopped the woman playing with a &quot;No! No!&quot;, he wasn&#39;t trying to embarrass or insult her. It was about the music. &quot;Music has forbidden what is not music to go on.&quot;<br/>\n<br/>\nSometimes, during the years I participated in unschooling discussions, I was more conscious of my &quot;performance&quot; than hearing the music, and took a lot of advice (&quot;No! No!&quot;) personally. That was my fault and my choice and it was an impediment to understanding unschooling. Yes, being reactionary and negative was a barrier to hearing the music. When I finally got out of my own way, the music was still there. I guess I was ready to hear it.<br/>\n________________<br/>\n(end of quote)</div>","specialLinks":[]}],"prevTopicId":70658,"nextTopicId":70678}}