{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":36888606,"authorName":"Luz Shosie and Ned Vare","from":"Luz Shosie and Ned Vare &lt;nedvare@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:  2236 - No age requirements","postDate":"1029290936","msgId":40975,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI5N0YyMzNCLjEzMkMlbmVkdmFyZUBudHBseC5uZXQ+","inReplyToHeader":"PDEwMjkyMTQ5MTkuMTQyMi41MTA3Lm01QHlhaG9vZ3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":40974,"nextInTime":40976,"topicId":40975,"numMessagesInTopic":0,"msgSnippet":"on 8/13/02 1:01 AM, Unschooling-dotcom@yahoogroups.com at Unschooling-dotcom@yahoogroups.com wrote: ... Ned answers: I agree, Betsy. The list is not limited to","messageBody":"<div id=\"ygrps-yiv-61669293\">on 8/13/02 1:01 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> wrote:<br/>\n<br/>\nBetsy writes:<br/>\n<blockquote><span title=\"ireply\"> &gt; Why should we limit ourselves to the ages that are contained in<br/>\n&gt; government schools? (K-12)<br/>\n<br/>\n </span></blockquote>Ned answers:<br/>\nI agree, Betsy. The list is not limited to those who have &quot;school-age&quot;<br/>\nchildren. As I see it, it is about discussing ideas that pertain to how to<br/>\nraise children without doing what schools do to them. People don&#39;t need to<br/>\nhave children at all in order to do that. Why? Because we have all been<br/>\nchildren and our memories are vivid.<br/>\n<br/>\nOur own youngest child is now 23. I feel qualified to contribute here, not<br/>\nabout what we did on a day to day basis so much, but on the concept of<br/>\nunschooling, the reasoning of it, the results of that reasoning, etc.<br/>\n<br/>\nThis discussion does not even limit itself to people who have children at<br/>\nall, as it is named. It&#39;s about an idea and how that idea is manifested.<br/>\n<br/>\nThere is plenty of discussion available and needed about how to treat a<br/>\nchild, right from birth, if we are planning to unschool him/her. One big<br/>\nidea is how to think outside of the need to prepare that kid for school. If<br/>\nwe don&#39;t need to do that, then an entirely different attitude applies. It is<br/>\nthis: Wow, I need to prepare this child for LIFE. The job suddenly takes on<br/>\na more focus. No longer do we think about having the box of crayons and the<br/>\nlunchbox and the right sneakers. We must actually get serious about<br/>\nparenting. <br/>\n<br/>\nThe school system would like to be our child&#39;s surrogate parent.<br/>\nHomeschoolers see the dangers in giving them that responsibility. The more<br/>\nwe learn about those schools, the more we realize those dangers, and the<br/>\nmore we understand the meaning of the &quot;un&quot;  in our word.<br/>\n<br/>\nFor example, I was raised with the expectation that I would go to school.<br/>\nTherefore, my parents were only part-time involved in my early education,<br/>\nbelieving that the school would know what to do with me when the time came.<br/>\nThey relinquished many parental duties to the school employees whom they<br/>\ndidn&#39;t even know. As a result, I often got completely different views on<br/>\nthings at school than I got from my parents. The separation began early and<br/>\ngrew right along with me.<br/>\n<br/>\nWhen parents plan to unschool, or homeschool, the fact that they accept all<br/>\nresponsibility makes a big difference, and makes raising a child a far more<br/>\nurgent business for them, and puts their lives into sharp focus as their<br/>\nchild grows. <br/>\n<br/>\nThe great benefit for Luz and me in our son&#39;s unschooling (we never even<br/>\ngave it a name - he was simply living with us) was not so much his obvious<br/>\ngains in knowledge and skills, but the very fact that he was living his life<br/>\nunder the almost constant care of one or the other of us, and thus he was<br/>\nnot subjected to anyone who would miseducate him or treat him<br/>\ninappropriately or even waste his time, all of which my previous children<br/>\nexperienced in schools, as most of us did.<br/>\n<br/>\nAnd the joy was that we got to know him at each stage much better than we<br/>\nwould have if he had gone away every day to school buildings. The other part<br/>\nof that is that he got to know us intimately, too.<br/>\n<br/>\nMy school experience had the effect of alienating me from my parents. They<br/>\nseemed to see themselves merely as the launchpad for me to be influenced<br/>\ndeeply by others. We ended up mostly estranged. But, in comparison to that,<br/>\nLuz and I are incredibly close to our son -- he still wants us to be the<br/>\nfirst to know his secrets. To me, that&#39;s a triumph and a treasure.<br/>\n<br/>\nWhat more can we ask. And we give the credit to unschooling.<br/>\n<br/>\nNed Vare <br/>\nHow the hell can you live in a &quot;starter home&quot;? It&#39;s like calling your wife<br/>\nyour &quot;first wife&quot;  --  Ian Shoales</div>","specialLinks":[]}],"prevTopicId":40974,"nextTopicId":40976}}