{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","replyTo":"LIST","senderId":"wccb_624YKa8KIzKSrt2l-VMlLEpxF9Lwon-rk-lu5fbj3f0KC5htzWGdu4RfxxMvBB4lwDg1_tidsE4X9oGlEYLjQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Fw:  http://ens-news.com/ens/oct2000/2000L-10-13-15.html","postDate":"971587664","msgId":13660,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAzOGUwMWMwMzY2ZiQ5MTg3MzE4MCQzYTVkZDFkMUBsZGlvbm5vPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":13659,"nextInTime":13661,"topicId":13660,"numMessagesInTopic":0,"msgSnippet":"... Environment Transgenic Corn Disallowed as More Tainted Taco Shells Turn Up ... taco","messageBody":"<div id=\"ygrps-yiv-1657273237\"><blockquote><span title=\"qreply\">----- Original Message -----<br/>\n<br/>\n Environment<br/>\n<br/>\nTransgenic Corn Disallowed as More Tainted Taco Shells Turn Up<br/>\n<br/>\n&gt; RESEARCH TRIANGLE PARK, North Carolina, October 13, 2000<br/>\n&gt; (ENS) - A type of genetically engineered corn not approved for<br/>\n&gt; human consumption was voluntarily pulled from the entire agricultural<br/>\n&gt; market this week after a watchdog group detected the product in<br/>\n&gt; yet another brand of taco shells.<br/>\n&gt;<br/>\n&gt; Aventis CropScience agreed to cancel its license to sell the biotech<br/>\n&gt; corn, which is known as StarLink, after the coalition Genetically<br/>\n&gt; Engineered Food Alert announced that it had discovered the cornmeal<br/>\n&gt; in Safeway brand taco shells.<br/>\n&gt;<br/>\n&gt; Last month, the watchdog coalition Genetically Engineered Food Alert<br/>\n&gt; said it found StarLink corn in Taco Bell brand taco shells.<br/>\n&gt;<br/>\n&gt; Aventis consented to the remedy at the &quot;strong urging&quot; of the U.S.<br/>\n&gt; Environmental Protection Agency (EPA), which has approved StarLink<br/>\n&gt; for use only as an animal feed.<br/>\n&gt;<br/>\n&gt; The deal struck between Aventis and the EPA this week means that<br/>\n&gt; StarLink corn can no longer be planted for any agricultural purpose.<br/>\n&gt;<br/>\n&gt; &quot;Today&#39;s agreement will ensure that in the future no new StarLink<br/>\n&gt; corn will be grown and none will find its way into the processed foods<br/>\n&gt; like taco shells,&quot; the EPA declared in a written statement. &quot;The<br/>\n&gt; voluntary agreement represents far and away the fastest tool<br/>\n&gt; available to EPA for quickly removing StarLink corn from being planted<br/>\n&gt; for any agricultural purposes.&quot;<br/>\n&gt;<br/>\n&gt; This action will ensure the full protection of public health and<br/>\n&gt; continues customer confidence in the food supply,&quot; the EPA said.<br/>\n&gt;<br/>\n&gt; StarLink corn has not been approved for direct human consumption<br/>\n&gt; because of unresolved questions regarding its effect on human<br/>\n&gt; health. The corn, which is engineered to be toxic to insects, has also<br/>\n&gt; been found to be heat stable and resistant to stomach acids and<br/>\n&gt; enzymes, indicating that it could cause allergies in humans.<br/>\n&gt;<br/>\n&gt; Allergens can cause skin rashes, nausea, and respiratory problems. In<br/>\n&gt; severe cases, allergens can cause anaphylactic shock or death.<br/>\n&gt;<br/>\n&gt; But the EPA was quick to emphasize that there is no evidence that the<br/>\n&gt; consumption of StarLink will lead to any of those problems.<br/>\n&gt;<br/>\n&gt; &quot;EPA does not have any evidence that food containing StarLink corn<br/>\n&gt; will cause any allergic reactions in people, and the agency believes<br/>\n&gt; that the risks, if any, are extremely low,&quot; the agency declared in its<br/>\n&gt; statement. &quot;However, because Aventis was responsible for ensuring<br/>\n&gt; that StarLink corn only be used in animal feed, and that responsibility<br/>\n&gt; was clearly not met, today&#39;s action was necessary.&quot;<br/>\n&gt;<br/>\n&gt; According to the United States Department of Agriculture (USDA),<br/>\n&gt; the suspension of StarLink sales could cost Aventis some $100<br/>\n&gt; million. The USDA last month agreed to buy up all of this year&#39;s<br/>\n&gt; StarLink crop and sell it for animal feed and other related uses after<br/>\n&gt; the substance was detected in Taco Bell brand taco shells.<br/>\n&gt;<br/>\n&gt; The Taco Bell products, manufactured by Kraft Foods, were<br/>\n&gt; voluntarily recalled from grocery store shelves on September 22. The<br/>\n&gt; U.S. Food and Drug Administration (FDA) officially recalled the<br/>\n&gt; products ten days later under the provisions of a class II recall,<br/>\n&gt; which is defined as a &quot;situation which the use of, exposure to, a<br/>\n&gt; violative product may cause temporary of medically reversible<br/>\n&gt; adverse health effects.<br/>\n&gt;<br/>\n&gt; Neither the voluntary or mandatory recall affected products sold at<br/>\n&gt; Taco Bell restaurants, although federal officials said they would test<br/>\n&gt; those foodstuffs as a precautionary measure.<br/>\n&gt;<br/>\n&gt; Safeway began pulling its brand name taco shells off store shelves<br/>\n&gt; Wednesday night. Customers who purchased the shells are being<br/>\n&gt; asked to return them to the store for a refund.<br/>\n&gt;<br/>\n&gt; Both Safeway and Kraft Foods used the same corn flour supplier for their<br/>\ntaco<br/>\n&gt; shells, the Azteca Milling Company of Plainview, Texas.<br/>\n&gt;<br/>\n&gt; Azteca is investigating the incidents and has reportedly implemented<br/>\n&gt; testing procedures to ensure that the genetically modified corn does<br/>\n&gt; not reach its mills.<br/>\n&gt;<br/>\n&gt; That is not good enough for Genetically Modified Food Alert, the<br/>\n&gt; watchdog coalition that prompted the recalls.<br/>\n&gt;<br/>\n&gt; Larry Bohlen, director of health and environment programs at coalition<br/>\n&gt; member organization Friends of the Earth, said that the incidents<br/>\n&gt; illustrate bigger problems with the government&#39;s regulatory<br/>\n&gt; procedures.<br/>\n&gt;<br/>\n&gt; &quot;Two contamination incidents in one month show that the FDA is<br/>\n&gt; doing a miserable job protecting the American food supply,&quot; Bohlen<br/>\n&gt; said.<br/>\n&gt;<br/>\n&gt; The coalition has called on the FDA to test all corn based food<br/>\n&gt; products for the presence of Cry9C, the gene engineered into<br/>\n&gt; StarLink corn.<br/>\n&gt;<br/>\n&gt; Genetically Engineered Food Alert has also called on the FDA to<br/>\n&gt; conduct a thorough investigation into numerous reports of illness<br/>\n&gt; made to FDA and alleged to have been caused by consumption of<br/>\n&gt; contaminated taco shells.<br/>\n&gt;<br/>\n&gt; &quot;The recall of Taco Bell taco shells distributed by Kraft and the<br/>\n&gt; recent finding of StarLink corn in Safeway products underscores the<br/>\n&gt; need for stronger government regulation over genetically engineered<br/>\n&gt; foods,&quot; said Philip Clapp, president of the National Environmental<br/>\n&gt; Trust. &quot;While these genetically engineered ingredients continue to<br/>\n&gt; enter the market, the FDA refuses to mandate pre-market safety<br/>\n&gt; testing of genetically engineered ingredients or labeling for<br/>\n&gt; consumers&#39; right to know.&quot;<br/>\n&gt;<br/>\n&gt; Aventis is a global corporate group with European roots in Germany<br/>\n&gt; and France. Aventis CropScience was formed in December 1999 from<br/>\n&gt; the combination of AgrEvo, the Hoechst/Schering joint venture, and<br/>\n&gt; the Rhône-Poulenc agriculture division. Their website can be found<br/>\n&gt; at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www2.aventis.com\">http://www2.aventis.com</a><br/>\n&gt;<br/>\n&gt; More information on the Genetically Engineered Food Alert coalition<br/>\n&gt; can be found at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.gefoodalert.org\">http://www.gefoodalert.org</a> <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.gefoodalert.org\">http://www.gefoodalert.org</a><br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.aics.org/justice/camp.html\">http://www.aics.org/justice/camp.html</a><br/>\n&gt; </span></blockquote></div>","specialLinks":[]}],"prevTopicId":13657,"nextTopicId":13652}}