{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Covert","from":"Covert &lt;covert@...-net.ne.jp&gt;","replyTo":"LIST","senderId":"cMytM-YzafD_9vk8Dob4yGpU7HkxVNIW5g4WJamlhz2SG50lWCRBhtelplXKalgKXqPxth7Ff_wyVg-_dky0Fts-NAhjQYc","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Bullying in Japan","postDate":"958367699","msgId":8521,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAwNTE1MDUwNi5PQUExMjAyMUBtYWlsLndhMi5zby1uZXQubmUuanA+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":8520,"nextInTime":8522,"topicId":8521,"numMessagesInTopic":0,"msgSnippet":"Hi all, Just picked up the following news story about bullying in Japan that I thought might of some interest. Perhaps the most suprising thing about this","messageBody":"<div id=\"ygrps-yiv-1396570561\">Hi all,<br/>\n<br/>\nJust picked up the following news story about bullying in Japan that I <br/>\nthought might of some interest.<br/>\n<br/>\nPerhaps the most suprising thing about this article for parents in Japan <br/>\n-- myself included! -- is that Japan reportedly comes in last place in <br/>\nbullying among the countries surveyed. (But then again, whenever Japan&#39;s <br/>\nMinistry of Education is involved in research, the results are best <br/>\nviewed with some suspicion.)  <br/>\n<br/>\nRegardless, bullying in Japan remains an *extremely* serious problem for <br/>\nschoolkids in Japan, and it&#39;s one of the reasons why Japanese families <br/>\nare turning away from school in increasing numbers.<br/>\n<br/>\nThankfully, there are at least two viable choices in Japan: homelearning <br/>\nand alternative education.<br/>\n<br/>\nThe vast majority of Japanese families are not aware of these choices, <br/>\nand the Education Ministry, of course, is in no hurry to inform them. But <br/>\nthe choices are out there, and where Japanese families are aware of these <br/>\nchoices, we see more and more families in Japan embracing homelearning <br/>\nand alternative education. A positive sign, indeed.<br/>\n<br/>\nHere, then, is the story....   <br/>\n<br/>\nBrian Covert<br/>\n(KnoK NEWS)<br/>\nin Osaka, Japan<br/>\n<br/>\n--------------------------------<br/>\n<br/>\n[Daily Yomiuri, 14 May 2000]<br/>\n<br/>\n<br/>\nPANEL ON BULLYING ISSUES SURVEY RESULTS, MANUAL<br/>\n<br/>\n<br/>\nAn international research group on bullying recently compiled a report, <br/>\nincluding a bullying prevention manual, for the Education Ministry, The <br/>\nYomiuri Shimbun learned Saturday.<br/>\n<br/>\nThe report is based on survey results from four countries, including <br/>\nJapan and Britain.<br/>\n<br/>\nThe report was compiled by a group of university professors from Japan <br/>\nand other countries, in addition to officials from the National Institute <br/>\nof Educational Research and the National Research Institute of Police <br/>\nScience.<br/>\n<br/>\nWith research funds from the Education Ministry, the group surveyed a <br/>\ntotal of 16,000 public school students, teachers and parents around the <br/>\nnation in January 1997. A total of 7,000 students ranging from <br/>\nfifth-grade primary school level to third-grade middle school pupils were <br/>\nsurveyed. At almost the same time, students in the same age bracket in <br/>\nBritain, Holland and Norway were similarly surveyed.<br/>\n<br/>\nThe results showed that although many children from all four countries <br/>\nreported experiencing bullying, their teachers and parents were much less <br/>\naware of the bullying than the bullied children&#39;s peers.<br/>\n<br/>\nOnly 13.9 percent of Japanese students polled had experienced bullying, <br/>\nthe lowest percentage among the four countries. The survey found that <br/>\n39.4 percent of children in Britain and 27 percent in Holland had <br/>\nexperienced bullying.<br/>\n<br/>\nHowever, Japan had the highest percentage of students bullied more than <br/>\nonce a week, or for a period longer than one academic term. The survey <br/>\nalso showed that more than 30 percent of the students felt they could not <br/>\nreport bullying to their teachers or parents because they feared the <br/>\nbullies would retaliate.<br/>\n<br/>\nThe report figures suggest a tendency in Japan for the same victim to be <br/>\nrepeatedly bullied over an extended period. It showed that Japanese <br/>\nstudents, as they grow older, have an increasing tendency to ignore <br/>\nincidents of bullying, the report said.<br/>\n<br/>\nThe apathy of onlookers makes the problem of bullying worse, according to <br/>\nthe report.<br/>\n<br/>\nIt is necessary to involve everyone in tackling the problem of bullying, <br/>\nthe report said.<br/>\n<br/>\nThe report mentions Australia&#39;s &quot;family group conferencing&quot; as an example <br/>\nof a positive approach toward solving bullying issues. The technique <br/>\ninvolves bringing together not only a bully and a victim but also their <br/>\nfamilies, a school counselor, local residents and the police.<br/>\n<br/>\nThe report also listed three countermeasures to help bullied children:<br/>\n<br/>\nFirstly, a teacher or counselor should privately consult with students <br/>\nthey suspect are being victimized. Slight trembling or irregular eye <br/>\nmovements may indicate that the student is being bullied, the report said.<br/>\n<br/>\nDuring the counseling session, the teacher or counselor has to clearly <br/>\nshow that they are in a position to protect the victim, the report <br/>\nstressed.<br/>\n<br/>\nSecondly, conventional countermeasures by teachers and adults need to be <br/>\nreviewed and a new system to help children support each other to <br/>\neradicate bullying must be set up.<br/>\n<br/>\nAs examples, the report proposes the introduction of a program to develop <br/>\nthe students&#39; abilities to make friends with others, and a <br/>\nteacher-supported buddy system between junior and senior students to stop <br/>\nbullying.<br/>\n<br/>\nThirdly, Japanese school principals need to take a more active role. <br/>\nSchool principals in Europe and the United States usually remember the <br/>\nnames and faces of their students, while principals and vice principals <br/>\nin Japan tend to maintain distance between themselves and their students, <br/>\nthe report observed. The principals should have more contact with the <br/>\nchildren and exercise stronger leadership, the report said.<br/>\n<br/>\n<br/>\n(copyright 2000 - Yomiuri Shimbun)</div>","specialLinks":[]}],"prevTopicId":8516,"nextTopicId":8501}}