{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"from my mom","postDate":"1035832592","msgId":48540,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMS4xLjUuMC4yMDAyMTAyODEwNTk0Ni4wMGE2OTZkMEBwb3AzLm5vcnRvbi5hbnRpdmlydXM+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":48539,"nextInTime":48541,"topicId":48540,"numMessagesInTopic":0,"msgSnippet":"My mom went to Italy this summer to learn about Reggio schools. Since she came back, she was on a Reggio schools email discussion list for teachers. These were","messageBody":"<div id=\"ygrps-yiv-1895950996\">My mom went to Italy this summer to learn about Reggio schools. Since she <br/>\ncame back, she was on a Reggio schools email discussion list for teachers. <br/>\nThese were her last two posts on that list - I thought you all might enjoy <br/>\nand appreciate them.<br/>\n<br/>\n·       Subject: Re: phonemic awareness and developmental appropriateness<br/>\n·       From: Jeanne Kerwin &lt;·  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:MagamJK@...\">MagamJK@...</a>&gt;<br/>\n·       Date: Thu, 28 Sep 2000 00:47:36 EDT<br/>\n<br/>\nI agree that we must look at each child individually -- isn&#39;t that what <br/>\ndevelopmentally appropriate really is all about?  Not all children learn in <br/>\nthe same way or at the same age. This idea that our governor in Caifornia <br/>\nhas that &quot;all children will be reading by the second half of kindergarten&quot; <br/>\nis ridiculous and dangerous. We already are way behind other states (for <br/>\nmany reasons) and it is all boiling down to politics. We teachers in this <br/>\nstate are going crazy with the &quot;accountability&quot; craze. Pushing children <br/>\ninto an area of learning before they are interested or ready for that <br/>\nparticular kind of thing may raise test scores temporarily but will do <br/>\nlasting damage to the child and the education system in the long run. I am <br/>\na high school teacher of child development with a lab school on the campus <br/>\nwhich I also direct. I also teach at the local community college and state <br/>\nuniversity part time in the early childhood education departments. I enjoy <br/>\nhearing all the points of view - it keeps me sane. Jeanne<br/>\n<br/>\n<br/>\n<br/>\n·       Subject: Re: phonemic awareness and developmental appropriateness<br/>\n·       From: Jeanne Kerwin &lt;·  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:MagamJK@...\">MagamJK@...</a>&gt;<br/>\n·       Date: Sat, 30 Sep 2000 22:37:35 EDT<br/>\n<br/>\nI honestly don&#39;t think &quot;they&quot; have a real definition in mind for &quot;reading&quot;; <br/>\nat least I haven&#39;t been able to find a consistent feeling about it among <br/>\nthe several school districts around here. Most kindergarten teachers will <br/>\nanswer that they think it means knowing all the &quot;sounds of letters&quot; and <br/>\nbeing able to use phonics to read simple books. Since I am in a high school <br/>\nand see the poor results of many years of pure phonics I guess I am <br/>\nprejudiced against using this method exclusively. The good readers are the <br/>\nones who learned at an early age to love books and were read to by members <br/>\nof their families; not many of my students love to read for pleasure and <br/>\nmost really hate writing. I find his so sad. I think there is some hope on <br/>\nthe horizon however now that so many people in California are taking their <br/>\nchildren out of school and homeschooling. These families are dedicated and <br/>\nhardworking for the most part and their children consistently score above <br/>\nthe public school students in every area. I know many of these children and <br/>\nfamilies and find them very xcited about learning and doing lots of things <br/>\ntogether in homeschooling groups. This may be a wake-up call to the state <br/>\ned department. We&#39;ll see.<br/>\n<br/>\nJeanne<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":48492,"nextTopicId":48294}}