{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] The Etiology and Treatment of Childhood","postDate":"1030845069","msgId":42614,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ2LjFiYjdiYThjLjJhYTJjYzhkQGFvbC5jb20+"},"prevInTopic":42610,"nextInTopic":0,"prevInTime":42613,"nextInTime":42615,"topicId":42610,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/31/02 6:15:30 PM, leschke@islandnet.com writes: ","messageBody":"<div id=\"ygrps-yiv-1133322334\">In a message dated 8/31/02 6:15:30 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a> writes:<br/>\n<br/>\n&lt;&lt; Unfortunately, some<br/>\nvictims are so incapacitated by their childhood that they are simply<br/>\nnot competent to work. One promising rehabilitaion program (Spanky and<br/>\nAlfalfa, 1978) has trained victims of severe childhood to sell lemonade. &gt;&gt;<br/>\n<br/>\nOH!  That&#39;s a hoot!<br/>\n<br/>\nOnly it&#39;s more like 1938 &lt;g&gt;.</div>","specialLinks":[]},{"userId":1509055,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"The Etiology and Treatment of Childhood","postDate":"1030839003","msgId":42610,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMC4yLjEuMC4yMDAyMDgzMTE3MDkxNS4wMWJmZTJkMEBwb3AuaXNsYW5kbmV0LmNvbT4="},"prevInTopic":0,"nextInTopic":42614,"prevInTime":42609,"nextInTime":42611,"topicId":42610,"numMessagesInTopic":0,"msgSnippet":"Not sure where this came from, but it s hilarious in parts. Tia A Major Scientific Advance: The Etiology and Treatment of Childhood THE ETIOLOGY AND TREATMENT","messageBody":"<div id=\"ygrps-yiv-98647754\">Not sure where this came from, but it&#39;s hilarious in parts.<br/>\nTia<br/>\n<br/>\n  A Major Scientific Advance: The Etiology and Treatment of Childhood<br/>\n<br/>\n         THE ETIOLOGY AND TREATMENT OF CHILDHOOD<br/>\n                 Jordan W. Smoller<br/>\n                 University of Pennsylvania<br/>\n<br/>\nChildhood is a syndrome which has only recently begun to receive<br/>\nserious attention from clinicians. The syndrome itself, however,<br/>\nis not at all recent. As early as the 8th century, the Persian<br/>\nhistorian Kidnom made references to &quot;short, noisy creatures,&quot; who<br/>\nmay well have been what we now call &quot;children.&quot; The treatment of<br/>\nchildren, however, was unknown until this century, when so-called<br/>\n&quot;child psychologists&quot; and &quot;child psychiatrists&quot; became common. Despite<br/>\nthis history of clinical neglect, it has been estimated that well over<br/>\nhalf of all Americans alive today have experienced childhood directly<br/>\n(Suess, 1983). In fact, the actual numbers are probably much higher,<br/>\nsince these data are based on self-reports which may be subject to<br/>\nsocial desirability biases and retrospective distortion.<br/>\n<br/>\nThe growing acceptance of childhood as a distinct phenomenon is<br/>\nreflected in the proposed inclusion of the syndrome in the upcoming<br/>\nDiagnostic and Statistical Manual of Mental Disorders, 4th edition,<br/>\nor DSM-IV, of the American Psychiatric Association (1990). Clinicians<br/>\nare still in disagreement about the significant clinical features of<br/>\nchildhood, but the proposed DSM-IV will almost certainly include the<br/>\nfollowing core features:<br/>\n<br/>\n1.    Congenital onset<br/>\n2.    Dwarfism<br/>\n3.    Emotional lability and immaturity<br/>\n4.    Knowledgy deficits<br/>\n5.    Legume anorexia<br/>\n<br/>\nClinical Features of Childhood<br/>\n<br/>\nAlthough the focus of this paper is on the efficacy of conventional<br/>\ntreatment of childhood, the five clinical markers mentioned above merit<br/>\nfurther discussion for those unfamiliar with this patient population.<br/>\n<br/>\n<br/>\nCONGENITAL ONSET<br/>\n<br/>\nIn one of the few existing literature reviews on childhood, Temple-Black<br/>\n(1982) has noted that childhood is almost always present at birth,<br/>\nalthough it may go undetected for years or even remain subclinical<br/>\nindefinitely. This observation has led some investigators to speculate<br/>\non biological contribution to childhood. As one psychologist has put<br/>\nit, &quot;we may soon be in a position to distinguish organic childhood from<br/>\nfunctional childhood&quot; (Rogers, 1979).<br/>\n<br/>\n<br/>\nDWARFISM<br/>\n<br/>\nThis is certainly the most familiar marker of childhood. It is widely<br/>\nknown that children are physically short relative to the population at<br/>\nlarge. Indeed, common clinical wisdom suggests that the treatment of<br/>\nthe so-called &quot;small child&quot; (or &quot;tot&quot;) is particularly difficult. These<br/>\nchildren are known to exhibit infantile behavior and display a startling<br/>\nlack of insight (Tom and Jerry, 1967).<br/>\n<br/>\nEMOTIONAL LABILITY AND IMMATURITY<br/>\n<br/>\nThis aspect of childhood is often the only basis for a clinician&#39;s<br/>\ndiagnosis. As a result, many otherwise normal adults are misdiagnosed as<br/>\nchildren and must suffer the unnecessary social stigma of being labelled<br/>\na &quot;child&quot; by professionals and friends alike.<br/>\n<br/>\nKNOWLEDGE DEFICITS<br/>\n<br/>\nWhile many children have IQs with or even above the norm, almost all<br/>\nwill manifest knowledge deficits. Anyone who has known a real child<br/>\nhas experienced the frustration of trying to discuss any topic that<br/>\nrequires some general knowledge. Children seem to have little knowledge<br/>\nabout the world they live in. Politics, art, and science--children are<br/>\nlargely ignorant of these. Perhaps it is because of this ignorance, but<br/>\nthe sad fact that most children have few friends who are not,<br/>\nthemselves, children.<br/>\n<br/>\nLEGUME ANOREXIA<br/>\n<br/>\nThis last identifying feature is perhaps the most unexpected.  Folk<br/>\nwisdom is supported by empirical observation--children will rarely<br/>\neat their vegetables (see Popeye, 1957, for review).<br/>\n<br/>\nCauses of Childhood<br/>\n<br/>\nNow that we know what it is, what can we say about the causes of<br/>\nchildhood?  Recent years have seen a flurry of theory and speculation<br/>\nfrom a number of perspectives. Some of the most prominent are reviewed<br/>\nbelow.<br/>\n<br/>\nSociological Model<br/>\n<br/>\nEmile Durkind was perhaps the first to speculate about sociological<br/>\ncauses of childhood. He points out two key observations about children:<br/>\n<br/>\n         1.    the vast majority of children are unemployed, and<br/>\n<br/>\n         2.    children represent one of the least educated segments of<br/>\n               our society.<br/>\n<br/>\nIn fact, it has been estimated that less than 20% of children have had<br/>\nmore than fourth grad education.<br/>\n<br/>\nClearly, children are an &quot;out-group.&quot; Because of their intellectual<br/>\nhandicap, children are even denied the right to vote. From the<br/>\nsociologist&#39;s perspective, treatment should be aimed at helping<br/>\nassimilate children into mainstream society. Unfortunately, some<br/>\nvictims are so incapacitated by their childhood that they are simply<br/>\nnot competent to work. One promising rehabilitaion program (Spanky and<br/>\nAlfalfa, 1978) has trained victims of severe childhood to sell lemonade.<br/>\n<br/>\nBiological Model<br/>\n<br/>\nThe observation that childhood is usually present from birth has led<br/>\nsome to speculate on a biological contribution. An early investigation<br/>\nby Flintstone and Jetson (1939) indicated that childhood runs in<br/>\nfamilies.  Their survey of over 8,000 American families revealed that<br/>\nover half contained more than one child. Further investigation revealed<br/>\nthat even most non-child family members had experienced childhood at<br/>\nsome point. Cross-cultural studies (e.g., Mowgli and Din, 1950)<br/>\nindicated that family childhood is even more prevalent in the Far East.<br/>\nFor example, in Indian and Chinese families, as many as three out of<br/>\nfour family members may have childhood.<br/>\n<br/>\nImpressive evidence of a genetic component of childhood comes from a<br/>\nlarge-scale twin study by Brady and Partridge (1972). These authors<br/>\nstudied over 106 pairs of twins, looking at concordance rates for<br/>\nchildhood. Among identical or monozygotic twins, concordance was<br/>\nunusually high (0.92), i.e., when one twin was diagnosed with<br/>\nchildhood, the other twin was almost always a child as well.<br/>\n<br/>\n<br/>\nPsychological Models<br/>\n<br/>\nA considerable number of psychologically-based theories of the<br/>\ndevelopment of childhood exist. They are too numerous to review<br/>\nhere. Among the more familiar models are Seligman&#39;s &quot;learned<br/>\nchildishness&quot; model. According to this model, individuals who are<br/>\ntreated like children eventually give up and become children. As<br/>\na counterpoint to such theories, some experts have claimed that<br/>\nchildhood does not really exist. Szasz (1980) has called &quot;childhood&quot;<br/>\nan expedient label. In seeking conformity, we handicap those whom<br/>\nwe find unruly or too short to deal with by labelling them &quot;children.&quot;<br/>\n<br/>\n<br/>\nTreatment of Childhood<br/>\n<br/>\nEfforts to treat childhood are as old as the syndrome itself. Only in<br/>\nmodern times, however, have human and systematic treatment protocols<br/>\nbeen applied.  In part, this increased attention to the problem may be<br/>\ndue to the sheer number of individuals suffering from childhood.<br/>\n<br/>\nGovernment statistics (DHHS) reveal that there are more children alive<br/>\ntoday than at any time in our history. To paraphrase P.T. Barnum:<br/>\n&quot;There&#39;s a child born every minute.&quot;<br/>\n<br/>\nThe overwhelming number of children has made government intervention<br/>\ninevitable. The nineteenth century saw the institution of what remains<br/>\nthe largest single program for the treatment of childhood-- so-called<br/>\n&quot;public schools.&quot; Under this colossal program, individuals are placed<br/>\ninto treatment groups based on the severity of their condition. For<br/>\nexample, those most severely afflicted may be placed in a<br/>\n&quot;kindergarten&quot; program. Patients at this level are typically short,<br/>\nunruly, emotionally immature, and intellectually deficient. Given this<br/>\ntype of individual, therapy is essentially one of patient management<br/>\nand of helping the child master basic skills (e.g. finger-painting).<br/>\n<br/>\nUnfortunately, the &quot;school&quot; system has been largely ineffective.  Not<br/>\nonly is the problem a massive tax burden, but it has failed even to<br/>\nslow down the rising incidence of childhood.<br/>\n<br/>\nFaced with this failure and the growing epidemic of childhood,<br/>\nmental health professionals are devoting increasing attention<br/>\nto the treatment of childhood. Given a theoretical framework by<br/>\nFreud&#39;s landmark treatises on childhood, child psychiatrists and<br/>\npsychologists claimed great successes in their clinical intervention.<br/>\n<br/>\nBy the 1950&#39;s, however, the clinicians&#39; optimism had waned. Even after<br/>\nyears of costly analysis, many victims remained children. The following<br/>\ncase (taken from Gumbie and Poke, 1957) is typical.<br/>\n<br/>\n*    Billy J., age 8, was brought to treatment by his parents.<br/>\nBilly&#39;s affliction was painfully obvious. He stood only 4&#39;3&quot; high<br/>\nand weighed a scant 70 lbs., despite the fact that he ate voraciously.<br/>\nBilly presented a variety of troubling symptoms. His voice was<br/>\nnoticably high for a man. He displayed legume anorexia, and, according<br/>\nto his parents, often refused to bathe. His intellectual functioning<br/>\nwas also below normal--he had little general knowledge and could barely<br/>\nwrite a structured sentence. Social skills were also deficient. He often<br/>\nspoke inappropriately and exhibited &quot;whining behaviour.&quot; His sexual<br/>\nexperience was non-existent. Indeed, Billy considered women &quot;icky.&quot; His<br/>\nparents reported that his condition had been present from birth,<br/>\nimproving gradually after he was placed in a school at age 5.<br/>\n   The diagnosis was &quot;primary childhood.&quot; After years of painstaking<br/>\ntreatment, Billy improved gradually. At age 11, his height and weight<br/>\nhave increased, his social skills are broader, and he is now functional<br/>\nenough to hold down a &quot;paper route.&quot;<br/>\n<br/>\nAfter years of this kind of frustration, startling new evidence has<br/>\ncome to light which suggests that the prognosis in cases of childhood<br/>\nmay not be all gloom. A critical review by Fudd (1972) noted that<br/>\nstudies of the childhood syndrome tend to lack careful follow-up.<br/>\nActing on this observation, Moe, Larrie, and Kirly (1974) began a<br/>\nlarge-scale longitudinal study. These investigators studied two<br/>\ngroups. The first group consisted of 34 children currently engaged in<br/>\na long-term conventional treatment program. The second was a group of<br/>\n42 children receiving no treatment. All subjects had been diagnosed as<br/>\nchildren at least 4 years previously, with a mean duration of<br/>\nchildhood at 6.4 years.<br/>\n<br/>\nAt the end of one year, the results confirmed the clinical wisdom<br/>\nthat childhood is a refractory disorder--virtually all symptoms<br/>\npersisted and the treatment group was only slightly better off than<br/>\nthe controls.<br/>\n<br/>\nThe results, however, of a careful 10-year follow-up were startling.<br/>\nThe investigators (Moe, Larrie, Kirly, & Shemp, 1984) assessed the<br/>\noriginal cohort on a variety of measures. General knowledge and<br/>\nemotional maturity were assessed with standard measures. Height was<br/>\nassess by the &quot;metric system&quot; (see Ruler, 1923), and legume appetite<br/>\nby the Vegetable Appetite Test (VAT) designed by Popeye (1968). Moe<br/>\net al. found that subjects improved uniformly on all measures. Indeed,<br/>\nin most cases, the subjects appeared to be symptom-free. Moe et al.<br/>\nreport a spontaneous remission rate of 95%, a finding which is certain<br/>\nto revolutionize the clinical approach to childhood.<br/>\n<br/>\nThese recent results suggests that the prognosis for victims of<br/>\nchildhood may not be so bad as we have feared. We must not, however,<br/>\nbecome too complacent. Despite its apparently high spontaneous<br/>\nremission rate, childhood remains one of the most serious and rapidly<br/>\ngrowing disorders facing mental health professionals today. And, beyond<br/>\nthe psychological pain it brings, childhood has recently been linked to<br/>\na number of physical disorders. Twenty years ago, Howdi, Doodi, and<br/>\nBeauzeau (1965) demonstrated a six-fold increased risk of chicken pox,<br/>\nmeasles, and mumps among children as compared with normal controls.<br/>\nLater, Barby and Kenn (1971) linked childhood to an elevated risk of<br/>\naccidents--compared with normal adults, victims of childhood were much<br/>\nmore likely to scrape their knees, lose their teeth, and fall off their<br/>\nbikes.<br/>\n<br/>\nClearly, much more research is need before we can give any real hope<br/>\nto the millions of victims wracked by this insidious disorder.<br/>\n<br/>\nREFERENCES<br/>\n<br/>\nAmerican Psychiatric Association (1990).  The diagnostic and<br/>\nstatistical manual of mental disorders, 4th edition:<br/>\nA preliminary report. Washington,D.C.; APA.<br/>\n<br/>\nBarby, B., & Kenn, K. (1971). The plasticity of behavior.<br/>\nn B. Barby & K.  Kenn (Eds.), Psychotherapies R Us. Detroit: Ronco<br/>\npress.<br/>\n<br/>\nFlintstone, F., & Jetson, G. (1939). Cognitive mediation of labour<br/>\ndisputes. Industrial Psychology Today, 2, 23-35.<br/>\n<br/>\nFudd, E.J. (1972). Locus of control and shoe-size. Journal of Footwear<br/>\nPsychology, 78, 345-356.<br/>\n<br/>\nGumbie, G., & Pokey, P. (1957). A cognitive theory of iron- smelting.<br/>\nJournal of Abnormal Metallurgy, 45, 235-239.<br/>\n<br/>\nHowdi, C., Doodi, C., & Beauzeau, C. (1965). Western civilization: A<br/>\nreview of the literature. Reader&#39;s digest, 60, 23-25.<br/>\n<br/>\nMoe, R., Larrie, T., and Kirly, Q. (1974). State childhood versus trait<br/>\nchildhood. TV Guide, May 12-19, 1-3.<br/>\n<br/>\nMoe, R., Larrie, T., Kirly, Q. (1974). Spontaneous remission of<br/>\nchildhood. In W.C. Fields (Ed.), New Hope for Children and Animals.<br/>\nHollywood: Acme Press.<br/>\n<br/>\nPopeye, T.S.M. (1957). The use of spinach in extreme circumstances.<br/>\nJournal of Vegetable Science, 58, 530-538.<br/>\n<br/>\nPopeye, T.S.M. (1968). Spinach: A phenomenological perspective.<br/>\nExistential botany, 35, 908-813.<br/>\n<br/>\nRogers, F. (1979). Becoming my neighbour. New York: Soft Press.<br/>\n<br/>\nRuler, Y. (1923). Assessing measurements protocols by the<br/>\nmulti-method multiple regression index for the psychometric<br/>\nanalysis of factorial interaction. Annals of Boredom, 67, 1190-1260.<br/>\n<br/>\nSpanky, D., & Alfalfa, Q. (1978). Coping with puberty.<br/>\n         Sears catalog, 45-46.<br/>\n<br/>\nSuess, D.R. (1983). A psychometric analysis of green eggs with and<br/>\n   without ham. Journal of Clinical Cuisine, 245, 567-578.<br/>\n<br/>\nTemple-Black, S. (1982). Childhood: an ever-so sad disorder.<br/>\nJournal of Precocity, 3, 129-134.<br/>\n<br/>\nTom, C., & Jerry, M. (1967). Human behavior as a model for<br/>\nunderstanding the rat. In M. de Sade (Ed.).<br/>\nThe Rewards of Punishment. Paris: Bench Press.<br/>\n<br/>\n<br/>\nNo one can make you feel inferior without your consent.<br/>\nEleanor Roosevelt<br/>\n*********************************************<br/>\nTia Leschke<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a><br/>\nOn Vancouver Island</div>","specialLinks":[]}],"prevTopicId":42600,"nextTopicId":42588}}