{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":11,"messages":[{"userId":0,"authorName":"dawn","from":"dawn &lt;dawn@...&gt;","replyTo":"LIST","senderId":"j2yMU_BQ8725ANa8KcMcLj_BcN4yW96fUYsrUJL8m6wu4p81-Ismz_lUBOYJuBvZ2aJnkeqcqMCSzkk","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] in the news","postDate":"976666086","msgId":14503,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFBpbmUuQlNGLjQuMjEuMDAxMjEyMTYwNzU4MC41MzQxNi0xMDAwMDBAbWF0ZS5ranNsLmNvbT4=","inReplyToHeader":"PDEuNS40LjE2LjIwMDAxMjEzMDkxNTE5LjFhODdkMzg0QDEwLjAuMC4zPg=="},"prevInTopic":14502,"nextInTopic":0,"prevInTime":14502,"nextInTime":14504,"topicId":14482,"numMessagesInTopic":0,"msgSnippet":"thanks, Pauline.  Nice to see you here. dawn h-s ********** Some who support more coercive strategies assume that children will run wild if they are not","messageBody":"<div id=\"ygrps-yiv-2122711933\">thanks, Pauline.  Nice to see you here.<br/>\n<br/>\n<br/>\ndawn h-s<br/>\n**********<br/>\nSome who support more coercive strategies assume that children will run<br/>\nwild if they are not controlled.  However, the children for whom this is<br/>\ntrue typically turn out to be those accustomed to being controlled--those<br/>\nwho are not trusted, given explanations, encouraged to think for<br/>\nthemselves, helped to develop and internalize good values, and so<br/>\non.  Control breeds the need for more control, which is then used to<br/>\njustify the use of control.<br/>\n<br/>\n---Alfie Kohn,  Punished by Rewards, p. 33.<br/>\n**********</div>","specialLinks":[]},{"userId":0,"authorName":"Pauline","from":"Pauline &lt;paulined@...&gt;","replyTo":"LIST","senderId":"vE18K-GrBK_Sjw6wB5B2Zy1Orv7K0QXa2dQDNoXy2HnUgq89RhiFCAVYoQXdteTjvAFFM0zUxDYNKMYgKwKr0iOQNY2eqZdFft4","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] in the news","postDate":"976659754","msgId":14502,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEuNS40LjE2LjIwMDAxMjEzMDkxNTE5LjFhODdkMzg0QDEwLjAuMC4zPg=="},"prevInTopic":14497,"nextInTopic":14503,"prevInTime":14501,"nextInTime":14503,"topicId":14482,"numMessagesInTopic":0,"msgSnippet":"... Yes, ridiculous for them to say she forced him to bf.  I bet he only had second thoughts about nursing after being subjected to the questioning and ","messageBody":"<div id=\"ygrps-yiv-506428584\"><blockquote><span title=\"ireply\">&gt;someone sent me a copy of the article.  it says that they boy was 6 and<br/>\n&gt;his mother forced him to breastfeed (although the mother claims she didn&#39;t<br/>\n&gt;know that he didn&#39;t want to).  It was in the Chicago Tribune.  My first<br/>\n&gt;question is, &quot;How did she force him to nurse against his will?  There was<br/>\n&gt;very little I could get my 6 yo to do agains his will.&quot; And the kid was<br/>\n&gt;seen by a psychologist (if I&#39;m remembering correctly) and found OK....Oh,<br/>\n&gt;I&#39;m messing this all up.  I&#39;ll go see if I can find the URL and forward it<br/>\n&gt;here.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;dawn h-s<br/>\n&gt;**********<br/>\n<br/>\n<br/>\n </span></blockquote>Yes, ridiculous for them to say she forced him to bf.  I bet he only had<br/>\nsecond thoughts about nursing after being subjected to the questioning and<br/>\npossible ridicule of the DCFS and psychiatric interviews.  <br/>\n<br/>\nHere is the story<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.chicagotribune.com/news/metro/chicago/article/0,2669,ART-48622,FF\">http://www.chicagotribune.com/news/metro/chicago/article/0,2669,ART-48622,FF</a><br/>\n&gt;.html<br/>\n&gt;<br/>\n&gt;Chicago Tribune<br/>\n&gt;10 December 2000<br/>\n&gt;<br/>\n&gt;Mother who breastfeeds boy, 6, faces custody fight<br/>\n&gt;State calls it abuse; she defends approach<br/>\n&gt;<br/>\n&gt;By Sue Ellen Christian and Julie Deardorff<br/>\n&gt;Tribune Staff Writers<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;In an exceptional case, Illinois child protection authorities have taken a<br/>\n&gt;6-year-old boy from the custody of a Champaign mother because she was still<br/>\n&gt;breastfeeding him, allegedly against his wishes.<br/>\n&gt;<br/>\n&gt;In the view of the mother fighting for the return of her only child, the<br/>\n&gt;battle pits American norms about parenting against her right to raise her<br/>\n&gt;son as she sees fita style that includes allowing the boy to choose when<br/>\n&gt;he quits nursing.<br/>\n&gt;<br/>\n&gt;To state child welfare officials, the case is about abuse.<br/>\n&gt;<br/>\n&gt;Authorities at the Department of Children and Family Services took the boy<br/>\n&gt;from the 32-year-old woman&#39;s home after a baby-sitter called an abuse hot<br/>\n&gt;line and the child subsequently told investigators that he no longer wanted<br/>\n&gt;to breastfeed, they said. The mother says she told investigators her son<br/>\n&gt;never indicated he didn&#39;t want to nurse and that she would continue to<br/>\n&gt;breastfeed as long as her son wished.<br/>\n&gt;<br/>\n&gt;The agency has determined that the child&#39;s living situation constitutes<br/>\n&gt;sexual molestation and risk of harm.<br/>\n&gt;<br/>\n&gt;&quot;Breastfeeding a child is not the issue,&quot; says Deborah Kennedy, DCFS<br/>\n&gt;regional administrator in the central region. &quot;It&#39;s after he has stated<br/>\n&gt;that it is unwanted and she had that information and didn&#39;t indicate she<br/>\n&gt;would halt that activity ... then you have unwanted behavior on his part<br/>\n&gt;and that constitutes abuse.&quot;<br/>\n&gt;<br/>\n&gt;She added: &quot;In general, any contact between a sexual organ against the will<br/>\n&gt;of the child constitutes abuse ... because it&#39;s breastfeeding, it&#39;s a<br/>\n&gt;sensitive issue.&quot;<br/>\n&gt;<br/>\n&gt;On Monday, final arguments are scheduled in the family court case in<br/>\n&gt;Champaign County, which alleges emotional harm to the boy. The case is to<br/>\n&gt;determine whether the boy was neglected or abused and whether he should<br/>\n&gt;return home to his mother.<br/>\n&gt;<br/>\n&gt;The mother says the misguided case is based on society&#39;s narrow ideas about<br/>\n&gt;what constitutes good parenting.<br/>\n&gt;<br/>\n&gt;Research shows that while rare, it is not unheard of for a child to be<br/>\n&gt;nursing at 6.<br/>\n&gt;<br/>\n&gt;Indeed, some pediatricians and child-rearing experts have come to espouse a<br/>\n&gt;revival of old parenting practices, such as extended breastfeeding and<br/>\n&gt;sleeping in the same bed with childrenwhat some call &quot;co-sleeping.&quot;<br/>\n&gt;<br/>\n&gt;DCFS has said that co-sleeping was a factor in its decision to take the<br/>\n&gt;child from the home. DCFS investigators say the woman slept naked with the<br/>\n&gt;boy, which she denies.<br/>\n&gt;<br/>\n&gt;&quot;They are saying because you&#39;re not practicing Dr. Spock American-style<br/>\n&gt;parenting, you&#39;re a bad mom,&quot; says the petite, feisty woman who was born on<br/>\n&gt;a farm in Downstate Illinois. &quot;What about all those places in the world<br/>\n&gt;where the family sleeps in one room and that is co-sleeping and you&#39;re<br/>\n&gt;telling me all those people are maladjusted? It&#39;s cultural bias.<br/>\n&gt;<br/>\n&gt;&quot;My son would come to me and ask to nurse,&quot; says the woman. &quot;It&#39;s not<br/>\n&gt;sexual. It was a closeness thing. When he&#39;s ready for it, he will ask to<br/>\n&gt;end breastfeeding.&quot;<br/>\n&gt;<br/>\n&gt;A complete understanding of the case is elusive, in part because not all<br/>\n&gt;the testimony and evidence is public. The judge in the Champaign County<br/>\n&gt;case, Ann Einhorn, has refused to release any documents, and the state&#39;s<br/>\n&gt;attorney as well as the lawyer representing the boy refuse to discuss the<br/>\n&gt;case.<br/>\n&gt;<br/>\n&gt;(The Tribune editorial standard is not to name juveniles in investigations<br/>\n&gt;of sexual abuse, so the names of the child and the mother, who have the<br/>\n&gt;same last name, have been withheld. In interviews, the mother did not<br/>\n&gt;request anonymity.)<br/>\n&gt;<br/>\n&gt;The woman is the oldest of nine children in a family that she says<br/>\n&gt;practiced co-sleeping.<br/>\n&gt;<br/>\n&gt;Her current home is a two-bedroom, second-floor apartment, cluttered with<br/>\n&gt;mounds of clothes, toys, newspapers and boxes of food through which narrow<br/>\n&gt;pathways have been carved. Hoping her son will be home for Christmas, she<br/>\n&gt;has purchased about a dozen presentsa scooter, a book, the game<br/>\n&gt;Battleshipwhich sit stacked on the stairs.<br/>\n&gt;<br/>\n&gt;The mother works part time at a liquor store and takes continuing education<br/>\n&gt;classes. She never married the child&#39;s father, who now lives in Oregon and<br/>\n&gt;only recently has instigated contact with the boy. He did not return phone<br/>\n&gt;calls from the Tribune.<br/>\n&gt;<br/>\n&gt;The mother says she practices child-led weaning, which is supported by the<br/>\n&gt;Schaumburg-based breastfeeding advocacy organization, La Leche League<br/>\n&gt;International, and allows the child to determine when he or she is done<br/>\n&gt;nursing.<br/>\n&gt;<br/>\n&gt;&quot;My child was weaning himself,&quot; she says, &quot;he was nursing for 10 minutes a<br/>\n&gt;day and on weekends a little more. I don&#39;t think DCFS has any right to be<br/>\n&gt;involved in this decision between me and my child.&quot;<br/>\n&gt;<br/>\n&gt;Natural or the norm?<br/>\n&gt;<br/>\n&gt;DCFS documents given to the Tribune by the mother indicate that the boy<br/>\n&gt;told a child protection investigator that he no longer wanted to nurse and<br/>\n&gt;had told his mom that; the mother says her son has never communicated that<br/>\n&gt;to her.<br/>\n&gt;<br/>\n&gt;The documents also indicate that the boy told the investigator that he<br/>\n&gt;still shared a bed with his mother and &quot;sometimes when she does not have<br/>\n&gt;clean clothes, she sleeps naked.&quot; The boy told the investigator that he<br/>\n&gt;always slept in clothes.<br/>\n&gt;<br/>\n&gt;In an interview, the mother says she has not slept with him naked since he<br/>\n&gt;was around age 3, when she stopped because her son commented that she<br/>\n&gt;should put some clothes on. Though she has since moved, the mother says her<br/>\n&gt;son did not have his own room or his own bed in their former three-bedroom<br/>\n&gt;apartment.<br/>\n&gt;<br/>\n&gt;Her parenting style and the way she was raised bring to the fore areas of<br/>\n&gt;child-rearing that many of today&#39;s parents keep private because they are<br/>\n&gt;not seen as widely acceptable in society, experts say. While no researcher<br/>\n&gt;supports forcing a child to nurse or co-sleeping naked if that creates<br/>\n&gt;discomfort for a child, they also say that co-sleeping and extended nursing<br/>\n&gt;are both perfectly naturalit is society that makes them seem unnatural.<br/>\n&gt;<br/>\n&gt;Research shows that many women continue to nurse their children well beyond<br/>\n&gt;infancy.<br/>\n&gt;<br/>\n&gt;Katherine Dettwyler, an associate professor of anthropology and nutrition<br/>\n&gt;at Texas A&M University, conducted a study in the late 1990s on 1,280<br/>\n&gt;children whose parents self-reported information about their breastfeeding<br/>\n&gt;practices. Of the total, 375 children were still nursing at age 4, 212<br/>\n&gt;children were nursing at age 5, and 67 children were nursing at age 6,<br/>\n&gt;according to Dettwyler.<br/>\n&gt;<br/>\n&gt;Elizabeth Baldwin, a Miami-based attorney who specializes in breastfeeding<br/>\n&gt;cases and is an adviser to La Leche League International, says &quot;there is<br/>\n&gt;nothing wrong with breastfeeding at age 6.&quot;<br/>\n&gt;<br/>\n&gt;&quot;You cannot make a child nurse; either the child has the need or does not<br/>\n&gt;have the need,&quot; Baldwin said. &quot;We have sexualized the breast to the point<br/>\n&gt;where we assume that it is a sexual thing rather than a tool for nursing.&quot;<br/>\n&gt;<br/>\n&gt;Extended breastfeeding and co-sleeping often go hand-in-hand, experts say.<br/>\n&gt;<br/>\n&gt;&quot;Other countries wouldn&#39;t even know there was a question to be asked about<br/>\n&gt;where should my baby sleep,&quot; said James McKenna, a professor of<br/>\n&gt;anthropology and the director of a mother-baby behavioral sleep lab at the<br/>\n&gt;University of Notre Dame. &quot;It is a recent Western concept engrained in us,<br/>\n&gt;an emphasis on individualism and the idea that it&#39;s a moral principle that<br/>\n&gt;early in life babies and children need to soothe themselves.&quot;<br/>\n&gt;<br/>\n&gt;McKenna added: &quot;In our society, we equate nudity with the potential for<br/>\n&gt;sexuality. It may not be a sexual act at all in the minds of participants;<br/>\n&gt;it is externally influenced viewpoints that make it so.&quot;<br/>\n&gt;<br/>\n&gt;He warned, however, that not all co-sleeping arrangements are necessarily<br/>\n&gt;healthy.<br/>\n&gt;<br/>\n&gt;&quot;The benefit of any kind of social behavior is determined by the context in<br/>\n&gt;which it occurs,&quot; McKenna said. &quot;In a healthy human family, sleeping<br/>\n&gt;arrangements can enhance that which is already good, or it could be the<br/>\n&gt;case sleeping arrangements can enhance that which is already bad.&quot;<br/>\n&gt;<br/>\n&gt;Focus on boy&#39;s reaction<br/>\n&gt;<br/>\n&gt;The Champaign case is similar tobut also critically different froma<br/>\n&gt;celebrated case out of New York state in 1991. In that case Denise<br/>\n&gt;Periggo&#39;s 3-year-old daughter Cherlyn was taken from her because Periggo<br/>\n&gt;had strong feelings of sexual arousal when breastfeeding.<br/>\n&gt;<br/>\n&gt;In the Champaign case, experts are divided on how the nursing was affecting<br/>\n&gt;the boy.<br/>\n&gt;<br/>\n&gt;A report by Champaign forensic psychologist Dr. Marty Traver,who evaluated<br/>\n&gt;the boy upon referral from Judge Einhorn, described an alert, relaxed child<br/>\n&gt;who expressed ambivalence about nursing.<br/>\n&gt;<br/>\n&gt;&quot;It is clear that [the boy] has suffered some emotional problems as a<br/>\n&gt;result of his extended nursing,&quot; Traver wrote. &quot;Those problems however do<br/>\n&gt;not appear to rise to the level of abuse unless there is evidence that [the<br/>\n&gt;boy&#39;s] mother nursed him for her own gratification.&quot;<br/>\n&gt;<br/>\n&gt;&quot;The primary detriment from extended nursing in this case, was that [the<br/>\n&gt;boy] was ashamed of doing so and did not feel socially appropriate in doing<br/>\n&gt;so,&quot; Traver&#39;s report states.<br/>\n&gt;<br/>\n&gt;&quot;A parent must weigh the damage done by participating in something society<br/>\n&gt;does not approve of against the positive effects and advantages of<br/>\n&gt;continuing to do so. In this case, as in many others, the parent and child<br/>\n&gt;had to keep the continuing breastfeeding a secret because of societal<br/>\n&gt;disapproval. This sets the child up to keep other secrets that he cannot<br/>\n&gt;yet understand,&quot; the report stated.<br/>\n&gt;<br/>\n&gt;Traver also said it was not appropriate for the boy to continue to sleep<br/>\n&gt;with his mother. &quot;At this age, it would be psychologically harmful for him<br/>\n&gt;to be in his mother&#39;s presence when she is nude. ... (The boy) must learn<br/>\n&gt;to sleep in his own bed and soothe himself to sleep.&quot;<br/>\n&gt;<br/>\n&gt;But a report by Kate McDougall, a Catholic Social Service social worker who<br/>\n&gt;is counseling the mother and child, concluded that while the mother&#39;s<br/>\n&gt;&quot;parenting style may be considered somewhat permissive, this therapist does<br/>\n&gt;not have concerns about [the boy&#39;s] safety while in her care.&quot; McDougall<br/>\n&gt;added that she saw no evidence of any abuse in the relationship.<br/>\n&gt;<br/>\n&gt;The boy &quot;has come to feel ashamed and guilty about breastfeeding as a<br/>\n&gt;result of his being removed from his mother&#39;s care due to their nursing.<br/>\n&gt;This therapist has concerns that these feelings of shame and guilt will be<br/>\n&gt;exacerbated by further separation,&quot; McDougall wrote in a clinical<br/>\n&gt;assessment report.<br/>\n&gt;<br/>\n&gt;McDougall also stated in her report that she had no concerns about the two<br/>\n&gt;sleeping in the same bed and recommended the boy be returned home.<br/>\n&gt;<br/>\n&gt;The woman&#39;s public defender, David DeThorne, said Traver&#39;s testimony stated<br/>\n&gt;that the child was embarrassed.<br/>\n&gt;<br/>\n&gt;&quot;That shouldn&#39;t be a reason the state should get involved,&quot; DeThorne said.<br/>\n&gt;&quot;She was doing something to him outside the norm, and [perhaps] he didn&#39;t<br/>\n&gt;want tothat is open to dispute as well.&quot;<br/>\n&gt;<br/>\n&gt;He added: &quot;Parents should be allowed to make decisions that might be out of<br/>\n&gt;the norm. Most parents don&#39;t breastfeed at age of 6, but it doesn&#39;t mean<br/>\n&gt;it&#39;s wrong for the child.&quot;<br/>\n&gt;<br/>\n&gt;Countered DCFS spokeswoman Martha Allen: &quot;There is a problem when the<br/>\n&gt;mother is sleeping naked with a 6-year-old; we live in America and we have<br/>\n&gt;our norms too.<br/>\n&gt;<br/>\n&gt;&quot;This is a case that not just DCFS but the state&#39;s attorney and judge<br/>\n&gt;determined was inappropriate and was a form of abuse.<br/>\n&gt;<br/>\n&gt;&quot;It&#39;s inappropriate for a mother to be breastfeeding a child at 6 years old<br/>\n&gt;and to be sleeping naked with him. The reason DCFS found it an issue was<br/>\n&gt;we&#39;re looking at the area of sexual abuse when we say molestation. There is<br/>\n&gt;risk of actual and emotional abuse. We are in the realm of sexual abuse;<br/>\n&gt;that is the reason that we took the child out of the mother&#39;s care.&quot;<br/>\n&gt;<br/>\n&gt;On Monday, Judge Einhorn will hear final arguments from both sides in the<br/>\n&gt;Champaign County case. Einhorn may decide on Monday, or she could wait<br/>\n&gt;until a later date, to determine whether the boy was neglected or abused.<br/>\n&gt;If her determination is that the child was abused, another hearing will be<br/>\n&gt;held to decide whether the child can go home or not, and to determine a<br/>\n&gt;plan for the mother to get her son back.<br/>\n&gt;<br/>\n&gt;Though she wants her son back, the mother also refuses to compromise her<br/>\n&gt;methods.<br/>\n&gt;<br/>\n&gt;&quot;They took my son because I&#39;m not following the DCFS cookbook on raising a<br/>\n&gt;kid,&quot; she says. &quot;It&#39;s so outrageous, they need to admit they made a mistake<br/>\n&gt;and drop it.&quot;<br/>\n<br/>\n </span></blockquote>Love <br/>\n  Pauline<br/>\n<br/>\n<br/>\n<br/>\nLots of photos of us having fun at home in sunny Sydney<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://albums.photopoint.com/j/AlbumIndex?u=898945&a=6546029&pw=23631\">http://albums.photopoint.com/j/AlbumIndex?u=898945&a=6546029&pw=23631</a></div>","specialLinks":[]},{"userId":0,"authorName":"Tracy Oldfield","from":"&quot;Tracy Oldfield&quot; &lt;tracy.oldfield@...&gt;","replyTo":"LIST","senderId":"2zWrvh3dATBx1P-dt5c5WuCs_EGHKn1EikEf8bnejNPIKvz-VbRm-HKGwzryymsZpwSPoYF_smBytKfQuXidIVXlfR2tdOMmhHh-kHCZksXmPny1Nw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] in the news","postDate":"976583860","msgId":14497,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNBMzU3Q0I0LjEwMzExLjhEMEFGN0Bsb2NhbGhvc3Q+","inReplyToHeader":"PDAwMGIwMWMwNjM4NCQ3Y2MwZmZmMCQwMTAwMDA1YUBjYW1lbG90Pg==","referencesHeader":"PDAwMDEwMWMwNjM4MyQwYTU1NDU4MCQzYjhmM2VhNkB3dnVzLm9yZz4="},"prevInTopic":14493,"nextInTopic":14502,"prevInTime":14496,"nextInTime":14498,"topicId":14482,"numMessagesInTopic":0,"msgSnippet":"naturalweaners, an egroup, is for those intersted/needing support in child-led weaning, obviously!  Started after an argument on a list I m on about extended","messageBody":"<div id=\"ygrps-yiv-1346708082\">naturalweaners, an egroup, is for those intersted/needing support in <br/>\nchild-led weaning, obviously!  Started after an argument on a list I&#39;m <br/>\non about extended nursing...<br/>\n<br/>\nTracy<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; Can anyone tell me -- is there an email discussion group devoted to<br/>\n&gt; breast-feeding?  Besides this one, I mean?<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"Susan in FL","from":"&quot;Susan in FL&quot; &lt;samiot@...&gt;","replyTo":"LIST","senderId":"w2XEUenjcXBXu3fSC7Zzvbc9DAtZjJo01HrBkUpziDT4bT4LCa1DNI-Bg7dd-sjxJz-sPf8lQjuKjQXpXwXcDmZIesaPkKCX","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] in the news","postDate":"976574838","msgId":14492,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDYwMWMwNjNjNCQ1MGE1NjNkMCQ5ZDBjMjE0MUBjZmwucnIuY29tPg==","inReplyToHeader":"PDAwMDEwMWMwNjM4MyQwYTU1NDU4MCQzYjhmM2VhNkB3dnVzLm9yZz4="},"prevInTopic":14491,"nextInTopic":14493,"prevInTime":14491,"nextInTime":14493,"topicId":14482,"numMessagesInTopic":0,"msgSnippet":"I would imagine a child would have one very good way of letting you know he didn t want to nurse, especially after his teeth are in.","messageBody":"<div id=\"ygrps-yiv-259526871\">\n<html><head>\n \n\n\n</head> \n \n<div><span class=\"ygrps-yiv-259526871650344622-11122000\"><font face=\"Arial\" color=\"#0000ff\" size=\"2\">I \nwould imagine a child would have one very good way of letting you know he didn&#39;t \nwant to nurse, especially after his teeth are \nin.</font></span></div></html></div>","specialLinks":[]},{"userId":0,"authorName":"dawn","from":"dawn &lt;dawn@...&gt;","replyTo":"LIST","senderId":"IMKYUk5AubbyNrwsC9dPJKfXI0IzpFdjLQW2UQ96oJUZtjyBHRsrVo8xkNxrYT6jhXtbqBOOevTrQY0","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: in the news","postDate":"976571821","msgId":14493,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFBpbmUuQlNGLjQuMjEuMDAxMjExMTM1NDQ4MC40NDQxOS0xMDAwMDBAbWF0ZS5ranNsLmNvbT4=","inReplyToHeader":"PEI2NUE4Njc4LjEwNDMlYW15bmVsc29uM0Bob21lLmNvbT4="},"prevInTopic":14492,"nextInTopic":14497,"prevInTime":14492,"nextInTime":14494,"topicId":14482,"numMessagesInTopic":0,"msgSnippet":"and there is the grandmother of all breastfeeding lists...Parent-L http://lists.uts.edu.au/mailman/listinfo/parent-l dawn h-s **********","messageBody":"<div id=\"ygrps-yiv-489881880\">and there is the grandmother of all breastfeeding lists...Parent-L<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://lists.uts.edu.au/mailman/listinfo/parent-l\">http://lists.uts.edu.au/mailman/listinfo/parent-l</a><br/>\n<br/>\ndawn h-s<br/>\n**********</div>","specialLinks":[]},{"userId":0,"authorName":"Valerie","from":"&quot;Valerie&quot; &lt;valeries@...&gt;","replyTo":"LIST","senderId":"OeeV5r1zidQYxqz0ogI0tqUYE3EwT1Qj3vBPBRKX-Qjf8H3YRMNnUYSPthD4ynf2sTWT_G2hPCikr672c-Y9D95047nO2g","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] Re: in the news","postDate":"976566715","msgId":14491,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWMwNjNiMSQ2NmNjNGM0MCRlZThlM2VhNkB3dnVzLm9yZz4=","inReplyToHeader":"PEI2NUE4Njc4LjEwNDMlYW15bmVsc29uM0Bob21lLmNvbT4="},"prevInTopic":14490,"nextInTopic":14492,"prevInTime":14490,"nextInTime":14492,"topicId":14482,"numMessagesInTopic":0,"msgSnippet":"The article about this was on another list I belong to. As far as breastfeeding groups, I m pretty sure there are some on egroups that are solely for bfing but","messageBody":"<div id=\"ygrps-yiv-1382638094\">The article about this was on another list I belong to. As far as<br/>\nbreastfeeding groups, I&#39;m pretty sure there are some on egroups that are<br/>\nsolely for bfing but any ap list would also have plenty of discussion.<br/>\n<br/>\nAmy<br/>\nMama to Accalia (6/14/99)<br/>\n&quot;The hardest to learn was the least complicated&quot; -Indigo Girls<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Breastfeeding spurs custody battle<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>***I have an even longer, more indepth article if anyone would like to read<br/>\nit (and become furious/ill). Email me personally if you want me to forward<br/>\nit.<br/>\n<br/>\n--Valerie</div>","specialLinks":[]},{"userId":0,"authorName":"Cory and Amy Nelson","from":"Cory and Amy Nelson &lt;amynelson3@...&gt;","replyTo":"LIST","senderId":"NZafRhvvUHh51Fu4Sv-_LCyp5ab0lYvTDOErmusz3JWKVg42XRZEItDsPER3zoCjCARgoFGVsUMAoaYzfdOiKdEzCH4tvo8AP2UMdCuzWUg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: in the news","postDate":"976562777","msgId":14490,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI2NUE4Njc4LjEwNDMlYW15bmVsc29uM0Bob21lLmNvbT4=","inReplyToHeader":"PDNBMzQ5MDA4LjUxMkY2QUMwQHF0bS5uZXQ+"},"prevInTopic":14488,"nextInTopic":14491,"prevInTime":14489,"nextInTime":14491,"topicId":14482,"numMessagesInTopic":0,"msgSnippet":"The article about this was on another list I belong to. As far as breastfeeding groups, I m pretty sure there are some on egroups that are solely for bfing but","messageBody":"<div id=\"ygrps-yiv-470596894\">The article about this was on another list I belong to. As far as<br/>\nbreastfeeding groups, I&#39;m pretty sure there are some on egroups that are<br/>\nsolely for bfing but any ap list would also have plenty of discussion.<br/>\n<br/>\nAmy<br/>\nMama to Accalia (6/14/99)<br/>\n&quot;The hardest to learn was the least complicated&quot; -Indigo Girls<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; Breastfeeding spurs custody battle<br/>\n&gt; <br/>\n&gt; - - - - - - - - - - - -<br/>\n&gt; <br/>\n&gt; Dec. 10, 2000 | CHICAGO (AP) -- A judge will hold a hearing Monday on a<br/>\n&gt; 6-year-old boy who was removed from his mother&#39;s custody because she was<br/>\n&gt; still breast-feeding him when he was 5, allegedly against his wishes.<br/>\n&gt; <br/>\n&gt; The Illinois Department of Children and Family Services took the child<br/>\n&gt; in July after a baby sitter called a child-abuse hot line.<br/>\n&gt; <br/>\n&gt; Champaign County Circuit Judge Ann Einhorn is scheduled to hear the<br/>\n&gt; case. <br/>\n&gt; <br/>\n&gt; DCFS investigators said the boy told them he no longer wanted to<br/>\n&gt; breast-feed, but the mother, 32, said her son never indicated that he<br/>\n&gt; wanted to stop. She denied any allegations of abuse.<br/>\n&gt; <br/>\n&gt; Authorities did not identify the woman to protect the child&#39;s privacy.<br/>\n&gt; <br/>\n&gt; &quot;The fundamental issue on this is that the child did not want to do it,<br/>\n&gt; and I think that&#39;s one of the key reasons this is a problem,&quot; said DCFS<br/>\n&gt; Director Jess McDonald.<br/>\n&gt; <br/>\n&gt; The agency also contended the woman shared a bed with her son. The<br/>\n&gt; mother said there is not enough space for the boy to have his own room.<br/>\n&gt; <br/>\n&gt; &quot;My child was weaning himself,&quot; the mother said. &quot;I don&#39;t think DCFS<br/>\n&gt; has any right to be involved in this decision between me and my child.&quot;<br/>\n&gt; <br/>\n&gt; Although it is rare for an American child to be breast-fed at such an<br/>\n&gt; advanced age, physicians and anthropologists said it is not unheard of.<br/>\n&gt; <br/>\n&gt; Katherine Dettwyler, an anthropologist and nutritionist at Texas A&M<br/>\n&gt; University, recently conducted a study of 1,280 children whose parents<br/>\n&gt; reported their breast-feeding practices. Of the total, 375 children<br/>\n&gt; were still breast-feeding at age 4, 212 at age 5 and 67 at age 6.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Associated Press </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","replyTo":"LIST","senderId":"pY5bNzs9US2ArDb5S0lR34IVJYn1UMIFAPBf-WdSnSVU1-wK_Uw8Ro6zsXXVEKUfWxYaUSlh3ghjH_0r0Dqsj-MCxQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] in the news","postDate":"976556598","msgId":14488,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMTYwMWMwNjM5YyRiOWNhZDY2MCQxZTVkZDFkMUBsZGlvbm5vPg==","referencesHeader":"PDAwMDEwMWMwNjM4MyQwYTU1NDU4MCQzYjhmM2VhNkB3dnVzLm9yZz4="},"prevInTopic":14485,"nextInTopic":14490,"prevInTime":14487,"nextInTime":14489,"topicId":14482,"numMessagesInTopic":0,"msgSnippet":"I think it is time for the general population to raise up and pass some laws putting controls on CPS/CWS or whatever they are called in each and every state!","messageBody":"<div id=\"ygrps-yiv-964163383\">\n<html><head>\n \n \n<style></style>\n</head>\n \n<div><font face=\"Arial\" size=\"2\">I think it is time for the general population to \nraise up and pass some laws putting controls on CPS/CWS or whatever they are \ncalled in each and every state!&nbsp; It is time that personal picadillos \nstopped being the ruler to judge other by!&nbsp; Geez Louise, whatever happened \nto &quot;cast the first stone&quot; and &quot;live and let live?&quot;</font></div>\n<div><font face=\"Arial\" size=\"2\"></font>&nbsp;</div>\n<div><font face=\"Arial\" size=\"2\">Lynda, fuming!</font></div>\n<blockquote><span title=\"qreply\"> <blockquote\n style=\"PADDING-RIGHT:0px;PADDING-LEFT:5px;MARGIN-LEFT:5px;BORDER-LEFT:#000000 2px solid;MARGIN-RIGHT:0px;\">\n  <div style=\"FONT:10pt arial;\">----- Original Message ----- </div>\n  <div\n style=\"BACKGROUND:#e4e4e4;FONT:10pt arial;\"><b>From:</b> \n  <a rel=\"nofollow\" title=\"valeries@...\" target=\"_blank\" href=\"mailto:valeries@...\">Valerie</a> \n  </div>\n  <div style=\"FONT:10pt arial;\"><b>To:</b> <a rel=\"nofollow\"\n title=\"Unschooling-dotcom@egroups.com\"\n target=\"_blank\" href=\"mailto:Unschooling-dotcom@egroups.com\">Unschooling-dotcom@egroups.com</a> \n  ; <a rel=\"nofollow\" title=\"HerbalMothering@egroups.com\"\n target=\"_blank\" href=\"mailto:HerbalMothering@egroups.com\">HerbalMothering@egroups.com</a> \n  </div>\n  <div style=\"FONT:10pt arial;\"><b>Sent:</b> Monday, December 11, 2000 7:00 \n  AM</div>\n  <div style=\"FONT:10pt arial;\"><b>Subject:</b> [Unschooling-dotcom] in the \n  news</div>\n  <div><br></div>\n  <div><font face=\"Arial\" size=\"2\"><span class=\"ygrps-yiv-964163383430245714-11122000\">Whoa. I just heard \n  this on the news: A 5 year old boy was removed from his mother&#39;s custody \n  because &quot;He was being forced to breastfeed&quot;. Does this sound suspicious to \n  anyone else? How does someone &quot;force&quot; a child to nurse?</span></font></div>\n  <div><font face=\"Arial\" size=\"2\"><span\n class=\"ygrps-yiv-964163383430245714-11122000\"></span></font>&nbsp;</div>\n  <div><font face=\"Arial\" size=\"2\"><span\n class=\"ygrps-yiv-964163383430245714-11122000\">Valerie</span></font></div><br><br><tt>Message \n  boards, timely articles, a free newsletter and more!<br>Check it all out at: \n  <a rel=\"nofollow\"\n target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br><br>Addresses:<br>Post \n  message: <a rel=\"nofollow\"\n target=\"_blank\" href=\"mailto:Unschooling-dotcom@egroups.com\">Unschooling-dotcom@egroups.com</a><br>Unsubscribe: \n  Unschooling-dotcom-unsubscribe@egroups.com<br>List owner: \n  Unschooling-dotcom-owner@egroups.com<br>List settings page: <a rel=\"nofollow\"\n target=\"_blank\" href=\"http://www.egroups.com/group/Unschooling-dotcom\">http://www.egroups.com/group/Unschooling-dotcom</a><br></tt><br></blockquote></span></blockquote></html> \n</div>","specialLinks":[]},{"userId":0,"authorName":"Elizabeth McCullough","from":"&quot;Elizabeth McCullough&quot; &lt;emccullough@...&gt;","replyTo":"LIST","senderId":"KbrL9zbJCsoAWEj7Lst5rxgARhWmkYYJoqN1myQc2bUiYUg7bv_egCfWBRxsnnqfYd4A3mN3OsCtES1Kk75bJG7-QTDuHR7S55UMUkMrZdcE_MvYYS2z6E3IfVw_hA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] in the news","postDate":"976547540","msgId":14484,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGIwMWMwNjM4NCQ3Y2MwZmZmMCQwMTAwMDA1YUBjYW1lbG90Pg==","inReplyToHeader":"PDAwMDEwMWMwNjM4MyQwYTU1NDU4MCQzYjhmM2VhNkB3dnVzLm9yZz4="},"prevInTopic":14482,"nextInTopic":14485,"prevInTime":14483,"nextInTime":14485,"topicId":14482,"numMessagesInTopic":0,"msgSnippet":"Can anyone tell me -- is there an email discussion group devoted to breast-feeding?  Besides this one, I mean? Elizabeth McCullough Virginia ... From: Valerie","messageBody":"<div id=\"ygrps-yiv-1383432063\">\n<html><head>\n \n\n\n</head> \n \n<div><font color=\"#0000ff\" face=\"Arial\" size=\"2\"><span class=\"ygrps-yiv-1383432063960400915-11122000\">Can \nanyone tell me -- is there an email discussion list devoted to \nbreast-feeding?&nbsp; Besides this one, I mean?</span></font></div>\n<div><font color=\"#0000ff\" face=\"Arial\" size=\"2\"><span\n class=\"ygrps-yiv-1383432063960400915-11122000\"></span></font>&nbsp;</div>\n<div><font color=\"#0000ff\" face=\"Arial\" size=\"2\"><span\n class=\"ygrps-yiv-1383432063960400915-11122000\">Elizabeth McCullough</span></font></div>\n<div><font color=\"#0000ff\" face=\"Arial\" size=\"2\"><span\n class=\"ygrps-yiv-1383432063960400915-11122000\">Virginia</span></font></div>\n<blockquote><span title=\"qreply\"> <blockquote>\n  <div align=\"left\" class=\"ygrps-yiv-1383432063OutlookMessageHeader\" dir=\"ltr\"><font face=\"Tahoma\"\n size=\"2\">-----Original Message-----<br><b>From:</b> Valerie \n  [mailto:valeries@...]<br><b>Sent:</b> Monday, December 11, 2000 10:00 \n  AM<br><b>To:</b> Unschooling-dotcom@egroups.com; \n  HerbalMothering@egroups.com<br><b>Subject:</b> [Unschooling-dotcom] in the \n  news<br><br></font></div>\n  <div><font face=\"Arial\" size=\"2\"><span class=\"ygrps-yiv-1383432063430245714-11122000\">Whoa. I just heard \n  this on the news: A 5 year old boy was removed from his mother&#39;s custody \n  because &quot;He was being forced to breastfeed&quot;. Does this sound suspicious to \n  anyone else? How does someone &quot;force&quot; a child to nurse?</span></font></div>\n  <div><font face=\"Arial\" size=\"2\"><span\n class=\"ygrps-yiv-1383432063430245714-11122000\"></span></font>&nbsp;</div>\n  <div><font face=\"Arial\" size=\"2\"><span\n class=\"ygrps-yiv-1383432063430245714-11122000\">Valerie</span></font></div></blockquote></span></blockquote></html> \n</div>","specialLinks":[]},{"userId":0,"authorName":"dawn","from":"dawn &lt;dawn@...&gt;","replyTo":"LIST","senderId":"88hb-vPYnjNBxefi-WGdhEVFByGx93D_rceev5WBC4THqL9aJXyaiy_P3vZd3PCl1TX2wsVO0yMtUNQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] in the news","postDate":"976547375","msgId":14485,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFBpbmUuQlNGLjQuMjEuMDAxMjExMDcwNTEyMC4xNTI1OS0xMDAwMDBAbWF0ZS5ranNsLmNvbT4=","inReplyToHeader":"PDAwMDEwMWMwNjM4MyQwYTU1NDU4MCQzYjhmM2VhNkB3dnVzLm9yZz4="},"prevInTopic":14484,"nextInTopic":14488,"prevInTime":14484,"nextInTime":14486,"topicId":14482,"numMessagesInTopic":0,"msgSnippet":"someone sent me a copy of the article.  it says that they boy was 6 and his mother forced him to breastfeed (although the mother claims she didn t know that he","messageBody":"<div id=\"ygrps-yiv-489093223\">someone sent me a copy of the article.  it says that they boy was 6 and<br/>\nhis mother forced him to breastfeed (although the mother claims she didn&#39;t<br/>\nknow that he didn&#39;t want to).  It was in the Chicago Tribune.  My first<br/>\nquestion is, &quot;How did she force him to nurse against his will?  There was<br/>\nvery little I could get my 6 yo to do agains his will.&quot; And the kid was<br/>\nseen by a psychologist (if I&#39;m remembering correctly) and found OK....Oh,<br/>\nI&#39;m messing this all up.  I&#39;ll go see if I can find the URL and forward it<br/>\nhere.<br/>\n<br/>\n<br/>\ndawn h-s<br/>\n**********<br/>\nSome who support more coercive strategies assume that children will run<br/>\nwild if they are not controlled.  However, the children for whom this is<br/>\ntrue typically turn out to be those accustomed to being controlled--those<br/>\nwho are not trusted, given explanations, encouraged to think for<br/>\nthemselves, helped to develop and internalize good values, and so<br/>\non.  Control breeds the need for more control, which is then used to<br/>\njustify the use of control.<br/>\n<br/>\n---Alfie Kohn,  Punished by Rewards, p. 33.<br/>\n**********<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mon, 11 Dec 2000, Valerie wrote:<br/>\n<br/>\n&gt; Whoa. I just heard this on the news: A 5 year old boy was removed from his<br/>\n&gt; mother&#39;s custody because &quot;He was being forced to breastfeed&quot;. Does this<br/>\n&gt; sound suspicious to anyone else? How does someone &quot;force&quot; a child to nurse?<br/>\n&gt; <br/>\n&gt; Valerie<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"Valerie","from":"&quot;Valerie&quot; &lt;valeries@...&gt;","replyTo":"LIST","senderId":"z27GQjFad05H5FVKX1Qr3aLLhbeEXp52rOdXk0QwcDXrfm6xnUD1rZzjE_pqpqpjltzfc_ER0VbpbqWT9qb_C8UXHRxdsw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"in the news","postDate":"976546803","msgId":14482,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDEwMWMwNjM4MyQwYTU1NDU4MCQzYjhmM2VhNkB3dnVzLm9yZz4="},"prevInTopic":0,"nextInTopic":14484,"prevInTime":14481,"nextInTime":14483,"topicId":14482,"numMessagesInTopic":0,"msgSnippet":"Whoa. I just heard this on the news: A 5 year old boy was removed from his mother s custody because He was being forced to breastfeed . Does this sound","messageBody":"<div id=\"ygrps-yiv-777632798\">\n<html><head>\n \n</head> \n \n<div><font face=\"Arial\" size=\"2\"><span class=\"ygrps-yiv-777632798430245714-11122000\">Whoa. I just heard \nthis on the news: A 5 year old boy was removed from his mother&#39;s custody because \n&quot;He was being forced to breastfeed&quot;. Does this sound suspicious to anyone else? \nHow does someone &quot;force&quot; a child to nurse?</span></font></div>\n<div><font face=\"Arial\" size=\"2\"><span\n class=\"ygrps-yiv-777632798430245714-11122000\"></span></font>&nbsp;</div>\n<div><font face=\"Arial\" size=\"2\"><span\n class=\"ygrps-yiv-777632798430245714-11122000\">Valerie</span></font></div></html></div>","specialLinks":[]}],"prevTopicId":14495,"nextTopicId":14421}}