{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Joseph Fuerst","from":"&quot;Joseph Fuerst&quot; &lt;fuerst@...&gt;","replyTo":"LIST","senderId":"tSlxzqSweAK4li2gmRKAjeDwZzDYP7rpvfKO3Q-jbKbPMfGocSnPyj3XQ8X0XAvoIC6UVcwBEpHY_ZcfNsM1jdrXQWM0jdEV","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest Number 1530","postDate":"1002715852","msgId":26846,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMWIwMWMxNTE4NCQ5YmQ3NWQwMCRlYTg5ODUwYUBwYXZpbGlvbj4=","referencesHeader":"PDEwMDI2MjY0NTUuMjUyLjY0OTk1Lm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":26845,"nextInTime":26847,"topicId":26846,"numMessagesInTopic":0,"msgSnippet":"Hi Caren, I hope you can manage to relax a bit!  You may need to ask others about de-schooling since my oldest dd only went to K.  Although,  my second dd ","messageBody":"<div id=\"ygrps-yiv-1206102164\">Hi Caren,<br/>\nI hope you can manage to relax a bit!  You may need to ask others about<br/>\nde-schooling since my oldest dd only went to K.  Although,  my second dd<br/>\nseems to have the &quot;I&#39;m-missing-out&quot; feeling becauseshe has three others her<br/>\nage going to school. She wants to do &quot;schoolwork&quot; and &quot;homework&quot;<br/>\neveryday.....but,  it&#39;s her decision.  She writes (i.e., copies mostly)<br/>\nevery day.  And doesn&#39;t want her friends to read before her.<br/>\n<br/>\nAs to your disorganization....it &#39;reads&#39; to me like 9/11 has increased it.<br/>\nAt least know that reaction is not surprising.  This war is anxiety<br/>\nproducing....most people are having grief reactions,  or at least increased<br/>\nstress reactions.  I know this is on-line and unschooling,  so I don&#39;t want<br/>\nto offer mental health advice  in anything but generic form (?)....In all<br/>\nseriousness,  your community may have mental health professionals available<br/>\nat no charge....at least to speak to groups.  I know ours does because I<br/>\nhave volunteered.<br/>\nOn the other hand, your disorganization doesn&#39;t seem (through your e-mail)<br/>\nto be that bad.....I have lived like that frequently!!  Check your sense of<br/>\nhumor...can you laugh about some/all of it?<br/>\n<br/>\nAs to it effecting Max......I&#39;d say don&#39;t worry about that.  If you choose<br/>\nto work on your level of organization and if you believe that will enhance<br/>\nMax&#39;s life....well,then you are being an example of unschooling yourself.<br/>\nThere are many many books on organization/home management - and some on-line<br/>\nresourses, too.  Personally,  I have had this &quot;housework is mundane&quot;<br/>\nattitude until recently.  And our house was utter chaos usually.  When I it<br/>\nbegan effecting my anxiety level and self esteem,  I began to work on it.<br/>\n(We have four people of the younger persuasion here - household tasks are<br/>\nneccesary to our functioning!)<br/>\n<br/>\nSo I&#39;m currently seeking that balance between tidiness and &#39;room for<br/>\ncreative play&#39; (which involves allowing freedom to explore and can get<br/>\nmessy).  Our house is better....we do not have the yelling at each other<br/>\nwhen we want/need to get out the door anymore...because of this increased<br/>\nlevel of organization,  I have more time to actually pay attention to the<br/>\nchildren!<br/>\n<br/>\nSuz<br/>\n<blockquote><span title=\"ireply\"> &gt; OK, OK, I admit it -- I AM scared!  Max (sometimes referred to as Evan)<br/>\n </span></blockquote>was in a charter school for 1st and 2nd grades, and now he&#39;s home.  I am a<br/>\ndisorganized person in general, and even more so since Sept. 11th (probably<br/>\nsomething I need to process there).  Disorganized meaning that last week I<br/>\nkept forgetting Max had agreed to clean his room on a certain day, and it&#39;s<br/>\nstill not clean, the cat had to eat dog food for a day &#39;cause I just kept<br/>\nforgetting we were out, the checkbook is in horrible disarray (intuitive<br/>\nchecking, I&#39;ve heard it called), etc., etc.  Actually, writing this out, all<br/>\nthat doesn&#39;t seem like that big a deal.  I think it reminds me of the years<br/>\nI was depressed and never had &quot;it&quot; together.  Anyway, Max has been just kind<br/>\nof hanging around, looking like he&#39;d like me to tell him what to do.  He<br/>\nfound an old book a grandparent had given him - fun with reading kind of<br/>\nthing where you fill in the blanks - and he was *thrilled* to be doing that.<br/>\nEven though he thinks like this:  One of the fill-in-the-blanks was The<br/>\n_________ jump up high.  Boys or man?  He chose boys, not because of the<br/>\nplural &quot;jump&quot; but because he thought it was really silly for a grown man to<br/>\nbe jumping.  If the word had been &quot;jumps&quot; he still would have chosen boys,<br/>\nbecause that&#39;s the way he thinks.  Then he would have looked in the back and<br/>\nhe would have been &quot;wrong&quot;.  OK, so now that particular book is gone, but he<br/>\nreally wants to be doing more &quot;school&quot;-like work, because that&#39;s what he&#39;s<br/>\nused to.  I have read where kids who have gone to school need time to<br/>\n&quot;deschool&quot;, and that I just need to be patient, let him hang out, and he&#39;ll<br/>\nfind himself.  But I&#39;m worried that because of my disorganization, maybe I&#39;m<br/>\nnot providing him with a good environment for doing that.  It feels<br/>\nneglectful.  I&#39;m NOT neglecting him, and if he came up and said &quot;I want to<br/>\ngo look at __________&quot; I&#39;d take him in a minute, but he&#39;s not really<br/>\ninterested in anything.  He does read a lot.  He&#39;s almost nine.  I really<br/>\nbelieve he needs time to &quot;heal&quot; from<br/>\n<blockquote><span title=\"ireply\"> &gt; his school experiences.  Nothing severely traumatic happened, but hearing<br/>\n </span></blockquote>that what you&#39;re interested in has no value, that finishing something on<br/>\ntime has more value than achieving your vision of it, etc., certainly left<br/>\nsome scars.  Has anyone else on the list been here?  I&#39;ve been trying to act<br/>\nto everyone around me that I believe that everything is fine, and deep down<br/>\nI believe it will be, but before that deep down is a lot of fear.  Any other<br/>\n&quot;deschoolers&quot; out there?  Thanks  --<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; Caren<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ________________________________________________________________________<br/>\n&gt; ________________________________________________________________________<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Your use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]}],"prevTopicId":26829,"nextTopicId":26849}}