{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":1509055,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest Number 2195","postDate":"1028655605","msgId":39995,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMC4yLjEuMC4yMDAyMDgwNjEwMzMyMi4wMWQxOWU1MEBwb3AuaXNsYW5kbmV0LmNvbT4=","inReplyToHeader":"PDNENEY4MzQ2LjExNDlEQURFQGd0ZS5uZXQ+","referencesHeader":"PDEwMjg2MDQzNTUuMTQzNC45Mzc3OC5tMTFAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":39930,"nextInTopic":0,"prevInTime":39994,"nextInTime":39996,"topicId":39923,"numMessagesInTopic":0,"msgSnippet":"... I m still wondering where some people got the idea that using the word teach is forbidden .  I ve seen suggestions that it s *better* to think of","messageBody":"<div id=\"ygrps-yiv-264848701\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt;<br/>\n&gt;  I think a discussion of the different aspects of learning vs teaching<br/>\n&gt;is very helpful .... up to a point. All people do both, I think, teach<br/>\n&gt;and learn in the natural scheme of life. Learning that there is a<br/>\n&gt;give-and-take in these things is very valuable.  Making &quot;teaching&quot; a<br/>\n&gt;forbidden word is foolish in my eyes and misplaces the correct emphasis<br/>\n&gt;with a somewhat arbitrary stance. That is just too confusing for many<br/>\n&gt;people.<br/>\n<br/>\n </span></blockquote>I&#39;m still wondering where some people got the idea that using the word <br/>\n&quot;teach&quot; is &quot;forbidden&quot;.  I&#39;ve seen suggestions that it&#39;s *better* to think <br/>\nof learning rather than teaching, that it can help new unschoolers to lose <br/>\nthat word *for awhile*.  The only people that seem to use the word <br/>\n&quot;forbidden&quot; in connection with the word teach are the ones complaining <br/>\nabout the fact that it&#39;s &quot;forbidden&quot;.  Same with talk about &quot;rules&quot; for <br/>\nunschooling.  Someone suggests that it might help to think of something a <br/>\ncertain way, and soon after someone complains about all the unschooling <br/>\n&quot;rules&quot;.<br/>\nTia<br/>\n<br/>\n<br/>\nNo one can make you feel inferior without your consent.<br/>\nEleanor Roosevelt<br/>\n*********************************************<br/>\nTia Leschke<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a><br/>\nOn Vancouver Island</div>","specialLinks":[]},{"userId":22330745,"authorName":"DMM5692@aol.com","from":"DMM5692@...","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest Number 2195","postDate":"1028636516","msgId":39930,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVhLjJiYmJkNjBmLjJhODExOTY0QGFvbC5jb20+"},"prevInTopic":39924,"nextInTopic":39995,"prevInTime":39929,"nextInTime":39931,"topicId":39923,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/5/02 11:26:26 PM Eastern Daylight Time, ... i wish i could KNOW you guys! IN PERSON! DENISE [Non-text portions of this message have been","messageBody":"<div id=\"ygrps-yiv-1291913874\">In a message dated 8/5/02 11:26:26 PM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m reminded of an interchange between Lady Astor and Winston Churchill:<br/>\n&gt; Lady Astor said: Winston, if you were my husband, I&#39;d poison your tea, to<br/>\n&gt; which Churchill replied, My good lady, if you were my wife, I&#39;d drink it.<br/>\n&gt; <br/>\n&gt; Cheers, <br/>\n&gt; <br/>\n&gt; Ned Vare<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>i wish i could KNOW you guys! IN PERSON! DENISE<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1798873,"authorName":"PSoroosh@aol.com","from":"PSoroosh@...","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest Number 2195","postDate":"1028622744","msgId":39924,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYzLmY5OWZhNTAuMmE4MGUzOThAYW9sLmNvbT4="},"prevInTopic":39923,"nextInTopic":39930,"prevInTime":39923,"nextInTime":39925,"topicId":39923,"numMessagesInTopic":0,"msgSnippet":"Good post- I get your point that people might think that saying no teaching means saying that the parents shouldn t demonstrate anything, explain anything,","messageBody":"<div id=\"ygrps-yiv-1234531259\">Good post- I get your point that people might think that saying &quot;no teaching&quot; <br/>\nmeans saying that the parents shouldn&#39;t demonstrate anything, explain <br/>\nanything, pick out interesting videos or books, help kids learn <br/>\nanything...etc.<br/>\n<br/>\nBut I do think that from the examples given, that it has been clear that <br/>\nnobody was ever saying that. Sandra, for example, has talked at length about <br/>\nhelping her kids learn all kinds of things. I&#39;ve recently posted some ways to <br/>\nhelp kids learn some math stuff. I think that anybody reading for more than a <br/>\nfew days would realize that the point of not using the word &quot;teach&quot; is to <br/>\nretrain old patterns of thinking - to help people break away from thinking <br/>\nthat kids only learn what teachers teach.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It is actually too close to what many have done by leaving their kids<br/>\n&gt; off at a school. <br/>\n<br/>\n<br/>\n </span></blockquote>THIS makes sense - sort of. I mean - I can imagine it, even though I can&#39;t <br/>\nsay I&#39;ve EVER seen it in practice. Except that people who don&#39;t want to <br/>\ninteract and support their kids&#39; learning would just leave them IN school -- <br/>\nat least that&#39;s what makes sense to me.<br/>\n<br/>\nDon&#39;t interfere - learning will happen.... Nobody grows&gt;  or changes if the <br/>\n<blockquote><span title=\"ireply\"> &gt; kids are just left to be by themselves and don&#39;t have<br/>\n&gt; a loving parent there to interact when needed. <br/>\n<br/>\n </span></blockquote>We had this discussion on this list a month or so ago - people were posting <br/>\nabout this exact thing - and were attacked for supposedly saying that kids <br/>\nneeded to be &quot;entertained all the time.&quot; Just can&#39;t win, can we? &lt;G&gt; But - <br/>\nyes I agree with this point. I just don&#39;t think it is a big issue. I haven&#39;t <br/>\nseen unschooling parents who didn&#39;t work hard to enrich their kids&#39; lives.<br/>\n<br/>\nI don&#39;t equate unschooling with leaving kids alone and not supporting their <br/>\ninterests. That is the opposite of unschooling, in my book.<br/>\n<br/>\nNew homeschoolers often<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; have to make a real effort to BE with their kids when they have so<br/>\n&gt; conveniently been without them for so long.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I think they do - yes. Sometimes they have to make an effort to observe them <br/>\ncarefully - and not to DIRECT them all the time, too.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think a discussion of the different aspects of learning vs teaching<br/>\n&gt; is very helpful .... up to a point. All people do both, I think, teach<br/>\n&gt; and learn in the natural scheme of life. Learning that there is a<br/>\n&gt; give-and-take in these things is very valuable.  <br/>\n<br/>\n </span></blockquote>Well - that&#39;s one point. The big point is that now that the  kids are out of <br/>\nschool, they don&#39;t need mom or dad to become their &quot;teacher&quot;  or to &quot;teach&quot; <br/>\nthem -- they don&#39;t need a teacher if they aren&#39;t &quot;doing school.&quot;  See - here <br/>\nI&#39;m using teacher and teach in the very common usage where teach means that a <br/>\nteacher decides what should be learned, when, how and tests whether it was <br/>\nlearned. Unschoolers reject that and it would be easier to keep that clear if <br/>\nwe used &quot;help kids learn&quot; instead of teach, I think.<br/>\n<br/>\nIfMaking &quot;teaching&quot; a<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; forbidden word is foolish in my eyes and misplaces the correct emphasis <br/>\n&gt; with a somewhat arbitrary stance. That is just too confusing for many<br/>\n&gt; people.  Time and effort is better spent in making clearly what you mean<br/>\n&gt; by unschooling with lots of examples, as people are asking for and<br/>\n&gt; giving now with &quot;what my homeschooling day is like&quot; and various<br/>\n&gt; suggestions.<br/>\n<br/>\n<br/>\n </span></blockquote>Some of the same people saying that &quot;you don&#39;t need to &quot;teach&quot;&quot; and &quot;you <br/>\ndon&#39;t need to become their &quot;teacher&quot;&quot; are also those of us who post <br/>\nb&#39;zillions of ideas and anecdotes about our unschooling lives. So - yeah - I <br/>\nagree with you and do it all the time.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Everyone finds there own way of doing it in the end, but<br/>\n&gt; <br/>\n&gt; the examples and support of others do help.<br/>\n<br/>\n<br/>\n </span></blockquote>I know someone who uses Calvert Curriculum. She is the teacher in that family <br/>\nand is spending her summer trying to figure out what she&#39;s going to teach her <br/>\nson in the fall. She&#39;s sweet and joyful and loves her kids and interacts <br/>\nreally nicely with them and pays close attention to their interests and does <br/>\nher best to support them. They all are happy and content with how things are <br/>\nworking. That doesn&#39;t make it unschooling. Why not? Well - because all the <br/>\n&quot;teaching&quot;  - including the planning, carrying out, and assessment -- is <br/>\nincompatible with unschooling, that&#39;s why. If someone comes here and wants to <br/>\nknow about unschooling and she says, &quot;Well, look at all the &#39;teaching plans&#39; <br/>\nand pick out which kind of teacher you prefer to be and buy the curriculum <br/>\nand teach it to your child,&quot; it would be really wrong of us not to step up <br/>\nand say, &quot;That isn&#39;t unschooling.&quot; If we want people to understand, they need <br/>\nto understand that traditional-style &quot;teaching&quot; in the widest meaning of the <br/>\nword is not necessary then it would be more clear if we didn&#39;t confuse the <br/>\nissue so  much..<br/>\n<br/>\n--pamS<br/>\nNational Home Education Network<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.NHEN.org\">http://www.NHEN.org</a><br/>\nChanging the Way the World Sees Homeschooling!<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":257127,"authorName":"Deb","from":"Deb &lt;herbtea@...&gt;","profile":"live_oak2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest Number 2195","postDate":"1028621126","msgId":39923,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNENEY4MzQ2LjExNDlEQURFQGd0ZS5uZXQ+","referencesHeader":"PDEwMjg2MDQzNTUuMTQzNC45Mzc3OC5tMTFAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":39924,"prevInTime":39922,"nextInTime":39924,"topicId":39923,"numMessagesInTopic":0,"msgSnippet":"From: PSoroosh@aol.com ... Pam, for your info, I have definitely seen this happen! One parent with two teenage boys borrowed some of my books on unschooling","messageBody":"<div id=\"ygrps-yiv-2076156415\">From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:PSoroosh@...\">PSoroosh@...</a><br/>\n<blockquote><span title=\"ireply\"> &gt; Ned - do you and Luz see this happening? Unschooling parents refusing to give<br/>\n&gt; their child help? I haven&#39;t seen that. The unschooling parents I have seen<br/>\n&gt; seem to all be incredibly resourceful, supportive, involved, observant,<br/>\n&gt; intuitive, responsive facilitators. It wouldn&#39;t occur to me to worry that a<br/>\n&gt; kid might want to learn to read and that an unschooling parent would not<br/>\n&gt; figure out how best to help them or get help for them. Is that really<br/>\n&gt; something you worry about?<br/>\n&gt; <br/>\n&gt; --pamS<br/>\n<br/>\n </span></blockquote>Pam, for your info, I have definitely seen this happen! One parent with<br/>\ntwo teenage boys borrowed some of my books on unschooling and thought<br/>\nthat was the perfect solution to her homeschooling problems: her boys<br/>\nwere not very enthusiastic about learning, and she had apparently<br/>\nenforced some things on them. Now introduced to unschooling, she decided<br/>\nshe would never force them to do anything they didn&#39;t want to and would<br/>\nlet them do what they wanted on their own instead, to be sure she didn&#39;t<br/>\ndo the wrong thing. She is a friendly loving lady. But three years<br/>\nlater, her 16 year old son still cannot read. He occasionally says he<br/>\nwants to and wants help but she can&#39;t give it to him and doesn&#39;t model<br/>\nwhat to do or look into it far enough to come up with the right help to<br/>\ngive him. So she rather complacently does nothing rather than &quot;violate&quot;<br/>\nhim. He is 6 feet tall, a nice boy but embarrassed to have anyone see<br/>\nhim trying to read, even his father.  HE made some slight progress with<br/>\nsome easy readers I gave her that I thought would interest him, and they<br/>\ndid, but she hasn&#39;t taken it further.<br/>\n<br/>\nAnother woman I know got the &quot;don&#39;t tell him what to do for<br/>\nhomeschooling&quot; bug and her 10 year old son heartily subscribes to this<br/>\nflaunting it to everyone around him. She did take him out of some school<br/>\nor other; she is busy working as a single mom, and just kowtows to him<br/>\nwhen he says &quot;I don&#39;t have to learn anything!&quot; No modeling, no other<br/>\nideas put forth for him, just yeah - that&#39;s the philosophy we are<br/>\nfollowing, she says.<br/>\nI invited them to go with a group of homeschoolers for whom I had<br/>\narranged a rather neat field trip to a nature park where the naturalist<br/>\nused to be an archeologist and he showed us artifacts he had made using<br/>\nmethods of the early Americans in our region. We got to use<br/>\nspear-throwers and carve holes in rock using sand and bamboo, chop wood<br/>\nwith shell axes and stuff like that. IT was really fun! But this boy was<br/>\nrude to everyone including the naturalist and selfish. The mom left him<br/>\noff another day with a different group activity of this naturalist, and<br/>\nhe was asked not to come back because he wouldn&#39;t stick with the group<br/>\nwhen they walked through the woods. Obviously, he needs time to chill<br/>\nout and decompress, but his mom was not giving that to him. SHe was<br/>\nstill trying to find other places for him to be and not exerting much<br/>\ninfluence for the positive with him because she didn&#39;t know how to. With<br/>\nher version of unschooling, she felt she didn&#39;t have to; she was<br/>\nfollowing her understanding of the philosophy and thought be being let<br/>\nbe somehow he would magically do well. <br/>\n<br/>\nA third story: a mom with two little boys about 3 and 4 1/2 and one 8<br/>\nyear old daughter. SHe quit her job and took her kids out of preschool<br/>\nand school to spend time with them. But again, her version of<br/>\nunschooling was  not restricting them in any way - letting them be free<br/>\nto do exactly what they want. She extolled the virtues of letting them<br/>\ntake off their clothes and jump in the mud, run, play. Sounds so free,<br/>\ndoesn&#39;t it? I&#39;ve done it! BUt these kids were running in circles, not<br/>\ncommunicating with anyone, not really aware of their environment. Like<br/>\nkids act when they are tired but still playing frantically. In fact when<br/>\nthey came along with me to a park, these kids could not listen to and<br/>\nspeak to anyone else there. THey were wild, and the mother ended up<br/>\nsending her daughter back to public school because she hated being home<br/>\nwith her brothers and couldn&#39;t get her mother&#39;s attention and help. I<br/>\nspoke with this lady today. She thought she was going to find other moms<br/>\nto exchange kid time with. Would you want to? I am going to write up<br/>\nsome very specific things for her to read and think and practice so her<br/>\ndaughter can come home again maybe.<br/>\n<br/>\n<br/>\nI provide an umbrella school service in Florida so parents can do what<br/>\nthey want to do with their kids and not have to register with the county<br/>\nor send in any tests to the government. I have parents at all phases of<br/>\ntransition in how they homeschool. Some of the worst are the ones who<br/>\nuse &quot;letting them learn on their own and do only what they want to&quot; as a<br/>\nsubstitute for really getting involved with their kids and understanding<br/>\nand helping them. <br/>\n<br/>\nI do find people can be very confused by the unschooling philosophy and<br/>\nthough something about it sounds right to them, they get hung up in not<br/>\ndoing anything so that they won&#39;t do the wrong thing! I try to help them<br/>\ntransition, cut out the workbooks, add lots of doing things out and<br/>\nabout in life, and reading together, and talking together. I try to help<br/>\nthem shorten their learning curve and lighten up on school-like things,<br/>\nand get to know and appreciate their kids.<br/>\n<br/>\nSo I find that less dogma of any sort is better. Better to just be<br/>\nexplicit and give lots of examples of what TO DO than what not to. And<br/>\nnew unschooling parents do have things TO DO - like talk and listen,<br/>\nfind out things themselves, model an interest in researching thing and<br/>\ngoing places, doing things and enjoying life. These are positives.<br/>\nLeaving their kids alone to do what they want does not encompass how to<br/>\nbe a parent - the moms usually need a new view of their roles. <br/>\n<br/>\nIt is actually too close to what many have done by leaving their kids<br/>\noff at a school. Don&#39;t interfere - learning will happen.... Nobody grows<br/>\nor changes if the kids are just left to be by themselves and don&#39;t have<br/>\na loving parent there to interact when needed. New homeschoolers often<br/>\nhave to make a real effort to BE with their kids when they have so<br/>\nconveniently been without them for so long.<br/>\n<br/>\n I think a discussion of the different aspects of learning vs teaching<br/>\nis very helpful .... up to a point. All people do both, I think, teach<br/>\nand learn in the natural scheme of life. Learning that there is a<br/>\ngive-and-take in these things is very valuable.  Making &quot;teaching&quot; a<br/>\nforbidden word is foolish in my eyes and misplaces the correct emphasis<br/>\nwith a somewhat arbitrary stance. That is just too confusing for many<br/>\npeople.  Time and effort is better spent in making clearly what you mean<br/>\nby unschooling with lots of examples, as people are asking for and<br/>\ngiving now with &quot;what my homeschooling day is like&quot; and various<br/>\nsuggestions. Everyone finds there own way of doing it in the end, but<br/>\nthe examples and support of others do help.<br/>\n<br/>\nAnother viewpoint for you to consider.<br/>\n<br/>\nDebbie <br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; Just like I think that MOST PEOPLE will hear you say &quot;Kids need phonics&quot; and<br/>\n&gt; think you mean &quot;Kids need to be taught to read using a formal comprehensive<br/>\n&gt; phonics program&quot; - I also think MOST PEOPLE hear the word &quot;teach&quot; or<br/>\n&gt; &quot;teacher&quot; and think of someone deciding what, when, where, and how kids are<br/>\n&gt; supposed to learn something and then testing and grading how well they do at<br/>\n&gt; it.<br/>\n&gt; <br/>\n&gt; Now - I&#39;m going to be pretty darn sure that long-time unschoolers don&#39;t mean<br/>\n&gt; either of those things. If I hear a long-time unschooler say, &quot;Yeah- I taught<br/>\n&gt; my daughter how to do long division,&quot; it doesn&#39;t bring up those connotations<br/>\n&gt; to me. In that case, knowing how unschooling workds, I&#39;m going to assume this<br/>\n&gt; came about because the kid wanted to do something and the parent offered the<br/>\n&gt; information and so on.<br/>\n&gt; <br/>\n&gt; BUT - here, on this list, with nearly a thousand people and MANY of those<br/>\n&gt; people who are just trying to figure out what all this unschooling stuff is<br/>\n&gt; all about - many of those people start out not even able to conceive of what<br/>\n&gt; unschooling is - it seems to me that people are going to be very confused and<br/>\n&gt; even misled if you say either that kids need phonics or that kids need to be<br/>\n&gt; taught. Again - I GET the point - I just think that in THIS context it is<br/>\n&gt; something that we have to stop and clear up every time it gets said because<br/>\n&gt; it is so easily and so likely misconstrued.<br/>\n&gt; <br/>\n&gt; It is okay - words can have multiple levels of meanings. &quot;I am my child&#39;s<br/>\n&gt; first and most important teacher.&quot;  &quot;I am my child&#39;s parent and I am NOT my<br/>\n&gt; child&#39;s teacher.&quot;<br/>\n&gt; <br/>\n&gt; I have said both of those and meant them and they didn&#39;t contradict each<br/>\n&gt; other IN the contexts in which I said them.<br/>\n&gt; <br/>\n&gt; So - in a context where there are lots of new-to-unschooling people -<br/>\n&gt; remembering that &quot;phonics&quot; and &quot;teach&quot; and &quot;teacher&quot; have connotations to<br/>\n&gt; them that we don&#39;t mean - it is more helpful to avoid those terms and just<br/>\n&gt; talk more descriptively about what we mean.<br/>\n&gt; <br/>\n&gt; --pamS<br/>\n&gt; <br/>\n&gt; </span></blockquote></div>","specialLinks":[]}],"prevTopicId":39974,"nextTopicId":25800}}