{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","senderId":"YfuyA2n4D__t6svZCSihyrh0uOe7w9skJqo1UZEoBnF4v44f2y3p_lTLAGh2CX80o4ULggVxqi3O","spamInfo":{"isSpam":false,"reason":"0"},"subject":"diet and misunderstanding","postDate":"1005759642","msgId":27710,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExYi43NWNlYmZmLjI5MjQwNjlhQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":27709,"nextInTime":27711,"topicId":27710,"numMessagesInTopic":0,"msgSnippet":" When kids are allowed free choice, they don t go by taste buds. It s","messageBody":"<div id=\"ygrps-yiv-122708467\">&lt;&lt;  Should she simply follow her taste buds,<br/>\nshe could still get into trouble..... &gt;&gt;<br/>\n<br/>\n<br/>\nWhen kids are allowed free choice, they don&#39;t go by taste buds.<br/>\n<br/>\nIt&#39;s seeming impossible for some people to begin to grasp what we&#39;re talking <br/>\nabout.  Kids who have free choice eat protein, vegetables, fruit.  Not ONLY <br/>\nthose, but they eat all kinds of food, by choice.  And when it has been <br/>\nchoice (because they become hungry for all kinds of foods--the body balances <br/>\nitself), they have no aversions to any foods they&#39;ve been forced to eat.<br/>\n<br/>\nThe same way my kids will play with dictionaries or maps for fun, because <br/>\nthose things have not been identified as &quot;educational&quot; or &quot;school stuff,&quot; <br/>\nthey will eat the kinds of foods that some families have to force.  Holly <br/>\nprefers broccoli and spinach over all other vegetables, and will request them <br/>\nfor lunch in a house full of all kinds of foods, or from the store.<br/>\n<br/>\nMy kids reject American cheese and want Colby or Cheddar.  They think <br/>\nAmerican cheese is yucky.  I do too, but I didn&#39;t tell them so.  I offered <br/>\nthem both and they rejected the &quot;cheese food.&quot;  <br/>\n<br/>\nThey reject processed meats.  They think pork rinds are poison.  The only <br/>\nwant real meat they&#39;ve seen clean, and rarely even that--they don&#39;t at all <br/>\nprize or crave meat, as my husband does who had to eat lima beans and other <br/>\ntacky vegetables to get his very small portion of meat for years and <br/>\nyears--to this day he will eat NOTHING with peas in it because his mother <br/>\nlaughed at him and said he did TOO like peas, and he was TOO going to eat <br/>\nthem.  I can picture it clearly, because she once told me &quot;yes you are&quot; when <br/>\nI told her I wasn&#39;t going to eat tongue for lunch at her house.  &quot;Yes you <br/>\nare.&quot;  Guess whether I did.<br/>\n<br/>\nSo those who think the children of those families in which there is freedom <br/>\nto eat food are all eating ice cream and donuts are wrong and hugely wrong.   <br/>\nI wouldn&#39;t have believed it before I saw it, but I&#39;m totally glad I&#39;ve seen <br/>\nit.<br/>\n<br/>\nLast night Kirby took two of his older (college age) friends out to eat, <br/>\nbecause they&#39;ve treated him several times.  So he took $30 of his own money, <br/>\nand they went to IHOP.  It&#39;s not a health food restaurant, but neither is it <br/>\nburgers or pizza or an ice cream shop.  I doubt that he ordered anything <br/>\njunky; I doubt that he ordered dessert.  He probably had milk, or maybe soda. <br/>\n If it had been breakfast he would have ordered juice, even in the total <br/>\nabsence of parental witness.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":27706,"nextTopicId":27702}}