{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":50009731,"authorName":"Heidi Wordhouse-Dykema","from":"Heidi Wordhouse-Dykema &lt;heidi@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest Number 3127","postDate":"1047523273","msgId":60964,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMS4wLjE0LjAuMjAwMzAzMTIxODI1MTIuMDFiYmNjOTBAbWFpbC5keWtlbWEubmV0Pg==","inReplyToHeader":"PDkyNTYtM0U2Rjg4MDAtNDM3QHN0b3JlZnVsbC0yMzc4LnB1YmxpYy5sYXdzb24ud2VidHYubmV0Pg==","referencesHeader":"PFVuc2Nob29saW5nLWRvdGNvbUB5YWhvb2dyb3Vwcy5jb20ncyBtZXNzYWdlIG9mIDExIE1hciAyMDAzIDIxOjI1OjQzIC0wMDAwPg=="},"prevInTopic":60904,"nextInTopic":0,"prevInTime":60963,"nextInTime":60965,"topicId":60904,"numMessagesInTopic":0,"msgSnippet":"I ve been thinking about your post for a few hours now and some of the things your 15yo son does are similar (if in smaller episodes) to what my 13yo does,","messageBody":"<div id=\"ygrps-yiv-1960229523\">I&#39;ve been thinking about your post for a few hours now and some of the <br/>\nthings your 15yo son does are similar (if in smaller episodes) to what my <br/>\n13yo does, sometimes.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;He is beginning to get in trouble<br/>\n&gt;outside of our home when he is with one friend. They are in the age of<br/>\n&gt;hormones/testosterone. He wants to fight with people lately.<br/>\n<br/>\n </span></blockquote>Perhaps he would be interested in taking an Aikido class?  He&#39;ll have a <br/>\nchance to work in a safe environment, throwing people around the room and <br/>\notherwise &#39;attacking&#39; them, but he&#39;ll also be learning how to defend <br/>\nhimself from harm *and* if it&#39;s a good dojo/sensei learn about assertive, <br/>\nnon-violent behavior.  I&#39;m recommending Aikido because I&#39;m mostly <br/>\nacquainted with it as a martial art, because your son seems to be dealing <br/>\nwith some frustration in his life and is starting to release that stress in <br/>\nphysical ways, and Aikido is both physical, non-violent and almost <br/>\nimpossible to start a fight with.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;He just<br/>\n&gt;quit counseling after over 4 years with the same therapist. A nice man.<br/>\n&gt;My son said he couldn&#39;t tell him some things because he was afraid/trust<br/>\n&gt;issues.<br/>\n<br/>\n </span></blockquote>Well, he doesn&#39;t sound like a very good therapist, no matter how &#39;nice&#39; he <br/>\nis/was.  Or maybe he wasn&#39;t a good fit for your son.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;My son wants to get his permit to drive. I feel I need to put a<br/>\n&gt;warning on the car if he does. He tried to read the drivers manual and<br/>\n&gt;threw it down. He couldn&#39;t read it very quickly. There are too many<br/>\n&gt;words and the print is very small. I told him I would go over it with<br/>\n&gt;him.<br/>\n<br/>\n </span></blockquote>Sit down and nonchalantly start to read it to yourself.  Then start to read <br/>\nit out loud, as if to yourself.  As he&#39;s being physical, maybe he could <br/>\nhave something to play with with his hands, while he&#39;s listening.  (or if <br/>\nhe&#39;s open to your just reading it to him, do that!)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;He has a short attention span lately. He says he is &quot;retarded&quot; and<br/>\n&gt;there is no use.<br/>\n<br/>\n </span></blockquote>Ouch.  That&#39;s gotta hurt.  I have no ideas for this one.  Of course he&#39;s <br/>\nnot or it&#39;d be really obvious.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;He said he had to ask his friend what time it was the<br/>\n&gt;other day because he couldn&#39;t tell. This is something new.<br/>\n<br/>\n </span></blockquote>Give him a digital watch, preferably one that does other things too, like a <br/>\ncompass or that has a laser or something.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  He does very<br/>\n&gt;little work for me - if any.<br/>\n<br/>\n </span></blockquote>Neither do I, but I suppose that&#39;s okay. (smile)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;He reads yet not very often. He draws<br/>\n&gt;pictures.<br/>\n<br/>\n </span></blockquote>Then help him draw pictures!!!  Is this one of his passions?  Get him <br/>\npencils, sketchbooks, charcoal... take him to new places with interesting <br/>\nthings to draw.  Try to draw yourself.  Offer to bind his artwork together <br/>\ninto a book.  Find an artist/cartoonist/whatever he could visit/be mentored <br/>\nby.  Check out all the drawing books from the library you can find, sit at <br/>\na table in the middle of the house, and try to teach yourself to <br/>\ndraw.  He&#39;s bound to make off with a few of them.  Go to the museum and <br/>\nsay, &quot;Shoot, you can draw better than that!  Maybe you should be a world <br/>\nfamous artist so you can support me in the style to which I&#39;d like to be <br/>\naccustomed!&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;My greatest fear is him starting a life of crime. He won&#39;t<br/>\n&gt;back down even to the police.<br/>\n<br/>\n </span></blockquote>Does he commonly have difficulty expressing his anger and &#39;negative&#39; <br/>\nfeelings?  Aikido again.  I heard something the other day, where a world <br/>\nchampion prize fighter was on the subway with a friend.  A drunk guy gets <br/>\non and shoves into the prize fighter as he passes by.  The friend say, <br/>\n&quot;Man, why didn&#39;t you deck the guy?  You&#39;re strong enough to take him!&quot;  The <br/>\nprize fighter say, &quot;I don&#39;t have to.  I&#39;m powerful enough, I can afford to <br/>\nbe polite.&quot;<br/>\n<br/>\nMaybe your son is finding it difficult to &#39;find his power&#39;, and fighting is <br/>\nan easy way to find something.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  We were just able to<br/>\n&gt;purchase a second vehicle so I am hoping I can get my son interested in<br/>\n&gt;going other places.<br/>\n<br/>\n </span></blockquote>Go with him.  So something he wants to do.  Just *be* there.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;A few of my other kids are starting a<br/>\n&gt;business/crafts. My son seemed semi-interested. He does like art. I went<br/>\n&gt;out and purchased some art materials for my son and his friend.<br/>\n<br/>\n </span></blockquote>there you go.  ...and you don&#39;t have to spend a lot of money either, if <br/>\nmoney is an issue.  charcoal (briquettes) on sidewalks are kind of cool (or <br/>\neven charcoal from your last fireplace-fire.  Plaster of paris dried into <br/>\nchunks makes a great white chalk  (as does drywall)  String and some nails <br/>\nin spare bits of board can be cool.  Duct tape rocks!<br/>\n<br/>\nconcentrate on the art (and aikido) and let the rest go.<br/>\nHeidiWD</div>","specialLinks":[]},{"userId":12116257,"authorName":"michele-nappi@webtv.net","from":"michele-nappi@...","profile":"whitelight_2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest Number 3127","postDate":"1047496704","msgId":60904,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkyNTYtM0U2Rjg4MDAtNDM3QHN0b3JlZnVsbC0yMzc4LnB1YmxpYy5sYXdzb24ud2VidHYubmV0Pg==","inReplyToHeader":"VW5zY2hvb2xpbmctZG90Y29tQHlhaG9vZ3JvdXBzLmNvbSdzIG1lc3NhZ2Ugb2YgMTEgTWFyIDIwMDMJMjE6MjU6NDMgLTAwMDA="},"prevInTopic":0,"nextInTopic":60964,"prevInTime":60903,"nextInTime":60905,"topicId":60904,"numMessagesInTopic":0,"msgSnippet":"I am having trouble with my 15 year old. I began unschooling just this year. He never liked school and was traumatized there. He is dyslexic and considered","messageBody":"<div id=\"ygrps-yiv-72928398\">I am having trouble with my 15 year old. I began unschooling just this<br/>\nyear. He never liked school and was traumatized there. He is dyslexic<br/>\nand considered bipolar. No medication. He is beginning to get in trouble<br/>\noutside of our home when he is with one friend. They are in the age of<br/>\nhormones/testosterone. He wants to fight with people lately. He just<br/>\nquit counseling after over 4 years with the same therapist. A nice man.<br/>\nMy son said he couldn&#39;t tell him some things because he was afraid/trust<br/>\nissues. My son wants to get his permit to drive. I feel I need to put a<br/>\nwarning on the car if he does. He tried to read the drivers manual and<br/>\nthrew it down. He couldn&#39;t read it very quickly. There are too many<br/>\nwords and the print is very small. I told him I would go over it with<br/>\nhim. He has a short attention span lately. He says he is &quot;retarded&quot; and<br/>\nthere is no use. He said he had to ask his friend what time it was the<br/>\nother day because he couldn&#39;t tell. This is something new. He does very<br/>\nlittle work for me - if any. He reads yet not very often. He draws<br/>\npictures. My greatest fear is him starting a life of crime. He won&#39;t<br/>\nback down even to the police. One police officer threatened him over the<br/>\nweekend -swore at him about his &quot;attitude&quot; etc. I called the police<br/>\nchief. What it sounds like is that officer was off duty visiting a<br/>\nrelative when he saw my son. My son looked at him because he had a<br/>\npolice vehicle that was different than the ones in our town. What is<br/>\nscary is that if this officer was acting like he was on duty when he<br/>\nwasn&#39;t. The police chief from this officers town told me that towns<br/>\nofficers don&#39;t go into our town to help out. The police chief from that<br/>\ntown wouldn&#39;t write down anything I was saying. He said talking was good<br/>\nenough and that he wouldtalk to this officer to get his side of the<br/>\nstory. The family this officer was visiting had the same last name and<br/>\nthey have a reputaton in our town as being unhappy and very grouchy.We<br/>\nlive in a small town. I love my son unconditionally and with an open<br/>\nmind. He knows he is loved and has family support. We were just able to<br/>\npurchase a second vehicle so I am hoping I can get my son interested in<br/>\ngoing other places. I know I will need to come up with some money:) to<br/>\nkeep him occupied. A few of my other kids are starting a<br/>\nbusiness/crafts. My son seemed semi-interested. He does like art. I went<br/>\nout and purchased some art materials for my son and his friend. I want<br/>\nto keep them occupied the bes I can:) Thanks for listening. Michele <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":60956,"nextTopicId":60966}}