{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":55,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Food issues,unschooling","postDate":"1128254422","msgId":108690,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyZi42NmQ2MWVlNi4zMDcxMjVkNkBhb2wuY29tPg=="},"prevInTopic":108689,"nextInTopic":108695,"prevInTime":108689,"nextInTime":108691,"topicId":108630,"numMessagesInTopic":0,"msgSnippet":"Just in case anyone here didn t know, there are collections of comments from some earlier food discussions here: http://sandradodd.com/eating/longterm ","messageBody":"<div id=\"ygrps-yiv-3787301\">Just in case anyone here didn&#39;t know, there are collections of comments from <br/>\nsome earlier food discussions here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/eating/longterm\">http://sandradodd.com/eating/longterm</a>    <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/food\">http://sandradodd.com/food</a><br/>\n<br/>\nThe first is about longterm problems of controlling food, and the second is <br/>\nthe main portal to the food topics on my site.<br/>\n<br/>\nJoyce has some food topics on her page, middle of righthand side:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://home.earthlink.net/%7Efetteroll/rejoycing/\">http://home.earthlink.net/%7Efetteroll/rejoycing/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://home.earthlink.net/%7Efetteroll/rejoycing/influencing%20kid%20behavior/food/food.html\">http://home.earthlink.net/%7Efetteroll/rejoycing/influencing%20kid%20behavior/food/food.html</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":77070457,"authorName":"Sanguinegirl83@aol.com","from":"Sanguinegirl83@...","profile":"sanguinegirl83","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Food issues,unschooling","postDate":"1128242147","msgId":108689,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlZC40NTU2YzgwYi4zMDcwZjVlM0Bhb2wuY29tPg=="},"prevInTopic":108685,"nextInTopic":108690,"prevInTime":108688,"nextInTime":108690,"topicId":108630,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/1/2005 5:26:45 PM Eastern Daylight Time, ... My parents were the same way-my dad even had a motto :, You must eat the nutritious to get","messageBody":"<div id=\"ygrps-yiv-1012925830\">In a message dated 10/1/2005 5:26:45 PM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kjennings95@...\">kjennings95@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My mom was a &quot;clean your plate, there are starving children in China&quot; kind <br/>\n&gt; of mom.  I got slapped for suggesting that we send the food to the starving <br/>\n&gt; children down the street, insubordination.  She has changed her views 180 <br/>\n&gt; degrees since then, but I still carry the guilt whenever I throw food away.  (I <br/>\n&gt; picture it stuck to my butt as more lumpy cellulite, that helps! &lt;g&gt;)  <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>My parents were the same way-my dad even had a &quot;motto&quot;:, &quot;You must eat the <br/>\nnutritious to get the delicious&quot;! Which is wrong on so many levels... Our <br/>\nstarving children were in Africa, and I, too, still feel the guilt when throwing <br/>\nfood away-ESPECIALLY if it is in a restaurant, where I&#39;ve paid more for it. I <br/>\nlike your idea of picturing it as cellulite! I get a refresher on my will power <br/>\nevery Sunday when we go to my parents and my mother not only tries to do the <br/>\nsame to my oldest (6), but will completely disgust me with her need to clean <br/>\nevery crumb off of all of our plates (but my dad and my husband... hmmm... that&#39;s <br/>\nodd...) when we&#39;re done-even to the point of wiping the sauce up with her <br/>\nfinger and sucking it off... Ugh. I suggest the kiddo leave the room-that way he <br/>\ndoesn&#39;t have to watch it. I leave, too.<br/>\n<br/>\nI am morbidly obese, too (clinically), and though not as &quot;fit&quot; or active as <br/>\nyou, have found that I have let society and my mother convince me that I am <br/>\nweak and unhealthier than I am. I have been surprised by my level of fitness, <br/>\nstrength and endurance a few times since I&#39;ve gotten so heavy. The mention of the <br/>\ntrampoline in front of the t.v., your story and the rest of the talk here has <br/>\ninspired me-hope I can keep it going! Thanks!<br/>\n<br/>\nPeace,<br/>\nSang<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Food issues,unschooling","postDate":"1128223993","msgId":108685,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyNy42NWQ1ZGY1Yi4zMDcwYWVmOUBhb2wuY29tPg=="},"prevInTopic":108683,"nextInTopic":108689,"prevInTime":108684,"nextInTime":108686,"topicId":108630,"numMessagesInTopic":0,"msgSnippet":"... This is a shot in the dark, but I have a nagging thought that maybe (just maybe) the *hope* that adults need more food (to justify eating more as a reward ","messageBody":"<div id=\"ygrps-yiv-89056208\"><blockquote><span title=\"ireply\">&gt; -=- Because surely a 9 year old doesn&#39;t need a many calories as an<br/>\n&gt; &gt; adult?   -=-<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>This is a shot in the dark, but I have a nagging thought that maybe (just <br/>\nmaybe) the *hope* that adults need more food (to justify eating more as a reward <br/>\nfor being grown) might be one of the problems.   I have ALWAYS (always, since <br/>\nI was a kid taking health classes and hearing about the now-abandoned four <br/>\nfood groups) that kids needed more calories than sedentary adults, that physical <br/>\nlaborers needed more calories than deskworkers, that active adults needed more <br/>\nthan older folks who mostly sat, etc.    And that nobody could pack it in and <br/>\nwalk away skinny like teenaged boys. &lt;g&gt;<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":100122184,"authorName":"Lisa M. Cottrell Bentley","from":"&quot;Lisa M. Cottrell Bentley&quot; &lt;cottrellbentley@...&gt;","profile":"cottrellbentley","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Food issues,unschooling","postDate":"1128218216","msgId":108683,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzM0YzRTY4LjEwNjAwMDlAY294Lm5ldD4=","inReplyToHeader":"PGRoamoxcitqZHRuQGVHcm91cHMuY29tPg==","referencesHeader":"PGRoamoxcitqZHRuQGVHcm91cHMuY29tPg=="},"prevInTopic":108682,"nextInTopic":108685,"prevInTime":108682,"nextInTime":108684,"topicId":108630,"numMessagesInTopic":0,"msgSnippet":"... Apologize for the previous food controlling.  Decide to make life changes yourself, tell your family, ask for their support of you, then change.  Sounds","messageBody":"<div id=\"ygrps-yiv-2094427111\"><blockquote><span title=\"ireply\">&gt; I don&#39;t have any help to offer but just want to let you know that I have a similar concern <br/>\n&gt; about my ds, 15.  He&#39;s been heavy since he was seven or eight.  I used to control food but <br/>\n&gt; quit about two years ago.<br/>\n </span></blockquote>...<br/>\n<blockquote><span title=\"ireply\"> &gt; His father and I are both overweight too.<br/>\n </span></blockquote>...<br/>\n<blockquote><span title=\"ireply\"> &gt; Ideas on what to do??<br/>\n<br/>\n </span></blockquote>Apologize for the previous food controlling.  Decide to make life <br/>\nchanges yourself, tell your family, ask for their support of you, then <br/>\nchange.  Sounds simple (and it is) however it is about the most <br/>\ndifficult thing in the world to do, too.  As with other issues in life, <br/>\nit really helps to find like minded people to help, too.<br/>\n<br/>\n-Lisa in AZ</div>","specialLinks":[]},{"userId":100122184,"authorName":"Lisa M. Cottrell Bentley","from":"&quot;Lisa M. Cottrell Bentley&quot; &lt;cottrellbentley@...&gt;","profile":"cottrellbentley","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Food issues,unschooling","postDate":"1128217632","msgId":108682,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzM0YzQzIwLjIwMjA0MDlAY294Lm5ldD4=","inReplyToHeader":"PGRobHB1Nyt2YXYzQGVHcm91cHMuY29tPg==","referencesHeader":"PGRobHB1Nyt2YXYzQGVHcm91cHMuY29tPg=="},"prevInTopic":108680,"nextInTopic":108683,"prevInTime":108681,"nextInTime":108683,"topicId":108630,"numMessagesInTopic":0,"msgSnippet":"... My 9 year old daughter currently weighs 63 pounds.  I convert that to 4.5 stone (I could be wrong on my conversion, thus I give the known accurate, too).","messageBody":"<div id=\"ygrps-yiv-579509532\"><blockquote><span title=\"ireply\">&gt; Because surely a 9 year old doesn&#39;t need a many calories as an <br/>\n&gt; adult? Would I give a 3 year old an adult portion? I dunno, I&#39;m lost.<br/>\n<br/>\n </span></blockquote>My 9 year old daughter currently weighs 63 pounds.  I convert that to <br/>\n4.5 stone (I could be wrong on my conversion, thus I give the known <br/>\naccurate, too).  Her whole life she has been able to eat whatever she <br/>\nwants whenever she wants without artificial quantity or time constraints <br/>\n(a la Unschooling).  I am a grown woman that weighs more than double her <br/>\nweight and I eat the same quantity or less than her every single day (I <br/>\ndon&#39;t know precisely since I&#39;ve never measured out her food).  Why does <br/>\nshe eat &quot;so much&quot;?  Partially genetics and partially the fact that she <br/>\nis a growing girl.  Her brain and body need a lot of calories to help <br/>\nher grow and be strong.  I expect Zoë to gain a lot of weight and height <br/>\nover the next couple of years.  I became my full adult size around 12. <br/>\nShe is going to need to eat a lot if she wants to grow that much in only <br/>\n3 years.  I don&#39;t think that she even is aware of the fact that she eats <br/>\nabout the same amount as me, because I&#39;ve never brought it to her <br/>\nattention in a positive or negative way.  It is just food, not a <br/>\ncontest.  We usually all start out with less than we are going to want <br/>\nof a meal and get ourselves refills until we&#39;ve had enough.  I do start <br/>\nmy 5 year old out with a lot less, but when I see her having hungry <br/>\ndays, I offer her more food (or she just gets it herself :) ).  Neither <br/>\nof my children have ever snuck food, as every food that we have is <br/>\nalways available to them at any time of the day.<br/>\n<br/>\nHave you considered going to some sort of Weight Watchers program with <br/>\nher?  As a homeschooler it would be easy for her to tag along with you <br/>\nto meetings and sit by you-- offer her a book or something to do during <br/>\nthe meeting times, don&#39;t require her to listen (or weigh in!).  I have <br/>\nhad weight issues in the past and reading a lot about nutrition and <br/>\nhaving help with discovering what proper portion sizes look like helps a <br/>\nlot.  Personally, I would make this about *you* and tell her that you <br/>\nneed her help (for all the reasons that you wrote this list -- be very <br/>\nhonest and open with your daughter, but not in a scary way, just a <br/>\nproactive way).  She isn&#39;t necessarily in immediate danger, as she is a <br/>\ngrowing girl and could do some major stretching over the next couple of <br/>\nyears.  She would be a super model at her current weight if she were as <br/>\ntall as you predict that she is going to be.<br/>\n<br/>\nAs I learned more about nutrition, I brought that information into my <br/>\nfamily&#39;s diet (I cooked their meals!) and I talked about all the <br/>\ninteresting information that I was finding out.  I was shocked at some <br/>\nof the lies that I had previously believed and I shared this information <br/>\nwith my husband and children.  I discovered that I had food allergies <br/>\nand I found out how good that I could feel once I permanently took those <br/>\nallergens out of my life.  Then, after all of this talking and <br/>\ndiscussing your newfound interest, let the rest of your family make <br/>\ntheir final decisions on their own regarding their diet.  Ultimately, <br/>\ntheir bodies are their bodies.  My family&#39;s diet (including some <br/>\nextended family) has changed dramatically for the better since I went on <br/>\na personal quest to get healthy.  I have never pressured them into <br/>\nchanging their diets.  Example really works, lecturing seldom does. <br/>\nLive the life that you wish that your family was living.  Buy the foods <br/>\nthat are good for _you_.  Keep stocked up in overflowing quantities <br/>\n(this is really important as it is easier to eat healthy foods if they <br/>\nare actually available and ready to eat).  My 9 year old daughter, Zoë, <br/>\nis a bigger advocate of healthy eating than I am!<br/>\n<br/>\nThis is a tough issue and definitely an important unschooling one.  Food <br/>\n  is necessary every day and can affects every aspect of how a person&#39;s <br/>\nquality of life is.<br/>\n<br/>\n-Lisa in AZ<br/>\n<br/>\nP.S.  You might be interested in what &quot;The China Study&quot; by T. Colin <br/>\nCampbell has to say about various diseases.  They aren&#39;t caused by the <br/>\nquantity of foods that we eat, but rather what the foods are. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.thechinastudy.com\">http://www.thechinastudy.com</a>  or http:/www.drmcdougall.com</div>","specialLinks":[]},{"userId":197421595,"authorName":"Katy Jennings","from":"&quot;Katy Jennings&quot; &lt;kjennings95@...&gt;","profile":"coyotegoddess95","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Food issues,unschooling","postDate":"1128201923","msgId":108678,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTEwNy1EQVYyMENCREQ1RUZCNzI3Mjk5NDdEQUU3QkU4RTBAcGh4LmdibD4=","referencesHeader":"PDFhYy40MGIxMjBjOC4zMDZmZjgwYUBhb2wuY29tPg=="},"prevInTopic":108673,"nextInTopic":108680,"prevInTime":108677,"nextInTime":108679,"topicId":108630,"numMessagesInTopic":0,"msgSnippet":"My 9 almost 10 year old boy eats WAY more than I do.  During his growth spurts I LOVE all you can eat restaurants for him.  He eats 4-5 full meals a day, along","messageBody":"<div id=\"ygrps-yiv-242085553\">My 9 almost 10 year old boy eats WAY more than I do.  During his growth spurts I LOVE all you can eat restaurants for him.  He eats 4-5 full meals a day, along with snacks when he is in his growing period.  He usually does that for about 3 months at a time, he puts on a little around the waist, then he shoots up, and slows down a little on the eating.  Then it starts all over again.  Even during his slow period he eats more than I do though, and he always eats 2 dinners, one early and one fairly late.  I guess that is what you consider supper and dinner?  Kids, especially as they near puberty, need more calories.  And girls who carry a little more weight often loose it after they start their periods, at least I did, and my niece has.  We were both a little chunky, then at around 13-14, when the periods started getting more regular the weight dropped off.   Speaking of my niece, she is 14 and in public school.  She comes to my house after school most days.  You should see how much she eats when she gets here, then has a full dinner.  They need the nourishment.<br/>\n<br/>\nAnd just as an aside, since you mentioned your daughter&#39;s shoe size, my son (remember he is 9) wears a US size 5 mens.  That is a US size 7 womens, which is what I wear.  It is a pretty average size for women, most women are between 7 and 9.  He is a tall, muscular kid, with big feet (like a great dane puppy &lt;g&gt;)  If your daughter is tall with wide shoulders and is muscular, she probably needs more nourishment than a small dainty 9 year old.  A muscular person burns more calories doing every day things than a person without a lot of muscle.  So they need to take in more calories.  <br/>\n<br/>\nI am what I consider a bit overweight, have been since having my son.  According to the medical standards, I am &quot;morbidly obese.&quot;  But you know what?  I can hike 20 miles in our desert mountains.  I do a cardio kick-boxing type workout 2-3 times a week.  I am pretty strong, whenever someone needs something heavy moved they usually come to me.  And my cholesterol is 115 and my blood pressure is low.  But I am fat.  Fat doesn&#39;t always equal unhealthy.  Things like cholesterol level and especially stress are much more important in terms of general health.  <br/>\n<br/>\nI have some food issues myself, so I know a little of what you are feeling, but those issues are mine.  I will not make them my son&#39;s.  My mom was a &quot;clean your plate, there are starving children in China&quot; kind of mom.  I got slapped for suggesting that we send the food to the starving children down the street, insubordination.  She has changed her views 180 degrees since then, but I still carry the guilt whenever I throw food away.  (I picture it stuck to my butt as more lumpy cellulite, that helps! &lt;g&gt;)  <br/>\n<br/>\nShowing your daughter that you love her no matter what, that food is not an issue, would be helpful.  What I have learned from the people on this list is that the relationship with your kids is the most important thing.  So stop worrying about food and her weight and start working on building a good, strong, loving relationship with your daughter.  Focus on what SHE wants and needs, and the rest will follow.<br/>\n<br/>\nBest wishes,<br/>\nKaty J.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Food issues,unschooling","postDate":"1128193818","msgId":108673,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg3MjdBRkE4LTYwMEYtNDQ3Ni1CNzNELTQxMTJFQkQ4NUU1OUBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGRobHB1Nyt2YXYzQGVHcm91cHMuY29tPg==","referencesHeader":"PGRobHB1Nyt2YXYzQGVHcm91cHMuY29tPg=="},"prevInTopic":108671,"nextInTopic":108678,"prevInTime":108672,"nextInTime":108674,"topicId":108630,"numMessagesInTopic":0,"msgSnippet":"... Could very well be she s gearing up. Kathryn was about the same height and weight (if my math is right and a stone is 14 pounds that s about 120 pounds) at","messageBody":"<div id=\"ygrps-yiv-523720723\">On Oct 1, 2005, at 6:55 AM, elainegh8 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m just not sure. She&#39;s 9 and weighs 9 and a half stone. Her height<br/>\n&gt; is 4 feet 10 and half inches. She is probably going to be about 5ft<br/>\n&gt; 9 and a half inches.<br/>\n<br/>\n </span></blockquote>Could very well be she&#39;s gearing up.<br/>\n<br/>\nKathryn was about the same height and weight (if my math is right and  <br/>\na stone is 14 pounds that&#39;s about 120 pounds) at 12. Now she&#39;s 5&#39; 4&quot;  <br/>\nand about 100 lbs. I can&#39;t totally use her as an example since she  <br/>\nwent for a regular check up and the nurse pointed out where she was  <br/>\non the height/weight chart and Kathryn wasn&#39;t pleased. So *she*  <br/>\ndecided to start moving. She also has a dad who&#39;s great at focusing  <br/>\non the positive and setting reasonable goals. So now she&#39;s an  <br/>\nenthusiastic runner.<br/>\n<br/>\nThe reason I even mention it -- since I can&#39;t package up the internal  <br/>\nmotivation and the running partner for others ;-) -- is that  <br/>\nKathryn&#39;s interest in sports may not be entirely related to weight  <br/>\nsince I&#39;ve noticed that the 11-13 age is a common age for formerly  <br/>\nuninterested kids to become interested in sports. Kathryn joined the  <br/>\ntown softball team and we were silently concerned that all the girls  <br/>\nwould be a lot better than she and it would be discouraging for her  <br/>\nbut half the team had never played before. And my husband volunteered  <br/>\nto coach the middle school cross country team (11-13 year olds) and  <br/>\nmost of the kids had never run before.<br/>\n<br/>\nA friend of mine&#39;s son was round also and is also now tall and thin.  <br/>\nThe interesting thing is that his formerly skinny  younger brother is  <br/>\nnow round and looks exactly like his brother did a couple of years ago.<br/>\n<br/>\nIf your *daughter* wants to eat less, then drinking water and many  <br/>\nsmall portions (as others suggested) rather than one large portion  <br/>\ncan be helpful. But if it&#39;s you that&#39;s trying to find ways to control  <br/>\nher eating, her motivation is going to be towards figuring out how to  <br/>\nget around your controls so she can get the food she wants.<br/>\n<br/>\nDoes she eat a lot of carbohydrates? She may want to switch them for  <br/>\nproteins and vegetables and whole grains. And thought is changing on  <br/>\nlow fat diets because fat helps us feel full and low fat diets can  <br/>\noften leave us feeling hungry all the time.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154681619,"authorName":"michele oquinn","from":"michele oquinn &lt;mmoquinn@...&gt;","profile":"mmoquinn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Food issues,unschooling","postDate":"1128190413","msgId":108680,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUxMDAxMTgxMzMzLjY2NDYxLnFtYWlsQHdlYjQwNTAxLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGRobHB1Nyt2YXYzQGVHcm91cHMuY29tPg=="},"prevInTopic":108678,"nextInTopic":108682,"prevInTime":108679,"nextInTime":108681,"topicId":108630,"numMessagesInTopic":0,"msgSnippet":"I struggle with weight issues and more! I can totally relate to your post. I feel I am already to blame for her weight by giving her too big portions already. ","messageBody":"<div id=\"ygrps-yiv-905687549\">I struggle with weight issues and more!<br/>\nI can totally relate to your post.<br/>\n<br/>\nI feel I am already to blame for her weight by giving<br/>\nher too big portions already.<br/>\n<br/>\n+++ I also feel responsible. We eat out too much. I<br/>\nWANT to grocery shop, fix meals at home, and be able<br/>\nto KNOW I&#39;m offering the best for my child/self, but<br/>\nit never seems to end up that way.  It&#39;s like feast or<br/>\nfamine in my house.  Once I do shop, we all tend to<br/>\nover eat because it&#39;s so great to have stuff at home. <br/>\nMaybe I need to &quot;schedule&quot; weekly shopping trips so<br/>\nI&#39;m not so overwhelmed by the process?<br/>\n<br/>\n<br/>\nI also think it&#39;s repulsive, on me especially my<br/>\nself loathing knows no bounds, but it does affect my<br/>\nfeelings wh my daughter. I am embaressed to have a fat<br/>\nchild. What an awful admission.<br/>\n<br/>\n+++ I know I don&#39;t like being overweight as I no<br/>\nlonger enjoy things I used too.  Things like running<br/>\nand hiking are physically exhausting to me.  I do<br/>\nsense my son is very unhappy about his weight for the<br/>\nway he looks.  He&#39;s always sucking in his gut and<br/>\ntelling me &quot;I just would like to look like this all<br/>\nthe time&quot; <br/>\nKnow what&#39;s strange?  I see myself in the mirror and<br/>\nseem only a bit larger than my thin self...but then<br/>\nsee photos of myself and cry...I am huge.<br/>\n<br/>\n<br/>\nI worry constantly about how people see me, this was<br/>\nhanded down from my mother who only really cares <br/>\nabout what things look like not how they really are.<br/>\n<br/>\n+++ I do, too!   I&#39;m 5&#39;9&quot;, 260lbs.  My son is 11yo,<br/>\n4&#39;9&quot;, 120lbs.  The world looks at us as though we have<br/>\nnothing to offer.  LAZY is the word I hear in my mind.<br/>\n I feel lazy for not shopping, feeding us well,<br/>\nexercising as I should.  As a kid I was teased for<br/>\nbeing thin.  How ironic!!<br/>\nMy parents are especially critical of my son and me. <br/>\nMy athletic daughter is &quot;normal&quot; weight, therefore,<br/>\nacceptable.<br/>\n<br/>\nI will say this: my son is now taking a fencing class<br/>\non Thursdays (1hr) and LOVES it.  Works up a sweat and<br/>\nfeels the burn of exercise and likes it.  We go to the<br/>\npark after that and play for 2 hours with other<br/>\nkids/parents in our homeschool group.  Total free<br/>\nplay.  Exercise isn&#39;t the goal (although it certainly<br/>\nhappens).  He seems less concerned with his appearance<br/>\nlately.  I always try to stay neutral.  I just beat up<br/>\non myself, in my head, for not being more dedicated,<br/>\nenergetic towards HEALTH.<br/>\n<br/>\n<br/>\n\t\t<br/>\n__________________________________ <br/>\nYahoo! Mail - PC Magazine Editors&#39; Choice 2005 <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a></div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler Waynforth","from":"&quot;Schuyler Waynforth&quot; &lt;s.waynforth@...&gt;","profile":"schuyler_waynforth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Food issues,unschooling","postDate":"1128184027","msgId":108671,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRobWRjcit2NGp2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFhYy40MGIxMjBjOC4zMDZmZjgwYUBhb2wuY29tPg=="},"prevInTopic":108670,"nextInTopic":108673,"prevInTime":108670,"nextInTime":108672,"topicId":108630,"numMessagesInTopic":0,"msgSnippet":"... children. ... from kid-version ... Doing a quick search on-line the suggested daily intake for pre-pubertal girls is anything from 1600 to 3500 calories a","messageBody":"<div id=\"ygrps-yiv-1510640530\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, SandraDodd@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; In a message dated 10/1/05 7:25:47 AM, elainegh8@h... writes:<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; &gt; Because surely a 9 year old doesn&#39;t need a many calories as an<br/>\n&gt; &gt; adult?<br/>\n&gt; &gt; <br/>\n&gt; <br/>\n&gt; I think it&#39;s the other way around. Adults don&#39;t need as much as<br/>\n </span></blockquote>children.   <br/>\n<blockquote><span title=\"ireply\"> &gt; She&#39;s 9! She&#39;s big. She&#39;s growing. She&#39;s coming toward puberty when <br/>\n&gt; kids need LOTS of calories because their bodies are transforming<br/>\n </span></blockquote>from kid-version <br/>\n<blockquote><span title=\"ireply\"> &gt; to adult version.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Doing a quick search on-line the suggested daily intake for<br/>\npre-pubertal girls is anything from 1600 to 3500 calories a day.  So a<br/>\nhuge range which means that there are no rules of thumb to guide<br/>\nanyone about how much or how little their son or daughter should eat.<br/>\n And a range which easily incorporates how much I (5 foot 10, almost<br/>\n12 stone (165 pounds) and 37 years old) eat.  <br/>\n<br/>\n&lt;snip&gt;<br/>\n<blockquote><span title=\"ireply\"> &gt;...Food isn&#39;t used to try to control growth. It&#39;s a resource, <br/>\n&gt; like water, like soft places to sit, like things to read. If you<br/>\n </span></blockquote>make it a <br/>\n<blockquote><span title=\"ireply\"> &gt; powerful, dangerous substance, you&#39;ll have problems.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>When I was thinking about the whole food issue thing this is what I<br/>\nkept coming back to, the idea that food is just food.  If you give it<br/>\nmore meaning, more weight, than you have to deal with those issues<br/>\nbefore you can even get to the idea that food is about sustenance.  <br/>\n<br/>\nSchuyler</div>","specialLinks":[]},{"userId":163750020,"authorName":"tuckervill2@aol.com","from":"tuckervill2@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Food issues,unschooling","postDate":"1128179078","msgId":108670,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1ZC41YTNjNjNjYy4zMDZmZmY4NkBhb2wuY29tPg=="},"prevInTopic":108668,"nextInTopic":108671,"prevInTime":108669,"nextInTime":108671,"topicId":108630,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/1/2005 8:26:01 AM Central Standard Time, elainegh8@hotmail.com writes: I am  paranoid about fatness as it is a killer and also for other ","messageBody":"<div id=\"ygrps-yiv-564701305\">In a message dated 10/1/2005 8:26:01 AM Central Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:elainegh8@...\">elainegh8@...</a> writes:<br/>\n<br/>\nI am  paranoid about fatness as it is a killer and also for other <br/>\nreasons I&#39;ll  list below. It is guaranteed to shorten life, <br/>\nespecially in our family. I  also have personal hangups about fatness <br/>\nwhich I think are clouding this  issue. This issue has given me the <br/>\nchance to think about it all more  deeply.<br/>\n<br/>\n<br/>\n<br/>\n~~~<br/>\nYou&#39;re very brave to admit all that you did.  And that&#39;s a good start  to <br/>\ngetting past it.<br/>\n <br/>\nI will admit that I wanted my last child to be a girl, but I was also  <br/>\ndesparately afraid that if it were a girl that she would have the genes of my  <br/>\nhusband&#39;s side of the family and look like my Amazon sister-in-law.  Well,  Will <br/>\nwasn&#39;t a girl, and he did get those genes, and he looks a lot like his  father <br/>\nin body shape--but also got my good eyes, and he&#39;s much more athletic  than <br/>\nthat side of the family and I&#39;m not too concerned about him becoming  overweight <br/>\nor having thick jowls, as I would be if he were female.  My goal  for us, <br/>\nbecause he does have that body type, is that we live a very active  lifestyle, <br/>\ntrying all kinds of sports together, and if he lives that life then  it will be <br/>\neasy to continue it as an adult.  We currently mountain bike  together, and <br/>\ncanoe and hike and swim and play tennis (but my husband  doesn&#39;t).  I figure the <br/>\nmore I exercise, the more food I can enjoy!   ;)<br/>\n <br/>\nSo, I understand what you mean about having a fat daughter.  My dad is  <br/>\nparanoid of it, too, and makes comments about my weight sometimes...but I let  them <br/>\nslide off because I know I can bike 12 miles on a rooty mountain trail in  <br/>\nspite of having a bad back, and he can&#39;t do that, even though he&#39;s thin.<br/>\n <br/>\nI would like to recommend a book.  The Ultimate Weight-Loss Solution  by Dr. <br/>\nPhil McGraw.  Say what you will about Dr. Phil (and I&#39;ve said plenty  about <br/>\nhis ideas about children), this is one of the books that has been most  helpful <br/>\nto me about getting through the emotional aspects of why we eat and  are <br/>\noverweight.<br/>\n <br/>\nYou really should get past it, for your daughter&#39;s sake.<br/>\n <br/>\nKaren<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Food issues,unschooling","postDate":"1128177162","msgId":108668,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhYy40MGIxMjBjOC4zMDZmZjgwYUBhb2wuY29tPg=="},"prevInTopic":108667,"nextInTopic":108670,"prevInTime":108667,"nextInTime":108669,"topicId":108630,"numMessagesInTopic":0,"msgSnippet":"... I think it s the other way around.   Adults don t need as much as children. She s 9!   She s big.   She s growing.   She s coming toward puberty when kids","messageBody":"<div id=\"ygrps-yiv-1465309317\">In a message dated 10/1/05 7:25:47 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:elainegh8@...\">elainegh8@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Because surely a 9 year old doesn&#39;t need a many calories as an<br/>\n&gt; adult?<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I think it&#39;s the other way around.   Adults don&#39;t need as much as children.   <br/>\nShe&#39;s 9!   She&#39;s big.   She&#39;s growing.   She&#39;s coming toward puberty when <br/>\nkids need LOTS of calories because their bodies are transforming from kid-version <br/>\nto adult version.<br/>\n<br/>\n-=- Would I give a 3 year old an adult portion?-=-<br/>\n<br/>\nIf you think of food in terms of &quot;adult portions&quot; and you&#39;ve been <br/>\napportioning it, maybe that&#39;s part of the problem.   <br/>\n<br/>\nFrom the beginning my kids could choose what they ate and how much of it, or <br/>\nhow little of it.   My husband was a pudgy baby, born fat, and stayed big <br/>\nalways.   Our oldest is somewhat that way (not as big as his dad was) and the <br/>\nother two aren&#39;t.   I was a scrawny kid, and until after I had the second baby, <br/>\nwas not big.    Food isn&#39;t used to try to control growth.   It&#39;s a resource, <br/>\nlike water, like soft places to sit, like things to read.   If you make it a <br/>\npowerful, dangerous substance, you&#39;ll have problems.<br/>\n<br/>\n-=-I feel I am already to blame for her weight by giving her too big<br/>\nportions already.-=-<br/>\n<br/>\nTry to get over the blame and guilt.   If it&#39;s not your fault, must it be her <br/>\nfault?<br/>\nCan fault be removed from the equation?<br/>\n<br/>\nMy husband&#39;s mom never blamed herself, she always blamed him, from the time <br/>\nhe was a baby, and she tried giving him less food, so he would sneak off and <br/>\neat elsewhere, and spend his money on food, and food is still his comfort <br/>\nsubstance.   She would have done better to love him and feed him and maybe he would <br/>\nhave felt rich and full many years ago, instead of empty and unloved and <br/>\nwrong.<br/>\n<br/>\n-=-What&#39;s the difference between limiting portions and saying you can&#39;t<br/>\neat anything else for a set amount of time or having to eat from a<br/>\nsmaller bowl (as you&#39;ve already suggested)?-=-<br/>\n<br/>\nI didn&#39;t say &quot;say you can&#39;t.&quot;<br/>\nYou asked for input.   If SHE wants to find tricks to eat less you might <br/>\nsuggest that SHE get a special bowl, but I never once suggested that you control <br/>\nher portions or you time her eating.<br/>\n<br/>\nProbably because of the way my kids are and my family is, I wasn&#39;t assuming <br/>\nyou wanted a new control plan, but a way to stop trying to control.<br/>\n<br/>\n-=-I wonder how many issues are brought to the unschooling list by<br/>\nparents thinking it&#39;s a problem with their child when it&#39;s really a<br/>\nproblem of their own?-=-<br/>\n<br/>\nThe vast majority of them. &lt;g&gt;<br/>\n<br/>\n-=-<br/>\nI am paranoid about fatness as it is a killer and also for other<br/>\nreasons I&#39;ll list below. It is guaranteed to shorten life,-=-<br/>\n<br/>\nThis is not logic, it&#39;s fear speaking.   It&#39;s bullshit.<br/>\nStress is a killer.<br/>\nShame and unhappiness are killers.<br/>\nThat they often go hand in hand with fat is a damned shame.<br/>\n<br/>\n-=-I suppose it also plays in to my own personal disgust at fatness. I<br/>\nreally hope I haven&#39;t passed it on to dd (I try not to) but I sort<br/>\nof feel being fat is immoral.-=-<br/>\n<br/>\nWell you didn&#39;t create that feeling yourself, it&#39;s deeply ingrained in our <br/>\nwhole culture and language and history.   Gluttony was one of the infamous seven <br/>\ndeadly sins of rhetoric-gone-by.   But what of people who are not <br/>\n&quot;gluttonous&quot; but are naturally biologically larger than others?    <br/>\n<br/>\nIs being tall a sin?   Is being pale skinned a sin?   Is have large or small <br/>\nbreasts a sin?   Big hands?   Freckles?<br/>\n<br/>\nMaybe reading about genetics would make you feel better for a while here than <br/>\nreading about disease and diet and obesity.<br/>\n<br/>\n-=-I also think it&#39;s repulsive, on me especially my self loathing knows<br/>\nno bounds, but it does affect my feelings with my daughter.-=-<br/>\n<br/>\nGet therapy then.   Find a help group of some sort.   Whose voice is in your <br/>\nhead saying you&#39;re disgusting?   Your mom?   Your grandmother? Friends long <br/>\ngone?    Do you want YOUR voice to live in your daughter&#39;s head long after <br/>\nyou&#39;re gone, saying she&#39;s disgusting, her feet are too big, and she should be <br/>\nashamed?<br/>\n<br/>\n-=- I don&#39;t want to<br/>\npass this on to dd but how can I not? It must pervade everything.-=-<br/>\n<br/>\nAwareness is a good start, but do not take your time.   MOVE to change.   <br/>\nShe&#39;ll be twelve or fifteen before you know it if you take your time to change.<br/>\n<br/>\n-=-Actually your writing (Sandra) about changing dials to sliders or<br/>\ndimmers was very useful. When I start thinking people are thinking<br/>\nI&#39;m a bad mother cos I am letting dd have an enormous dessert when<br/>\nwe&#39;re out I try and think SLIDERS! DIMMERS! get rid of that DIAL<br/>\nthat says ALL or NOTHING!-=-<br/>\n<br/>\nGood!   I&#39;m glad something I wrote might help.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Food issues,unschooling","postDate":"1128172790","msgId":108665,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUzLjFkMDkzNDZkLjMwNmZlNmY2QGFvbC5jb20+"},"prevInTopic":108664,"nextInTopic":108667,"prevInTime":108664,"nextInTime":108666,"topicId":108630,"numMessagesInTopic":0,"msgSnippet":"... My sister s proud of being thin while I m not, but it was tobacco and cocaine that helped her with that.   She quit the cocaine years back, but kept the ","messageBody":"<div id=\"ygrps-yiv-978706900\">In a message dated 10/1/05 4:43:59 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:s.waynforth@...\">s.waynforth@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t know that controlling her food<br/>\n&gt; will do that, smoking kept me thin for a long time, so maybe that<br/>\n&gt; would work.  But smoking has it&#39;s downside too. <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>My sister&#39;s proud of being thin while I&#39;m not, but it was tobacco and cocaine <br/>\nthat helped her with that.   She quit the cocaine years back, but kept the <br/>\ntobacco.    I&#39;m proud of having many more teeth than she has, and of not having <br/>\nto stand out in the snow to suck expensive smoke, as she does.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Food issues,unschooling","postDate":"1128171616","msgId":108661,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwZi5hOGY2NmQ4LjMwNmZlMjYwQGFvbC5jb20+"},"prevInTopic":108659,"nextInTopic":108664,"prevInTime":108660,"nextInTime":108662,"topicId":108630,"numMessagesInTopic":0,"msgSnippet":"... But one was related to the other and you had odd circumstances. You kept eating so you could keep reading. In the absence of a weird condition like a mom","messageBody":"<div id=\"ygrps-yiv-477155594\">In a message dated 9/30/05 9:46:21 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ynxn96@...\">ynxn96@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-so we could only really read if we were doing soimething<br/>\n&gt; like eating. . . . . So be careful on presenting any reading material as a<br/>\n&gt; distraction from eating. -=-<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>But one was related to the other and you had odd circumstances.    <br/>\nYou kept eating so you could keep reading.<br/>\n<br/>\nIn the absence of a weird condition like a mom discouraging reading, the <br/>\nreading might be more interesting than the food!<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":172951189,"authorName":"Liza Rose Gottlieb","from":"Liza Rose Gottlieb &lt;lizarosegottlieb@...&gt;","profile":"lizarosegottlieb","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Food issues,unschooling","postDate":"1128171469","msgId":108667,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUxMDAxMTI1NzUwLjI0MTY3LnFtYWlsQHdlYjUzMjA1Lm1haWwueWFob28uY29tPg=="},"prevInTopic":108665,"nextInTopic":108668,"prevInTime":108666,"nextInTime":108668,"topicId":108630,"numMessagesInTopic":0,"msgSnippet":"Sometimes people eat in order to placate a sense of poverty (emotional or physical), or lack of control over their own lives.  My FIL, who is obese and getting","messageBody":"<div id=\"ygrps-yiv-87743964\">Sometimes people eat in order to placate a sense of poverty (emotional or physical), or lack of control over their own lives.  My FIL, who is obese and getting more so, will sit at the table after dinner with a magazine, a bag of nuts and/or a carton of prunes and eat mindlessly.  He has a low self-esteem (perceived poverty of friends) and comforts himself with eating.  There are also control issues with his wife (over his eating and drinking, just for starters).  <br/>\n <br/>\nIf he were to de-school his eating he may go into a period of gorging (a la tv & kids), but over time would, in theory, even out.  Unfortunately, he&#39;s in his mid-sixties and may not have that kind of time.  <br/>\n <br/>\nIs there some area of her life that is under stress that triggers a need to control an area of her life (eating)?<br/>\n <br/>\nLiza Rose<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nYahoo! for Good<br/>\n Click here to donate to the Hurricane Katrina relief effort. <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":8037645,"authorName":"elainegh8","from":"&quot;elainegh8&quot; &lt;elainegh8@...&gt;","profile":"elainegh8","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Food issues,unschooling","postDate":"1128164103","msgId":108664,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRobHB1Nyt2YXYzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEyZC42NWVlMzY3MS4zMDZmMTBmMkBhb2wuY29tPg=="},"prevInTopic":108661,"nextInTopic":108665,"prevInTime":108663,"nextInTime":108665,"topicId":108630,"numMessagesInTopic":0,"msgSnippet":"I m just not sure. She s 9 and weighs 9 and a half stone. Her height is 4 feet 10 and half inches. She is probably going to be about 5ft 9 and a half inches.","messageBody":"<div id=\"ygrps-yiv-815912027\">I&#39;m just not sure. She&#39;s 9 and weighs 9 and a half stone. Her height <br/>\nis 4 feet 10 and half inches. She is probably going to be about 5ft <br/>\n9 and a half inches. The shoes I&#39;m going to have to get her this <br/>\ntime are going to be a UK size 5. That&#39;s adult size here. She&#39;s got <br/>\nmassive shoulders and is very strong. I am tall 5ft 8 and strong too <br/>\nand her dad is very thickly built with weight lifter type shoulders. <br/>\nI guess she was never going to be petite :)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;It&#39;s not made in to a huge deal but I do give her smaller <br/>\n&gt; &gt; portions&gt; &gt; than us (sometimes she complains cos it&#39;s not <br/>\n&gt;&gt;fair).&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n &gt;It&#39;s not fair.   She&#39;s young and growing and hungry.Give yourself <br/>\n&gt;smaller portions than you do her.   Why should you have a bigger <br/>\n </span></blockquote>portion?<br/>\n<br/>\nBecause surely a 9 year old doesn&#39;t need a many calories as an <br/>\nadult? Would I give a 3 year old an adult portion? I dunno, I&#39;m lost.<br/>\nI feel I am already to blame for her weight by giving her too big <br/>\nportions already.<br/>\n<br/>\nI&#39;ve thought about this some more and I think this is much more <br/>\nabout me than dd really. :(<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If you limit her portions you are asking for dishonesty, shame, <br/>\n&gt;sneakiness, a &gt; feeling of neediness... &gt; Nothing good will come of <br/>\n&gt;it.<br/>\n<br/>\n </span></blockquote>What&#39;s the difference between limiting portions and saying you can&#39;t <br/>\neat anything else for a set amount of time or having to eat from a <br/>\nsmaller bowl (as you&#39;ve already suggested)? I am a bit confused <br/>\nabout this. This is an honest question btw not any antagonism. :)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -0=-Our society is rather paranoid about fatness.  <br/>\n<br/>\n </span></blockquote>I wonder how many issues are brought to the unschooling list by <br/>\nparents thinking it&#39;s a problem with their child when it&#39;s really a <br/>\nproblem of their own?<br/>\n<br/>\nI am paranoid about fatness as it is a killer and also for other <br/>\nreasons I&#39;ll list below. It is guaranteed to shorten life, <br/>\nespecially in our family. I also have personal hangups about fatness <br/>\nwhich I think are clouding this issue. This issue has given me the <br/>\nchance to think about it all more deeply.<br/>\n<br/>\nThis is really hard and I think people may find my feelings about <br/>\nthis disturbing. I know I do. It&#39;s a mixed bag of feelings of <br/>\nrevulsion, shame and guilt.<br/>\n<br/>\n5 years ago I was really ill and put on five and half stone. <br/>\nEntirely due to that weight and family predisposition I am now <br/>\nglucose tolerance impaired. I have personaly now lost 2 and a half <br/>\nstone but it is not enough. I have to lose weight or I will get <br/>\nDiabetes. Being fat as a child (I wasn&#39;t,I was skinny) greatly <br/>\nincreases the chances of getting serious diseases. I am afraid.<br/>\n<br/>\nI suppose it also plays in to my own personal disgust at fatness. I <br/>\nreally hope I haven&#39;t passed it on to dd (I try not to) but I sort <br/>\nof feel being fat is immoral. That also means I am not a good <br/>\nperson. When there are so many people without enough the fact that <br/>\npeople can eat so much it affects their health is disgusting..I am <br/>\nincluding myself in this. I am disgusting. I was also disgusting <br/>\nwhen I was just a stone overweight.<br/>\n<br/>\nI also think it&#39;s repulsive, on me especially my self loathing knows <br/>\nno bounds, but it does affect my feelings with my daughter. I am <br/>\nembaressed (sp?) to have a fat child. What an awful admission. This <br/>\nis a mess really. <br/>\n<br/>\nMy mother has been fat her entire life and as a child I always <br/>\nthought her body was repulsive and swore I&#39;d never get like that. It <br/>\nmay have been because I went to boarding school from the age of 8 so <br/>\nmostly only saw other childrens bodies. I don&#39;t like my mother very <br/>\nmuch.<br/>\n<br/>\nI am embaressed to go out as I feel people are judging me because I <br/>\nand my dd are fat. People really judge about fatness in children. I <br/>\nam hyper sensitive to other peoples&#39; ideas. I am working on not <br/>\nbeing that way.<br/>\n<br/>\nI am terrified of being judged. I worry constantly about how people <br/>\nsee me, this was handed down from my mother who only really cares <br/>\nabout what things look like not how they really are. I don&#39;t want to <br/>\npass this on to dd but how can I not? It must pervade everything. I <br/>\nguess at least I am aware of it and working on it which is a good <br/>\nstart.<br/>\n<br/>\nActually your writing (Sandra) about changing dials to sliders or <br/>\ndimmers was very useful. When I start thinking people are thinking <br/>\nI&#39;m a bad mother cos I am letting dd have an enormous dessert when <br/>\nwe&#39;re out I try and think SLIDERS! DIMMERS! get rid of that DIAL <br/>\nthat says ALL or NOTHING! They might be thinking what a polite <br/>\nperson she is or what a nice family we look. Or they might not even <br/>\nbe thinking about us at all.<br/>\n<br/>\n                           BWs Elaine<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Try not to think of it as control.   It WILL control her.   You&#39;re <br/>\n </span></blockquote>training&gt; her to expect to be controlled. You control her now, food <br/>\ncontrols her later? &gt; Drop the word and the idea &quot;control.&quot;   <br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; Sandra </span></blockquote></div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler Waynforth","from":"&quot;Schuyler Waynforth&quot; &lt;s.waynforth@...&gt;","profile":"schuyler_waynforth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Food issues,unschooling","postDate":"1128163339","msgId":108659,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRobHA2YitjY3RtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGRoazRvOSthOHRwQGVHcm91cHMuY29tPg=="},"prevInTopic":108655,"nextInTopic":108661,"prevInTime":108658,"nextInTime":108660,"topicId":108630,"numMessagesInTopic":0,"msgSnippet":"I can t imagine not ever having felt full.  I think if Linnaea (5) or Simon (8) had never felt full, and didn t have Prader Willi, I would make dish after dish","messageBody":"<div id=\"ygrps-yiv-1490443891\">I can&#39;t imagine not ever having felt full.  I think if Linnaea (5) or<br/>\nSimon (8) had never felt full, and didn&#39;t have Prader Willi, I would<br/>\nmake dish after dish of food that I knew they loved and they could eat<br/>\nuntil they were full.  The thought of always feeling hungry just makes<br/>\nme feel unhappy.  And I would hate to think that Simon or Linnaea were<br/>\nneeding food in that way.<br/>\n<br/>\nIn the UK there is a real focus on fat phobia.  Or, more precisely,<br/>\nthere is a phobic focus on weight.  With Channel 4&#39;s You Are What You<br/>\nEat, and BBC3&#39;s Honey We&#39;re Killing The Kids it is easy to get a sense<br/>\nthat the most important thing you can do for your child is to help<br/>\nthem be thin.  David (dh) was watching Honey We&#39;re Killing the Kids<br/>\nlast night and was appalled to hear them state that a diet of junk<br/>\nfood lead to a life expectancy of 66 years.  There are no studies that<br/>\nprove that.  The message that junk food is bad is so important at the<br/>\nmoment nobody will argue the made up statistics that BBC3 produces.  <br/>\n<br/>\nIf the most important thing for you is that your daughter isn&#39;t fat<br/>\nthan you need to address that. I don&#39;t know that controlling her food<br/>\nwill do that, smoking kept me thin for a long time, so maybe that<br/>\nwould work.  But smoking has it&#39;s downside too.  Maybe you could offer<br/>\ngoing to your local leisure centre during lunchtime and go swimming<br/>\n(we&#39;ve found our local is much emptier at lunchtime than at other<br/>\ntimes).  I don&#39;t know where you are in Wales, but there are beautiful<br/>\nbeaches, aren&#39;t there? maybe you could go rockhounding on the beach<br/>\nand get a walk in that way.  You could see if there is a climbing wall<br/>\nnearby and she could try climbing, Simon and Linnaea both really enjoy<br/>\nthat. Maybe there is a fencing club or an archery group or something<br/>\nthat you and she could do that she&#39;d really like.  It might not change<br/>\nher weight at all, but it might make her more interested in other<br/>\nkinds of activities besides eating.  <br/>\n<br/>\nLet her eat.  Make food an area where she has no guilt and no<br/>\nemotional relationship to increase her desire for it.  Pam wrote a<br/>\nwonderful post on the marginal utility of anything and how denying<br/>\naccess to something increases its relative value.  I posted it on my<br/>\nblog here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://waynforth.blogspot.com/2005/01/marginal-utility-or-marginal-value.html\">http://waynforth.blogspot.com/2005/01/marginal-utility-or-marginal-value.html</a><br/>\n(which I hope is alright, I never actually asked for permission to<br/>\nquote you Pam). Maybe you should read that and see if you need to<br/>\nchange your perspective.  <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;elainegh8&quot;<br/>\n&lt;elainegh8@h...&gt; wrote:<br/>\n&lt;snip&gt; <br/>\n<blockquote><span title=\"qreply\"> &gt; I&#39;ve never heard her say she is full, ever. </span></blockquote></div>","specialLinks":[]},{"userId":142809109,"authorName":"badolbilz","from":"badolbilz &lt;ynxn96@...&gt;","profile":"heidis4reasons","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Food issues,unschooling","postDate":"1128136666","msgId":108655,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzM0RGRkRBLjIwOTA5MDZAZnJvbnRpZXJuZXQubmV0Pg==","referencesHeader":"PGRoazNpNis3MXJxQGVHcm91cHMuY29tPiA8NDMzREE3Q0IuOTAyMDYwMEBpaHVnLmNvLm56Pg=="},"prevInTopic":108653,"nextInTopic":108659,"prevInTime":108654,"nextInTime":108656,"topicId":108630,"numMessagesInTopic":0,"msgSnippet":"Cally, I second you on this.  When I was growing up, my mother tried to keep us from reading a lot...said it would create an  unrealistic view of the","messageBody":"<div id=\"ygrps-yiv-1819134862\">Cally, I second you on this.  When I was growing up, my mother tried to <br/>\nkeep us from reading a lot...said it would create an  unrealistic view <br/>\nof the world...so we could only really read if we were doing soimething <br/>\nlike eating.  I could and still can go through a whole box of cereal if <br/>\nI have a good book.  It&#39;s like a co-addiction.  Since I&#39;ve been working <br/>\nhard at getting a healthier body,  I&#39;ve completely refused myself to <br/>\nread while I eat.  So be careful on presenting any reading material as a <br/>\ndistraction from eating.    One thing I&#39;ve done that&#39;s worked pretty <br/>\nwell is to have a list of 100 and 200 calorie foods and pace myself <br/>\nthroughout the day.  You can eat something every hour that way and still <br/>\nonly take in 1200-1500 or more calories for the whole day, and  mix up <br/>\nthe stuff so proteins, carbs, etc. are spaced out for even bouts of <br/>\nenergy and fullness.  I also try to drink one glass of water in between <br/>\neating every 1-2 hours to maintain my full feeling.  <br/>\n<br/>\nGood luck.  And try to subtly assure your daughter how much you enjoy <br/>\nher and are glad for her just as she is.  Her emotional confidence is <br/>\nprobably very fragile and is probably the first step to helping her be <br/>\nhealthier is to boost her own self-worth.<br/>\n<br/>\nHeidi Case<br/>\n<br/>\nCally Brown wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;   Maybe<br/>\n&gt; &gt; simply putting an interesting magazine article or a catalog or<br/>\n&gt; &gt; something beside her plate at meals?<br/>\n&gt;<br/>\n&gt; I eat way more when I read (books, magazines - or e-mails like now) - I<br/>\n&gt; eat without noticing, I guess, then &#39;need&#39; more to get the feeling of<br/>\n&gt; satisfaction.<br/>\n&gt;<br/>\n&gt; Cally<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n&gt;<br/>\n&gt; Visit the Unschooling website and message boards: <br/>\n&gt; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.info\">http://www.unschooling.info</a>&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------------------------------------------<br/>\n&gt; YAHOO! GROUPS LINKS<br/>\n&gt;<br/>\n&gt;     *  Visit your group &quot;UnschoolingDiscussion<br/>\n&gt;       &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UnschoolingDiscussion\">http://groups.yahoo.com/group/UnschoolingDiscussion</a>&gt;&quot; on the web.<br/>\n&gt;        <br/>\n&gt;     *  To unsubscribe from this group, send an email to:<br/>\n&gt;        <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n&gt;       &lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a>?subject=Unsubscribe&gt;<br/>\n&gt;        <br/>\n&gt;     *  Your use of Yahoo! Groups is subject to the Yahoo! Terms of<br/>\n&gt;       Service &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a>&gt;.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------------------------------------------<br/>\n&gt;<br/>\n&gt;------------------------------------------------------------------------<br/>\n&gt;<br/>\n&gt;No virus found in this incoming message.<br/>\n&gt;Checked by AVG Anti-Virus.<br/>\n&gt;Version: 7.0.344 / Virus Database: 267.11.8/114 - Release Date: 9/28/2005<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":109856460,"authorName":"nellebelle","from":"&quot;nellebelle&quot; &lt;nellebelle@...&gt;","profile":"lamaribelle","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Food issues,unschooling","postDate":"1128121866","msgId":108652,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZmUwMWM1YzYxNCQzZWMwNjk1MCQ2NDAxYThjMEBob21lPg==","referencesHeader":"PDEyZC42NWVlMzY3MS4zMDZmMTBmMkBhb2wuY29tPg=="},"prevInTopic":108651,"nextInTopic":108653,"prevInTime":108651,"nextInTime":108653,"topicId":108630,"numMessagesInTopic":0,"msgSnippet":"... her to expect to be controlled. You control her now, food controls her later? Drop the word and the idea control. Good point.  Thanks for the","messageBody":"<div id=\"ygrps-yiv-1446838733\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;Try not to think of it as control.   It WILL control her.   You&#39;re training <br/>\n </span></blockquote>her to expect to be controlled. You control her now, food controls her later?   <br/>\nDrop the word and the idea &quot;control.&quot;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nGood point.  Thanks for the reminder about using certain words.<br/>\n<br/>\nHow about this: let her listen to her own cues of hunger and fullness and which foods will satisfy at any given time.<br/>\n<br/>\nMary Ellen<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Food issues,unschooling","postDate":"1128118002","msgId":108651,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyZC42NWVlMzY3MS4zMDZmMTBmMkBhb2wuY29tPg=="},"prevInTopic":108650,"nextInTopic":108652,"prevInTime":108650,"nextInTime":108652,"topicId":108630,"numMessagesInTopic":0,"msgSnippet":"... It s not fair.   She s young and growing and hungry.   Give yourself smaller portions than   you do her.   Why should you have a bigger portion? If you","messageBody":"<div id=\"ygrps-yiv-477944238\">In a message dated 9/30/05 4:03:28 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nellebelle@...\">nellebelle@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;It&#39;s not made in to a huge deal but I do give her smaller <br/>\n&gt; portions<br/>\n&gt; than us (sometimes she complains cos it&#39;s not fair).&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>It&#39;s not fair.   She&#39;s young and growing and hungry.   Give yourself smaller <br/>\nportions than   you do her.   Why should you have a bigger portion?<br/>\n<br/>\nIf you limit her portions you are asking for dishonesty, shame, sneakiness, a <br/>\nfeeling of neediness...   <br/>\nNothing good will come of it.<br/>\n<br/>\n-0=-Our society is rather paranoid about fatness.  Your daughter will not <br/>\nalways have you there to control her food.  You can help her best by helping her <br/>\ngain that control for herself.<br/>\n-=-<br/>\n<br/>\nTry not to think of it as control.   It WILL control her.   You&#39;re training <br/>\nher to expect to be controlled. You control her now, food controls her later?   <br/>\nDrop the word and the idea &quot;control.&quot;   <br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":109856460,"authorName":"nellebelle","from":"&quot;nellebelle&quot; &lt;nellebelle@...&gt;","profile":"lamaribelle","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Food issues,unschooling","postDate":"1128117661","msgId":108650,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZDcwMWM1YzYwYSQ3YTVhZjBjMCQ2NDAxYThjMEBob21lPg==","referencesHeader":"PGRoaXZtaitiMWkwQGVHcm91cHMuY29tPg=="},"prevInTopic":108649,"nextInTopic":108651,"prevInTime":108649,"nextInTime":108651,"topicId":108630,"numMessagesInTopic":0,"msgSnippet":"... do my dd will balloon to a vast size. You can t know what will happen unless you do let go of the controls.  Sandra s general advice of","messageBody":"<div id=\"ygrps-yiv-1169238847\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;I find I am unable to let go my control over food. I&#39;m afraid if I <br/>\n </span></blockquote>do my dd will balloon to a vast size.&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nYou can&#39;t know what will happen unless you do let go of the controls.  Sandra&#39;s general advice of gradually letting go of controls would apply here.  Don&#39;t just say &quot;you can eat whatever you want&quot;, but say yes more when she asks for food.<br/>\n<br/>\nIt is possible that your dd will be a heavier person, no matter what you do or don&#39;t do.  For the most part, good nutrition and physical activity are more important than body weight.  Also, between 8 and 12 is a normal time for kids to put on extra weight in preparation for a final growth spurt.<br/>\n<br/>\nIs she interested in nutrition?  My kids have recently become very interested in &quot;serving sizes&quot;.  They&#39;ve also off and on paid attention to the food pyramid and recommended #s of servings of various categories.  There are lots of websites on nutrition for kids.  Nutrition is simple and complicated at the same time.  There are so many unknowns.  Recomendations such as the food pyramid can only be very general guidelines, not exact precscriptions for everybody.  Recomendations change every few years too.  So, it makes more sense to help our kids listen to their own cues of hunger and which foods will satisfy them at any given time.  At 12 and 10, my kids still sometimes have food jags where they only want to eat a few certain foods for days or weeks at a time.  I was never very controlling about food, but I became aware of some ways I was controlling.  As I&#39;ve let go I find the kids making amazing choices and frequently turning down ice cream or soda, etc. - unless they really want it!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;It&#39;s not made in to a huge deal but I do give her smaller portions <br/>\n </span></blockquote>than us (sometimes she complains cos it&#39;s not fair).&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nSound like it might be a huge deal to her.  What if you gave everyone smaller portions and let each decide whether they need/want more?  Or let each dish up their own?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;I also say if she is hungry she can have <br/>\n </span></blockquote>unlimited fruit or other filling but low calorie food. Her meals are <br/>\nstill big!&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nFruit can be very &quot;fattening&quot;.  Many fruits are calorie dense.  Could you brainstorm with her on a list of foods she might choose from if she has eaten a meal and still wants more?  When she does ask for food, ask her questions like: sweet or salty? dry or wet? crunchy or soft? thirsty? play a game or do something active first, then see if still hungry?<br/>\n<br/>\nI know this is a difficult situation for your family.  Our society is rather paranoid about fatness.  Your daughter will not always have you there to control her food.  You can help her best by helping her gain that control for herself.<br/>\n<br/>\nMary Ellen<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1675643,"authorName":"Cally Brown","from":"Cally Brown &lt;mjcmbrwn@...&gt;","profile":"cally_marg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Food issues,unschooling","postDate":"1128114123","msgId":108648,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzM0RBN0NCLjkwMjA2MDBAaWh1Zy5jby5uej4=","referencesHeader":"PGRoazNpNis3MXJxQGVHcm91cHMuY29tPg=="},"prevInTopic":108647,"nextInTopic":108649,"prevInTime":108647,"nextInTime":108649,"topicId":108630,"numMessagesInTopic":0,"msgSnippet":"... I eat way more when I read (books, magazines - or e-mails like now) - I eat without noticing, I guess, then need more to get the feeling of satisfaction.","messageBody":"<div id=\"ygrps-yiv-212009740\"><blockquote><span title=\"ireply\">&gt;   Maybe<br/>\n&gt; simply putting an interesting magazine article or a catalog or<br/>\n&gt; something beside her plate at meals?<br/>\n<br/>\n </span></blockquote>I eat way more when I read (books, magazines - or e-mails like now) - I <br/>\neat without noticing, I guess, then &#39;need&#39; more to get the feeling of <br/>\nsatisfaction.<br/>\n<br/>\nCally</div>","specialLinks":[]},{"userId":8037645,"authorName":"elainegh8","from":"&quot;elainegh8&quot; &lt;elainegh8@...&gt;","profile":"elainegh8","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Food issues,unschooling","postDate":"1128109641","msgId":108653,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRoazRvOSthOHRwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGRoazNpNis3MXJxQGVHcm91cHMuY29tPg=="},"prevInTopic":108652,"nextInTopic":108655,"prevInTime":108652,"nextInTime":108654,"topicId":108630,"numMessagesInTopic":0,"msgSnippet":"Hi thanks for the ideas. What I really don t want to do is replace one rule with another,if you see what I mean. I m trying hard not to go too far. I ve just","messageBody":"<div id=\"ygrps-yiv-772208720\">Hi<br/>\n   thanks for the ideas. What I really don&#39;t want to do is replace one <br/>\nrule with another,if you see what I mean. I&#39;m trying hard not to go <br/>\ntoo far.<br/>\n<br/>\nI&#39;ve just ordered a mini trampoline and a wobble board.I&#39;m going to <br/>\nuse them but thought they might excite dd too. I told her I had <br/>\nordered them, she was very excited indeed. I think the wobble board <br/>\nwill help her with her co-ordination. So maybe more activity and more <br/>\ndrinks might help?<br/>\n<br/>\nI know she really likes stuff like carrot sticks and cucumber sticks <br/>\nand things. I could make loads of them and put them ready for her in <br/>\nthe fridge.<br/>\n<br/>\nI&#39;ve seen some really lovely lunch boxes on US sites that have <br/>\nseperate containers with lids, colourful too. That would be great in <br/>\nthe fridge for her to help herself to. Can&#39;t find a damn thing like <br/>\nthat here (UK). I&#39;m going to look for a food thermo flask too (again <br/>\nnot as nice as the ones in the US) so I can make her soup she can help <br/>\nherself to, sure she&#39;ll love that :)<br/>\n<br/>\nI guess I&#39;m similar in some ways to her. I&#39;m happier eating big meals <br/>\nof low calorie food than small meals of calorie dense stuff. I&#39;d like <br/>\nto eat HUGE meals of calorie dense food but it makes me feel terrible! <br/>\nJust as well I really like wholefood stuff and veggies :)<br/>\n<br/>\n                          BWs Elaine</div>","specialLinks":[]},{"userId":8037645,"authorName":"elainegh8","from":"&quot;elainegh8&quot; &lt;elainegh8@...&gt;","profile":"elainegh8","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Food issues,unschooling","postDate":"1128108808","msgId":108649,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRoazN1OCtncWttQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQzM0Q3MUZCLjYwNDA5MDFAc2JjZ2xvYmFsLm5ldD4="},"prevInTopic":108648,"nextInTopic":108650,"prevInTime":108648,"nextInTime":108650,"topicId":108630,"numMessagesInTopic":0,"msgSnippet":"That s not a bad idea :) BWs Elaine ... like","messageBody":"<div id=\"ygrps-yiv-1059378896\">That&#39;s not a bad idea :)<br/>\n<br/>\n                         BWs Elaine<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; **It&#39;s not as extreme as<br/>\n&gt; that as she doesn&#39;t want to eat constantly, it&#39;s more the volume of<br/>\n&gt; food.**<br/>\n&gt; <br/>\n&gt; Do you suppose more liquids and more wet foods would help her feel <br/>\n </span></blockquote>like <br/>\n<blockquote><span title=\"qreply\"> &gt; she&#39;s getting enough?<br/>\n&gt; <br/>\n&gt; Betsy </span></blockquote></div>","specialLinks":[]},{"userId":78282269,"authorName":"Deb","from":"&quot;Deb&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Food issues,unschooling","postDate":"1128108422","msgId":108647,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRoazNpNis3MXJxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFjMS4zMWNhMzBmMC4zMDZlZGJmNkBhb2wuY29tPg=="},"prevInTopic":108645,"nextInTopic":108648,"prevInTime":108646,"nextInTime":108648,"topicId":108630,"numMessagesInTopic":0,"msgSnippet":"... I do that - I ll read a magazine article at breakfast or read or chat with DH and DS at dinner (depends on what they re doing - if DS is watching something","messageBody":"<div id=\"ygrps-yiv-1007638264\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, SandraDodd@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; <br/>\n&gt; Two tricks I&#39;ve read about are eating slowly with long breaks <br/>\n&gt;during/between <br/>\n&gt; bites (conversation, reading, activities that involve her hands, <br/>\n&gt;maybe, during <br/>\n&gt; meals?)   and eating out of a single small bowl, like a rice bowl, <br/>\n&gt;with no <br/>\n&gt; refills until after some time has passed.     I&#39;m not sure they&#39;re <br/>\n&gt;*good* ideas, <br/>\n&gt; but might be worth considering.   They say (whoever &quot;they&quot; are) <br/>\n&gt;that &gt;it might <br/>\n&gt; take 20 minutes for the &quot;all&#39;s full&quot; signal to reach the brain.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n<br/>\n </span></blockquote>I do that - I&#39;ll read a magazine article at breakfast or read or <br/>\nchat with DH and DS at dinner (depends on what they&#39;re doing - if DS <br/>\nis watching something and takes his dinner to the living room, I&#39;ll <br/>\noften grab a magazine article to read). I have found that I will eat <br/>\nless if I do this - don&#39;t know if it applies globally or not. And, I <br/>\nknow that DS, who has never had food regulation at all, tends to <br/>\nstop when he&#39;s full regardless of whether he&#39;s just sitting and <br/>\neating or doing something at the time. So it could be a whole <br/>\ncombined ball o&#39; wax of physiology and psychology and other &#39;stuff&#39;. <br/>\nI don&#39;t know how you&#39;d go about &quot;requiring&quot; something like this <br/>\nthough without it becoming a whole different type of battle. Maybe <br/>\nsimply putting an interesting magazine article or a catalog or <br/>\nsomething beside her plate at meals?<br/>\n<br/>\n--Deb</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Food issues,unschooling","postDate":"1128104438","msgId":108645,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjMS4zMWNhMzBmMC4zMDZlZGJmNkBhb2wuY29tPg=="},"prevInTopic":108644,"nextInTopic":108647,"prevInTime":108644,"nextInTime":108646,"topicId":108630,"numMessagesInTopic":0,"msgSnippet":"... Two tricks I ve read about are eating slowly with long breaks during/between bites (conversation, reading, activities that involve her hands, maybe, during","messageBody":"<div id=\"ygrps-yiv-442967935\">In a message dated 9/30/05 11:13:23 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ecsamhill@...\">ecsamhill@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; **It&#39;s not as extreme as<br/>\n&gt; that as she doesn&#39;t want to eat constantly, it&#39;s more the volume of<br/>\n&gt; food.**<br/>\n&gt; <br/>\n&gt; Do you suppose more liquids and more wet foods would help her feel like<br/>\n&gt; she&#39;s getting enough?<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>-----------------<br/>\n<br/>\nTwo tricks I&#39;ve read about are eating slowly with long breaks during/between <br/>\nbites (conversation, reading, activities that involve her hands, maybe, during <br/>\nmeals?)   and eating out of a single small bowl, like a rice bowl, with no <br/>\nrefills until after some time has passed.     I&#39;m not sure they&#39;re *good* ideas, <br/>\nbut might be worth considering.   They say (whoever &quot;they&quot; are) that it might <br/>\ntake 20 minutes for the &quot;all&#39;s full&quot; signal to reach the brain.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":230706843,"authorName":"Betsy Hill","from":"Betsy Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Food issues,unschooling","postDate":"1128100347","msgId":108644,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzM0Q3MUZCLjYwNDA5MDFAc2JjZ2xvYmFsLm5ldD4=","inReplyToHeader":"PGRoam92Nys2NmtzQGVHcm91cHMuY29tPg==","referencesHeader":"PGRoam92Nys2NmtzQGVHcm91cHMuY29tPg=="},"prevInTopic":108642,"nextInTopic":108645,"prevInTime":108643,"nextInTime":108645,"topicId":108630,"numMessagesInTopic":0,"msgSnippet":"**It s not as extreme as that as she doesn t want to eat constantly, it s more the volume of food.** Do you suppose more liquids and more wet foods would help","messageBody":"<div id=\"ygrps-yiv-43610949\">**It&#39;s not as extreme as<br/>\nthat as she doesn&#39;t want to eat constantly, it&#39;s more the volume of<br/>\nfood.**<br/>\n<br/>\nDo you suppose more liquids and more wet foods would help her feel like <br/>\nshe&#39;s getting enough?<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":8037645,"authorName":"elainegh8","from":"&quot;elainegh8&quot; &lt;elainegh8@...&gt;","profile":"elainegh8","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Food issues,unschooling","postDate":"1128097575","msgId":108642,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRoam92Nys2NmtzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGRoam5jYys0Ym0yQGVHcm91cHMuY29tPg=="},"prevInTopic":108639,"nextInTopic":108644,"prevInTime":108641,"nextInTime":108643,"topicId":108630,"numMessagesInTopic":0,"msgSnippet":"Hi thanks Deb.I m aware of Prader Willi syndrome. Definitely not that. Prader Willi also comes with some learning disabilities and often people will go in bins","messageBody":"<div id=\"ygrps-yiv-562124729\">Hi<br/>\n   thanks Deb.I&#39;m aware of Prader Willi syndrome. Definitely not <br/>\nthat. Prader Willi also comes with some learning disabilities and <br/>\noften people will go in bins to get food. It&#39;s not as extreme as <br/>\nthat as she doesn&#39;t want to eat constantly, it&#39;s more the volume of <br/>\nfood.<br/>\n<br/>\n                         BWs Elaine<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; There are also some &#39;conditions&#39; for lack of a better term that <br/>\n </span></blockquote>cause <br/>\n<blockquote><span title=\"ireply\"> &gt; a person to not feel full, to not get that signal - google for <br/>\n </span></blockquote>Prader-<br/>\n<blockquote><span title=\"ireply\"> &gt; Willi Syndrome for example. So, there might be a biological issue <br/>\n </span></blockquote>that <br/>\n<blockquote><span title=\"ireply\"> &gt; needs to be addressed so she can understand feeling full, <br/>\n </span></blockquote>comfortable, <br/>\n<blockquote><span title=\"qreply\"> &gt; overfull, etc.<br/>\n&gt; <br/>\n&gt; HTH<br/>\n&gt; --Deb </span></blockquote></div>","specialLinks":[]},{"userId":78282269,"authorName":"Deb","from":"&quot;Deb&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Food issues,unschooling","postDate":"1128095948","msgId":108636,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRoam5jYys0Ym0yQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGRoaXZtaitiMWkwQGVHcm91cHMuY29tPg=="},"prevInTopic":108630,"nextInTopic":108639,"prevInTime":108635,"nextInTime":108637,"topicId":108630,"numMessagesInTopic":0,"msgSnippet":"There are also some conditions for lack of a better term that cause a person to not feel full, to not get that signal - google for Prader- Willi Syndrome for","messageBody":"<div id=\"ygrps-yiv-1506299205\">There are also some &#39;conditions&#39; for lack of a better term that cause <br/>\na person to not feel full, to not get that signal - google for Prader-<br/>\nWilli Syndrome for example. So, there might be a biological issue that <br/>\nneeds to be addressed so she can understand feeling full, comfortable, <br/>\noverfull, etc.<br/>\n<br/>\nHTH<br/>\n--Deb</div>","specialLinks":[]},{"userId":235373340,"authorName":"liberatedlearning","from":"&quot;liberatedlearning&quot; &lt;liberatedlearning@...&gt;","profile":"liberatedlearning","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Food issues,unschooling","postDate":"1128091515","msgId":108639,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRoamoxcitqZHRuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGRoaXZtaitiMWkwQGVHcm91cHMuY29tPg=="},"prevInTopic":108636,"nextInTopic":108642,"prevInTime":108638,"nextInTime":108640,"topicId":108630,"numMessagesInTopic":0,"msgSnippet":"Hi, I don t have any help to offer but just want to let you know that I have a similar concern about my ds, 15.  He s been heavy since he was seven or eight.","messageBody":"<div id=\"ygrps-yiv-1300749865\">Hi,<br/>\n<br/>\nI don&#39;t have any help to offer but just want to let you know that I have a similar concern <br/>\nabout my ds, 15.  He&#39;s been heavy since he was seven or eight.  I used to control food but <br/>\nquit about two years ago.  He still eats sneakily, like slipping into the kitchen after dinner <br/>\nto eat leftovers or waiting until everyone is out of the house to eat a snack.  I don&#39;t say <br/>\nanything to him about it and I don&#39;t withhold food or voice value judgements about his <br/>\nfood choices.  I try to have easy to eat, nutritious food available and I bring it to him at <br/>\ntimes.  I don&#39;t know how much he weighs because I don&#39;t ask him but I know he&#39;s gaining <br/>\nlately.  I can tell by looking at him and his clothes aren&#39;t fitting.  He is not particularly <br/>\nactive, physically, but he does have a daily exercise routine that he&#39;s been doing for nine <br/>\nmonths, of his own volition.<br/>\n<br/>\nHis father and I are both overweight too.<br/>\n<br/>\nIdeas on what to do??<br/>\n<br/>\nTina <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;elainegh8&quot; &lt;elainegh8@h...&gt; wrote:<br/>\n&gt; Hi<br/>\n&gt;    I have a search about to see if I could find any unschooling <br/>\n&gt; articles that might help with my problem. My dd aged 9 has a weight <br/>\n&gt; problem in that she is very overweight. She is not a junk food kid, <br/>\n&gt; although she likes it, she also likes all her veggies etc<br/>\n&gt; <br/>\n&gt; I find I am unable to let go my control over food. I&#39;m afraid if I <br/>\n&gt; do my dd will balloon to a vast size.  She&#39;s really big already. <br/>\n&gt; It&#39;s not what she eats but how much. Even when she was a baby and <br/>\n&gt; breastfeeding (she was v v long term breastfed) she would suckle til <br/>\n&gt; she was sick! It was overflow. She just doesn&#39;t  seem to know how <br/>\n&gt; much is enough. She will eat adult portions and then some more food.<br/>\n&gt; <br/>\n&gt; It&#39;s not made in to a huge deal but I do give her smaller portions <br/>\n&gt; than us (sometimes she complains cos it&#39;s not fair).  I didn&#39;t <br/>\n&gt; always do this and she would eat a whole adult sized meal, pudding <br/>\n&gt; and then want fruit too. I also say if she is hungry she can have <br/>\n&gt; unlimited fruit or other filling but low calorie food. Her meals are <br/>\n&gt; still big!<br/>\n&gt; <br/>\n&gt; She is very insistent that we have breakfast, lunch, dinner and <br/>\n&gt; supper. If say we get up late she insists she has breakfast then <br/>\n&gt; lunch immediately after as it is lunch &#39;time&#39;. For her there is a <br/>\n&gt; time for every meal, she likes knowing when things will be so if the <br/>\n&gt; time is a bit off because we got up late or had dinner late she ends <br/>\n&gt; up having 2 meals run together. For her it seems to be a cause of <br/>\n&gt; anxiety that she might have 3 meals instead of 4.<br/>\n&gt; <br/>\n&gt; I&#39;m not really sure how to tackle it. I want to not enforce food <br/>\n&gt; rules but I am also very concerned about her weight. Diabetes type 2 <br/>\n&gt; runs very strongly in my family so carrying excess weight is a <br/>\n&gt; worry. She does have very poor bodily co-ordination as well so <br/>\n&gt; excess weight makes movement more difficult for her. <br/>\n&gt; <br/>\n&gt; She went on holiday with my mum and came back 6 pounds heavier this <br/>\n&gt; year. She goes to her dads every weekend, last year she put 7lbs on <br/>\n&gt; when on holiday with him and then more weight on holiday with my <br/>\n&gt; mum. Her dad seems to have managed to stop putting weight on her but <br/>\n&gt; my mum hasn&#39;t.<br/>\n&gt; <br/>\n&gt; I do talk to dd about weight and health, emphasis on the health. I <br/>\n&gt; don&#39;t talk to her very often as I don&#39;t want to make it in to a huge <br/>\n&gt; issue. I think her older sister (aged 19) and my mum might have a go <br/>\n&gt; at her about it though.  She doesn&#39;t actually like being heavy. I <br/>\n&gt; have said that she doesn&#39;t have to lose weight as she is a kid and <br/>\n&gt; growing and to be a healthier weight she just has to stay the weight <br/>\n&gt; she is.<br/>\n&gt; <br/>\n&gt; I&#39;m sure I&#39;m doing this wrong. My older dd was a normal weight until <br/>\n&gt; she left home and has now ballooned massively. I think it&#39;s my fault <br/>\n&gt; as she wouldn&#39;t eat a healthy diet at all (still won&#39;t) and I made <br/>\n&gt; it an issue and so did my mum as she gave her all junk food and I <br/>\n&gt; said it was bad so she now thinks that not eating junk food all the <br/>\n&gt; time is depravation, my fault. I am much more relaxed about food <br/>\n&gt; with my younger one and she has never been faddy.<br/>\n&gt; <br/>\n&gt; She is very bright in a reading kind of way but is somehow  a <br/>\n&gt; little &#39;different&#39;. She has had difficulty understanding social cues <br/>\n&gt; and social &#39;rules&#39;. She was aggressive but isn&#39;t any more. Because <br/>\n&gt; of her co-ordination difficulties  she finds writing really hard. <br/>\n&gt; She&#39;s an adult level reader, self taught. I sort of feel <br/>\n&gt; her &#39;difference&#39; is also connected to her eating but I&#39;m not sure.<br/>\n&gt; <br/>\n&gt; I&#39;ve never heard her say she is full, ever.<br/>\n&gt; <br/>\n&gt; Although I&#39;ve written a lot here I do try and keep these thoughts of <br/>\n&gt; mine away from dd as I worry that it will make her more anxious or <br/>\n&gt; feel bad. All these thoughts go around my head. I do worry a lot I <br/>\n&gt; have to say.<br/>\n&gt; <br/>\n&gt;                             BWs Elaine (UK) </span></blockquote></div>","specialLinks":[]},{"userId":8037645,"authorName":"elainegh8","from":"&quot;elainegh8&quot; &lt;elainegh8@...&gt;","profile":"elainegh8","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Food issues,unschooling","postDate":"1128071699","msgId":108630,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRoaXZtaitiMWkwQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":108636,"prevInTime":108629,"nextInTime":108631,"topicId":108630,"numMessagesInTopic":0,"msgSnippet":"Hi I have a search about to see if I could find any unschooling articles that might help with my problem. My dd aged 9 has a weight problem in that she is very","messageBody":"<div id=\"ygrps-yiv-1523858038\">Hi<br/>\n   I have a search about to see if I could find any unschooling <br/>\narticles that might help with my problem. My dd aged 9 has a weight <br/>\nproblem in that she is very overweight. She is not a junk food kid, <br/>\nalthough she likes it, she also likes all her veggies etc<br/>\n<br/>\nI find I am unable to let go my control over food. I&#39;m afraid if I <br/>\ndo my dd will balloon to a vast size.  She&#39;s really big already. <br/>\nIt&#39;s not what she eats but how much. Even when she was a baby and <br/>\nbreastfeeding (she was v v long term breastfed) she would suckle til <br/>\nshe was sick! It was overflow. She just doesn&#39;t  seem to know how <br/>\nmuch is enough. She will eat adult portions and then some more food.<br/>\n<br/>\nIt&#39;s not made in to a huge deal but I do give her smaller portions <br/>\nthan us (sometimes she complains cos it&#39;s not fair).  I didn&#39;t <br/>\nalways do this and she would eat a whole adult sized meal, pudding <br/>\nand then want fruit too. I also say if she is hungry she can have <br/>\nunlimited fruit or other filling but low calorie food. Her meals are <br/>\nstill big!<br/>\n<br/>\nShe is very insistent that we have breakfast, lunch, dinner and <br/>\nsupper. If say we get up late she insists she has breakfast then <br/>\nlunch immediately after as it is lunch &#39;time&#39;. For her there is a <br/>\ntime for every meal, she likes knowing when things will be so if the <br/>\ntime is a bit off because we got up late or had dinner late she ends <br/>\nup having 2 meals run together. For her it seems to be a cause of <br/>\nanxiety that she might have 3 meals instead of 4.<br/>\n<br/>\nI&#39;m not really sure how to tackle it. I want to not enforce food <br/>\nrules but I am also very concerned about her weight. Diabetes type 2 <br/>\nruns very strongly in my family so carrying excess weight is a <br/>\nworry. She does have very poor bodily co-ordination as well so <br/>\nexcess weight makes movement more difficult for her. <br/>\n<br/>\nShe went on holiday with my mum and came back 6 pounds heavier this <br/>\nyear. She goes to her dads every weekend, last year she put 7lbs on <br/>\nwhen on holiday with him and then more weight on holiday with my <br/>\nmum. Her dad seems to have managed to stop putting weight on her but <br/>\nmy mum hasn&#39;t.<br/>\n<br/>\nI do talk to dd about weight and health, emphasis on the health. I <br/>\ndon&#39;t talk to her very often as I don&#39;t want to make it in to a huge <br/>\nissue. I think her older sister (aged 19) and my mum might have a go <br/>\nat her about it though.  She doesn&#39;t actually like being heavy. I <br/>\nhave said that she doesn&#39;t have to lose weight as she is a kid and <br/>\ngrowing and to be a healthier weight she just has to stay the weight <br/>\nshe is.<br/>\n<br/>\nI&#39;m sure I&#39;m doing this wrong. My older dd was a normal weight until <br/>\nshe left home and has now ballooned massively. I think it&#39;s my fault <br/>\nas she wouldn&#39;t eat a healthy diet at all (still won&#39;t) and I made <br/>\nit an issue and so did my mum as she gave her all junk food and I <br/>\nsaid it was bad so she now thinks that not eating junk food all the <br/>\ntime is depravation, my fault. I am much more relaxed about food <br/>\nwith my younger one and she has never been faddy.<br/>\n<br/>\nShe is very bright in a reading kind of way but is somehow  a <br/>\nlittle &#39;different&#39;. She has had difficulty understanding social cues <br/>\nand social &#39;rules&#39;. She was aggressive but isn&#39;t any more. Because <br/>\nof her co-ordination difficulties  she finds writing really hard. <br/>\nShe&#39;s an adult level reader, self taught. I sort of feel <br/>\nher &#39;difference&#39; is also connected to her eating but I&#39;m not sure.<br/>\n<br/>\nI&#39;ve never heard her say she is full, ever.<br/>\n<br/>\nAlthough I&#39;ve written a lot here I do try and keep these thoughts of <br/>\nmine away from dd as I worry that it will make her more anxious or <br/>\nfeel bad. All these thoughts go around my head. I do worry a lot I <br/>\nhave to say.<br/>\n<br/>\n                            BWs Elaine (UK)</div>","specialLinks":[]}],"prevTopicId":108755,"nextTopicId":89336}}