{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":8378727,"authorName":"zenmomma *","from":"&quot;zenmomma *&quot; &lt;zenmomma@...&gt;","profile":"zenmomma2kids","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Important people...long.","postDate":"1030331083","msgId":41990,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxMTdpanBrd2dFYWNGMXM1SU8wMDAxZWE1YUBob3RtYWlsLmNvbT4="},"prevInTopic":41986,"nextInTopic":0,"prevInTime":41989,"nextInTime":41991,"topicId":41986,"numMessagesInTopic":0,"msgSnippet":"... ladies have made in my life......I meant to add Mary (Zenmomma) to my previous list, (didn t mean to forget ya Mary, your posts are priceless to me). How","messageBody":"<div id=\"ygrps-yiv-1243807384\"><blockquote><span title=\"ireply\">&gt;&gt;I know the profound changes some of these incredible<br/>\n </span></blockquote>ladies have made in my life......I meant to add Mary (Zenmomma) to my<br/>\nprevious list, (didn&#39;t mean to forget ya Mary, your posts are<br/>\npriceless to me).&gt;&gt;<br/>\n<br/>\nHow sweet. Thanks, Ren<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Anyway, it was sheer curiosity and pondering that made me do it.<br/>\n </span></blockquote>So I typed in my name, Ren and unschooling and guess what? It turned<br/>\nup 514 hits!!&gt;&gt;<br/>\n<br/>\nLOL! I thought I was the only one who did this kind of stuff. &lt;g&gt; If you put <br/>\nin just zenmomma at Google, you get 3 hits. And, I kid you not, the first <br/>\none actually says &quot;...By Neri N on Saturday, October 13, 2001 - 11:47 pm: <br/>\nJust read your post Zenmomma. And I just have to say, I think you are <br/>\nbrilliant ...&quot; ROFLMAO!! That&#39;s one to send to the parents! ;-) Or an <br/>\nex-husband, if I had one.<br/>\n<br/>\nI loved the post you quoted here, Ren.<br/>\n<br/>\nLife is good.<br/>\n~Mary, who needs to read kind posts today because her bunny died this <br/>\nmorning. :-(<br/>\n<br/>\n<br/>\n_________________________________________________________________<br/>\nChat with friends online, try MSN Messenger: <a rel=\"nofollow\" target=\"_blank\" href=\"http://messenger.msn.com\">http://messenger.msn.com</a></div>","specialLinks":[]},{"userId":90564959,"authorName":"gruvystarchild","from":"&quot;gruvystarchild&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Important people...long.","postDate":"1030329760","msgId":41986,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFrYzRqMCtiNnAwQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":41990,"prevInTime":41985,"nextInTime":41987,"topicId":41986,"numMessagesInTopic":0,"msgSnippet":"I was sitting here pondering just how to qualify a person that is important in light of this board. I meandered over to google to see if I could get a","messageBody":"<div id=\"ygrps-yiv-1752655351\">I was sitting here pondering just how to qualify a person that <br/>\nis &quot;important&quot; in light of this board.<br/>\nI meandered over to google to see if I could get a definitive answer.<br/>\nA person not considered important by someone here turned up six <br/>\nhundred some odd hits when the name was typed in with the term <br/>\nunschooling.<br/>\nNot that I need google to tell me how important so many voices here <br/>\nhave been to me. I know the profound changes some of these incredible <br/>\nladies have made in my life......I meant to add Mary (Zenmomma) to my <br/>\nprevious list, (didn&#39;t mean to forget ya Mary, your posts are <br/>\npriceless to me).<br/>\nAnyway, it was sheer curiosity and pondering that made me do it.<br/>\nSo I typed in my name, Ren and unschooling and guess what? It turned <br/>\nup 514 hits!! I was scratching my head, knowing it couldn&#39;t be <br/>\naccurate, and started to scroll down.<br/>\nThe first two were posts I had written at the F.U.N. site some <br/>\nprevious months.....from there on all the hits were bringing up <br/>\nanything with CHILD(REN). LOL!!<br/>\nI was hoping google thought I was important, damn!<br/>\n<br/>\nSo here&#39;s one of the posts I answered to a distressed Mom that wasn&#39;t <br/>\nsure her children would learn anything if she unschooled:<br/>\n<br/>\nRe: concerns about unschooling<br/>\nFrom: Ren<br/>\nDate: 4/7/02<br/>\nTime: 10:24:39 PM<br/>\nRemote Name: 64.12.101.158<br/>\n<br/>\n<br/>\nComments<br/>\nFirst of all, why do you feel it is your responsibility to keep up <br/>\nwith a system that you disagree with? Losing that mindset will be <br/>\nvery beneficial if you are going to truly unschool. I think it is <br/>\nalso detrimental to the joy of today to be worrying about possible <br/>\nfuture disasters. I&#39;m not saying don&#39;t think about and plan for the <br/>\nfuture....I am suggesting that we do what is right and best for today <br/>\nthough. Don&#39;t let possiblities that may never happen rob you of your <br/>\njoyful, wonderful moments today. How could you guarantee those things <br/>\nif your child was in public school? You wouldn&#39;t be able to ensure <br/>\nthey would always be at grade level, or that they&#39;d be alright in the <br/>\nevent of some disaster. I would much rather my child have <br/>\ntheir &quot;self&quot; intact, the strength of knowing who they are, what they <br/>\nlove and learn what they choose outside the realm of some false <br/>\nenvironment in which they will likely encounter bullying, pressure to <br/>\nconform and numerous messages I&#39;d rather they never hear. There are <br/>\nno guarantees for the future in this life. That should not dictate <br/>\nour choice to unschool or not. Do you believe that children are born <br/>\nwith a natural curiosity about their world? That they are driven to <br/>\nlearn and do so joyfully? Believe me when I say that it can continue <br/>\npast the preschool years if you trust your child. <br/>\n<br/>\nI must disagree with the previous answer to you o this point that <br/>\nthere is no best way.... Joy is better than strife, a happy home <br/>\nbetter than a frustrated one, a content child better than a <br/>\ndistressed one, a close, loving bond between parent and child better <br/>\nthan contention. If what you are doing lends itself to these &quot;better&quot; <br/>\nways, then you are headed in the right direction. If not, then please <br/>\nconsider unschooling as the answer. Trusting my children to make <br/>\ntheir own choices has brought amazing results, and much joy to this <br/>\nfamily. It&#39;s us, the parents that must change, that must delve deep <br/>\nwithing to find the strength and discipline to shut up and let go!! <br/>\nChildren are wired to learn, to delve, to BE exactly what they are <br/>\nmeant to. We must learn how to offer without coercing, strew without <br/>\npressure and learn alongside our child without chafing. Not the <br/>\neasiest task for our minds dulled by the institution of ps. There is <br/>\nthis wide world filled with colors, sights, sounds, tastes....just <br/>\nwaiting to be explored. Approach it as a child would, with joy, <br/>\ninterest and eyes wide open. <br/>\n<br/>\nToday, do what brings joy in your life and the future will be very <br/>\nbright indeed. <br/>\n<br/>\nPaint with your bodies, walk in the mud, search for albino squirrels, <br/>\nobserve a flower opening, fly a kite, visit the beach, watch <br/>\ninteresting movies while eating chocolate and popcorn, build a fort, <br/>\ntry to pick up ice cubes with your feet, buy some interesting art <br/>\nsupplies and play around with them, dance to some reggae, lay outside <br/>\nat night and look at the stars... In short, LIVE!! Live life with <br/>\nabandon, with love, joy and zeal. All the learning anyone ever needs <br/>\nwill come out of these honest explorations, really. It&#39;s hard to <br/>\nbelieve until you do it. <br/>\n<br/>\nI highly encourage you visit unschooling.com for dialogue with many, <br/>\nmany unschooling families that are at various stages in this journey. <br/>\nThey will offer much needed support. <br/>\n<br/>\nRen, Unschooler with children ages 12, 8, 4 3/4 and babsy boy at <br/>\n1.....learning all they need to.<br/>\n<br/>\n<br/>\nI thought maybe, in light of the unfair accusations against this <br/>\nlist, this would show Ned what the discussions here are typically <br/>\nabout. Even though this is from another list, it hugely shows the <br/>\nspirit and attitude of the unschooling.com discussion group. <br/>\nIn my ever so humble opinion.<br/>\n<br/>\nRen</div>","specialLinks":[]}],"prevTopicId":41945,"nextTopicId":41998}}