{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] The benefit of being critiqued","postDate":"1478149846","msgId":77574,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI4ODU1ODA2LTJCNDItNEU2OS04MDZDLTNCQkJDRDI3RDlFRkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEY0RjhGRDUwLTlBMDYtNDYzRi05QzBBLTU4NEEwRkUxNTVDMUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEY0RjhGRDUwLTlBMDYtNDYzRi05QzBBLTU4NEEwRkUxNTVDMUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":77573,"nextInTopic":0,"prevInTime":77573,"nextInTime":77575,"topicId":77573,"numMessagesInTopic":0,"msgSnippet":"Wow. Yesterday I cut and pasted a Joyce quote without really looking at it, KNOWING my most recent Joyce-post was about this topic. Yeah, but… it’s the","messageBody":"<div id=\"ygrps-yiv-1675747809\"><html><head></head><div class=\"ygrps-yiv-1675747809ApplePlainTextBody\">Wow. &nbsp;Yesterday I cut and pasted a Joyce quote without really looking at it, KNOWING my most recent Joyce-post was about this topic. &nbsp;<br>Yeah, but… it’s the November 3 post. :-)<br><br>Text of it:<br><br>&quot;There are loads of places I can go to get people to agree with the standard mode of thought. Why would I want more of that? I&#39;m not looking for approval of what I do. I&#39;m looking for people who will stretch my thinking and help me grow.&quot;<br>—Joyce Fetteroll<br><br>Maybe some of you read something useful in the other quote(s), and maybe some of you thought I was confused or cryptic. &nbsp;It was confused. :-)<br><br>Sandra</div></html></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"The benefit of being critiqued","postDate":"1478109166","msgId":77573,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY0RjhGRDUwLTlBMDYtNDYzRi05QzBBLTU4NEEwRkUxNTVDMUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":77574,"prevInTime":77572,"nextInTime":77574,"topicId":77573,"numMessagesInTopic":0,"msgSnippet":"Holly and I had a long conversation the other day about the misunderstandings about unschooling, and the resistance, and arguments.  I used karate and ballet","messageBody":"<div id=\"ygrps-yiv-2075409792\">Holly and I had a long conversation the other day about the misunderstandings about unschooling, and the resistance, and arguments.  I used karate and ballet as examples of things that DO  need instruction.  Holly said that unschooling might be that way, because what they all have in common is that the people get feedback, and coaching to do it better and more safely.<br/>\n<br/>\nWhile looking for quotable examples of people using the phrase “shoved down his throat” or “crammed down their throats,” for my page on phrases to hear and avoid, I found something Shan Burton wrote when she was newer to the discussions.  It fits not only what Holly said, but something of Joyce’s that I quoted on Just Add Light the other day (which Joyce wrote in and about another discussion, but it applies here as well!):<br/>\n___________________<br/>\n<br/>\nJoyce wrote:<br/>\n&quot;He can feel you hovering over him waiting for him to do something that will calm your fears.&quot;<br/>\n<br/>\nSandra adds:<br/>\nYour children know when you&#39;re anxious or nervous. Don&#39;t think you&#39;re sneaking up on them. It&#39;s important to relax, not just to pretend to be relaxed. <br/>\n<br/>\nClick to see Susan Gaissert’s sneaky hovering cat, and for a link to the original Joyce-writing, but come back to read Shan’s list.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://justaddlightandstir.blogspot.com/2016/10/your-kids-know.html\">http://justaddlightandstir.blogspot.com/2016/10/your-kids-know.html</a><br/>\n___________________<br/>\n<br/>\nShan’s post:<br/>\n<br/>\nI am very very new here, but there are a few things I know for sure, already.<br/>\n<br/>\n1.  It is Sandra&#39;s list.  So she decides purpose and direction and tone.<br/>\n<br/>\n2.  I *love* the purpose and direction and tone.  I&#39;ve always felt out of sync with my real-life world.  People here say things I&#39;ve thought, and things I&#39;ve been laughed at elsewhere for saying, although they weren&#39;t intended to be funny.  That&#39;s refreshing to me - not rude.<br/>\n<br/>\n3.  It is hard to learn anything if your thoughts are rigid and your mind is closed.<br/>\n<br/>\n4.  Offense is not given where none is taken.  (I borrowed that from the Vulcans)  Monty python phrased it differently - if you&#39;re one of those who is easily offended (especially by the ring of truth)....don&#39;t post.  <br/>\n<br/>\n5. Honesty is high currency here.<br/>\n<br/>\n6.  Anyone willing to lay ego aside before they touch the keyboard, to embrace the stated fact that the discussion is about ideas and not people, will feel courtesy and respect here.  If (as the tone of the masked poster suggests) someone comes along wanting to convince others to live by a prescribed path simply because it suits them, I imagine they&#39;ll receive a different type of reception.<br/>\n<br/>\n7.  The honest advice I&#39;ve read without posting has been as valuable as the answers to my posts.  Unwanted diatribes about the general wrongdoings of the group as a whole, seem to have no intrinsic worth in my life.<br/>\n<br/>\n8.  I don&#39;t care to be lumped in anyone else&#39;s &quot;we&quot; without first giving my consent.<br/>\n<br/>\n9.  The world would certainly be more pleasant if no one tried to force their ideaology down the throats of everyone they encounter....even literal virtual strangers minding their business in what is intended to be a peaceful forum.<br/>\n<br/>\nOff my soapbox, and thanks for listening! =)<br/>\nshan  <br/>\n____________________________<br/>\n<br/>\nI smiled at “literal virtual strangers…” <br/>\nShan was responding to someone who jumped the group for not being “NVC” (following non-violent communication “rules”).<br/>\n<br/>\nIt’s been a busy season in my head, and out.  <br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":10270,"nextTopicId":77575}}