{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":550068917,"authorName":"Catherine Hassall","from":"Catherine Hassall &lt;cat@...&gt;","profile":"caterinasenang","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Childcare","postDate":"1424156142","msgId":75665,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFQTNERjVFLTIyREQtNEZBMC1CMTM1LTA1Q0IxMjQ3RUNBRUB0aGVhdHJlb2ZleGNoYW5nZXMuYml6Pg=="},"prevInTopic":75649,"nextInTopic":0,"prevInTime":75664,"nextInTime":75666,"topicId":75619,"numMessagesInTopic":0,"msgSnippet":"We have also had very positive experiences with au pairs . There is a Helpx website for travellers which is similar to Woofing (Workers On Organic Farms)","messageBody":"<div id=\"ygrps-yiv-223509524\">We have also had very positive experiences with &#39;au pairs&#39;.<br/>\n<br/>\nThere is a &#39;Helpx&#39; website for travellers which is similar to &#39;Woofing&#39; (Workers On Organic Farms) except not limited to farms but can be for any traveller who wants to live with a family and work in exchange for board and food.<br/>\n<br/>\nA couple of years ago my partner and I needed to work together 9-5 for the first time since our children were born - normally we have worked separately or in a way that could include the children but now we needed to be together in the theatre and too difficult to integrate the children; with no family living nearby.  <br/>\n<br/>\nWe have had another two of these situations since then (and one more coming up next month) plus we have invited some travellers to stay with us on 2 other occasions just for some extra help (Helpxers can work on cleaning and gardening so we have them in to help with the general load even when we were not both out of the house).<br/>\n<br/>\n These experiences have been full of learning - about people from other places, different languages: one woman was a dancer and focused on that with the children, another was into film, two were French (my daughter loves everything French so I sought them out specifically).  Very enriching actually as each one has offered their own specialities or remembered fun things from their own childhood etc.  <br/>\n<br/>\nSometimes it has been a bit challenging for them to understand the flexibility and organic nature of unschooling (or difficult for them to say YES!) - this has been French and German travellers where I think (!)  bedtimes and rules generally are expected for children.  The one who had the most trouble was someone who had actually worked in childcare - the others were receptive to a new way of thinking about children.<br/>\n<br/>\nOne woman -  the dancer - is returning next month to spend time with the children while we work on a project.  They are all looking fwd to it!  My partner is 65 and I am 47 and with no family around, these younger people also fill a gap in terms of a generational age range that is mostly missing from our lives - they have mostly been very playful!<br/>\n<br/>\nAnd for the travellers - well it is good for them too: they stay with an Australian family and can improve their English and save their money for other things.  We have also paid some cash on top of board when we were working and the au pair had bigger responsibilities.  <br/>\n<br/>\nall the best<br/>\ncatherine</div>","specialLinks":[]},{"userId":185116140,"authorName":"Janice Ancheta","from":"Janice Ancheta &lt;janice_casamina@...&gt;","profile":"janice_casamina","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Childcare","postDate":"1424110252","msgId":75649,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4QUJEQjIyLTc0NEQtNEU0Ny1CRUFDLUJEMTA1Q0E5OUMyNkB5YWhvby5jb20+","inReplyToHeader":"PDI0NkE2RkZFLTQxMzQtNEI3OC05MkU5LUVDMDg5REEwRTc0RkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PENBTURhX0owNm5rclhZTENORm0rYXFUPWYwc2lmR3JaQ2lIVkc9UVVfK24wbV9CaTJId0BtYWlsLmdtYWlsLmNvbT4gPENBTURhX0oxWD02PWZNTWlycXBKZW90WmtubUtWTmpvUlYzMmtwLWVWeitpQjdKdlc4UUBtYWlsLmdtYWlsLmNvbT4gPDI0NkE2RkZFLTQxMzQtNEI3OC05MkU5LUVDMDg5REEwRTc0RkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":75620,"nextInTopic":75665,"prevInTime":75648,"nextInTime":75650,"topicId":75619,"numMessagesInTopic":0,"msgSnippet":"Caroline, We have hosted au pairs in our home for the last four years. The au pair we are hosting now has been by far the best helper weÆve ever had. And we","messageBody":"<div id=\"ygrps-yiv-783983825\"><html><head></head><div>Caroline,</div><div><br></div><div>We have hosted au pairs in our home for the last four years. The au pair we are hosting now has been by far the best helper we’ve ever had. And we have had several highly-recommended nannies in the past (when my husband and I were both working 80+ hour weeks, before unschooling). We live in the United States and have hosted two au pairs from Colombia.</div><div><br></div><div>The age ranges you stated are fine. For those that don’t know (at least where I live - individual countries may differ), au pairs are women or men ages 18-26 who come from another country and live in your home. In exchange for room and board and a stipend, they help care for our children (usually 45 hours per week). A lot depends on the individual person that you choose to help you more than her status as a nanny or au pair, but I will try to point out some general differences that I’ve noticed.</div><div><br></div><div>Compared to a nanny or babysitter, the au pair is more motivated to be a part of your family. She is more likely to be accepting of parenting practices that are different from what she experienced - I mean, she supposedly came to your country to learn a new culture. My au pairs from Colombia say that the over-scheduling and control of things like food &nbsp;that we see here are not nearly as prevalent where they’re from. Au pairs also cost a lot less money than nannies. My au pair cares for our children when we are both working, but she also hangs out with the whole family so that she can really learn how we function. She also reads unschooling articles. I might have a harder time paying a nanny $15-20 or more per hour to hang out and read.</div><div><br></div><div>I treat my au pair like my little sister, and she takes care of my children as if she were their aunty. I have learned to apply unschooling principles to my relationship with our au pair, and that really supports her as she learns different ways of interacting with children.</div><div><br></div><div>There are downsides, and there definitely are horror stories. Also, au pairs are not supposed to do housework for the family. She can prepare and clean up meals for the kids, do kids’ laundry, and pick up toys. But she cannot clean your bathroom or be expected to do the entire kitchen clean-up.</div><div><br></div><div>I hope this helps.</div><div><br></div><div>Janice</div><div><br></div><div><br></div><br><div><div>On Feb 15, 2015, at 1:44 PM, Sandra Dodd <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a> [AlwaysLearning] &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>&gt; wrote:</div><br class=\"ygrps-yiv-783983825Apple-interchange-newline\"><blockquote><span title=\"qreply\"> <blockquote type=\"cite\"><div style=\"font-family:Helvetica;font-size:12px;font-style:normal;font-variant:normal;font-weight:normal;letter-spacing:normal;line-height:normal;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;background-color:rgb(255, 255, 255);\"><div id=\"ygrps-yiv-783983825ygrp-mlmsg\" style=\"font-size:13px;font-family:Arial, helvetica, clean, sans-serif;\"><div id=\"ygrps-yiv-783983825ygrp-msg\" style=\"line-height:1.22em;\"><div id=\"ygrps-yiv-783983825ygrp-text\" style=\"line-height:1.22em;font-family:Georgia;\"><p style=\"line-height:1.22em;margin:0px 0px 1em;\">If you have daycare help (relative, hired house-mate) who understands unschooling and won&#39;t undermine the plans, that could work. If you figure out how many hours in the week you would still have to be with your child (separate the idea of &quot;school hours&quot; from all of these considerations), you might relax.<br style=\"line-height:1.22em;\"><br style=\"line-height:1.22em;\">But the helper can&#39;t be the one who is providing home education, not in most jurisdictions. That might or might not matter. Where I live it must be the parent or guardian registering to homeschool a child. So seeing it as childcare, and figuring out ways to describe and document learning that happens/happened with you and your husband there will help you to feel confident and to share that confidence if you have dealings with authorities.</p></div><div style=\"line-height:1.22em;color:rgb(255, 255, 255);height:0px;\"></div></div></div></div></blockquote></span></blockquote></div><br></html></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Childcare","postDate":"1424036655","msgId":75620,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI0NkE2RkZFLTQxMzQtNEI3OC05MkU5LUVDMDg5REEwRTc0RkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBTURhX0oxWD02PWZNTWlycXBKZW90WmtubUtWTmpvUlYzMmtwLWVWeitpQjdKdlc4UUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBTURhX0owNm5rclhZTENORm0rYXFUPWYwc2lmR3JaQ2lIVkc9UVVfK24wbV9CaTJId0BtYWlsLmdtYWlsLmNvbT4gPENBTURhX0oxWD02PWZNTWlycXBKZW90WmtubUtWTmpvUlYzMmtwLWVWeitpQjdKdlc4UUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":75619,"nextInTopic":75649,"prevInTime":75619,"nextInTime":75621,"topicId":75619,"numMessagesInTopic":0,"msgSnippet":"If you have daycare help (relative, hired house-mate) who understands unschooling and won t undermine the plans, that could work.  If you figure out how many","messageBody":"<div id=\"ygrps-yiv-1729489765\">If you have daycare help (relative, hired house-mate) who understands unschooling and won&#39;t undermine the plans, that could work.  If you figure out how many hours in the week you would still have to be with your child (separate the idea of &quot;school hours&quot; from all of these considerations), you might relax.<br/>\n<br/>\nBut the helper can&#39;t be the one who is providing home education, not in most jurisdictions.  That might or might not matter.  Where I live it must be the parent or guardian registering to homeschool a child.   So seeing it as childcare, and figuring out ways to describe and document learning that happens/happened with you and your husband there will help you to feel confident and to share that confidence if you have dealings with authorities.</div>","specialLinks":[]},{"userId":326479635,"authorName":"Caroline Gallear","from":"Caroline Gallear &lt;carolinegallear@...&gt;","profile":"caroline.gallear","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Childcare","postDate":"1424031573","msgId":75619,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTURhX0oxWD02PWZNTWlycXBKZW90WmtubUtWTmpvUlYzMmtwLWVWeitpQjdKdlc4UUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PENBTURhX0owNm5rclhZTENORm0rYXFUPWYwc2lmR3JaQ2lIVkc9UVVfK24wbV9CaTJId0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBTURhX0owNm5rclhZTENORm0rYXFUPWYwc2lmR3JaQ2lIVkc9UVVfK24wbV9CaTJId0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":75620,"prevInTime":75618,"nextInTime":75620,"topicId":75619,"numMessagesInTopic":0,"msgSnippet":"My husband and I are looking at the future and thinking about when I will need to go back to work.  We re thinking this will probably be in a few years time,","messageBody":"<div id=\"ygrps-yiv-589105171\"><p dir=\"ltr\">My husband and I are looking at the future and thinking about when I will need to go back to work.  We&#39;re thinking this will probably be in a few years time, when the children are about 12, 10 and 5.</p>\n<p dir=\"ltr\">One solution we thought of was an au pair. Has anyone had an au pair to help look after their children? Would 12 be considered too old for them to look after?  Or do you have any better ideas?! We haven&#39;t much family nearby and my husband will have to keep working full time too, though hopefully with a bit more flexibility. </p>\n<p dir=\"ltr\">Thanks for any input. </p>\n<p dir=\"ltr\">Caroline. <br>\nHampshire, UK. </p></div>","specialLinks":[]}],"prevTopicId":75632,"nextTopicId":75607}}