{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":111436570,"authorName":"lurningathome@aol.com","from":"lurningathome@...","profile":"tolearnwithfreedom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"(no subject)","postDate":"1043942399","msgId":12058,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFjLjM3OWY1NGUxLjJiNmFhNWZmQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":12057,"nextInTime":12059,"topicId":12058,"numMessagesInTopic":0,"msgSnippet":"Found at: http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=30692 Time for public schools to throw in the towel? Posted: January 27, 2003 1:00 a.m.","messageBody":"<div id=\"ygrps-yiv-940193511\">Found at:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=30692\">http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=30692</a><br/>\n<br/>\nTime for public schools to throw in the towel?<br/>\n<br/>\nPosted: January 27, 2003<br/>\n1:00 a.m. Eastern<br/>\n<br/>\nBy Dr. Laura Schlessinger<br/>\n<br/>\n© 2003 WorldNetDaily.com<br/>\nI&#39;ve been collecting clips about schools and teachers around the country <br/>\nfor the last year, and I have to tell you that I genuinely fear for the <br/>\nrepublic. I say that because, for us &quot;old folks&quot; who were actually taught <br/>\nAmerican History in school, a thriving democracy depends upon universal <br/>\neducation – an education that prepares the citizens of a nation to govern <br/>\nthemselves through their elected representatives. (Of course, it was the <br/>\npresumption of the framers of the Constitution that if one attended school, <br/>\none could be counted on to emerge educated!)<br/>\n<br/>\nIs it really because they don&#39;t care that so many Americans don&#39;t vote? Or <br/>\nis it because they can&#39;t read the ballot? We tend to blame lackluster <br/>\npoliticians or negative campaigning for low turnout at the polls. But what <br/>\nif the real reason is that most of our citizens are not sufficiently <br/>\neducated about the basic concepts of democracy to understand the issues – <br/>\neven those that directly impact their self interest? And what if that <br/>\nignorance is compounded by illiteracy?<br/>\n<br/>\nLast fall, the Center for Civic Information at the Manhattan Institute <br/>\npublished the report of a telephone survey of over 1,000 fourth- and <br/>\neighth-grade teachers. Among the not so surprising findings was that only <br/>\nabout 25 percent of those surveyed said they most cared about whether a <br/>\nstudent got the right answers. More of them most cared that students tried <br/>\nhard or used a creative approach.<br/>\n<br/>\nThat absurd state of affairs has come about because this generation of <br/>\nteachers, and probably a few generations before, have themselves been <br/>\nraised to believe there are no right answers, anyway. So what difference <br/>\ndoes it make?<br/>\n<br/>\nFor example, our public-school children hear that the Founding Fathers are <br/>\nnot to be revered. They were greedy, patriarchal oppressors who were in it <br/>\nfor the money and the power. America is not a noble experiment in freedom <br/>\nand equality. That was the cover story, as we stole the land from the <br/>\nindigenous people. America wasn&#39;t recently attacked by terrorists. America <br/>\nis the terrorist!<br/>\n<br/>\nFurthermore, there are no such things as great books, since all the books <br/>\nwe were misguided enough to think of as great, were written by those same <br/>\nold white male misogynists from the evil empire of Western culture. What&#39;s <br/>\njust as great is any diary written by any woman, slave or Native American <br/>\nand recently discovered in someone&#39;s trunk. And woe to anyone who disagrees.<br/>\n<br/>\nOf course, none of it matters anyway, because language itself is fatally <br/>\ntainted, and words don&#39;t mean anything. They only mean what my <br/>\nidiosyncratic point of view believes they mean. Just ask the <br/>\ndeconstructionists.<br/>\n<br/>\nThose deconstructionists have been very busy, because they didn&#39;t stop with <br/>\nthe English language. They have also pretty successfully deconstructed <br/>\nfamily, religion, values, ethics and morality as well. We all know that, if <br/>\nthere can be no right answers, there obviously is no right and wrong. No <br/>\none&#39;s behavior can be judged because the most heinous acts can be excused <br/>\non the basis of what the perpetrator may have suffered at the hands of his <br/>\nparents, the police, the inequitable society. Yada, yada, yada.<br/>\n<br/>\nThis leads inevitably to &quot;understanding&quot; that immigrant children shouldn&#39;t <br/>\nbe penalized in school because English is not their first language. And <br/>\nwhat&#39;s so great about patriarchal, oppressive, English anyway? Embrace over <br/>\n100 languages in the classroom (as we do in the Los Angeles School <br/>\nDistrict) so that no one learns anything – least of all the immigrant <br/>\nchildren who are one day going to grow up as Americans and not even <br/>\nunderstand what that means, let alone what it requires of them or entitles <br/>\nthem to.<br/>\n<br/>\nGod is dead (although the Wiccan goddess still has a fighting chance, I <br/>\nguess) – traditional morality is destructive; excellence is discredited and <br/>\ndevalued; grades are antiquated. Discipline is discriminatory because <br/>\nthere&#39;s no such thing as bad behavior, just children with &quot;special needs.&quot;<br/>\n<br/>\nNo wonder teachers are trying to find ways to make their work meaningful, <br/>\nsince accomplishment and achievement can no longer be benchmarks of <br/>\nsuccess. After all, the unaccomplished and underachievers in the class are <br/>\nlikely to feel bad. Worse, their parents might sue for cruel and unusual <br/>\npunishment.<br/>\n<br/>\nFor a few years now, I&#39;ve been urging parents to send their kids to private <br/>\nreligious schools and/or homeschool them. I truly see no other options for <br/>\nraising and educating children to be morally fit, well informed, <br/>\nappreciative Americans and contributing members of society.<br/>\n<br/>\nA shortage of teachers, a kaleidoscope of standards, endemic failure, <br/>\nannual budget shortfalls, states taking over local school districts and <br/>\nguns in the classroom are unavoidable signs of public-school collapse. I <br/>\nthink Oregon may have the right idea. They are looking to shorten the <br/>\nschool year by 15 days. How long before it&#39;s clear to them and to us, that <br/>\nwe should simply close them altogether?<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":12035,"nextTopicId":12049}}