{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] FW: oh! thats the answer...silly me","postDate":"1045230146","msgId":58689,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBNzI1QzcyLjEzRTcxJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDFkZC4yOTU3NTVhLjJiN2Q4NzQ2QGFvbC5jb20+"},"prevInTopic":58629,"nextInTopic":0,"prevInTime":58688,"nextInTime":58690,"topicId":58629,"numMessagesInTopic":0,"msgSnippet":"... This point has been addressed by others but it s an important point. Our children are *both* a product of their genes and a product of our parenting.","messageBody":"<div id=\"ygrps-yiv-84013956\">on 2/13/03 6:41 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:encadia@...\">encadia@...</a> at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:encadia@...\">encadia@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I also, have a child with special needs, and with your education, I expected<br/>\n&gt; much more from you. And no, its not always gentic or learned by modeling.<br/>\n<br/>\n </span></blockquote>This point has been addressed by others but it&#39;s an important point.<br/>\n<br/>\nOur children are *both* a product of their genes and a product of our<br/>\nparenting. Having a special need to point to as a cause of behavior should<br/>\nnot stop a parent from being aware of the effect the parent has on the<br/>\nchild. That doesn&#39;t mean that perfect parenting turns all children into<br/>\nperfect children. But it does mean that we are responsible for helping or<br/>\nhindering them learning how to cope with their needs.<br/>\n<br/>\nIn fact the women people most turn to for advice about special needs<br/>\nchildren at Unschooling.com seem to be the *most* self aware of the part<br/>\nthey play in how their children handle life. They are *the* most willing to<br/>\nexamine their own behavior. They are *the* most willing to put their<br/>\nchildren&#39;s needs first and set aside their own emotional reactions their<br/>\nchildren&#39;s expressions of their needs.<br/>\n<br/>\nThe problem *isn&#39;t* the broken game controlers or the broken chairs or the<br/>\nbroken doors. If a parent sees that as the problem then she *is* part of the<br/>\nproblem. And if that same parent comes here and repeatedly throws adult<br/>\ntemper tantrums when she&#39;s asked to examine what part she may be playing in<br/>\nwhat&#39;s going on at home then she&#39;s demonstrating an unwillingness to self<br/>\nexamine.<br/>\n<br/>\nThe problem *is* the child not having an emotional awareness and the skills<br/>\nto handle strong emotions. If that same parent says:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; This destructive behavior usually happens so fast, we<br/>\n&gt;&gt; cant stop it.  To &quot;channel&quot; thier aggression elsewhere would require CONSTANT<br/>\n&gt;&gt; supervision., which seems unreasonable for kids thier age..( and really,<br/>\n&gt;&gt; impossible) <br/>\n<br/>\n </span></blockquote>she&#39;s reinforcing barriers between her kids and help she could be providing<br/>\nfor them.<br/>\n<br/>\nAnyone who has read Sandra&#39;s advice for a while knows that Kirby had a big<br/>\ntemper when he was younger. They have also read how she focused on him and<br/>\nhis needs and helped him acquire the skills he needed to help himself.<br/>\nHere&#39;s something she wrote last year:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Kirby was younger when he had such temper problems, but his dad or I would<br/>\n&gt; get at his level and say &quot;BREATHE,&quot; and we would breathe with him.  If he<br/>\n&gt; refused to breathe to calm down, we&#39;d remind him that if he breathed deeply<br/>\n&gt; he would feel better.  &quot;Get air to your toes.  Breathe.&quot;<br/>\n&gt; <br/>\n&gt; Usually he would.  If he couldn&#39;t or wouldn&#39;t we would carry him away from<br/>\n&gt; the group and sit with him or put him in a car or in his room, and probably<br/>\n&gt; stay with him, unless we were losing our tempers too and then we&#39;d just stay<br/>\n&gt; near.   <br/>\n<br/>\n </span></blockquote>I&#39;ve met Anne&#39;s and Mary&#39;s and Sandra&#39;s kids. They are all delightful<br/>\npeople. (The moms too :-) It seems to me that if my child had turned my<br/>\nhouse into a &quot;war zone&quot; I wouldn&#39;t be so quick to attack advice from people<br/>\nwhose children have or had issues and who are now dealing joyfully with<br/>\nlife. And I might want to *especially* examine the advice that made me mad<br/>\nbecause that&#39;s a good indication that it&#39;s hitting uncomfortably close to<br/>\nsomething I&#39;m avoiding examining. Being defensive is a good indication that<br/>\nwe&#39;re trying to find some external cause in order to avoid examining what<br/>\npart we&#39;re playing in the situation. It&#39;s a lot easier to point the blame<br/>\nelsewhere. That way we can absolve ourselves of responsibility.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":132800757,"authorName":"encadia@aol.com","from":"encadia@...","profile":"lasvegashillgirl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"FW: oh! thats the answer...silly me","postDate":"1045179718","msgId":58629,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkZC4yOTU3NTVhLjJiN2Q4NzQ2QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":58689,"prevInTime":58628,"nextInTime":58630,"topicId":58629,"numMessagesInTopic":0,"msgSnippet":"... Teresa,  has gotten alot of postive response from this group, and Sandra, you have to come off like this? I also, have a child with special needs, and with","messageBody":"<div id=\"ygrps-yiv-4223769\"><blockquote><span title=\"ireply\">&gt; &lt;&lt; Then he gets upset and angry or sad.. he feels like &quot;nothing <br/>\n&gt; works for him&quot;  , like everyone and everything is against him.   &gt;&gt;<br/>\n&gt; <br/>\n&gt; Maybe it&#39;s genetic?<br/>\n&gt; Maybe if you or his dad are that way he has it either genetically or by <br/>\n&gt; modelling.<br/>\n<br/>\n </span></blockquote> Teresa,  has gotten alot of postive<br/>\nresponse from this group, and Sandra, you have to come off like this? <br/>\nI also, have a child with special needs, and with your education, I expected <br/>\nmuch more from you. And no, its not always gentic or learned by modeling.<br/>\n<br/>\nIts very apparent that You have absolutely no clue of parenting a child with <br/>\nspecial needs, much less commenting in regards to it. <br/>\nThe best way I have ever seen or practiced changing children&#39;s behavior is <br/>\n<blockquote><span title=\"ireply\"> &gt; for me to be the way I want them to be.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n </span></blockquote>This is fantastic approach again from someone<br/>\nwith out a special needs child. But only a fantasy<br/>\nfrom a parent with a challenged child.<br/>\n<br/>\nThank you Sandra for your kind and wonderful advice.  I will definitely stop <br/>\nthrowing temper tantrums around here.. Gosh, I&#39;ve broken 5 sewing machines, 3 <br/>\n<br/>\nmicrowaves,  and 3 mixers in just the past 6 months.. I also wrecked my car <br/>\nand punched out my window.   I attacked my husband and tried to choke him, <br/>\nthen I kicked him in the groin last night.  I yelled at my kids and called <br/>\nthem no-good fuckers and said they were worthless and they ruined my life. .  <br/>\n<br/>\nJust a few days ago the bread I was making didnt turn out right so I trashed <br/>\nthe whole god damned oven.  Do  you think, when I couldnt get my on loan lap <br/>\ntop from school   to come on and I smashed it to the floor and stomped on it, <br/>\n<br/>\ncould that have been a bad example?  You know, I never realized how my <br/>\nbehavior could affect my kids .  What an insight.. So, do you think, if I <br/>\nstop behaving like this, my sons will stop too??   Maybe its worth a try.   <br/>\nYou know, I really thought you didnt like me, how paranoid of me..  I really <br/>\nneed to work on not being so schizo and afraid that folks are against me.   <br/>\n<br/>\nIf it works in Doddville, it MUST work here too.. Thanks again<br/>\n<br/>\nYep, it must be nice in Doddville!!<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":58670,"nextTopicId":58695}}