{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":87734814,"authorName":"Priscilla Martinez","from":"Priscilla Martinez &lt;ummhjm@...&gt;","profile":"ummhjm","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Privileges","postDate":"1085514673","msgId":94709,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNTI1MTk1MTEzLjI2MzExLnFtYWlsQHdlYjIwMjAxLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDQ4LjJjM2YxZDhmLjJkZTRlMDFjQGFvbC5jb20+"},"prevInTopic":94695,"nextInTopic":0,"prevInTime":94708,"nextInTime":94710,"topicId":94690,"numMessagesInTopic":0,"msgSnippet":"... although sandra s use of ebb and flow in this post is in a particular context, i d like to comment that it s a good way to describe many (if not all)","messageBody":"<div id=\"ygrps-yiv-526685923\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I don&#39;t know if it&#39;s privelege or trust or ebb and flow &gt;&gt;or long leash or what.<br/>\n<br/>\n&gt;&gt;Sandra<br/>\n<br/>\n </span></blockquote>although sandra&#39;s use of &quot;ebb and flow&quot; in this post is in a particular context, i&#39;d like to comment that it&#39;s a good way to describe many (if not all) aspects of parenting.  it&#39;s an important concept to keep in mind when they&#39;re babies -- for example, when concerned about if their nutrition is well-rounded, the truth with my kids has been that it ebbs and flows on a daily, even weekly basis -- but &quot;in the end&quot; (!), yes it&#39;s well-rounded.  in terms of unschooling for me, as i made the transition a few months ago, i was plagued by the workbook-monster whispering doubts in my ears about whether my kids are &quot;doing enough.&quot;  i&#39;ll admit i&#39;m no veteran, but i&#39;ve grown by leaps and bounds since then (compared to light-years that i have to go to have lived the wisdom some of you have!).  in any case, the workbook-monster is quite dead now, and i&#39;m left with days we&#39;ll make popcorn and watch movies together and days we garden together and days i hardly see them even though we&#39;re in the same<br/>\n house!  so, even what we do ebbs and flows, but i strive to remember that it will &quot;ebb and flow&quot; and that &quot;in the end&quot; (!) we&#39;re doing great!  and we get to relax and enjoy each other.<br/>\n<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nFriends.  Fun. Try the all-new Yahoo! Messenger<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Privileges (was wallpaper peelers)","postDate":"1085507100","msgId":94695,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4LjJjM2YxZDhmLjJkZTRlMDFjQGFvbC5jb20+"},"prevInTopic":94690,"nextInTopic":94709,"prevInTime":94694,"nextInTime":94696,"topicId":94690,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/25/04 11:37:02 AM, danielle.conger@comcast.net writes: ","messageBody":"<div id=\"ygrps-yiv-275019047\">In a message dated 5/25/04 11:37:02 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:danielle.conger@...\">danielle.conger@...</a> writes:<br/>\n<br/>\n&lt;&lt; But, I do believe that there are such things as &quot;privilege&quot; and<br/>\n<br/>\n&quot;responsibility&quot; that can be used in the absence of this kind of behavior<br/>\n<br/>\ntraining. Maybe they can&#39;t be; maybe we need different words altogether, I<br/>\n<br/>\ndon&#39;t know. I guess that&#39;s what I&#39;m wanting to explore here. I think there<br/>\n<br/>\nis a balance to be struck between a knee-jerk revoking of privileges and a<br/>\n<br/>\ncareful explanation and exploration of what &quot;privilege&quot; means. &gt;&gt;<br/>\n<br/>\nI agree that there is the &quot;I awarded you a privilege&quot; (like a furlough for <br/>\ndoing best in basic training or some such) and the leeway/freedom parents allow <br/>\na child to have because they just trust him.<br/>\n<br/>\nAll our kids have the privilege of getting into our cash and getting what <br/>\nthey need.  They ask first if we&#39;re there to ask.  None of them has ever abused <br/>\nit.  They bring us change when they use our money.  They tell us what they <br/>\nspent.  If Holly says &quot;Can I have my allowance?&quot; I might say &quot;get it out of Ke<br/>\nith&#39;s wallet,&quot; or &quot;here&#39;s $5 and get the rest out of my change cup.&quot;<br/>\n<br/>\nLast night Marty came and said &quot;I&#39;m going with Ryan to play games at <br/>\n[somebody&#39;s house I don&#39;t know].&quot;   I didn&#39;t quibble about the fact that he hadn&#39;t <br/>\nasked me, he was just telling me.  We both knew his evening was free.  He must <br/>\nREALLY have wanted to go, since he was turning off a new and exciting online <br/>\nvideo game to go, and Ryan&#39;s just lately back from college for summer so they&#39;re <br/>\nexcited to hang out with him.  And Kirby wasn&#39;t going, just Marty!  (Kirby was <br/>\nstill at karate and needed to work the next morning.)<br/>\n<br/>\nI asked who the guy was whose house they were going to, and whether Ryan had <br/>\nthe same cellphone number I have on file.  Satisfied with the answers, I said <br/>\n&quot;Okay.&quot;  Gave him $5 for a burger.  Was happy to see him go so merrily away.<br/>\n<br/>\nI don&#39;t know if it&#39;s privelege or trust or ebb and flow or long leash or what.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":164542605,"authorName":"Danielle Conger","from":"&quot;Danielle Conger&quot; &lt;danielle.conger@...&gt;","profile":"danielleconger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Privileges (was wallpaper peelers)","postDate":"1085503823","msgId":94690,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA2MjMwMWM0NDI3OCQ2MDMwM2ZhMCQ2NDAxYThjMEBNT0xFMjY5MDA+","referencesHeader":"PE5LRUlKSEVMTVBCQ1BFUE5CR0pER0VKS0dEQUEubGVnd2F0Y2hAcmVsaWFibGVhbnN3ZXJzLmNvbT4gPDAwMDMwMWM0NDI2YyQ0NDRmZDQwMCQ2NzRjZGUxOEBhb2xkc2wubmV0Pg=="},"prevInTopic":0,"nextInTopic":94695,"prevInTime":94689,"nextInTime":94691,"topicId":94690,"numMessagesInTopic":0,"msgSnippet":"Dawn wrote:  My daughter s been using scissors since she was two. And half the time it s been my big sewing scissors when we couldn t find her little ones. I m","messageBody":"<div id=\"ygrps-yiv-2127204584\">Dawn wrote:  My daughter&#39;s been using scissors since she was two. And half<br/>\nthe time it&#39;s been my big sewing scissors when we couldn&#39;t find her little<br/>\nones. I&#39;m not sure what to think of privlidges. To me they sound like<br/>\nsomething you dangle over a kids head for good behaviour, too much like<br/>\nrewards. I can&#39;t fit privledges into the context of my life right now. My<br/>\ndaughter has scissors privlidges I guess but simply because she went and<br/>\nused them, not because I deemed she was ready. My two year old has outlet<br/>\nprivledges but simply because he went and learned how to plug stuff in not<br/>\nbecause I deemed him mature enough. I suppose the difference may be that I<br/>\nwatch my kids take on new responsibilities and &#39;priviledges&#39; as they<br/>\nthemselves decide they&#39;re ready and able and you prefer to issue them as you<br/>\nsee them conform to your idea of maturity?<br/>\n=================<br/>\n<br/>\nI&#39;d like to riff on privileges a bit, since I used that word in my post as<br/>\nwell and would like to hear what folks here have to say about it.<br/>\n<br/>\nI agree with the sentiment Dawn&#39;s expressing above, but I think that there<br/>\nare different ways of using the word &quot;privilege.&quot; Sometimes privileges are<br/>\nused as rewards for conforming to expected behaviors, which is what Dawn&#39;s<br/>\nbalking at, I think--and I do, too when those expectations are knee-jerk and<br/>\nunexamined. But, I do believe that there are such things as &quot;privilege&quot; and<br/>\n&quot;responsibility&quot; that can be used in the absence of this kind of behavior<br/>\ntraining. Maybe they can&#39;t be; maybe we need different words altogether, I<br/>\ndon&#39;t know. I guess that&#39;s what I&#39;m wanting to explore here. I think there<br/>\nis a balance to be struck between a knee-jerk revoking of privileges and a<br/>\ncareful explanation and exploration of what &quot;privilege&quot; means. Does that<br/>\nmake sense?<br/>\n<br/>\nSome practical examples:<br/>\n I think that the privilege of using scissors or a knife comes with the<br/>\nresponsibility of using them appropriately, though I definitely believe in<br/>\nredirecting or figuring out alternative ways of exploring an undesirable<br/>\nuse. Don&#39;t cut new clothes with scissors, but do cut old clothes, fabric<br/>\nscraps, etc. Don&#39;t use the knife to carve the table or other furniture; do<br/>\nuse the knife to carve soap, balsam wood, etc.  The privilege of having toy<br/>\nswords comes with the responsibility of not hitting one&#39;s sisters or the dog<br/>\nwith them. (Gosh, I hate it when all my examples are about my little guy!)<br/>\nBasically, I&#39;ve tried to redirect, offer alternatives, and as a last resort<br/>\nremove the privilege until &quot;you&#39;re ready to try again.&quot; This isn&#39;t done<br/>\npunitively, and the decision is always theirs as to when they are ready to<br/>\ntry again--sometime in 5 min, 5 hours or the next day. That&#39;s pretty much<br/>\nwhat happened with the crayons in my example in the other post. They would<br/>\ntry again, and the mad crayoner would strike again. *g* Eventually, though,<br/>\nthese things get worked through without too much ado.<br/>\n<br/>\nThoughts?<br/>\n<br/>\n--Danielle<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.danielleconger.com/Homeschool/Welcomehome.html\">http://www.danielleconger.com/Homeschool/Welcomehome.html</a></div>","specialLinks":[]}],"prevTopicId":94708,"nextTopicId":94657}}