{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":431670068,"authorName":"Jan Smith","from":"Jan Smith &lt;inthemoment35@...&gt;","profile":"inthemoment35","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Please help me be more peaceful","postDate":"1268861474","msgId":52131,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUwNjg4My4xNDc1Ni5xbUB3ZWIxMTQxMDkubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGhua2xmMStuc24wQGVHcm91cHMuY29tPg==","referencesHeader":"PGhua2xmMStuc24wQGVHcm91cHMuY29tPg=="},"prevInTopic":52090,"nextInTopic":0,"prevInTime":52130,"nextInTime":52132,"topicId":52068,"numMessagesInTopic":0,"msgSnippet":"Hi Lisa my name is January, I have a 14yo son and 8 yo daughter, so needless to say I have experienced this same thing with my children many many times. I too","messageBody":"<div id=\"ygrps-yiv-1845395200\">Hi Lisa my name is January, I have a 14yo son and 8 yo daughter, so needless to say I have experienced this same thing with my children many many times. I too had a difficult childhood, that had daily severe verbal abuse. While I know from my own struggles at first with parenthood that reacting in a way that was s o ingrained into us as children is extremely difficult to overcome. It takes alot of conscious effort. I started with really examining what kind of childhood I wanted my children to have. Once I knew what kind of experiences I wanted them to have and remember as adults I had to think about what kind of parenting would facilitate those &quot;happy childhoods&quot;.  This can seem &quot;simple&quot; but I found I really needed to take some time alone and really contemplate the answers.  I knew if I didn&#39;t give this the time and energy it really needed to be effective that I was far less likely to give my children the childhood and parent that they DESERVED to have.<br/>\n<br/>\nAfter I knew how I wanted to treat my children, especially in difficult situations, I had to figure out how I would do it without reverting to the methods my parents, especially my mother, had used to disciplin me. For me I found visusalizing how I would react in various situations very helpful. I knew that I didn&#39;t want to yell at my children, shame them, embarrase them, or guilt them, instead I wanted to help them learn from their experiences and realize that everyone makes mistakes and that childhood is all about learning and growing. I didn&#39;t want them to feel that they were bad, and the only ones that made mistakes growing up (like I did). I spent time thinking about the effects of individual actions of my parents on me while I was a child. I thought about the things that made me really hurt inside, as well as things that would make me feel good (of course feelings that were &quot;good&quot; were often over powered by the pain of all the &quot;bad&quot;). This helped<br/>\n me really empathize with what my children would feel if I repeated the methods of discipline my parents used with me.<br/>\n<br/>\nI take time to take a deep breath when I feel anger, even impatience, with my children. Being human, I don&#39;t always do this before I react, like I should.  However, just  because I have started to over react or react in a way that I should not, does not mean that I can continue to go on that way ( for the sake of my children). So as soon as I realize that I am not giving my children the childhood experience I know they deserve I just stop. Even if I want to yell, or over react some more, I STOP! I take a deep breath, and ask God for patience and clarity. If I know that there needs to be some sort of  &quot;discipline&quot; for something that has happened, but I am not calm enough to make decisions without emotions involved, I simply tell my children that I need to think over the situation, even discuss it with their father, and that we will sit down a little later and discuss what has happened and what action needs to be taken (if any).  This way I never feel<br/>\n rushed into making rash choices based on learned behaviors as a child, instead of treating my children the way I know they deserve to be treated. Other than needing to remove a child from a situation of danger, NO other reactions are nescessary until I can put everything into perspective and most importantly Calm Down!<br/>\n<br/>\nLearning these behaviors, and equally importantly unlearning bad behaviors that were learned in childhood, are not easy but with determination and practice it is possible. Over the years I have learned to give up my learned &quot;illusions&quot; of control. The more I have been determined to give my children the childhood they deserve, the easier it has become to treat them with the respect that I know they deserve.<br/>\n<br/>\nNow for reacting to interactions between your child and others, this is what I try to do in similar situations.  First off I don&#39;t want to embaress my child, and I always try to say their names with love, not with anger, even if I am trying to send a subtle message. In a situation like you  described, I may very well call my child to come over to me, I don&#39;t act as if I am angry, usually because I am not, I act as if I simply want to talk to them, which I do. I would probably ask them why they chose sides between the other children. Then I might ask if they ever can remember doing the same thing that they were upset the otherchild had done. I would take the opportunity to try to help my child learn how their actions might affect others, hopefully better understanding themselves. I might also take that moment to try to help my child take a step back and look at how the other child that is being teamed up against might feel.  I want to help my<br/>\n children learn how to consider others, and how their actions may affect others. And for saying what he wants to say, well yeah, he needs to not just feel stiffled, he needs to learn from the situation if possible. However, unless your son is doing something that is truely harming the other child, I would probably wait until another time all together, maybe later in the day when you cuddling up. I wouldn&#39;t put your child on the defensive by starting out with what you thought he had &quot;done wrong&quot; (of course you may have to understand that he may quickly go on to the deffensive because of your past interactions). Instead I would possibly just try to get him talking about his activities of the day, especially around the time the incident occured, and very gently help him try to examine the situation you witnessed. Now this does not always go smoothly. Depending on your child he may get restless, fearfull (that you will become angry or upset with him),<br/>\n he may not be able to understand what you are trying to even discuss with him. So this may be a situation that you prepare yourself for and be prepared to stay calm. Make it a goal to increase your own understanding, not just his, after all you have alot to learn too, we all do. I do think if you keep practicing having a greater understanding of your child, having greater patience, and giving him the respect that he deserves, not only can you give him the childhood, memories, and mother that you want him to have, but I believe you will find many rewards in it for yourself.<br/>\n<br/>\nI am sorry if this has been long winded, but i hope sharing what has worked for us, can in some way help you, or at least inspire you that it can happen. You are the biggest influence in your childrens lives, remember to treat it as the prescious gift it is.  Be patient with yourself, a slip up is not the end of the world, there will be another chance, just don&#39;t undervalue the importance of telling your child &quot;I&#39;m sorry&quot; if it would be appropriate. Your effect on your child can be as possitive or as neggative as you allow it to be.  Good luck, I know you can make the positive changes you are wanting for you and your child. Feel the love you have for your child. Really feel it deep inside and let your heart be your guide in your actions. You will than have the tools that will help you with your child. <br/>\n<br/>\nP.S. The kids are yelling at eachother, life will always give you lots of opportunities to practice the skills I was talking about (lol), I know.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Lisa &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lisa@...\">lisa@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Mon, March 15, 2010 1:52:17 AM<br/>\nSubject: [AlwaysLearning] Please help me be more peaceful<br/>\n<br/>\n  <br/>\nHi, I&#39;m Lia. My son turned 7 yesterday. He is brilliant and wonderful. I want to be more peaceful with him. <br/>\n<br/>\nI tend to be pretty controlling about a few things - personal relations being the biggest of them.<br/>\n<br/>\nSo tonight, my son tried to get involved with a fight that had nothing to do with him. He has some friends who are siblings, and the oldest (9) was telling the youngest (5) that she was unhappy with something he (the youngest) did. <br/>\n<br/>\nMy son say &quot;you know, I didn&#39;t like that either&quot;. I said &quot;Joe&quot; ... meaning &quot;Joe, stay out of this.&quot;<br/>\n<br/>\nHe knew exactly what I meant so he said &quot;MOOOOOMMMM&quot; and tried to argue with me that he should be allowed to say what he wanted to say.<br/>\n<br/>\nWhen he said that I grabbed him by the wrist and pulled him in the house.<br/>\n<br/>\nMy problems with him getting involved in the fight are<br/>\n1) the issue in question was very mild and something that my son does himself, and it didn&#39;t bother my son in the moment that it happened (3 or 4 hours beforehand)<br/>\n2) the youngest gets picked on and his mother and I both want to discourage that<br/>\n3) I don&#39;t want my son to get in this &#39;groove&#39; or &#39;habit&#39; of mistreating or blaming or scapegoating this younger boy, and sometimes I think he does<br/>\n<br/>\nand, I think the biggest issue here is that I don&#39;t like my son being involved in fights. I very much try to be there with him and help him work through these types of things and let him work through and express his emotions, but not when to do so hurts others. I try to take him in private when emotions run high, and if anyone&#39;s emotions are running high then mine go crazy.<br/>\n<br/>\nI get better every day, but but because of my violent childhood I have urgent biochemical responses whenever anyone close to me gets angry.<br/>\n<br/>\nBecause of my own issues I am having a hard time getting clarity around this issue. <br/>\n<br/>\nAm I harming my son by stopping his expression in this manner? Am I being unreasonable? Should he be allowed to say in the moment whatever comes into his mind? thanks.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Please help me be more peaceful","postDate":"1268678595","msgId":52090,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg0NTIzMy44Njk1OC5xbUB3ZWIxMTA0MDcubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGhua2xmMStuc24wQGVHcm91cHMuY29tPg==","referencesHeader":"PGhua2xmMStuc24wQGVHcm91cHMuY29tPg=="},"prevInTopic":52074,"nextInTopic":52131,"prevInTime":52089,"nextInTime":52091,"topicId":52068,"numMessagesInTopic":0,"msgSnippet":"***My problems with him getting involved in the fight are 1) the issue in question was very mild and something that my son does himself, and it didn t bother","messageBody":"<div id=\"ygrps-yiv-452989223\">***My problems with him getting involved in the fight are<br/>\n1) the issue in question was very mild and something that my son does himself, and it didn&#39;t bother my son in the moment that it happened (3 or 4 hours beforehand)<br/>\n2) the youngest gets picked on and his mother and I both want to discourage that<br/>\n3) I don&#39;t want my son to get in this &#39;groove&#39; or &#39;habit&#39; of mistreating or blaming or scapegoating this younger boy, and sometimes I think he does***<br/>\n<br/>\n<br/>\nSee, this is where I would&#39;ve stepped in, not pulled my son out.  I might have turned to the older one and said, &quot;Now wait a minute, that&#39;s not fair, that happened hours ago.  You need to move on.&quot;  I also would&#39;ve pointed out to my own child that he himself does the very same thing and if he doesn&#39;t like others doing it, he could be kinder about helping his friend to NOT do that same thing.  I would&#39;ve addressed the group together about that particular issue, even though mild, about helping each other not do that since nobody seems to like it much.  I also would&#39;ve said something about the older kids needing to be kinder and more helpful to the younger one.  <br/>\n<br/>\nWe have neighbor kids that always fight.  Margaux has recently been wanting to spend more time with the older one who also happens to be a girl, but they never come over separate, they always come as a pair, so many times Margaux makes herself unavailable to not have to be around the little boy.  She used to play with him more than the girl, but over the last year, he&#39;s experienced a LOT of domestic violence and has himself started behaving in mean and manipulative ways.  She doesn&#39;t want to be around him anymore.  The older girl was spared much of that because during this time the state took custody from the mom and gave it to the dad, so she hasn&#39;t been around as much. (they have different dads)<br/>\n<br/>\nWhen Margaux does allow them to come over and play, she tells them up front that if they fight they have to go home.  I help the girls get set up on whatever it is they want to do, and then I set the PS2 up for the boy and he&#39;ll happily play that for hours.  Mostly that works just fine.  I think the only reason he comes over is because he hates being at home.<br/>\n<br/>\nBoth of my kids have come up with solutions to sibling rivalry over the years.  Chamille was the great mediator.  I rarely had to step in because she&#39;d always come up with fair solutions and the kids would abide by them.  She has that skill and the kids really wanted to play with Chamille at her house with her stuff, so they&#39;d go along with almost anything she said.  Margaux isn&#39;t a mediator, she&#39;s a bit more &quot;bossy&quot; and far less tolerant of certain things and gladly plays alone or with me or her dad, over putting up with the misbehaviors of other children in her home.<br/>\n<br/>\nInterestingly Margaux has figured out pretty early on, she&#39;s only 8, that schooled kids play very different than her homeschooled friends.  When she was going to her science class at the rec center she told me that she could tell all those kids went to school because of the way they behaved.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":118371350,"authorName":"yaboobarb","from":"&quot;yaboobarb&quot; &lt;yaboobarb@...&gt;","profile":"yaboobarb","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Please help me be more peaceful","postDate":"1268656249","msgId":52074,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhubDk5cCtmYzBxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhua2xmMStuc24wQGVHcm91cHMuY29tPg=="},"prevInTopic":52071,"nextInTopic":52090,"prevInTime":52073,"nextInTime":52075,"topicId":52068,"numMessagesInTopic":0,"msgSnippet":"Hi Lisa, Instead of trying to solve the problem (which is so complicated!) I want to suggest Michael Brown s, The Presence Portal,to you. Look to the Left for","messageBody":"<div id=\"ygrps-yiv-63561109\">Hi Lisa,<br/>\nInstead of trying to solve the problem (which is so complicated!) I want to suggest Michael Brown&#39;s, The Presence Portal,to you.<br/>\nLook to the Left for free audios.<br/>\n <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://thepresenceportal.com/\">http://thepresenceportal.com/</a><br/>\n<br/>\nThere are also LOADS of free audios on YouTube.<br/>\n<br/>\nMichale explains how *we* can transform our own emotional events and release the &quot;charge&quot; that binds us to an automatic way of being.<br/>\n<br/>\nI think that this will help, without adding fuel to the fire. It is helping me.<br/>\n<br/>\nOne of the things I love about what I have learned is that every &quot;emotive event&quot; that we had previously resisted in ourselves is the currency to liberate ourselves. <br/>\nIn that way, having three children is PROSPERITY! There is so much material to work with!<br/>\n<br/>\nMuch Love,<br/>\nBarbara<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Lisa&quot; &lt;lisa@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi, I&#39;m Lisa. My son turned 7 yesterday.  He is brilliant and wonderful.  I want to be more peaceful with him.  <br/>\n&gt; <br/>\n&gt; I tend to be pretty controlling about a few things - personal relations being the biggest of them.<br/>\n&gt; <br/>\n&gt; So tonight, my son tried to get involved with a fight that had nothing to do with him.  He has some friends who are siblings, and the oldest (9) was telling the youngest (5) that she was unhappy with something he (the youngest) did.  <br/>\n&gt; <br/>\n&gt; My son say &quot;you know, I didn&#39;t like that either&quot;.  I said &quot;Joe&quot; ... meaning &quot;Joe, stay out of this.&quot;<br/>\n&gt; <br/>\n&gt; He knew exactly what I meant so he said &quot;MOOOOOMMMM&quot; and tried to argue with me that he should be allowed to say what he wanted to say.<br/>\n&gt; <br/>\n&gt; When he said that I grabbed him by the wrist and pulled him in the house.<br/>\n&gt; <br/>\n&gt; My problems with him getting involved in the fight are<br/>\n&gt; 1) the issue in question was very mild and something that my son does himself, and it didn&#39;t bother my son in the moment that it happened (3 or 4 hours beforehand)<br/>\n&gt; 2) the youngest gets picked on and his mother and I both want to discourage that<br/>\n&gt; 3) I don&#39;t want my son to get in this &#39;groove&#39; or &#39;habit&#39; of mistreating or blaming or scapegoating this younger boy, and sometimes I think he does<br/>\n&gt; <br/>\n&gt; and, I think the biggest issue here is that I don&#39;t like my son being involved in fights.  I very much try to be there with him and help him work through these types of things and let him work through and express his emotions, but not when to do so hurts others.  I try to take him in private when emotions run high, and if anyone&#39;s emotions are running high then mine go crazy.<br/>\n&gt; <br/>\n&gt; I get better every day, but but because of my violent childhood I have urgent biochemical responses whenever anyone close to me gets angry.<br/>\n&gt; <br/>\n&gt; Because of my own issues I am having a hard time getting clarity around this issue.  <br/>\n&gt; <br/>\n&gt; Am I harming my son by stopping his expression in this manner?  Am I being unreasonable?  Should he be allowed to say in the moment whatever comes into his mind?  thanks.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Please help me be more peaceful","postDate":"1268653684","msgId":52071,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI0RUEzQzlFLTI3RTItNDk3OC05N0JFLTQ0NjBCN0RBMDNCMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhua2xmMStuc24wQGVHcm91cHMuY29tPg==","referencesHeader":"PGhua2xmMStuc24wQGVHcm91cHMuY29tPg=="},"prevInTopic":52068,"nextInTopic":52074,"prevInTime":52070,"nextInTime":52072,"topicId":52068,"numMessagesInTopic":0,"msgSnippet":"The questions in here aren t for answering on the list, but for the mom to consider on her own.  I don t need the answers.  If the questions don t help, that s","messageBody":"<div id=\"ygrps-yiv-1736324413\">The questions in here aren&#39;t for answering on the list, but for the  <br/>\nmom to consider on her own.  I don&#39;t need the answers.  If the  <br/>\nquestions don&#39;t help, that&#39;s fine.  They&#39;re guesses at possible factors.<br/>\n<br/>\n-=-<br/>\nSo tonight, my son tried to get involved with a fight that had nothing  <br/>\nto do with him. He has some friends who are siblings, and the oldest  <br/>\n(9) was telling the youngest (5) that she was unhappy with something  <br/>\nhe (the youngest) did.<br/>\n<br/>\n-=-My son say &quot;you know, I didn&#39;t like that either&quot;. I said &quot;Joe&quot; ...  <br/>\nmeaning &quot;Joe, stay out of this.&quot;-=-<br/>\n<br/>\nHe was practicing his interpersonal skills and you gave him a bad  <br/>\ngrade in conduct?   (Thinking of teachers telling kids to leave other  <br/>\nkids alone, when the kids were more involved in those situations than  <br/>\nthe teachers ever could be.)<br/>\n<br/>\n-=-He knew exactly what I meant so he said &quot;MOOOOOMMMM&quot; and tried to  <br/>\nargue with me that he should be allowed to say what he wanted to say.-=-<br/>\n<br/>\nTried to argue with you?  Is it that you gave him a command and he  <br/>\nwanted to challenge it?  Was that the real basis of it?<br/>\nIs he not allowed to converse with you?  Would it have been better for  <br/>\nyou to have said &quot;Joe, do you think it might be better for them to  <br/>\nwork this out privately?&quot;  He is brilliant and wonderful, I hear. :-)<br/>\n<br/>\n-=-1) the issue in question was very mild and something that my son  <br/>\ndoes himself, and it didn&#39;t bother my son in the moment that it  <br/>\nhappened (3 or 4 hours beforehand)-=-<br/>\n<br/>\nYou don&#39;t know that it didn&#39;t bother him, you only know that he didn&#39;t  <br/>\nverbalize it.  Seems it did bother him.  He said later &quot;you know, I  <br/>\ndidn&#39;t like that either.&quot;  So he was courteous at the time, but if  <br/>\nsomeone else is going to bring it up, he&#39;s willing to say &quot;I  <br/>\nagree.&quot;    If he can verbalize why it&#39;s irritating, he himself might  <br/>\nfigure out ways to avoid doing it himself, too.<br/>\n<br/>\n-=-2) the youngest gets picked on and his mother and I both want to  <br/>\ndiscourage that-=-<br/>\n<br/>\nThen think (but you don&#39;t have to tell us) about why you didn&#39;t  <br/>\ndiscourage the older sibling from picking on the younger kid right  <br/>\nthen and there.  Why didn&#39;t you get into the conversation yourself and  <br/>\nsuggest other ways that the kids could see the situation?<br/>\n<br/>\n-=-3) I don&#39;t want my son to get in this &#39;groove&#39; or &#39;habit&#39; of  <br/>\nmistreating or blaming or scapegoating this younger boy, and sometimes  <br/>\nI think he does-=-<br/>\n<br/>\nIt seems if you say to your son the things you said in your  post, he  <br/>\ncan help you reason it out.  The opposite of not mistreating or  <br/>\nblaming or scapegoating (which might be reworded, too, if the younger  <br/>\nboy is doing things he maybe shouldn&#39;t do) might be to roll over and  <br/>\nbe mistreated himself, in silent, growing resentment.    Somewhere  <br/>\nbetween those opposites is a healthy balance point you could help him  <br/>\nfind.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":170380942,"authorName":"Lisa","from":"&quot;Lisa&quot; &lt;lisa@...&gt;","profile":"cslisacs","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Please help me be more peaceful","postDate":"1268635937","msgId":52068,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhua2xmMStuc24wQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":52071,"prevInTime":52067,"nextInTime":52069,"topicId":52068,"numMessagesInTopic":0,"msgSnippet":"Hi, I m Lisa. My son turned 7 yesterday.  He is brilliant and wonderful.  I want to be more peaceful with him. I tend to be pretty controlling about a few","messageBody":"<div id=\"ygrps-yiv-212067099\">Hi, I&#39;m Lisa. My son turned 7 yesterday.  He is brilliant and wonderful.  I want to be more peaceful with him.  <br/>\n<br/>\nI tend to be pretty controlling about a few things - personal relations being the biggest of them.<br/>\n<br/>\nSo tonight, my son tried to get involved with a fight that had nothing to do with him.  He has some friends who are siblings, and the oldest (9) was telling the youngest (5) that she was unhappy with something he (the youngest) did.  <br/>\n<br/>\nMy son say &quot;you know, I didn&#39;t like that either&quot;.  I said &quot;Joe&quot; ... meaning &quot;Joe, stay out of this.&quot;<br/>\n<br/>\nHe knew exactly what I meant so he said &quot;MOOOOOMMMM&quot; and tried to argue with me that he should be allowed to say what he wanted to say.<br/>\n<br/>\nWhen he said that I grabbed him by the wrist and pulled him in the house.<br/>\n<br/>\nMy problems with him getting involved in the fight are<br/>\n1) the issue in question was very mild and something that my son does himself, and it didn&#39;t bother my son in the moment that it happened (3 or 4 hours beforehand)<br/>\n2) the youngest gets picked on and his mother and I both want to discourage that<br/>\n3) I don&#39;t want my son to get in this &#39;groove&#39; or &#39;habit&#39; of mistreating or blaming or scapegoating this younger boy, and sometimes I think he does<br/>\n<br/>\nand, I think the biggest issue here is that I don&#39;t like my son being involved in fights.  I very much try to be there with him and help him work through these types of things and let him work through and express his emotions, but not when to do so hurts others.  I try to take him in private when emotions run high, and if anyone&#39;s emotions are running high then mine go crazy.<br/>\n<br/>\nI get better every day, but but because of my violent childhood I have urgent biochemical responses whenever anyone close to me gets angry.<br/>\n<br/>\nBecause of my own issues I am having a hard time getting clarity around this issue.  <br/>\n<br/>\nAm I harming my son by stopping his expression in this manner?  Am I being unreasonable?  Should he be allowed to say in the moment whatever comes into his mind?  thanks.</div>","specialLinks":[]}],"prevTopicId":52128,"nextTopicId":52129}}