{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":342782030,"authorName":"K Pennell","from":"K Pennell &lt;mrsringsabre@...&gt;","profile":"mrsringsabre","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: advice on teen/parent relationships","postDate":"1355144383","msgId":69757,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTUxNDQzODMuODI0NjUuWWFob29NYWlsTmVvQHdlYjEyMTcwNS5tYWlsLm5lMS55YWhvby5jb20+","inReplyToHeader":"PENBT09UYVhPPXNkRUdueV9QaGR4akEzbVlaRkFKeVVueFdncFRyenNEU1o2c3h3WWNzUUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PDEzNTQ4ODUwODUuMjk4MTMuWWFob29NYWlsTmVvQHdlYjEyMTcwMS5tYWlsLm5lMS55YWhvby5jb20+IDxrOXNxcmwrNjRoOUBlR3JvdXBzLmNvbT4gPENBT09UYVhPPXNkRUdueV9QaGR4akEzbVlaRkFKeVVueFdncFRyenNEU1o2c3h3WWNzUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":69756,"nextInTopic":0,"prevInTime":69756,"nextInTime":69758,"topicId":69744,"numMessagesInTopic":0,"msgSnippet":"Thanks all, for the advice. My husband and I have tried to be very mindful about tone and not inadvertently coming across as patronizing or rude. This weekend","messageBody":"<div id=\"ygrps-yiv-133093848\">Thanks all, for the advice. My husband and I have tried to be very mindful about tone and not inadvertently coming across as patronizing or rude. This weekend was actually sort of a success. He stayed home for tree decorating, and even chatted with his dad. <br/>\n<br/>\n<br/>\nI liked your advice about the adventure, Pam. We&#39;ll have to give it some thought and be really listening to him to find out what might constitute his adventure/challenge. <br/>\n<br/>\n<br/>\nTo the person who suggested he is influenced by peers in school, I do think that is part of it. Maybe even in two ways: first, many of them are at odds with their parents and he picks up on that. His gf gets along nicely with her Dad but hated her late mother. But also, his gf and her dad don&#39;t really seem to approve of homeschooling and that probably makes him anxious. She used to quiz him, but she doesn&#39;t now (at least not in front of me).<br/>\n<br/>\n<br/>\nThe Parent-Teen Breakthrough is the book I was thinking of, everyone. Thanks, I&#39;m going to order it.<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n From: Pam Sorooshian &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\nSent: Friday, December 7, 2012 3:02 PM<br/>\nSubject: Re: [AlwaysLearning] Re: advice on teen/parent relationships<br/>\n <br/>\n<blockquote><span title=\"qreply\"> On Fri, Dec 7, 2012 at 5:27 AM, Meredith &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt; wrote:<br/>\n<br/>\n&gt; K Pennell &lt;mrsringsabre@...&gt; wrote:<br/>\n&gt; &gt;&gt; He said &quot;I don&#39;t really like him. I feel irritated by him all the time,<br/>\n&gt; and I have no idea why.&quot;<br/>\n&gt; **************<br/>\n&gt;<br/>\n<br/>\nLet your son know that some degree of the feelings he has is probably<br/>\nbiological - he&#39;s become an adult male and living under the thumb of<br/>\nanother adult male it might be built into him to begin to feel resistance.<br/>\nThink about herd animals and how the young males always challenge the older<br/>\nones. It might be that if your son understands that there are reasons for<br/>\nhaving these feelings that at least partly might have nothing to do with<br/>\nanything his dad is doing, maybe that&#39;ll help him handle those feelings a<br/>\nlittle better.<br/>\n<br/>\nI have observed many times that boys-becoming-men really seem to need some<br/>\nchallenge in their lives and when they aren&#39;t getting it in a way that<br/>\nworks for them, they find challenge/create some strife and difficulty. Some<br/>\nget it intellectually, maybe, by working on understanding challenging<br/>\nideas, but I think that is less common than the need for real true physical<br/>\nchallenge and adventure. Lots of girls want this, too, by the way, but I<br/>\nthink some of the underlying reasons are different for boys.<br/>\n<br/>\nBoys of 16, 17, 18 or so really often feel stuck in a situation that nobody<br/>\nadmits and they don&#39;t even know what it is. They are biologically men - in<br/>\nother times and places they would have become full-fledged members of the<br/>\nadult community - hunting, fighting, having children of their own, etc.<br/>\nHere, they are kept as mama&#39;s boys (and I mean to use an inflaming term to<br/>\nemphasize how it might feel to them, even if unstated). They feel out of<br/>\nplace, but they don&#39;t know what to do about it because we don&#39;t live in a<br/>\nsociety where they can grab their gun and go out hunting all alone. There<br/>\nis little physical challenge that is real. There is little challenge at<br/>\nall.<br/>\n<br/>\nIf your husband can find a way to help support your son in having his own<br/>\ngrand adventure, that might help turn his father into a support/mentor in<br/>\nhis eyes, rather than a hindrance. No telling what a grand adventure might<br/>\nlook like for him - maybe something you&#39;d never imagine, so don&#39;t start<br/>\ndreaming it up FOR him.<br/>\n<br/>\nI&#39;d say, in fact, let it be entirely between son and father because that<br/>\ncould really help build their relationship up. It could be a flat out gift<br/>\nand he&#39;d offer money, &quot;I have $1,000 I&#39;d like to give to you to celebrate<br/>\nthat you&#39;re becoming a man. The only strings attached are that I want you<br/>\nto decide to use it for a big adventure. I&#39;ll help in any way I can.&quot;<br/>\n<br/>\nMaybe not $1000, maybe not said in those words at all, maybe something<br/>\ncompletely different like helping him do something he&#39;s already said before<br/>\nhe wanted to do and you have dragged your feet. But I really feel it needs<br/>\nto be a challenge - something a little risky - for a lot of reasons but one<br/>\nis so that his dad can show his confidence in him.<br/>\n<br/>\nI think this is one reason there is so much traveling done by unschooled<br/>\nteens - that&#39;s a modern-day challenge that is physical (getting from here<br/>\nto there) and social and involves a very heady sense of independence and<br/>\ncompetence.<br/>\n<br/>\nThe book you&#39;re looking for might be either &quot;How to Talk so Kids will<br/>\nListen and Listen so Kids will Talk&quot; or &quot;The Parent-Teen Breakthrough: A<br/>\nRelationship Approach.&quot;<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] advice on teen/parent relationships","postDate":"1354973317","msgId":69756,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcwNTc3NTU1LUZDNDQtNDE4OS1CNzcwLTE3NUJGNDY0RTNGMUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDEzNTQ4ODUwODUuMjk4MTMuWWFob29NYWlsTmVvQHdlYjEyMTcwMS5tYWlsLm5lMS55YWhvby5jb20+","referencesHeader":"PDEzNTQ4ODUwODUuMjk4MTMuWWFob29NYWlsTmVvQHdlYjEyMTcwMS5tYWlsLm5lMS55YWhvby5jb20+"},"prevInTopic":69754,"nextInTopic":69757,"prevInTime":69755,"nextInTime":69757,"topicId":69744,"numMessagesInTopic":0,"msgSnippet":"... The book is Parent/Teen Breakthrough: the relationship approach by Mira Kirchenbaum. http://tinyurl.com/3mnbf52 When I was a teen it was my mom who","messageBody":"<div id=\"ygrps-yiv-435073252\">On Dec 7, 2012, at 7:58 AM, K Pennell wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; There was a book someone had suggested a while ago about talking to teens. <br/>\n<br/>\n </span></blockquote>The book is Parent/Teen Breakthrough: the relationship approach by Mira Kirchenbaum.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tinyurl.com/3mnbf52\">http://tinyurl.com/3mnbf52</a><br/>\n<br/>\nWhen I was a teen it was my mom who irritated me. It wasn&#39;t anything in particular that she did other than doing what most every other parent was doing --basically things that work so poorly with teens ;-)<br/>\n<br/>\nI think it comes down to lack of connection. She (and other parents around her) had in mind what kids were supposed to do -- go to school, get good grades -- but had no understanding of what I wanted or what I was going through in order to do that. Nor did I have the ability to articulate what was wrong since it was stuff everyone had to do and if I didn&#39;t like it, it was because of a lack in me. Plus I was full of hormones that drove the desire for independent thought and choices but no way to do that.<br/>\n<br/>\nI&#39;m about to go off on a tangent, but it will come back, I promise! :-) I never thought of this before but in a way conventional parenting is like being a shepherd. The shepherd&#39;s job is to keep the sheep from straying away from what sheep are supposed to do: stay together and eat, sleep and make new sheep. <br/>\n<br/>\nFrom the view of conventional parenting, the role of parents is to keep kids from straying from what kids are supposed to do -- schoolwork, chores, being &quot;nice&quot;. To do that -- the conventional view says -- you just prod kids back into right behavior when they stray.<br/>\n<br/>\nThe problem with that view is that eating, etc. is what sheep want to do so when they wander off, it&#39;s not hard to prod them back. And if a sheep repeatedly refuses, a shepherd can cull the animals that don&#39;t want to do what shepherds need them to do.<br/>\n<br/>\nBut going to school, doing chores, treating their own needs as unimportant is not what kids want to do. And shepherding kids through conventional life is like making sheep dance everyday. It&#39;s going to make for some might unhappy sheep who will want to escape so they can do what sheep want to do. <br/>\n<br/>\nWhat kids want -- what humans want -- is to feel connected with others as they &quot;follow their bliss&quot;. Which is a really good way of phrasing it (with a caveat). It&#39;s easy to picture sheep happily munching grass when they&#39;re hungry, sleeping when they&#39;re sleepy, following hormones when those kick in. (Since we humans are social creatures, what we want to do *also* includes connecting with others and wanting them to be happy.)<br/>\n<br/>\nBut the phrase was unfortunately was used to mean &quot;Do whatever feels good regardless of the consequences to yourself or anyone else.&quot; When you&#39;ve grown up only getting to do what you want on someone else&#39;s schedule -- and never getting to do enough of it -- that&#39;s pretty much the reaction you&#39;d expect to &quot;Follow your bliss.&quot; :-/<br/>\n<br/>\nWhat makes it seem like kids -- and other people -- don&#39;t care about others&#39; happiness is when others prevent them from getting what they want. If kids have to fight for what they want, they aren&#39;t going to care about other people&#39;s happiness -- especially those who are being roadblocks rather than helping. When kids feel supported in meeting their needs, they have the energy and desire to care about others&#39; happiness.<br/>\n<br/>\nKids (and other humans too!) want those they love to:<br/>\n<br/>\nListen to them, hear them, understand their needs and concerns and take those seriously. (That is no &quot;Yes, I understand, BUT ...)<br/>\nBe happy :-)<br/>\nUnderstand who they are.<br/>\nLike who they are.<br/>\nWant them to be the best *them* they can be.<br/>\nNot want them &quot;to be the best [by the loved one&#39;s standards] them they can be&quot;.<br/>\nBe happy that they get to do what they enjoy.<br/>\nShow an interest in what they&#39;re doing.<br/>\nSupport them as much as the *kids* want in what they&#39;re doing.<br/>\nOpen doors of opportunity to find and pursue interests that spark them.<br/>\n<br/>\nConventional parenting and school puts a low priority on much of the above. Conventional parenting is all about making those sheep dance because the shepherd believes dancing -- not current happiness -- is the best thing for the sheep&#39;s future happiness.<br/>\n<br/>\nUp until now your son has been a sheep made to dance. He&#39;s been unheard that dancing isn&#39;t what he loves. And yet, now that he has the freedom to not dance, he doesn&#39;t *feel* free: years of internal voices planted by you and your husband override his own voice about what feels right for him. Those voices don&#39;t evaporate as soon as Mom and Dad change their minds.<br/>\n<br/>\n*And* he&#39;s full of hormones that are driving him to desire to &quot;do it himself&quot;, to try things, to see what happens, to try something else without others watching to see if he&#39;s doing it &quot;right&quot;. He wants to feel free to *find* what&#39;s right for him, not be told. <br/>\n<br/>\nWhat I needed from my mom was the above connecting things not a shepherdess. ;-) I needed it all along to build a relationship so I could comfortably bring issues up without her seeing it as a request to be fixed and set back on the right track.<br/>\n<br/>\nIt&#39;s obviously hard to create that relationship once kids become teens. (And why parents are urged to do what creates connections when they&#39;re young!) But the Parent/Teen Breakthrough book can be a big help for those parents who are starting late.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [AlwaysLearning] advice on teen/parent relationships","postDate":"1354922358","msgId":69754,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk1RjRCQjVFLTZDNzQtNEU1Ni04REFGLTkyQzM1ODQzNkM5NUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEzNTQ4ODUwODUuMjk4MTMuWWFob29NYWlsTmVvQHdlYjEyMTcwMS5tYWlsLm5lMS55YWhvby5jb20+","referencesHeader":"PDEzNTQ4ODUwODUuMjk4MTMuWWFob29NYWlsTmVvQHdlYjEyMTcwMS5tYWlsLm5lMS55YWhvby5jb20+"},"prevInTopic":69753,"nextInTopic":69756,"prevInTime":69753,"nextInTime":69755,"topicId":69744,"numMessagesInTopic":0,"msgSnippet":"-=-Anyway, he isn t really unschooled but this question pertains to him. I d like to help this situation with unschooling philosophies in mind.-=- A parent","messageBody":"<div id=\"ygrps-yiv-213400832\">-=-Anyway, he isn&#39;t really unschooled but this question pertains to him. I&#39;d like to help this situation with unschooling philosophies in mind.-=-<br/>\n<br/>\nA parent who&#39;s not fully immersed in unschooling (your husband) can&#39;t treat a schoolkid (your son, even though he&#39;s not fully in school, he was never fully out) in an unschooling way and expect to see unschooling results.  I&#39;m sorry.  I know there are places that will promise people all manner of magic just for using the term &quot;unschooling,&quot; but they&#39;re wrong.    It&#39;s a long process involving patience and change.<br/>\n<br/>\nPam Sorooshian wrote this:  <br/>\n&quot;As we get older and our kids grow up, we eventually come to realize that all the big things in our lives are really the direct result of how we&#39;ve handled all the little things.&quot; —Pam Sorooshian, June 4, 2007<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/pamsorooshian\">http://sandradodd.com/pamsorooshian</a><br/>\n<br/>\nIt&#39;s true of all kind of parenting.<br/>\n<br/>\n-=-Our older son seems very angry toward my husband (his father). DS is 17, and this has been going on for a year or two. In the past when I have broached the subject, I get a &quot;he never cleans the counter but he always tells me to&quot; or something. Today I called him on that, and said &quot;he did use to complain about that, but when is the last time Dad did that?&quot; He couldn&#39;t recall, because it truly hasn&#39;t happened lately (i.e in a year or more). <br/>\n-=-<br/>\n<br/>\n1) With very little efforc, someone can break something that took a long time to build.<br/>\n2) You asked him about something particular (the counter) rather than seeing the point (hypocrisy).<br/>\nand<br/>\n3) Requiring chores or telling kids to clean up is not going to lead to a partnership.   How does your husband feel about the idea that if he doesn&#39;t like crumbs on the counter he should clean it?   My husband is The WORST about leaving a mess like that, and making a sandwich without using a plate.  I could rag on him about it, but it&#39;s easier to put the rag on the counter, and breathe, and be glad he&#39;s alive to leave crumbs (and to go to work, and to split wood, and to help me with things), and that he&#39;s leaving crumbs on our counter and not some other woman&#39;s.<br/>\n<br/>\n-=-He said &quot;I don&#39;t really like him. I feel irritated by him all the time, and I have no idea why.&quot;-=-<br/>\n<br/>\nPart of it is surely an instinctive leave-the-nest reaction.  It doesn&#39;t mean you should boot him out, but you should consider it healthy that a young man old enough to procreate is starting to feel too big for the den.<br/>\n<br/>\n-=-how can he help improve the relationship with his son? Especially when there are times DS is borderline rude.-=-<br/>\n<br/>\nHolly and I have had some rough exchanges lately.  She&#39;s not even borderline sometimes, just rude.  I can make it worse, or I can dodge it and say something she can think about later, when I&#39;m calm.  Usually, I make it worse.  But even &quot;worse&quot; comes in degrees.  I could take &quot;worse&quot; to the wall and need to worry about whether she would kill herself or run away.  That&#39;s not a good idea.  We get along much more than we irritate each other.  She will move out someday and I&#39;ll miss her.<br/>\n<br/>\nThings are rarely perfect.  Doing little things to make them better is sometimes the best thing that can happy, in some moments or seasons or moods or situations.<br/>\n<br/>\nParent/Teen Breakthrough is probably the book that was mentioned.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.chestnuthillinstitute.com/books/ptb/index.php\">http://www.chestnuthillinstitute.com/books/ptb/index.php</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":128961575,"authorName":"Vicki Dennis","from":"Vicki Dennis &lt;vicki@...&gt;","profile":"vickitexan2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: advice on teen/parent relationships","postDate":"1354911821","msgId":69753,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTVN1N055b3lfdTVKZVFuS1hwQUVhVDBuMGR3TGtDRXpEdW5kRHZDRjlFc1JiQmtPQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PENBT09UYVhPPXNkRUdueV9QaGR4akEzbVlaRkFKeVVueFdncFRyenNEU1o2c3h3WWNzUUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PDEzNTQ4ODUwODUuMjk4MTMuWWFob29NYWlsTmVvQHdlYjEyMTcwMS5tYWlsLm5lMS55YWhvby5jb20+CTxrOXNxcmwrNjRoOUBlR3JvdXBzLmNvbT4JPENBT09UYVhPPXNkRUdueV9QaGR4akEzbVlaRkFKeVVueFdncFRyenNEU1o2c3h3WWNzUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":69751,"nextInTopic":69754,"prevInTime":69752,"nextInTime":69754,"topicId":69744,"numMessagesInTopic":0,"msgSnippet":"I agree with lots of what Pam says, especially about it being biological. I was mulling in my head how to present that idea. I do believe that part of the","messageBody":"<div id=\"ygrps-yiv-1059479522\">I agree with lots of what Pam says, especially about it being biological.<br/>\nI was mulling in my head how to present that idea.<br/>\n<br/>\nI do believe that part of the biological component is that your son is<br/>\nirritated by his father more than by you.   If he were a daughter it would<br/>\nbe the opposite.   Though it might seem too &quot;traditional&quot;  I believe that<br/>\ngender differences do affect the parent child relationship transitions.<br/>\n<br/>\nWhether son or daughter I do agree that at 17 a parent does not relate to<br/>\noffspring of either gender in the same way as to a child of 6.<br/>\n<br/>\nIn my opinion it would not be at all harmful to explain to an adolescent<br/>\nmale about raging testosterone in himself and in his environment.  Reassure<br/>\nhim (and his father) that &quot;this, too, shall pass&quot;.  It&#39;s biology, not<br/>\npersonal.<br/>\n<br/>\nvicki<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Fri, Dec 7, 2012 at 2:02 PM, Pam Sorooshian &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; On Fri, Dec 7, 2012 at 5:27 AM, Meredith &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt;<br/>\n&gt; wrote:<br/>\n&gt;<br/>\n&gt; &gt; K Pennell &lt;mrsringsabre@...&gt; wrote:<br/>\n&gt; &gt; &gt;&gt; He said &quot;I don&#39;t really like him. I feel irritated by him all the<br/>\n&gt; time,<br/>\n&gt; &gt; and I have no idea why.&quot;<br/>\n&gt; &gt; **************<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt; Let your son know that some degree of the feelings he has is probably<br/>\n&gt; biological - he&#39;s become an adult male and living under the thumb of<br/>\n&gt; another adult male it might be built into him to begin to feel resistance.<br/>\n&gt; Think about herd animals and how the young males always challenge the older<br/>\n&gt; ones. It might be that if your son understands that there are reasons for<br/>\n&gt; having these feelings that at least partly might have nothing to do with<br/>\n&gt; anything his dad is doing, maybe that&#39;ll help him handle those feelings a<br/>\n&gt; little better.<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: advice on teen/parent relationships","postDate":"1354910579","msgId":69751,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhPPXNkRUdueV9QaGR4akEzbVlaRkFKeVVueFdncFRyenNEU1o2c3h3WWNzUUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGs5c3FybCs2NGg5QGVHcm91cHMuY29tPg==","referencesHeader":"PDEzNTQ4ODUwODUuMjk4MTMuWWFob29NYWlsTmVvQHdlYjEyMTcwMS5tYWlsLm5lMS55YWhvby5jb20+CTxrOXNxcmwrNjRoOUBlR3JvdXBzLmNvbT4="},"prevInTopic":69748,"nextInTopic":69753,"prevInTime":69750,"nextInTime":69752,"topicId":69744,"numMessagesInTopic":0,"msgSnippet":"... Let your son know that some degree of the feelings he has is probably biological - he s become an adult male and living under the thumb of another adult","messageBody":"<div id=\"ygrps-yiv-731220005\">On Fri, Dec 7, 2012 at 5:27 AM, Meredith &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; K Pennell &lt;mrsringsabre@...&gt; wrote:<br/>\n&gt; &gt;&gt; He said &quot;I don&#39;t really like him. I feel irritated by him all the time,<br/>\n&gt; and I have no idea why.&quot;<br/>\n&gt; **************<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Let your son know that some degree of the feelings he has is probably<br/>\nbiological - he&#39;s become an adult male and living under the thumb of<br/>\nanother adult male it might be built into him to begin to feel resistance.<br/>\nThink about herd animals and how the young males always challenge the older<br/>\nones. It might be that if your son understands that there are reasons for<br/>\nhaving these feelings that at least partly might have nothing to do with<br/>\nanything his dad is doing, maybe that&#39;ll help him handle those feelings a<br/>\nlittle better.<br/>\n<br/>\nI have observed many times that boys-becoming-men really seem to need some<br/>\nchallenge in their lives and when they aren&#39;t getting it in a way that<br/>\nworks for them, they find challenge/create some strife and difficulty. Some<br/>\nget it intellectually, maybe, by working on understanding challenging<br/>\nideas, but I think that is less common than the need for real true physical<br/>\nchallenge and adventure. Lots of girls want this, too, by the way, but I<br/>\nthink some of the underlying reasons are different for boys.<br/>\n<br/>\nBoys of 16, 17, 18 or so really often feel stuck in a situation that nobody<br/>\nadmits and they don&#39;t even know what it is. They are biologically men - in<br/>\nother times and places they would have become full-fledged members of the<br/>\nadult community - hunting, fighting, having children of their own, etc.<br/>\nHere, they are kept as mama&#39;s boys (and I mean to use an inflaming term to<br/>\nemphasize how it might feel to them, even if unstated). They feel out of<br/>\nplace, but they don&#39;t know what to do about it because we don&#39;t live in a<br/>\nsociety where they can grab their gun and go out hunting all alone. There<br/>\nis little physical challenge that is real. There is little challenge at<br/>\nall.<br/>\n<br/>\nIf your husband can find a way to help support your son in having his own<br/>\ngrand adventure, that might help turn his father into a support/mentor in<br/>\nhis eyes, rather than a hindrance. No telling what a grand adventure might<br/>\nlook like for him - maybe something you&#39;d never imagine, so don&#39;t start<br/>\ndreaming it up FOR him.<br/>\n<br/>\nI&#39;d say, in fact, let it be entirely between son and father because that<br/>\ncould really help build their relationship up. It could be a flat out gift<br/>\nand he&#39;d offer money, &quot;I have $1,000 I&#39;d like to give to you to celebrate<br/>\nthat you&#39;re becoming a man. The only strings attached are that I want you<br/>\nto decide to use it for a big adventure. I&#39;ll help in any way I can.&quot;<br/>\n<br/>\nMaybe not $1000, maybe not said in those words at all, maybe something<br/>\ncompletely different like helping him do something he&#39;s already said before<br/>\nhe wanted to do and you have dragged your feet. But I really feel it needs<br/>\nto be a challenge - something a little risky - for a lot of reasons but one<br/>\nis so that his dad can show his confidence in him.<br/>\n<br/>\n I think this is one reason there is so much traveling done by unschooled<br/>\nteens - that&#39;s a modern-day challenge that is physical (getting from here<br/>\nto there) and social and involves a very heady sense of independence and<br/>\ncompetence.<br/>\n<br/>\nThe book you&#39;re looking for might be either &quot;How to Talk so Kids will<br/>\nListen and Listen so Kids will Talk&quot; or &quot;The Parent-Teen Breakthrough: A<br/>\nRelationship Approach.&quot;<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":220041937,"authorName":"Heather","from":"Heather &lt;hbmccarty@...&gt;","profile":"heather13068","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] advice on teen/parent relationships","postDate":"1354892689","msgId":69748,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUwQzIwNTkxLjgwODAwMDVAdHdjbnkucnIuY29tPg==","inReplyToHeader":"PDEzNTQ4ODUwODUuMjk4MTMuWWFob29NYWlsTmVvQHdlYjEyMTcwMS5tYWlsLm5lMS55YWhvby5jb20+","referencesHeader":"PDEzNTQ4ODUwODUuMjk4MTMuWWFob29NYWlsTmVvQHdlYjEyMTcwMS5tYWlsLm5lMS55YWhvby5jb20+"},"prevInTopic":69746,"nextInTopic":69751,"prevInTime":69747,"nextInTime":69749,"topicId":69744,"numMessagesInTopic":0,"msgSnippet":"... It took my kids a long time to hear what I was actually saying, rather than what they expected me to say, once I had changed. Parent Teen Breakthrough, the","messageBody":"<div id=\"ygrps-yiv-1394022558\">K Pennell wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;  <br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Our older son seems very angry toward my husband (his father). DS is <br/>\n&gt; 17, and this has been going on for a year or two. In the past when I <br/>\n&gt; have broached the subject, I get a &quot;he never cleans the counter but he <br/>\n&gt; always tells me to&quot; or something. Today I called him on that, and said <br/>\n&gt; &quot;he did use to complain about that, but when is the last time Dad did <br/>\n&gt; that?&quot; He couldn&#39;t recall, because it truly hasn&#39;t happened lately <br/>\n&gt; (i.e in a year or more).<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>It took my kids a long time to hear what I was actually saying, rather <br/>\nthan what they expected me to say, once I had changed.<br/>\n<br/>\nParent Teen Breakthrough, the Relationship Approach, is a book that has <br/>\nbeen reccomended here before - it was very helpful to me.<br/>\n<br/>\nHeather</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: advice on teen/parent relationships","postDate":"1354886837","msgId":69746,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs5c3FybCs2NGg5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzNTQ4ODUwODUuMjk4MTMuWWFob29NYWlsTmVvQHdlYjEyMTcwMS5tYWlsLm5lMS55YWhvby5jb20+"},"prevInTopic":69744,"nextInTopic":69748,"prevInTime":69745,"nextInTime":69747,"topicId":69744,"numMessagesInTopic":0,"msgSnippet":"... ************** Two things come to mind - one is that he s surrounded by school kids who all complain about their parents. He Expects to dislike his. But","messageBody":"<div id=\"ygrps-yiv-981817961\">K Pennell &lt;mrsringsabre@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; He said &quot;I don&#39;t really like him. I feel irritated by him all the time, and I have no idea why.&quot;<br/>\n </span></blockquote>**************<br/>\n<br/>\nTwo things come to mind - one is that he&#39;s surrounded by school kids who all complain about their parents. He Expects to dislike his. <br/>\n<br/>\nBut the other is that the vast majority of adults treat teenagers with a special kind of disdain which is justly infuriating to them and it&#39;s entirely possible dad has picked up some bad habits from other parents, co-workers, tv, etc. This is something I&#39;ve seen a lot with Ray and his bio mom, who often falls into the habit of treating her son like &quot;a teenager&quot; even now - and every time she thinks she&#39;s being sweet and reasonable and helpful even when she&#39;s condescending and downright disrespectful. Why shouldn&#39;t she? She&#39;s acting like a normal mom of a teenager. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;how can he help improve the relationship with his son?<br/>\n<br/>\n </span></blockquote>Watch your own behavior very, very carefully and see if you&#39;re treating your son like &quot;a teenager&quot; or like a person. Start there, assuming you&#39;ve picked up that kind of behavior from Your peers, and work on mending your own attitude.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":342782030,"authorName":"K Pennell","from":"K Pennell &lt;mrsringsabre@...&gt;","profile":"mrsringsabre","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"advice on teen/parent relationships","postDate":"1354885085","msgId":69744,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTQ4ODUwODUuMjk4MTMuWWFob29NYWlsTmVvQHdlYjEyMTcwMS5tYWlsLm5lMS55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":69746,"prevInTime":69743,"nextInTime":69745,"topicId":69744,"numMessagesInTopic":0,"msgSnippet":"Hello all, We are unschooling my youngest, age 10. Our older son homeschools, but by his own choice, gets a list and checks things off. He says this loose","messageBody":"<div id=\"ygrps-yiv-457943888\">Hello all,<br/>\nWe are unschooling my youngest, age 10. Our older son homeschools, but by his own choice, gets a &quot;list&quot; and checks things off. He says this loose way we do it with our younger son just doesn&#39;t work for him; he doesn&#39;t like it. He attended public school until 8th grade. He also attends public school for band and a class at the tech center, so his friends are all in school, as is his girlfriend (of two years). Anyway, he isn&#39;t really unschooled but this question pertains to him. I&#39;d like to help this situation with unschooling philosophies in mind.<br/>\n<br/>\nOur older son seems very angry toward my husband (his father). DS is 17, and this has been going on for a year or two. In the past when I have broached the subject, I get a &quot;he never cleans the counter but he always tells me to&quot; or something. Today I called him on that, and said &quot;he did use to complain about that, but when is the last time Dad did that?&quot; He couldn&#39;t recall, because it truly hasn&#39;t happened lately (i.e in a year or more). <br/>\n<br/>\nHe said &quot;I don&#39;t really like him. I feel irritated by him all the time, and I have no idea why.&quot;<br/>\n<br/>\nSo my question is this: (and my husband is aware and glad I&#39;m writing, as he is very sad about this) how can he help improve the relationship with his son? Especially when there are times DS is borderline rude. There was a book someone had suggested a while ago about talking to teens. Any suggestions would be appreciated. Thanks.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":69750,"nextTopicId":69738}}