{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":7143857,"authorName":"jrossedd@aol.com","from":"jrossedd@...","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] to nose pierce or not isn&#39;t unschooling absolute","postDate":"1070911366","msgId":85866,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdkLjQyODdkYzYyLjJkMDYyOTg2QGFvbC5jb20+"},"prevInTopic":85865,"nextInTopic":0,"prevInTime":85865,"nextInTime":85867,"topicId":85856,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/08/2003 2:10:20 PM Eastern Standard Time, ... Sigh. I started with it in the first place! It was quite plainly in the sentence of mine","messageBody":"<div id=\"ygrps-yiv-14033064\">In a message dated 12/08/2003 2:10:20 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So where did you get &quot;under fourteen&quot;?<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Sigh. I started with it in the first place! It was quite plainly in the <br/>\nsentence of mine about my own concerns for my own children under 14, the sentence <br/>\nto which you responded with your story about Kirby. <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] to nose pierce or not isn&#39;t unschooling absolute","postDate":"1070910115","msgId":85865,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdjLjNmZDdlMzY0LjJkMDYyNGEzQGFvbC5jb20+"},"prevInTopic":85856,"nextInTopic":85866,"prevInTime":85864,"nextInTime":85866,"topicId":85856,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/8/03 10:56:53 AM, jrossedd@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-1399930281\">In a message dated 12/8/03 10:56:53 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jrossedd@...\">jrossedd@...</a> writes:<br/>\n<br/>\n&lt;&lt; Someone did post those words: &quot;it&#39;s her body so what&#39;s the harm?&quot; <br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;<br/>\n<br/>\n </span></blockquote>Sorry, then, I missed that.<br/>\nWas it about piercing or a tattoo?<br/>\nOr was it about IV drugs or crazed group sex?<br/>\nHonestly, not all things are equally dangerous.<br/>\n<br/>\n&lt;&lt;     Like anything else, it could be reasonable and moderate in one <br/>\nsituation and used to justify a harmful extreme in another.&gt;&gt;<br/>\n<br/>\nHave you seen anyone on this list justify harmful extremes?<br/>\nLet&#39;s talk about our real children and not our imaginary freak-out fantasies.<br/>\n<br/>\n&lt;&lt;  I personally see all kinds of risks in having sex under age 14&gt;&gt;<br/>\n<br/>\nKirby was sixteen, close to seventeen.  He&#39;s almost six feet tall.  He&#39;s <br/>\nshaved for a couple of years.  He&#39;s not a little boy.<br/>\n<br/>\nHolly&#39;s under fourteen.  She&#39;s not even thinking about kissing, let alone <br/>\nhaving sex.<br/>\n<br/>\nSo where did you get &quot;under fourteen&quot;?<br/>\n<br/>\n&lt;&lt; I personally see all kinds of risks in having sex under age 14, and/or <br/>\nwhen knowing someone only well enough for a movie date and a couple of <br/>\nvisits. &gt;&gt;<br/>\n<br/>\nIt wasn&#39;t that he didn&#39;t know her better, it&#39;s that he&#39;s really busy, and <br/>\ndidn&#39;t glom onto her in the desperation some teens do when another person will <br/>\npay personal, physical-touch attention to them.  I&#39;ve NEVER seen that kind of <br/>\ndesperation in any of the teenaged unschoolers I&#39;ve know.  I&#39;ve seen it dozens <br/>\nof times in kids at school, both when I was a kid and when I was a teacher.<br/>\n<br/>\nThe girl called Kirby a lot. When he discovered she was in the habit of lying <br/>\nto her dad he wasn&#39;t very interested in pursuing a relationship with her.  He <br/>\ndid go and meet her mom (who lives in another state, but had come to visit.  <br/>\nThe girl was pressing Kirby to call her mom &quot;mom.&quot;  He wasn&#39;t comfortable with <br/>\nthe pressure on him to act married to her instead of just a boyfriend.<br/>\n<br/>\nThey were at a camping event where I was not, when &quot;it&quot; happened (as I <br/>\nstrongly suspect; Kirby was discreet enough not to talk about it openly, but there <br/>\nwere subtle indications).  In the context of that camping event, it was quite <br/>\nromantic.  He had known her for a while, and was friends with many of her <br/>\nfriends.  So the suggestion that he didn&#39;t know her is inaccurate.<br/>\n<br/>\nThe fact that he didn&#39;t jump on her like a flea on a hotter newer dog seems <br/>\nto me proof of maturity.<br/>\n<br/>\nThe relationship started in February.  He botched her prom invitation (not <br/>\nknowing what a big deal prom was, he answered honestly &quot;not really&quot; to &quot;Do you <br/>\nwant to go to the prom?&quot;<br/>\n<br/>\nWhen he discovered what a faux pas that had been, he went and reserved a tux, <br/>\ncalled her and said he would go with her.  She said she already had other <br/>\nplans (to go with a female also-dateless friend) and his response when he got off <br/>\nthe phone was &quot;Well that saved me a hundred dollars.&quot;  She broke up with him <br/>\na day or two later.  I think she was afraid of the fallout from her NOT going <br/>\nwith him when he was willing.  She had all manner of school-based angst and <br/>\nconsiderations about the relationship.  Kirby had none of them.<br/>\n<br/>\n&lt;&lt; To engage in risky behavior without harm doesn&#39;t lessen actual risk. <br/>\nIt just lessens our perception of risk (which perversely may result in more <br/>\nexposure to it.)&gt;&gt;<br/>\n<br/>\nI understand what you mean mathematically, but how does it work for you in <br/>\nthe real world?<br/>\n<br/>\nDo you drive your car when the tires are getting bald?<br/>\nDo you drive in the snow when it&#39;s less than life or death?<br/>\nHave you ever exceeded the speed limit?<br/>\nDid your lack of harm lessen the actual risk?<br/>\n<br/>\n&lt;&lt; Not sure you&#39;ve heard me, though. I get the feeling <br/>\nyou&#39;re in some other argument you&#39;ve had before&gt;&gt;<br/>\n<br/>\nI&#39;m writing to hundreds of people.  Maybe you were writing to just one.<br/>\nThe list isn&#39;t designed for that.<br/>\n<br/>\n&lt;&lt;       Like your riff about &quot;today&#39;s highways&quot; -- I don&#39;t see much <br/>\nrelationship between what I said and how you responded with something about <br/>\nliving in <br/>\nthe present only.  (Maybe you meant to be funny?) &gt;&gt;<br/>\n<br/>\nThere&#39;s nothing funny about the fact that we are alive in this moment and <br/>\ntoday&#39;s life is the only life we can live.   <br/>\n<br/>\nHow will a child learn to drive today without today&#39;s highways?<br/>\n<br/>\n&lt;&lt;       Today&#39;s highways are different than when I learned to drive 30 years <br/>\nago. So I have to think about, and deal with, new realities and learning <br/>\nneeds <br/>\nfor my children as drivers, not simply go on auto pilot from my own past and <br/>\nhow I was schooled or parented. &gt;&gt;<br/>\n<br/>\nHave you not considered your own driving in the past thirty years?  Would you <br/>\nteach them to drive with thirty-year-old visions and thoughts in your head?<br/>\n<br/>\nWould you parrot what your driver&#39;s ed teacher said or what your parents said <br/>\n(you said &quot;how I was schooled or parented&quot;) instead of taking the synthesized <br/>\nknowledge you possess from all possible sources and the experience of thirty <br/>\nyears and pass THAT on to your children?<br/>\n<br/>\n&lt;&lt;Also I was a first-born child with a classic <br/>\nfocus on delayed gratification (living in the future)  I agree we are here <br/>\nnow, <br/>\nbut not that the present is all we have. It&#39;s all pretty seamless to me.&gt;&gt;<br/>\n<br/>\nI&#39;m a firstborn with a sometimes-irritating amount of detailed recall of <br/>\nchildhood memories, and live seems QUITE seamless to me, yet the only point at <br/>\nwhich my feet actually touch the ground is this moment.  The past is memory and <br/>\nthe future is speculation.  Whining about memory and losing sleep over <br/>\nspeculation only screw up the next breath we take.  <br/>\n<br/>\nIn AA (my mom used to go) they very indelicately say &quot;If you&#39;re standing with <br/>\none foot in the past and one foot in the future, you&#39;re pissing all over <br/>\ntoday.&quot;<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":7143857,"authorName":"jrossedd@aol.com","from":"jrossedd@...","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] to nose pierce or not isn&#39;t unschooling absolute","postDate":"1070905844","msgId":85856,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0Yy4yN2UzNDAyZC4yZDA2MTNmNEBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":85865,"prevInTime":85855,"nextInTime":85857,"topicId":85856,"numMessagesInTopic":0,"msgSnippet":"Sandra -- Someone did post those words: it s her body so what s the harm? Like anything else, it could be reasonable and moderate in one situation and used","messageBody":"<div id=\"ygrps-yiv-991427391\">Sandra --<br/>\n<br/>\n       Someone did post those words: &quot;it&#39;s her body so what&#39;s the harm?&quot; <br/>\n<br/>\n       Like anything else, it could be reasonable and moderate in one <br/>\nsituation and used to justify a harmful extreme in another.<br/>\n<br/>\n       I personally see all kinds of risks in having sex under age 14, and/or <br/>\nwhen knowing someone only well enough for a movie date and a couple of <br/>\nvisits. That is what I see. Whether the majority of other unschoolers agree with me <br/>\nis a separate question, as is whether and how I can help my children avoid <br/>\nthose risks.<br/>\n<br/>\n       To engage in risky behavior without harm doesn&#39;t lessen actual risk. <br/>\nIt just lessens our perception of risk (which perversely may result in more <br/>\nexposure to it.)<br/>\n<br/>\n       Do you know the movie, &quot;The Big Easy&quot; with Dennis Quaid as a New <br/>\nOrleans cop? They arrest a distraught woman for murdering her husband, and are much <br/>\namused because her defense is she never meant to kill him, she&#39;s stabbed him <br/>\nbefore and he didn&#39;t die! &lt;g&gt;<br/>\n<br/>\n       I take your point that you don&#39;t see video games with violent content <br/>\nas risky or objectionable. Not sure you&#39;ve heard me, though. I get the feeling <br/>\nyou&#39;re in some other argument you&#39;ve had before, raising objections to things <br/>\nI haven&#39;t said and never even thought.<br/>\n<br/>\n       Like your riff about &quot;today&#39;s highways&quot; -- I don&#39;t see much <br/>\nrelationship between what I said and how you responded with something about living in <br/>\nthe present only.  (Maybe you meant to be funny?) <br/>\n<br/>\n       Today&#39;s highways are different than when I learned to drive 30 years <br/>\nago. So I have to think about, and deal with, new realities and learning needs <br/>\nfor my children as drivers, not simply go on auto pilot from my own past and <br/>\nhow I was schooled or parented. Also I was a first-born child with a classic <br/>\nfocus on delayed gratification (living in the future)  I agree we are here now, <br/>\nbut not that the present is all we have. It&#39;s all pretty seamless to me.<br/>\n            <br/>\n<br/>\n     JJ<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In a message dated 12/7/03 10:47:56 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jrossedd@...\">jrossedd@...</a> writes:<br/>\n&gt; <br/>\n&gt; &lt;&lt;        But it seems to me worth mentioning that another extreme to avoid <br/>\n&gt; would be a sort of anything-goes tolerance for risky or demonstrably <br/>\n&gt; destructive <br/>\n&gt; choices, in the name of &quot;unschooling.&quot; Where each of us begins to feel that <br/>\n&gt; extreme approaching will vary, of course. Nose-piercing, tattoos, sexual <br/>\n&gt; contact <br/>\n&gt; with others, ingesting mind-altering substances, handling guns, and playing <br/>\n&gt; violent video games all fit into that category for me, when it is my own <br/>\n&gt; children under 14 in question.  &gt;&gt;<br/>\n&gt; <br/>\n&gt; Do you really consider playing video games (which are never violent, thought <br/>\n&gt; <br/>\n&gt; they  might have &quot;violent&quot; subjects, like war, karate kicking, guns) is in <br/>\n&gt; the <br/>\n&gt; same category with mind-altering substances or tattoos or having sex?<br/>\n&gt; <br/>\n&gt; Drugs are illegal, tattoos are permanent, and sex can cause death or <br/>\n&gt; reproduction or both.  A video game is a kid sitting in a chair with a <br/>\n&gt; remote control, <br/>\n&gt; not sticking anything into his body--not ink, LSD, other people&#39;s parts...<br/>\n&gt; <br/>\n&gt; Doesn&#39;t seem at all in the same category to me.<br/>\n&gt; <br/>\n&gt; &lt;&lt;I <br/>\n&gt; protecting and nurturing my children is to first protect them from their own <br/>\n&gt; <br/>\n&gt; extreme behavior long enough to help them to learn how to handle their own <br/>\n&gt; extreme <br/>\n&gt; impulses and desires that might do them permanent harm. &gt;&gt;<br/>\n&gt; <br/>\n&gt; My children have not experienced the &quot;extreme behavior&quot; you seem to be <br/>\n&gt; worried about.   &quot;Tolerance for risky or demonstrably destructive choices&quot; <br/>\n&gt; hasn&#39;t <br/>\n&gt; been an issue at our house.   I think Kirby had sex a time or two (at the <br/>\n&gt; same <br/>\n&gt; camping event) but I know he had condoms because I have them to him when he <br/>\n&gt; seemed in a possible range.  It didn&#39;t cause him to go sex crazy.  It&#39;s been <br/>\n&gt; <br/>\n&gt; nearly a year, and he was the girls boyfriend (in a way, they went to one <br/>\n&gt; movie, <br/>\n&gt; he visited her once and she came over here once) for several weeks and <br/>\n&gt; decided <br/>\n&gt; she wasn&#39;t really all that nice.  No drama, no trauma.   If it happened (as <br/>\n&gt; I <br/>\n&gt; suspect), she was his first but he wasn&#39;t her first.  <br/>\n&gt; <br/>\n&gt; My choice wasn&#39;t &quot;to tolerate&quot; it or not.  It seems to have been a done <br/>\n&gt; deal. <br/>\n&gt; He talked to me an somewhat vague terms about the situation being serious, <br/>\n&gt; and I talked to him in somewhat less vague terms about birth control, and <br/>\n&gt; condoms not being 100%, and serious relationships needing back-up birth <br/>\n&gt; control. He <br/>\n&gt; said &quot;I&#39;ll mention that.&quot;  <br/>\n&gt; <br/>\n&gt; When I was his age I was having sex.  He&#39;s that age and is not (in general <br/>\n&gt; terms).<br/>\n&gt; <br/>\n&gt; &lt;&lt;Those are some places that the &quot;it&#39;s their body so <br/>\n&gt; what&#39;s the harm?&quot; philosophy seems extreme to me. &gt;&gt;<br/>\n&gt; <br/>\n&gt; I haven&#39;t heard people say &quot;it&#39;s their body so what&#39;s the harm?&quot;<br/>\n&gt; <br/>\n&gt; It IS their body.  So help them learn to make choices when it&#39;s not so <br/>\n&gt; crucial instead of deciding for them up to the point that they&#39;re making <br/>\n&gt; their very <br/>\n&gt; first solo choices ever about things like tattoos, drugs, sex, guns, etc.<br/>\n&gt; <br/>\n&gt; My kids have been making choices their whole lives, and I don&#39;t see them <br/>\n&gt; doing crazy or dangerous or impulsive things.<br/>\n&gt; <br/>\n&gt; That pretty much goes against this:  &quot;I think part of my job in <br/>\n&gt; protecting and nurturing my children is to first protect them from their own <br/>\n&gt; <br/>\n&gt; extreme behavior long enough to help them to learn how to handle their own <br/>\n&gt; extreme <br/>\n&gt; impulses and desires that might do them permanent harm. &quot;<br/>\n&gt; <br/>\n&gt; That doesn&#39;t mean, though, that I have not protected them, that I haven&#39;t <br/>\n&gt; helped them learn, and that I don&#39;t care whether they are done permanent <br/>\n&gt; harm.<br/>\n&gt; <br/>\n&gt; The article on balance is a warning against seeing the world as two extreme <br/>\n&gt; choices, either controlling or &quot;losing control.&quot;<br/>\n&gt; <br/>\n&gt; &lt;&lt;  Up to now, I had been mainly thinking about how as an unschooler to <br/>\n&gt; help them handle learning to drive a car on today&#39;s highways, &gt;&gt;<br/>\n&gt; <br/>\n&gt; What other highways could they learn on?  The past and future are not <br/>\n&gt; useable <br/>\n&gt; highways.  Here we are, just today.  Just now.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":85839,"nextTopicId":85797}}