{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":14,"messages":[{"userId":280852700,"authorName":"Schuyler","from":"&quot;Schuyler&quot; &lt;s.waynforth@...&gt;","profile":"schuyler_waynforth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [AlwaysLearning] Re: Bible beaters","postDate":"1182186991","msgId":29368,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZjYwMWM3YjFjYyQ2YmQwMGM3MCQ0MDAxYThjMEBEYXZpZD4=","referencesHeader":"PGY1NjI3aStsajR0QGVHcm91cHMuY29tPiA8MDBiMzAxYzdiMWJhJGUxZjY1ODgwJDQwMDFhOGMwQERhdmlkPiA8NDY1RDYzNTctOTYwQS00RUZDLUIxRDctNUU4QURDNkI2MDY2QHNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":29365,"nextInTopic":0,"prevInTime":29367,"nextInTime":29369,"topicId":29345,"numMessagesInTopic":0,"msgSnippet":"Right, yes, good, now I can have the correct version in my head. Yay! I also like the line instead of some other topic it has wondered into it feels very","messageBody":"<div id=\"ygrps-yiv-1281084103\">Right, yes, good, now I can have the correct version in my head. Yay!<br/>\n<br/>\nI also like the line &quot;instead of some other topic it has wondered into&quot; it <br/>\nfeels very unschooling to me.<br/>\n<br/>\nSchuyler<br/>\nwww.waynforth.blogspot.com<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; -=-Recently Sandra posted Mary Gold&#39;s statement &quot;It isn&#39;t the<br/>\n&gt; unschooling it&#39;s<br/>\n&gt; the life&quot; and I&#39;ve been hearing those words echo in my head-=-<br/>\n&gt;<br/>\n&gt; It isn&#39;t the unschooling, it&#39;s life.<br/>\n&gt;<br/>\n&gt; (Right?  I think that&#39;s Mary&#39;s recommended saying...) </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Bible beaters","postDate":"1182185043","msgId":29365,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2NUQ2MzU3LTk2MEEtNEVGQy1CMUQ3LTVFOEFEQzZCNjA2NkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDAwYjMwMWM3YjFiYSRlMWY2NTg4MCQ0MDAxYThjMEBEYXZpZD4=","referencesHeader":"PGY1NjI3aStsajR0QGVHcm91cHMuY29tPiA8MDBiMzAxYzdiMWJhJGUxZjY1ODgwJDQwMDFhOGMwQERhdmlkPg=="},"prevInTopic":29364,"nextInTopic":29368,"prevInTime":29364,"nextInTime":29366,"topicId":29345,"numMessagesInTopic":0,"msgSnippet":"-=-Recently Sandra posted Mary Gold s statement It isn t the unschooling it s the life and I ve been hearing those words echo in my head-=- It isn t the","messageBody":"<div id=\"ygrps-yiv-281444039\">-=-Recently Sandra posted Mary Gold&#39;s statement &quot;It isn&#39;t the  <br/>\nunschooling it&#39;s<br/>\nthe life&quot; and I&#39;ve been hearing those words echo in my head-=-<br/>\n<br/>\nIt isn&#39;t the unschooling, it&#39;s life.<br/>\n<br/>\n(Right?  I think that&#39;s Mary&#39;s recommended saying...)<br/>\n<br/>\nTo clarify, the person who wrote was complaining about the discussion  <br/>\nof Bible thumpers or beaters, and that&#39;s the post I didn&#39;t let  <br/>\nthrough, though I did write to her directly and immediately, so she  <br/>\nhad feedback.  But she was angry that she couldn&#39;t say just whatever  <br/>\non earth she wanted to, to the whole list.  We don&#39;t have to give  <br/>\njust anyone the microphone here, and when people abuse it I put them  <br/>\nback on moderation where all new members start by default.<br/>\n<br/>\nI don&#39;t think that&#39;s unreasonable.  If anyone DOES think it&#39;s  <br/>\nunreasonable, she&#39;s free to make a yahoolist and set it up absolutely  <br/>\nunmoderated and go for it!    You can announce it here and invite the  <br/>\nmembers of this list over.  If you allow just anyone to join  <br/>\nautomatically and post, what you will end up with is a bunch of posts  <br/>\nadvertising nonsense, degrees online, and sex links, and kinda crazy  <br/>\nchain letter stuff about aliens in Pennsylvania or that public  <br/>\ntelevision wants everyone to sign this petition RIGHT NOW, or that if  <br/>\neveryone doesn&#39;t write to the U.S. government that e-mails are about  <br/>\nto cost a nickel apiece and then the people in other countries wonder  <br/>\nwhat the heck is a  nickel and why on earth should they give a rat&#39;s  <br/>\nass.  Oh.  And then people drop off the list because it has just  <br/>\nbecome another way for junk mail to get into their mailboxes.<br/>\n<br/>\nI have many, many years of experience now with online communications  <br/>\nin list style and forum/message board, and a couple of years of blog  <br/>\nexperience now (my own for a year and a half and reading others for  <br/>\nlonger), and some with MySpace.   Comments are often too soon, too  <br/>\nthoughtless, unaware of circumstances and history.  Often it&#39;s kinder  <br/>\nto shield a person from being exposed as hasty, thoughtless and  <br/>\nunaware than to give them the podium.<br/>\n<br/>\nIf there is a side discussion (they always peter out after a bit) and  <br/>\npeople are saying &quot;oh?&quot;  &quot;Yeah&quot;   &quot;I don&#39;t think so&quot;  &quot;Yeah, it is.&quot;   <br/>\nthen what never does  help is for someone new to the list to add &quot;All  <br/>\nof you stop talking about that because I wish you were talking about  <br/>\nsomething else; you and the list suck.&quot;<br/>\n<br/>\nWhen anyone wishes the list was about kids instead of some other  <br/>\ntopic it has wondered into, the thing to do is to post about your kids.<br/>\nIf you wish the list was more about reading, write about reading.<br/>\nIf you wish the list was discussing ANYthing that&#39;s not even ore off  <br/>\ntopic than whatever&#39;s bugging you, post that on-topic thing and  <br/>\nothers will respond.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Bible beaters","postDate":"1182184192","msgId":29364,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZBQzI4MUQzLTRBRDMtNDZDOC04NjAwLTBENTc5Q0QwREQ1NkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGY1NjI3aStsajR0QGVHcm91cHMuY29tPg==","referencesHeader":"PGY1NjI3aStsajR0QGVHcm91cHMuY29tPg=="},"prevInTopic":29363,"nextInTopic":29365,"prevInTime":29363,"nextInTime":29365,"topicId":29345,"numMessagesInTopic":0,"msgSnippet":"-=-I think it s wonderful that life is made up of people who are seriously committed to their own beliefs. When I am clear on what mine are I am not affected","messageBody":"<div id=\"ygrps-yiv-1753449388\">-=-I think it&#39;s wonderful that life is made up of people who are<br/>\nseriously committed to their own beliefs. When I am clear on what<br/>\nmine are I am not affected by others&#39; beliefs. -=-<br/>\n<br/>\nJust like the proselytizing woman was unaffected by your belief that  <br/>\nthere was no hell.<br/>\n<br/>\nJust like I&#39;m unaffected by people who say kids cannot learn to read  <br/>\nwithout being taught (as I live with three big people who drive, and  <br/>\nread great, who figured out reading in their own natural, real ways  <br/>\nwithout spending hours and hours, months or years, on lessons).<br/>\n<br/>\nJust like the new member/critic responded to me in an instant instead  <br/>\nof actually looking at any of the links I had sent her, or at the  <br/>\narchives of the group.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":280852700,"authorName":"Schuyler","from":"&quot;Schuyler&quot; &lt;s.waynforth@...&gt;","profile":"schuyler_waynforth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [AlwaysLearning] Re: Bible beaters","postDate":"1182179458","msgId":29363,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYjMwMWM3YjFiYSRlMWY2NTg4MCQ0MDAxYThjMEBEYXZpZD4=","referencesHeader":"PGY1NjI3aStsajR0QGVHcm91cHMuY29tPg=="},"prevInTopic":29362,"nextInTopic":29364,"prevInTime":29362,"nextInTime":29364,"topicId":29345,"numMessagesInTopic":0,"msgSnippet":"... I think that is often what is happening when people come to this list and other lists and get very offended by people s experiences, and responses to the","messageBody":"<div id=\"ygrps-yiv-1146272553\"><blockquote><span title=\"ireply\">&gt; I think it&#39;s wonderful that life is made up of people who are<br/>\n&gt; seriously committed to their own beliefs.  When I am clear on what<br/>\n&gt; mine are I am not affected by others&#39; beliefs.  When I am unsure of<br/>\n&gt; what I believe is when I notice that I really want to listen to what<br/>\n&gt; others are saying to see if I can gain clarity on my own belief<br/>\n&gt; systems.<br/>\n<br/>\n </span></blockquote>I think that is often what is happening when people come to this list and <br/>\nother lists and get very offended by people&#39;s experiences, and responses to <br/>\nthe things that they are sure are true, like letting a 4 year old watch <br/>\ntelevision will lead to a 25 year old axe murderer or children given a wide <br/>\nrange of food choices will always choose sugar and starches and e-numbers, <br/>\nor something like that. I&#39;m not terribly vocal about what challenges me in <br/>\nmy household. I&#39;m ever so afraid of getting it wrong, but I watch and I read <br/>\nand I listen. And it all helps so much. So that when something similar, or <br/>\nsomething comes up, instead of going to that fearful place where I say &quot;no&quot; <br/>\nor I say &quot;I don&#39;t think you should&quot; I can think it through with other <br/>\npeople&#39;s stories and experiences in my head. And really examine what my <br/>\nfears are based on.<br/>\n<br/>\nToday Simon bought a couple of packs of Yu-gi-oh cards on ebay. He was very <br/>\nexcited by his purchase. I thought he&#39;d put it on the watch list, which is <br/>\nwhat he usually does with things he wants me or David to get for him from <br/>\nebay. But I got an e-mail requesting payment and I got nervous about him <br/>\nbuying things willy nilly. Which is silly, Simon is incredible sensible with <br/>\nhis money and with what he wants to buy, and even if he weren&#39;t, it is not <br/>\nas if I couldn&#39;t respond after the fact. But, when I asked him the details <br/>\nof the transaction, he knew the shipping costs and the sale costs. I then <br/>\nshowed him the couple of things I look for in an ebay transaction, the <br/>\nbuyer&#39;s feedback profile and if VAT is added. It wasn&#39;t anything scary, but <br/>\nI have a vague sense that money is something that needs to be very <br/>\ncontrolled. Which means that it is an irrational control issue that I need <br/>\nto examine and take back to a rational response.---In an addendum (within <br/>\ntext) Simon is currently interested in buying a Duel Disk and I asked him <br/>\nwhat he was willing to pay for it. He said that he was willing to go up to <br/>\n14 pounds because there was a buy it now one for 14 pounds. See, my fears <br/>\nwere completly absurd.<br/>\n<br/>\nRecently Sandra posted Mary Gold&#39;s statement &quot;It isn&#39;t the unschooling it&#39;s <br/>\nthe life&quot; and I&#39;ve been hearing those words echo in my head. Today I got <br/>\nhungry, which meant that I needed to quickly grab something. I don&#39;t often <br/>\nlet hunger sneak up on me, but I was busy with Simon and Linnaea and looking <br/>\nup words beginning with le in the dictionary so that Linnaea could make her <br/>\nsuper neutral (neither good nor evil) name that began with le (she decided <br/>\non Lynx). And as the hunger overwhelmed my mood they were dealing with the <br/>\nfact that there was only one egg but they both wanted to make french toast, <br/>\nSimon wanted to use cow milk and Linnaea wanted to use soy. And I wanted to <br/>\nnot have to deal with this right now! But instead I grabbed a roll and <br/>\nshoved it in my mouth, suggested that they could scramble the egg and then <br/>\ndivide it in half and then add their milk of choice. It also helps me to <br/>\nhear those words when they are unhappy. That maybe they would feel better if <br/>\nthey had food, or sleep, or a drink, or the computer that they are craving <br/>\nnow or whatever.<br/>\n<br/>\nSo, I think it is very easy to believe that a challenge is an assualt, but <br/>\nit is much more helpful, to you and yours, to see a challenge as something <br/>\nto be honestly examined, to be open to as it may change the way you live and <br/>\nlove with those you love.<br/>\n<br/>\nSchuyler<br/>\nwww.waynforth.blogspot.com</div>","specialLinks":[]},{"userId":49413852,"authorName":"Dawn","from":"&quot;Dawn&quot; &lt;dawn@...&gt;","profile":"astrologerdawn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Bible beaters","postDate":"1182174258","msgId":29362,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY1NjI3aStsajR0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ3Y2Q5MGUyMDcwNjE3MjA1MHg0ZWMxMjBkMWxiMmE0MGM5YzdjY2Y2ODllQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":29359,"nextInTopic":29363,"prevInTime":29361,"nextInTime":29363,"topicId":29345,"numMessagesInTopic":0,"msgSnippet":"For me this meant people who either quoted the bible at me as being the doctrine by which I ought to be living or would use chapter and verse to let me know","messageBody":"<div id=\"ygrps-yiv-1353839675\">For me this meant people who either quoted the bible at me as being <br/>\nthe doctrine by which I ought to be living or would use chapter and <br/>\nverse to let me know that as a Metaphysical Practitioner I was going <br/>\nto hell if I didn&#39;t follow their belief systems.  Either way I think <br/>\nit&#39;s funny because I&#39;m not attached to the opinions of someone that <br/>\nquotes the bible at me as it&#39;s not the book I use to base my beliefs <br/>\nupon.<br/>\n<br/>\nI had an incident about 10 years ago with a woman(born again <br/>\nChristian - she told me this) in a 2nd hand book store spending over <br/>\n1 hour (closer to 2 actually) trying to convince me that I was going <br/>\nto hell because I am an astrologer.  <br/>\n<br/>\nI listened very patiently to what she had to say and I kept on <br/>\nsaying to her &quot;I absolutely believe that you believe what you are <br/>\nsaying.  However I don&#39;t believe the same as you&quot;... I really meant <br/>\nit that I had respect for her belief systems, they were just not the <br/>\nsame as mine and for me mine work for me and hers worked for her.  <br/>\n<br/>\nEventually she became exhausted and gave up on trying to convert me <br/>\nand see things her way.  I loved listening to her read me biblical <br/>\npassages, trying to change my belief systems and I realized not long <br/>\nafter it would belike someone trying to convince me that sending my <br/>\nchild to a boarding school in New Zealand (no offense to New <br/>\nZealanders, it&#39;s just far away from Tucson, AZ), wearing a uniform <br/>\nwould be a great thing.  (Zak was about 3 at the time and I&#39;d <br/>\ndiscovered unschooling, much to the chagrin of everyone around me at <br/>\nthat time).<br/>\n<br/>\nI think it&#39;s wonderful that life is made up of people who are <br/>\nseriously committed to their own beliefs.  When I am clear on what <br/>\nmine are I am not affected by others&#39; beliefs.  When I am unsure of <br/>\nwhat I believe is when I notice that I really want to listen to what <br/>\nothers are saying to see if I can gain clarity on my own belief <br/>\nsystems.<br/>\n<br/>\nThis unschooling thingy is a process for me that reveals itself to <br/>\nme everyday.  Mostly for me it&#39;s about deschooling myself (and <br/>\nhubby).<br/>\n<br/>\nNamaste<br/>\n<br/>\nDawn<br/>\nTucson, AZ<br/>\nZak 11, Max 7<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Susan &lt;SusanYvonne@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; &gt; It might be being used in lieu of, instead of, but it <br/>\ndoesn&#39;t &quot;mean<br/>\n&gt; &gt; the same thing,&quot; and I&#39;m guessing was first used by people who <br/>\ndidn&#39;t<br/>\n&gt; &gt; know thump from thrash.  To stab a finger onto a page and <br/>\nsay &quot;RIGHT<br/>\n&gt; &gt; HERE, in God&#39;s Holy Word&quot; is a thump.  To hold the Bible up and <br/>\ntap<br/>\n&gt; &gt; it and use it as a symbol of direct-from-Jesus-in-17th-century-<br/>\n&gt; &gt; English gospel is to thump it.    It&#39;s not to beat it. <br/>\n&lt;snip&gt;  &quot;Bible beaters&quot; doesn&#39;t make<br/>\n&gt; &gt; sense.<br/>\n&gt; <br/>\n&gt; I must have missed out on the first part of this thread (or my<br/>\n&gt; messages are being delivered out of order again from Yahoo) but as<br/>\n&gt; Andrea pointed out, &quot;bible beaters&quot; is a commonly used phrase on <br/>\nparts<br/>\n&gt; of the east coast (where I live) and it does make sense if you <br/>\nwere to<br/>\n&gt; witness this phrase in action.<br/>\n&gt; <br/>\n&gt; The folks here don&#39;t thump at a passage with a finger, they don&#39;t <br/>\nhold<br/>\n&gt; it up and tap it - there are many denominations - particularly the<br/>\n&gt; very conservative ones - that hold the bible in one hand or place <br/>\nit<br/>\n&gt; on their lap or the podium and literally beat the bible with their<br/>\n&gt; fist as they talk. They also tend to smack and pound it on the <br/>\npodium,<br/>\n&gt; the backs of the pews, and anything else that happens to be nearby<br/>\n&gt; when preaching or discussing it passionately. This behavior is why <br/>\nthe<br/>\n&gt; phrases &quot;bible beaters&quot; and &quot;beat the bible into them&quot; and other <br/>\nsuch<br/>\n&gt; similar sayings are heard around this area.<br/>\n&gt; <br/>\n&gt; -- Susan, with the east coast bible-belt perspective<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":210335840,"authorName":"Susan","from":"Susan &lt;SusanYvonne@...&gt;","profile":"taodesuki","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Bible beaters","postDate":"1182138655","msgId":29359,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3Y2Q5MGUyMDcwNjE3MjA1MHg0ZWMxMjBkMWxiMmE0MGM5YzdjY2Y2ODllQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDc5QTk0MDIwLTZCNTUtNDhCMy05NkZFLTVCRkVDOTY3N0MyQkBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGY1NGxnZCtndXI1QGVHcm91cHMuY29tPgkgPDc5QTk0MDIwLTZCNTUtNDhCMy05NkZFLTVCRkVDOTY3N0MyQkBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":29358,"nextInTopic":29362,"prevInTime":29358,"nextInTime":29360,"topicId":29345,"numMessagesInTopic":0,"msgSnippet":"... I must have missed out on the first part of this thread (or my messages are being delivered out of order again from Yahoo) but as Andrea pointed out,","messageBody":"<div id=\"ygrps-yiv-1793752099\"><blockquote><span title=\"ireply\">&gt; It might be being used in lieu of, instead of, but it doesn&#39;t &quot;mean<br/>\n&gt; the same thing,&quot; and I&#39;m guessing was first used by people who didn&#39;t<br/>\n&gt; know thump from thrash.  To stab a finger onto a page and say &quot;RIGHT<br/>\n&gt; HERE, in God&#39;s Holy Word&quot; is a thump.  To hold the Bible up and tap<br/>\n&gt; it and use it as a symbol of direct-from-Jesus-in-17th-century-<br/>\n&gt; English gospel is to thump it.    It&#39;s not to beat it. &lt;snip&gt;  &quot;Bible beaters&quot; doesn&#39;t make<br/>\n&gt; sense.<br/>\n<br/>\n </span></blockquote>I must have missed out on the first part of this thread (or my<br/>\nmessages are being delivered out of order again from Yahoo) but as<br/>\nAndrea pointed out, &quot;bible beaters&quot; is a commonly used phrase on parts<br/>\nof the east coast (where I live) and it does make sense if you were to<br/>\nwitness this phrase in action.<br/>\n<br/>\nThe folks here don&#39;t thump at a passage with a finger, they don&#39;t hold<br/>\nit up and tap it - there are many denominations - particularly the<br/>\nvery conservative ones - that hold the bible in one hand or place it<br/>\non their lap or the podium and literally beat the bible with their<br/>\nfist as they talk. They also tend to smack and pound it on the podium,<br/>\nthe backs of the pews, and anything else that happens to be nearby<br/>\nwhen preaching or discussing it passionately. This behavior is why the<br/>\nphrases &quot;bible beaters&quot; and &quot;beat the bible into them&quot; and other such<br/>\nsimilar sayings are heard around this area.<br/>\n<br/>\n-- Susan, with the east coast bible-belt perspective</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Bible beaters","postDate":"1182138454","msgId":29358,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQxQ0FFODQwLUUzRkMtNDJCMC04RDhFLTU4NkVFOTY1OTE4REBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDc3QzA4MkIyLTRBRkUtNEMxNC05Qjc3LTg1QzM5OTY5N0E2QUBlYXJ0aGxpbmsubmV0Pg==","referencesHeader":"PGY1NGxnZCtndXI1QGVHcm91cHMuY29tPiA8NzlBOTQwMjAtNkI1NS00OEIzLTk2RkUtNUJGRUM5Njc3QzJCQHNhbmRyYWRvZGQuY29tPiA8NDY3NUUzOTkuMzAzMDYwNUBpaHVnLmNvLm56PiA8MTkyNjdBRjItNDI3MC00NzlDLUE2MUUtQTEzNTU3NTAxRDdDQHNhbmRyYWRvZGQuY29tPiA8NzdDMDgyQjItNEFGRS00QzE0LTlCNzctODVDMzk5Njk3QTZBQGVhcnRobGluay5uZXQ+"},"prevInTopic":29357,"nextInTopic":29359,"prevInTime":29357,"nextInTime":29359,"topicId":29345,"numMessagesInTopic":0,"msgSnippet":"-=-Bible thumpers thump Bibles; they don t thump people with Bibles. I ve certainly felt attacked with Bible quotes though. -=- Yeah, I did think of that... ","messageBody":"<div id=\"ygrps-yiv-255341324\">-=-Bible thumpers thump Bibles; they don&#39;t thump people with Bibles.<br/>\n<br/>\nI&#39;ve certainly felt attacked with Bible quotes though.<br/>\n-=-<br/>\n<br/>\nYeah, I did think of that...<br/>\nThey&#39;ll beat you up with threats of hell.<br/>\n<br/>\nDo unschoolers do that?  Do we say &quot;repent now or the horrors of  <br/>\nschool will be eternally upon you&quot;?<br/>\n<br/>\nMaybe.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Bible beaters","postDate":"1182138003","msgId":29357,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc3QzA4MkIyLTRBRkUtNEMxNC05Qjc3LTg1QzM5OTY5N0E2QUBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDE5MjY3QUYyLTQyNzAtNDc5Qy1BNjFFLUExMzU1NzUwMUQ3Q0BzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGY1NGxnZCtndXI1QGVHcm91cHMuY29tPiA8NzlBOTQwMjAtNkI1NS00OEIzLTk2RkUtNUJGRUM5Njc3QzJCQHNhbmRyYWRvZGQuY29tPiA8NDY3NUUzOTkuMzAzMDYwNUBpaHVnLmNvLm56PiA8MTkyNjdBRjItNDI3MC00NzlDLUE2MUUtQTEzNTU3NTAxRDdDQHNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":29356,"nextInTopic":29358,"prevInTime":29356,"nextInTime":29358,"topicId":29345,"numMessagesInTopic":0,"msgSnippet":"... I ve certainly felt attacked with Bible quotes though. Joyce [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-1612311382\">On Jun 17, 2007, at 10:50 PM, Sandra Dodd wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Bible thumpers thump Bibles; they don&#39;t thump people with Bibles.<br/>\n<br/>\n </span></blockquote>I&#39;ve certainly felt attacked with Bible quotes though.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Bible beaters","postDate":"1182135024","msgId":29356,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5MjY3QUYyLTQyNzAtNDc5Qy1BNjFFLUExMzU1NzUwMUQ3Q0BzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDQ2NzVFMzk5LjMwMzA2MDVAaWh1Zy5jby5uej4=","referencesHeader":"PGY1NGxnZCtndXI1QGVHcm91cHMuY29tPiA8NzlBOTQwMjAtNkI1NS00OEIzLTk2RkUtNUJGRUM5Njc3QzJCQHNhbmRyYWRvZGQuY29tPiA8NDY3NUUzOTkuMzAzMDYwNUBpaHVnLmNvLm56Pg=="},"prevInTopic":29355,"nextInTopic":29357,"prevInTime":29355,"nextInTime":29357,"topicId":29345,"numMessagesInTopic":0,"msgSnippet":"-=-I think it is meant as a person who metaphorically bashes (or beats, I guess) you over the head with a bible i.e. to do just what a bible thumper does.-=-","messageBody":"<div id=\"ygrps-yiv-1714054706\">-=-I<br/>\nthink it is meant as a person who metaphorically &quot;bashes (or beats, I<br/>\nguess) you over the head with a bible&quot; i.e. to do just what a bible<br/>\nthumper does.-=-<br/>\n<br/>\nBible thumpers thump Bibles; they don&#39;t thump people with Bibles.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1675643,"authorName":"Cally Brown","from":"Cally Brown &lt;mjcmbrwn@...&gt;","profile":"cally_marg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Bible beaters","postDate":"1182131097","msgId":29355,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2NzVFMzk5LjMwMzA2MDVAaWh1Zy5jby5uej4=","inReplyToHeader":"PDc5QTk0MDIwLTZCNTUtNDhCMy05NkZFLTVCRkVDOTY3N0MyQkBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGY1NGxnZCtndXI1QGVHcm91cHMuY29tPiA8NzlBOTQwMjAtNkI1NS00OEIzLTk2RkUtNUJGRUM5Njc3QzJCQHNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":29354,"nextInTopic":29356,"prevInTime":29354,"nextInTime":29356,"topicId":29345,"numMessagesInTopic":0,"msgSnippet":"Here in New Zealand, the most commonly used term is bible basher . I think it is meant as a person who metaphorically bashes (or beats, I guess) you over the","messageBody":"<div id=\"ygrps-yiv-123255230\">Here in New Zealand, the most commonly used term is &quot;bible basher&quot;. I <br/>\nthink it is meant as a person who metaphorically &quot;bashes (or beats, I <br/>\nguess) you over the head with a bible&quot; i.e. to do just what a bible <br/>\nthumper does.<br/>\n<br/>\nThe reality is pretty offensive which ever term you use!<br/>\n<br/>\nCally</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Bible beaters","postDate":"1182130298","msgId":29354,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5QTk0MDIwLTZCNTUtNDhCMy05NkZFLTVCRkVDOTY3N0MyQkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGY1NGxnZCtndXI1QGVHcm91cHMuY29tPg==","referencesHeader":"PGY1NGxnZCtndXI1QGVHcm91cHMuY29tPg=="},"prevInTopic":29353,"nextInTopic":29355,"prevInTime":29353,"nextInTime":29355,"topicId":29345,"numMessagesInTopic":0,"msgSnippet":"-=-I  know you have a great love for words, so I thought I d mention this: Bible beater is a widely used term that means the same thing as Bible","messageBody":"<div id=\"ygrps-yiv-1575160912\">-=-I  know you have a great love for words, so I thought I&#39;d mention  <br/>\nthis:<br/>\n&quot;Bible beater&quot; is a widely used term that means the same thing as<br/>\n&quot;Bible thumper.&quot;-=-<br/>\n<br/>\nOkay, thanks.  I didn&#39;t know the term.<br/>\n<br/>\nIt might be being used in lieu of, instead of, but it doesn&#39;t &quot;mean  <br/>\nthe same thing,&quot; and I&#39;m guessing was first used by people who didn&#39;t  <br/>\nknow thump from thrash.  To stab a finger onto a page and say &quot;RIGHT  <br/>\nHERE, in God&#39;s Holy Word&quot; is a thump.  To hold the Bible up and tap  <br/>\nit and use it as a symbol of direct-from-Jesus-in-17th-century- <br/>\nEnglish gospel is to thump it.    It&#39;s not to beat it.<br/>\n<br/>\nThere are those among the &quot;lower church&quot; protestants who worship the  <br/>\nbook itself, and they point at it and touch it for emphasis.  It&#39;s  <br/>\ngoofy but it has a basis in reality.  &quot;Bible beaters&quot; doesn&#39;t make  <br/>\nsense.  Sorry.<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":125182846,"authorName":"alexandriapalonia","from":"&quot;alexandriapalonia&quot; &lt;alexandriapalonia@...&gt;","profile":"alexandriapalonia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Bible beaters","postDate":"1182128461","msgId":29353,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY1NGxnZCtndXI1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDg5RDE3M0M5LTBGMkItNDQwOS04Q0JBLTg3OTU5Q0Y5NjczMkBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":29346,"nextInTopic":29354,"prevInTime":29352,"nextInTime":29354,"topicId":29345,"numMessagesInTopic":0,"msgSnippet":"I know you have a great love for words, so I thought I d mention this: Bible beater is a widely used term that means the same thing as Bible thumper. It","messageBody":"<div id=\"ygrps-yiv-1426176138\">I know you have a great love for words, so I thought I&#39;d mention this:<br/>\n&quot;Bible beater&quot; is a widely used term that means the same thing as<br/>\n&quot;Bible thumper.&quot;<br/>\n<br/>\nIt seems to be a more east-coast term, but there&#39;s plenty of folks out<br/>\nthere using it in lieu of &quot;Bible thumper.&quot;<br/>\n<br/>\nAndrea <br/>\n<br/>\n <br/>\n<blockquote><span title=\"qreply\"> &gt; Comparing us to &quot;bible beaters&quot; (and PLEASE, the term is &quot;Bible  <br/>\n&gt; thumpers&quot;--get it straight) isn&#39;t helpful at all.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt;S600 </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] about uninvited e-mail","postDate":"1182048321","msgId":29346,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg5RDE3M0M5LTBGMkItNDQwOS04Q0JBLTg3OTU5Q0Y5NjczMkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEVGOEUzNDA4LTU1MEYtNEQzOC05QzZDLTU4ODE1QUZGNkY0N0BzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDAwMTEwMWM3YjA4MSQ5ZTMxYzRjMCQ2NDAxYThjMEBXSUZFPiA8RUY4RTM0MDgtNTUwRi00RDM4LTlDNkMtNTg4MTVBRkY2RjQ3QHNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":29345,"nextInTopic":29353,"prevInTime":29345,"nextInTime":29347,"topicId":29345,"numMessagesInTopic":0,"msgSnippet":"-=-Again though, I have to do what I feel is best for my son and my family and I would hope that the people on a group like this would be respectful of that","messageBody":"<div id=\"ygrps-yiv-1633246150\">-=-Again though, I have to do what I feel is best for my son and my  <br/>\nfamily and<br/>\nI would hope that the people on a group like this would be respectful of<br/>\nthat fact.-=-<br/>\n<br/>\n&quot;Respectful&quot; meaning accepting of all choices as equally valid?<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/priorities\">http://sandradodd.com/priorities</a><br/>\n<br/>\nIf the priority in one&#39;s life or in a discussion is unschooling, then  <br/>\nsuggestions that lead toward unschooling are superior (for purposes  <br/>\nof that discussion or in that family) to suggestions and decisions  <br/>\nthat will hamper unschooling.<br/>\n<br/>\n-=- I signed up for this group hoping that the folks weren&#39;t so<br/>\njudgmental as the bible beaters I usually run into on the local groups<br/>\naround us so I could speak a little more freely - guess that isn&#39;t the<br/>\ncase.&quot;<br/>\n-=-<br/>\n<br/>\nYou DID speak freely, and the posts were allowed through to the list.<br/>\nIf you want to express yourself and be praised instead of questioned,  <br/>\nthen you need to figure out what a particular group considers  <br/>\npraiseworthy and express that, or at least don&#39;t express what they  <br/>\nwill question.<br/>\n<br/>\nIf you got to a vegetarian workshop and say you don&#39;t see any problem  <br/>\nwith hotdogs, don&#39;t be surprised if they tell you the problems they see.<br/>\nIf you go to a Harley enthusiasts&#39; rally and say you think there&#39;s no  <br/>\nreal difference between a Kawasaki and a Harley, they will probably  <br/>\ndisagree with you.<br/>\n<br/>\nComparing us to &quot;bible beaters&quot; (and PLEASE, the term is &quot;Bible  <br/>\nthumpers&quot;--get it straight) isn&#39;t helpful at all.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"about uninvited e-mail","postDate":"1182047112","msgId":29345,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVGOEUzNDA4LTU1MEYtNEQzOC05QzZDLTU4ODE1QUZGNkY0N0BzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDAwMTEwMWM3YjA4MSQ5ZTMxYzRjMCQ2NDAxYThjMEBXSUZFPg==","referencesHeader":"PDAwMTEwMWM3YjA4MSQ5ZTMxYzRjMCQ2NDAxYThjMEBXSUZFPg=="},"prevInTopic":0,"nextInTopic":29346,"prevInTime":29344,"nextInTime":29346,"topicId":29345,"numMessagesInTopic":0,"msgSnippet":"-=-To me I assumed this meant you did not want this discussion on your list.-= I didn t want it privately either. The analogy I have in mind about people who","messageBody":"<div id=\"ygrps-yiv-1489521944\">-=-To me I assumed this meant you did not want this discussion on  <br/>\nyour list.-=<br/>\n<br/>\nI didn&#39;t want it privately either.<br/>\n<br/>\nThe analogy I have in mind about people who send private e-mail is this:<br/>\nThis meeting is private.  Anyone&#39;s welcome to come.  They can even  <br/>\ncome up and take the mic and speak.  But if the speeches aren&#39;t in  <br/>\nkeeping with the purpose of the meeting, the mic might be taken away  <br/>\nfrom them early, or they&#39;ll be asked to listen for a while.<br/>\n<br/>\nSpeeches are to be supportive of the principles of unschooling, not  <br/>\njust be about anything in the whole wide world.  It&#39;s an unschooling  <br/>\nmeeting.<br/>\n<br/>\nIf someone doesn&#39;t like the way the meeting went, they can just not  <br/>\ncome back next week (as it were).  They should NOT follow someone  <br/>\nhome and accost her on her own front porch, which is what it can feel  <br/>\nlike when someone who made a public speech/post is then addressed  <br/>\nprivately and critically about it.<br/>\n<br/>\nStay in the light of the whole list, and if a listowner asks you not  <br/>\nto discuss something, it&#39;s not a negotiable point.  It&#39;s a request  <br/>\nfor you to let the mic go to those who are speaking from an  <br/>\nunschooling point of view.<br/>\n<br/>\nI don&#39;t need to provide a forum for people to say unschooling sucks,  <br/>\nthat we&#39;re wrong and that nothing we do is any better than whatever  <br/>\nany other family chooses to do.    There&#39;s no benefit to anyone to  <br/>\nbring other messages here.  It won&#39;t help them understand unschooling  <br/>\nand it won&#39;t help those many other dozens or hundreds who are just  <br/>\nreading and not writing.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":29336,"nextTopicId":29360}}