{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","replyTo":"LIST","senderId":"hlV1vtYNRCsB_9hOLKCdPxSK1DjN-hRSpAAjMNHIJyMSG8BpBHn8BQxLRqIEVbbn_68wZaXt243LJzDZYYZ2fdY37g","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Fw: Interior Nominee Billed Alaska For Assistaqnce to Private Group","postDate":"979347169","msgId":15046,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZjQwMWMwN2NmYyQyZjU1NWMyMCQyNDVkZDFkMUBsZGlvbm5vPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":15045,"nextInTime":15047,"topicId":15046,"numMessagesInTopic":0,"msgSnippet":"For those keeping up on the politics of Dumbya s proposed appointees. Lynda ... year ... been ... she ... ask ... Department ... director ... tool ... proper ","messageBody":"<div id=\"ygrps-yiv-265794326\">For those keeping up on the politics of Dumbya&#39;s proposed appointees.<br/>\n<br/>\nLynda<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\n&gt;  INTERIOR NOMINEE BILLED ALASKA FOR ASSISTANCE TO PRIVATE GROUP<br/>\n&gt;<br/>\n&gt; The Arizona Republic<br/>\n&gt; Interior nominee billed Alaska for assistance to private group<br/>\n&gt;<br/>\n&gt; Associated Press<br/>\n&gt; Jan. 12, 2001 10:30:00<br/>\n&gt;<br/>\n&gt; WASHINGTON - Gale Norton billed the Alaska Legislature $270 an hour last<br/>\nyear<br/>\n&gt; to help overturn a fishing policy of the Interior Department that she&#39;s<br/>\nbeen<br/>\n&gt; chosen to run. Billing records also show she charged the state for help<br/>\nshe<br/>\n&gt; gave a private group in the case.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Alaska Democrats and environmentalists are questioning why Norton would<br/>\nask<br/>\n&gt; Alaska&#39;s taxpayers to pay for her to assist the Mountain States Legal<br/>\n&gt; Foundation, a group she once worked for that has sued the Interior<br/>\nDepartment<br/>\n&gt; repeatedly.<br/>\n&gt;<br/>\n&gt; &quot;I would be concerned about us spending Alaska money to help another<br/>\n&gt; organization outside the state put their views forward,&quot; Democratic state<br/>\n&gt; Rep. Al Kookesh said Thursday.<br/>\n&gt;<br/>\n&gt; &quot;I&#39;d think that would be highly inappropriate,&quot; Carl Pope, executive<br/>\ndirector<br/>\n&gt; of the Sierra Club, said Friday. &quot;State government is not an ideological<br/>\ntool<br/>\n&gt; of the Mountain States Legal Foundation.&quot;<br/>\n&gt;<br/>\n&gt; Republican lawmakers and a Norton spokeswoman said the billings were<br/>\nproper<br/>\n&gt; because the group was supporting the Legislature&#39;s position in the same<br/>\ncase.<br/>\n&gt;<br/>\n&gt; Bill records obtained by The Associated Press show Norton was paid more<br/>\nthan<br/>\n&gt; $60,000 last year by Alaska lawmakers to help write a friend-of-the-court<br/>\n&gt; brief in a federal lawsuit opposing Interior Department oversight of<br/>\nfishing<br/>\n&gt; in Alaska.<br/>\n&gt;<br/>\n&gt; The work is part of the legal and lobbying activities she performed after<br/>\n&gt; ending her tenure as Colorado attorney general in 1999. The work is under<br/>\n&gt; review by senators for possible conflicts of interest. Norton was named<br/>\nlast<br/>\n&gt; month as Bush&#39;s choice to head the Interior Department, which manages the<br/>\n&gt; nation&#39;s vast natural resources from national parks to offshore oil<br/>\ndeposits.<br/>\n&gt;<br/>\n&gt; The billing records show Norton charged Alaska at least 18 times to help<br/>\nthe<br/>\n&gt; legal foundation file its brief in the case. The records charge for such<br/>\n&gt; items as eight hours for &quot;revisions to Mountain States Legal Foundation<br/>\n&gt; brief&quot; and 1.2 hours to &quot;review and comment on final draft of Mountain<br/>\nStates<br/>\n&gt; Legal Foundation amicus&quot; and make a phone call.<br/>\n&gt;<br/>\n&gt; Norton&#39;s spokeswoman, Jeanie Mamo, said Norton charged Alaska for helping<br/>\nthe<br/>\n&gt; foundation because she had enlisted the group&#39;s help on the state&#39;s<br/>\nbehalf.<br/>\n&gt;<br/>\n&gt; &quot;She worked with them on the amicus brief on behalf of the state,&quot; Mamo<br/>\nsaid<br/>\n&gt; Thursday.<br/>\n&gt;<br/>\n&gt; Another lawyer who worked with Norton said the billings were proper. Paul<br/>\n&gt; Lenzini said Norton&#39;s assistance to the foundation supported the state&#39;s<br/>\n&gt; position in the case.<br/>\n&gt;<br/>\n&gt; &quot;To the extent that the Mountain States brief was better and sharper after<br/>\n&gt; she reviewed it, she served the interests of the state,&quot; Lenzini said.<br/>\n&gt;<br/>\n&gt; Alaska House Speaker Brian Porter, one of the GOP legislative leaders who<br/>\n&gt; hired Norton, said he was not bothered by the billings for her work with<br/>\nthe<br/>\n&gt; foundation. &quot;We&#39;re happy,&quot; Porter said.<br/>\n&gt;<br/>\n&gt; Norton&#39;s Denver firm, Brownstein, Hyatt & Farber, has represented a<br/>\ncompany<br/>\n&gt; that tried to develop an Indian casino regulated by the Interior<br/>\nDepartment<br/>\n&gt; and a company seeking the department&#39;s approval to drill for oil off<br/>\n&gt; California&#39;s coast, records show.<br/>\n&gt;<br/>\n&gt; Mamo said Norton would &quot;follow the law in every case&quot; where she might have<br/>\na<br/>\n&gt; conflict of interest. Federal ethics laws require officials to stay out of<br/>\n&gt; decisions that could benefit them or their families financially.<br/>\n&gt;<br/>\n&gt; Norton&#39;s ties to the Mountain States Legal Foundation are often cited by<br/>\n&gt; environmentalists who oppose her nomination. She was a foundation lawyer<br/>\nfrom<br/>\n&gt; 1979 until 1983, hired by James Watt, an Interior secretary under<br/>\npresident<br/>\n&gt; Reagan who was anathema to environmentalists.<br/>\n&gt;<br/>\n&gt; The foundation has sued the Interior Department repeatedly in recent<br/>\nyears,<br/>\n&gt; seeking to overturn restrictions on mining, grazing and off-road vehicle<br/>\nuse<br/>\n&gt; on federal land. Twenty-three leaders of environmental, labor and civil<br/>\n&gt; rights groups held a news conference Friday to kick off what they hope<br/>\nwill<br/>\n&gt; be a multimillion-dollar advertising and public pressure campaign to<br/>\npersuade<br/>\n&gt; senators to reject Norton&#39;s nomination. They said Norton&#39;s views and ties<br/>\nto<br/>\n&gt; groups like Mountain States show she is &quot;fundamentally out of step with<br/>\nthe<br/>\n&gt; American people,&quot; as Pope put it.<br/>\n&gt;<br/>\n&gt; The fishing case is the second major environmental controversy in Alaska<br/>\nto<br/>\n&gt; involve Norton. While a top Interior Department lawyer during the Reagan<br/>\n&gt; administration, Norton advocated drilling for oil in the Arctic National<br/>\n&gt; Wildlife Refuge - a position Bush supports but environmentalists oppose.<br/>\n&gt;<br/>\n&gt; In the fishing case, Alaska is challenging a ruling that said the Interior<br/>\n&gt; Department has the right to regulate subsistence fishing in most Alaska<br/>\n&gt; waters.<br/>\n&gt;<br/>\n&gt; The state argues that such federal regulations infringe on the state&#39;s<br/>\nright<br/>\n&gt; to regulate fishing in its territory. The 9th U.S. Circuit Court of<br/>\nAppeals<br/>\n&gt; heard arguments in September but has not ruled.<br/>\n&gt;<br/>\n&gt; GOP legislative leaders decided to make their arguments to the appeals<br/>\ncourt<br/>\n&gt; because they didn&#39;t trust Gov. Tony Knowles, a Democrat, to represent<br/>\n&gt; lawmakers&#39; point of view fully, Porter said.<br/>\n&gt;<br/>\n&gt; But Democrats cried foul when the GOP leaders waited until October, after<br/>\n&gt; Norton and Lenzini had finished their work, to get formal approval for the<br/>\n&gt; state contract. Alaska House Minority Leader Ethan Berkowitz called the<br/>\nmove<br/>\n&gt; &quot;an abuse of legislative discretion.&quot;<br/>\n&gt;<br/>\n&gt; On the Net:<br/>\n&gt;<br/>\n&gt; Alaska Legislature: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.legis.state.ak.us/\">http://www.legis.state.ak.us/</a> </span></blockquote></div>","specialLinks":[]}],"prevTopicId":15043,"nextTopicId":15050}}