{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":276731379,"authorName":"","from":"robin.bentley@...","profile":"ehulani56","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Family upset about our son not reading yet","postDate":"1412213099","msgId":74872,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PG0waTloYisxNHA0aWM1QFlhaG9vR3JvdXBzLmNvbT4=","inReplyToHeader":"PG0wZnJoMisxZjJjbGpiQFlhaG9vR3JvdXBzLmNvbT4=","referencesHeader":"PG0wZnJoMisxZjJjbGpiQFlhaG9vR3JvdXBzLmNvbT4="},"prevInTopic":74866,"nextInTopic":0,"prevInTime":74871,"nextInTime":74873,"topicId":74865,"numMessagesInTopic":0,"msgSnippet":"~ She thinks what I am doing is a reaction to our childhood, which was pretty awful. ~ Is it? It might even be understandable. Why wouldn t you want something","messageBody":"<div id=\"ygrps-yiv-310319537\">~ <span style=\"line-height:1.25;word-spacing:normal;\">She thinks what I am doing is a reaction to our childhood, which was pretty awful. ~<br><br>Is it?<br><br>It might even be understandable. Why wouldn&#39;t you want something different from the unhappiness of your own home?<br><br>I think having something to go towards versus fight against is better. So a peaceful, joyful home where reading is part of everyday life (and a skill which your son will learn when he is ready) and where he can pursue his interests with your help, *is* the better thing to focus on. And while your mother&#39;s and sister&#39;s comments and texts rankle, they really don&#39;t get to say how you parent.<br><br>~ </span><span style=\"line-height:1.25;word-spacing:normal;\">I know they love my son, but I am deeply hurt by their lack of trust in \nme as a mother, and that they can&#39;t see how incredibly happy he is. ~<br><br>If you weren&#39;t trusted as a child growing up (I&#39;m guessing at that) then your family isn&#39;t going to trust you as a mum, no matter what you do. Plus, it&#39;s possible that they feel you are judging them for their choices since you&#39;ve made different ones.</span><span style=\"line-height:1.25;word-spacing:normal;\"> Your son&#39;s home is happy - he doesn&#39;t need to get away to the &quot;safety&quot; of school, like you did.<br><br>I would send them all the information Sandra provided. I might also send them copies of Pam&#39;s book &quot;Free to Learn&quot; - it&#39;s a great one for relatives - short and easy to understand <a rel=\"nofollow\" target=\"_blank\" href=\"http://livingjoyfully.ca/books/#learn\">http://livingjoyfully.ca/books/#learn</a></span>. You might want to get Pam&#39;s email series, if you don&#39;t already, to bolster your confidence <a rel=\"nofollow\" target=\"_blank\" href=\"http://livingjoyfully.ca/newsletter/\">http://livingjoyfully.ca/newsletter/.</a><p>&nbsp;<br></p><span style=\"line-height:1.25;word-spacing:normal;\">You said your son loves his grandma and his aunt and you want them in your lives. That&#39;s good! At this point, they are talking to *you* about his lack of reading. If they start talking to him or about him in his presence, those relationships might then be detrimental to your son. I&#39;d keep an eye on that. And you can be the buffer between them and your son, if necessary. There are ways to stay in touch without regular in-person visits. Keep a blog with pictures and evidence of learning and send it to them, regularly. Call them to tell them about all the cool things you did that day, then say &quot;gotta go&quot; if they get into questioning you. Make the times you do see them full of fun and engagement for you and your son, so there&#39;s little opportunity for them to corner you.<br><br>And your sister is wrong about reading at 15. You might not be able to &quot;teach&quot; him, but he can learn! <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/r/carol\">http://sandradodd.com/r/carol</a><br><br>Robin B.<br><p> &nbsp;</p><br><br><br></span></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Family upset about our son not reading yet","postDate":"1412137502","msgId":74866,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGOEZENkNBLUQxM0QtNEQ5Qy1CQzg1LUIyNTJBRUMyRUQxQUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PG0wZnJoMisxZjJjbGpiQFlhaG9vR3JvdXBzLmNvbT4=","referencesHeader":"PG0wZnJoMisxZjJjbGpiQFlhaG9vR3JvdXBzLmNvbT4="},"prevInTopic":74865,"nextInTopic":74872,"prevInTime":74865,"nextInTime":74867,"topicId":74865,"numMessagesInTopic":0,"msgSnippet":"You could send links to things from my site or Joyce s or Pam Laricchia s on reading. I m working on an article about late reading, but it won t be on my site","messageBody":"<div id=\"ygrps-yiv-1024615863\">You could send links to things from my site or Joyce&#39;s or Pam Laricchia&#39;s on reading.<br/>\n<br/>\nI&#39;m working on an article about late reading, but it won&#39;t be on my site for four months. :-)  That&#39;s my deal with The Homeschooler magazine—They publish and THEN I can have it.  It&#39;s a quarterly.  The current issue arrived this week, so it will be a while.<br/>\n<br/>\nBut there is this:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/r/despite\">http://sandradodd.com/r/despite</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/r/hollydodd\">http://sandradodd.com/r/hollydodd</a><br/>\n<br/>\nGo here <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/search\">http://sandradodd.com/search</a><br/>\nSearch for late reading.<br/>\n<br/>\nIf you use the lower search box, it will search all three sites.  My own got 147 results, but some just have &quot;late&quot; and &quot;reading&quot; on the same page.  Still, there&#39;s a lot there, from people whose children are grown now, and doing great.  <br/>\n<br/>\nSchool creates reading failures.  Schools create non-readers.  Unschooling does not.<br/>\nWhen unschoolers read, they are REALLY reading, not doing graded exercises designed to prepare them to read, or to simulate reading, or limiting themselves to baby books with just 20 or 30 words, or just short sentences and small words, as early-elementary reading materials are created.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":312931908,"authorName":"","from":"mranzer@...","profile":"nycartgal2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Family upset about our son not reading yet","postDate":"1412135092","msgId":74865,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PG0wZnJoMisxZjJjbGpiQFlhaG9vR3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":74866,"prevInTime":74864,"nextInTime":74866,"topicId":74865,"numMessagesInTopic":0,"msgSnippet":"Our son is almost 8 years old and has never gone to school. He is happy, inquisitive, and creative. He loves Lego, video games, making his own books, and","messageBody":"<div id=\"ygrps-yiv-552445837\"><p><span>Our son is almost 8 years old and has never gone to school.</span></p><p><span>He is happy, inquisitive, and creative. He loves Lego, video games, making his own books, and acting out stories. My husband and I see him blossoming and learning every day. His vocabulary is impressive, and he speaks eloquently. When he writes stories, he puts a lot of thought into the narrative and characters. He recognizes some words, and does adding in subtraction in his head. I love the way he is learning!</span></p><p><span><br></span></p><p>I knew my family was concerned that he isn&#39;t reading yet, but other than little comments here and there, and my mom grilling him occasionally, they haven&#39;t said much. This week things came to a head. My mom told me she is angry that I don&#39;t spend time &quot;teaching&quot; my son. She then asked if his good friend can read, as if it&#39;s relevant...&nbsp;</p><p><br></p><p>Then, my sister sent me this series of texts, none of which I responded to:</p><p><br></p><p><span style=\"font-family:Helvetica;font-size:12px;line-height:normal;\">***It is not fair that he can&#39;t read. You always talk about women in other countries that should be allowed an education and you are not giving one to your own son.&nbsp;</span><br style=\"font-family:Helvetica;font-size:12px;line-height:normal;\"><br style=\"font-family:Helvetica;font-size:12px;line-height:normal;\"><span style=\"font-family:Helvetica;font-size:12px;line-height:normal;\">I am begging you teach him and see how he will grow healthier every day. Do you not want him to be independent ?</span><br style=\"font-family:Helvetica;font-size:12px;line-height:normal;\"><br style=\"font-family:Helvetica;font-size:12px;line-height:normal;\"><span style=\"font-family:Helvetica;font-size:12px;line-height:normal;\">I hope you are okay . I just don&#39;t understand why you are so adament about certain things. Life is not always easy. You are not doing him any favors by not teaching him. I understand you want to do things differently but, there are certain necessities in life like reading and math . Everything does not have to be the exact opposite of what you had growing up . Emotionally I get some of it. He needs certain things. You were just talking to me about organization . Don&#39;t you think he will need that and some structure ? You cannot teach him that when he is 15. You do some many great things with him why not just add some other things that are very important to his development ?***</span><br></p><p><br></p><p><span style=\"line-height:1.25;word-spacing:normal;\">She thinks what I am doing is a reaction to our childhood, which was pretty awful. I loved school, until I got bullied. It was a place where I was safe from the unhappiness of our home. My husband and I believe that the joy in our household is more important than when our son learns to read.</span><br></p><p><br></p><p>I know they love my son, but I am deeply hurt by their lack of trust in me as a mother, and that they can&#39;t see how incredibly happy he is. Although he does not fit the schooly criteria, he is developing at the perfect rate for him.&nbsp;<span style=\"word-spacing:normal;line-height:1.25;\">My son loves his grandma and aunt, so we want them in our lives. I have thanked them for their concern, but that we will continue as we are.&nbsp;</span></p><p><br></p><p>How you&#39;ve have handled situations like this? How do you respond to the criticism without getting defensive?<br></p><p><br></p><p>Thank you,</p><p>Meryl</p><p><br></p><p><br></p></div>","specialLinks":[]}],"prevTopicId":74861,"nextTopicId":74864}}