{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Etiquette & Politeness","postDate":"1229363357","msgId":41065,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVFQTY3NDVFLUMwQzEtNDlDNS04NDc5LUY5NjAyREJDQ0U2RUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdpNjRpaCtkampjQGVHcm91cHMuY29tPg==","referencesHeader":"PGdpNjRpaCtkampjQGVHcm91cHMuY29tPg=="},"prevInTopic":41064,"nextInTopic":0,"prevInTime":41064,"nextInTime":41066,"topicId":41053,"numMessagesInTopic":0,"msgSnippet":"-=-Sometimes I need a nudge over to a different track, and sometimes they are the ones to give it to me. It goes both ways--sometimes we are just flat out ","messageBody":"<div id=\"ygrps-yiv-1989305626\">-=-Sometimes I need a nudge over to a different track, and sometimes  <br/>\nthey are the ones to<br/>\ngive it to me. It goes both ways--sometimes we are just flat out  <br/>\nwrong--and it&#39;s not just<br/>\nchildren that are wrong! In the end, I always appreciate that someone  <br/>\nI love has gone out-<br/>\non-a-limb with me to point out that it&#39;s me that needs to shift, not  <br/>\nthe world. LOL-=-<br/>\n<br/>\nMe too.  My kids will tell me when they think I&#39;m being unfair or  <br/>\nunreasonable or whatever.<br/>\n<br/>\n-=-We had an understanding that turns with a toy didn&#39;t need to be  <br/>\ncut short, but that the child with the toy would say, &quot;You can have  <br/>\nit when I&#39;m done.&quot; The second child would feel heard and that they  <br/>\nwere the next in line. It worked almost all of the time. -=-<br/>\n<br/>\nThat&#39;s how my kids were with the computer, when we only had one and  <br/>\nit worked.  Sometimes I was the third in line, but that was okay.  By  <br/>\nthe time Holly  needed long turns we had two computers, and now we  <br/>\nhave four, so no waiting.<br/>\n<br/>\n-=-Since I&#39;ve stopped that (long ago now) I see how powerful it can  <br/>\nbe for them to just be a part of a working system. In some ways, my  <br/>\ncommentary pointed out that they weren&#39;t part of the family in some  <br/>\nway. -=-<br/>\n<br/>\nI don&#39;t say &quot;Good JOB!&quot; but I do say thanks a lot.<br/>\n<br/>\n-=-I don&#39;t comment every time my hubby takes out the garbage, but  <br/>\nevery so often I do, if it was especially full and it really makes my  <br/>\nlife easier for it to be emptied, and then he does, for instance.-=-<br/>\n<br/>\nKeith and I always said please and thanks a lot, before we had kids,  <br/>\nand we haven&#39;t stopped.  If I  need a tissue I&#39;ll ask someone to  <br/>\nplease pass the box, and then say thanks.  If I  need a drink of  <br/>\nwater, I&#39;ll say please and thanks.  Saying it about such small things  <br/>\nmakes it pretty automatic to say it about bigger things.  Holly drove  <br/>\nyesterday.  I thanked her.  I don&#39;t love to drive for fun.   Brett  <br/>\nrearranged cars outside because the trashman won&#39;t pick up in our cul- <br/>\nde-sac if there&#39;s a single car parked at the curb.  I thanked him.<br/>\n<br/>\n-=-An honest exclamation of pleasure in the moment is one thing, a  <br/>\npattern of &quot;reward&quot; is something else. I have a cousin who is very  <br/>\nclear that everything her daughter does is a &quot;great job&quot; because she  <br/>\nis &quot;training&quot; her to do the right thing. There is not trust that  <br/>\ngoodness will emerge in a nurturing environment.-=-<br/>\n<br/>\nOH THAT.  Yes.  It can be creepy when a mom&#39;s voice sounds like a  <br/>\ncomputer character on an educational video game.  &quot;FanTAStic!&quot; every  <br/>\ntime the kid clicks the right answer or something.<br/>\n<br/>\nWe don&#39;t just recite &quot;thank you&quot; in a quoty kind of  way.  It&#39;s  <br/>\nreally a thank you.  It will be &quot;I&#39;m glad you did that because I  <br/>\ndidn&#39;t want to put my shoes back on&quot; or &quot;You&#39;re so nice to take the  <br/>\nsnow off the car for me!&quot; or &quot;Thanks for making this  <br/>\nfood!&quot;  (Thanking cooks or people who bring us sandwiches is big here.)<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":294520986,"authorName":"Joanna Murphy","from":"&quot;Joanna Murphy&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Etiquette & Politeness","postDate":"1229362577","msgId":41064,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdpNjRpaCtkampjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENERUY4MTM5LUQyQkYtNDIwNi1BREMwLUEyOEUzNUQxOUFFMEBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":41062,"nextInTopic":41065,"prevInTime":41063,"nextInTime":41065,"topicId":41053,"numMessagesInTopic":0,"msgSnippet":"... I really liked this response.  I think that when a parent is trying to move beyond making my child do ... and you are looking for something new, you can","messageBody":"<div id=\"ygrps-yiv-1653542422\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; -=-So are there times when I *should* tell my child to share, or do I<br/>\n&gt; step in and find other solutions? -=-<br/>\n&gt; <br/>\n&gt; I told my kids to share lots of times.<br/>\n&gt; <br/>\n&gt; More often I was persuasive and made suggestions that would help them  <br/>\n&gt; choose to share and feel good about it.<br/>\n<br/>\n </span></blockquote>I really liked this response.  I think that when a parent is trying to move beyond &quot;making <br/>\nmy child do ...&quot; and you are looking for something new, you can choose to not make them <br/>\ndo something, but then you might find yourself in the realm of &quot;unparenting.&quot;  Talking <br/>\nwith our kids, helping them to move beyond a &quot;no&quot; into a softer place of considering the <br/>\nfeelings of others, and some of their own more subtle feelings of happiness when they can <br/>\nhelp make another person happy--this is a place of truer empowerment and connection.<br/>\n<br/>\nI consider that my kids often have many answers inside of them-sometimes a no is a no, <br/>\nbut often a no changes when the information they are considering changes.  And every so <br/>\noften, if they are stuck in place that seems pretty clearly off base to me, I give them a <br/>\nnudge over to a different track.  <br/>\n<br/>\nSometimes I need a nudge over to a different track, and sometimes they are the ones to <br/>\ngive it to me.  It goes both ways--sometimes we are just flat out wrong--and it&#39;s not just <br/>\nchildren that are wrong!  In the end, I always appreciate that someone I love has gone out-<br/>\non-a-limb with me to point out that it&#39;s me that needs to shift, not the world.  LOL<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; -=-I supposed this would also depend on age...my 6 year old  <br/>\n&gt; understands the idea of sharing, as does my 4 year old. But with both  <br/>\n&gt; of them I always did the &quot;You need to share. In a few minutes, let  <br/>\n&gt; them have a turn...&quot; -=-<br/>\n&gt; <br/>\n&gt; Depending on the toy and situation, sometimes I just said &quot;When he&#39;s  <br/>\n&gt; done, you can play with it if you still want to,&quot; and that worked  <br/>\n&gt; pretty well.<br/>\n&gt; <br/>\n </span></blockquote>I was in a playgroup that did a version of this that worked nicely.  We had an <br/>\nunderstanding that turns with a toy didn&#39;t need to be cut short, but that the child with the <br/>\ntoy would say, &quot;You can have it when I&#39;m done.&quot;  The second child would feel heard and <br/>\nthat they were the next in line.  It worked almost all of the time.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; unschoolers tend to put down the idea of saying things like, &quot;good<br/>\n&gt; boy&quot; or &quot;good job&quot; to their toddlers or children. Or at least that&#39;s<br/>\n&gt; the impression I get. I don&#39;t try to do this in a childish or<br/>\n&gt; manipulative &quot;do what makes mommy happy&quot; sort of way, but in a way<br/>\n&gt; that I&#39;m hoping makes the child feel proud in an accomplishment of<br/>\n&gt; theirs. <br/>\n<br/>\n </span></blockquote>All of the current pop-child rearing info is on rewards and behavior modification.  This can <br/>\ntoo easily turn from a communication between two people to manipulation.  If you think <br/>\nthat a child needs to hear that they did &quot;good&quot; then you might be missing some larger <br/>\nissues of dignity and self-knowledge.  (Note that I said &quot;might&quot;)  A child knows he did <br/>\ngood, because his/her actions help create more peace, cleanliness, order, etc. etc.    <br/>\n<br/>\nThere is power in not acknowledging actions that are part of everyday life, just as there <br/>\ncan be power in acknowledging them.  I&#39;ve been one of those parents who automatically <br/>\nsaid &quot;good&quot; every time my kids did something desirable so that they would repeat the <br/>\naction.  Blech!  Since I&#39;ve stopped that (long ago now) I see how powerful it can be for <br/>\nthem to just be a part of a working system.  In some ways, my commentary pointed out <br/>\nthat they weren&#39;t part of the family in some way.  I don&#39;t comment every time my hubby <br/>\ntakes out the garbage, but every so often I do, if it was especially full and it really makes <br/>\nmy life easier for it to be emptied, and then he does, for instance.<br/>\n<br/>\n<br/>\nLike when one of the babies first put a piece of garbage in<br/>\n<blockquote><span title=\"ireply\"> &gt; the trash can on their own without me even explaining what trash was,<br/>\n&gt; I said, &quot;Good job, Logan!&quot; And he grinned really big because he knew<br/>\n&gt; he had picked up on something that &quot;big people&quot; do that he now did.<br/>\n&gt; <br/>\n&gt; -=-Is that kind of acknowledgment petty or simply what I meant it to  <br/>\n&gt; be -<br/>\n&gt; an affirmation that he figured something out?-=-<br/>\n&gt; <br/>\n </span></blockquote>An honest exclamation of pleasure in the moment is one thing, a pattern of &quot;reward&quot; is <br/>\nsomething else.  I have a cousin who is very clear that everything her daughter does is a <br/>\n&quot;great job&quot; because she is &quot;training&quot; her to do the right thing.  There is not trust that <br/>\ngoodness will emerge in a nurturing environment.<br/>\n<br/>\nI know that positive reinforcement works with my dogs and horses.  Maybe &quot;thank you&quot; is <br/>\nmore appropriate with people?<br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":166322738,"authorName":"Nancy Wooton","from":"Nancy Wooton &lt;nancywooton@...&gt;","profile":"ikonstitcher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Etiquette & Politeness","postDate":"1229361945","msgId":41062,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc0MzkxMEMyLTZDQzMtNDZBQi1CQTM1LTZDODBDRTFCRDlGM0Bjb3gubmV0Pg==","inReplyToHeader":"PEJMVTEwOS1EQVYxMUNBMjY4NzRCRTI4ODM3NTJERjA4RTJGNDBAcGh4LmdibD4=","referencesHeader":"PGdpNTBqdStrc25jQGVHcm91cHMuY29tPiA8QkxVMTA5LURBVjExQ0EyNjg3NEJFMjg4Mzc1MkRGMDhFMkY0MEBwaHguZ2JsPg=="},"prevInTopic":41060,"nextInTopic":41064,"prevInTime":41061,"nextInTime":41063,"topicId":41053,"numMessagesInTopic":0,"msgSnippet":"... My dd wiped the bathroom fixtures down the other day, something I do at least every other day myself.  When she reported this deed, I asked, Whaddya want,","messageBody":"<div id=\"ygrps-yiv-866129776\">On Dec 15, 2008, at 5:30 AM, Ariana Zora Ziminsky wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We are authentically acknowleding what we<br/>\n&gt; appreciate in their behavior; we aren&#39;t just giving them an A+ for  <br/>\n&gt; putting<br/>\n&gt; trash in the trash can.<br/>\n<br/>\n </span></blockquote>My dd wiped the bathroom fixtures down the other day, something I do  <br/>\nat least every other day myself.  When she reported this deed, I  <br/>\nasked, &quot;Whaddya want, a medal?&quot;  To which she replied, &quot;Yes, please.&quot;   <br/>\nThat, apparently, is her standard answer when asked that question.<br/>\n<br/>\n(FYI, my dd is 21 years old, and that was the first time she&#39;s ever  <br/>\ncleaned any part of the bathroom &lt;g&gt;)<br/>\n<br/>\nNancy</div>","specialLinks":[]},{"userId":285625854,"authorName":"harmonyhogan","from":"&quot;harmonyhogan&quot; &lt;harmony@...&gt;","profile":"harmonyhogan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Etiquette & Politeness","postDate":"1229354173","msgId":41056,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdpNXNidCt1bWgyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdpNTBqdStrc25jQGVHcm91cHMuY29tPg=="},"prevInTopic":41054,"nextInTopic":41059,"prevInTime":41055,"nextInTime":41057,"topicId":41053,"numMessagesInTopic":0,"msgSnippet":"... I don t think you should make a child share when they really don t want to, but they can learn to want to share.  We talk about why we share, how we feel","messageBody":"<div id=\"ygrps-yiv-1334557419\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; For example, I&#39;ve read several times where a parent will talk about <br/>\n&gt; not forcing a child to share or say &quot;Thank You&quot;. <br/>\n<br/>\n </span></blockquote>I don&#39;t think you should make a child share when they really don&#39;t <br/>\nwant to, but they can learn to want to share.  We talk about why we <br/>\nshare, how we feel when we share or don&#39;t share, and how the other <br/>\nperson feels about it.  We also talk about our options.  You can give <br/>\nthe toy to the other person, play together, or politely let them know <br/>\nthat you are going to play with it and they can have it when your <br/>\ndone.  I also let the children choose for themselves when they are <br/>\ngoing to be done.  If you were reading messages on the computer and <br/>\nyour spouse said &quot;okay, you only get 5 minutes, then it&#39;s someone <br/>\nelses turn&quot; you wouldn&#39;t be very happy and you would feel rushed, so <br/>\nyou wouldn&#39;t enjoy it.  <br/>\nI also think it is important to talk to children about it before they <br/>\nare at play dates with other kids, so they already know.  There is a <br/>\ngame I play with my preschoolers where we build a block circular wall <br/>\nand put stuffed animals in the middle.  The object of the game is to <br/>\nrescue the &quot;friends&quot; from the middle.  We go around the group and <br/>\neach one says a nice thing you can do for a friend(say please, thank <br/>\nyou, share, let them play with you, don&#39;t hit, etc.)when you say <br/>\nsomething nice you can take one block.  Once all the blocks are down <br/>\nyou can rescue the stuffed animal friends.  the kids love playing it.<br/>\nHarmony</div>","specialLinks":[]},{"userId":60149828,"authorName":"Betsy","from":"&quot;Betsy&quot; &lt;sassyweitzel@...&gt;","profile":"sassyweitzel","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Etiquette & Politeness","postDate":"1229352120","msgId":41060,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdpNXFibytrZjFmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdpNTBqdStrc25jQGVHcm91cHMuY29tPg=="},"prevInTopic":41059,"nextInTopic":41062,"prevInTime":41059,"nextInTime":41061,"topicId":41053,"numMessagesInTopic":0,"msgSnippet":"Re: twins and good jobbing-- I have twins, too (they just turned three) and we handled the sharing issue a couple of different ways-- 1. If it was a toy that","messageBody":"<div id=\"ygrps-yiv-1992939361\">Re: twins and good jobbing--<br/>\n<br/>\nI have twins, too (they just turned three) and we handled the sharing issue a couple of <br/>\ndifferent ways--<br/>\n<br/>\n1. If it was a toy that was in high demand, we just had two of them.<br/>\n2. Honestly, I let them work it out. It worked for us, but usually the takee would just go <br/>\nfind something else, and if I got involved I created a problem where there wasn&#39;t one.<br/>\n<br/>\nThe good jobbing--in that instance, if he&#39;d done something I&#39;d asked of him, I&#39;d just say <br/>\n&quot;Thank you.&quot; If I asked someone else to throw something in the trash, or hand me <br/>\nsomething, that&#39;s what I&#39;d say, not &quot;good job.&quot;<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; With my twins I find it especially difficult just between them as they <br/>\n&gt; are both the same age (17 mo.) and often want the same thing of <br/>\n&gt; course. But if one takes the toy from the other, I&#39;m not sure that me <br/>\n&gt; taking the toy back and returning it to the original child is modeling <br/>\n&gt; the right idea, either.<br/>\n&gt; <br/>\n&gt; Also, in light of reinforcing positive behavior, I&#39;ve noticed that <br/>\n&gt; unschoolers tend to put down the idea of saying things like, &quot;good <br/>\n&gt; boy&quot; or &quot;good job&quot; to their toddlers or children. Or at least that&#39;s <br/>\n&gt; the impression I get. I don&#39;t try to do this in a childish or <br/>\n&gt; manipulative &quot;do what makes mommy happy&quot; sort of way, but in a way <br/>\n&gt; that I&#39;m hoping makes the child feel proud in an accomplishment of <br/>\n&gt; theirs. Like when one of the babies first put a piece of garbage in <br/>\n&gt; the trash can on their own without me even explaining what trash was, <br/>\n&gt; I said, &quot;Good job, Logan!&quot; And he grinned really big because he knew <br/>\n&gt; he had picked up on something that &quot;big people&quot; do that he now did. </span></blockquote></div>","specialLinks":[]},{"userId":33362559,"authorName":"Ariana Zora Ziminsky","from":"&quot;Ariana Zora Ziminsky&quot; &lt;ariana999@...&gt;","profile":"arizorazim","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Etiquette & Politeness","postDate":"1229347852","msgId":41059,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJMVTEwOS1EQVYxMUNBMjY4NzRCRTI4ODM3NTJERjA4RTJGNDBAcGh4LmdibD4=","referencesHeader":"PGdpNTBqdStrc25jQGVHcm91cHMuY29tPg=="},"prevInTopic":41056,"nextInTopic":41060,"prevInTime":41058,"nextInTime":41060,"topicId":41053,"numMessagesInTopic":0,"msgSnippet":"... I know that from an unschooling perspective, what bugs me is the cookie-cutter praise, Good job! said in that certain tone of voice, used over and over","messageBody":"<div id=\"ygrps-yiv-2090836147\">Deb wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Also, in light of reinforcing positive behavior, I&#39;ve noticed that<br/>\n&gt; unschoolers tend to put down the idea of saying things like, &quot;good<br/>\n&gt; boy&quot; or &quot;good job&quot; to their toddlers or children. Or at least that&#39;s<br/>\n&gt; the impression I get. I don&#39;t try to do this in a childish or<br/>\n&gt; manipulative &quot;do what makes mommy happy&quot; sort of way, but in a way<br/>\n&gt; that I&#39;m hoping makes the child feel proud in an accomplishment of<br/>\n&gt; theirs. Like when one of the babies first put a piece of garbage in<br/>\n&gt; the trash can on their own without me even explaining what trash was,<br/>\n&gt; I said, &quot;Good job, Logan!&quot; And he grinned really big because he knew<br/>\n&gt; he had picked up on something that &quot;big people&quot; do that he now did.<br/>\n<br/>\n </span></blockquote>I know that from an unschooling perspective, what bugs me is the <br/>\ncookie-cutter praise, &quot;Good job!&quot; said in that certain tone of voice, used <br/>\nover and over again. After a while, it loses its meaning and value. I don&#39;t <br/>\nthink unschoolers are against acknowledging wonderful things their children <br/>\ndo; I think the issue is offering a fake &quot;Good job!&quot; vs. being really <br/>\nauthentic and true to yourself and your children when expressing to them how <br/>\nmuch you truly like what they did. It sounds like you actually have a handle <br/>\non the main idea, but I&#39;ll elaborate anyways:<br/>\n<br/>\nI have a 3-year-old who loves to throw things in the trash and close any <br/>\nopen drawer/cabinet he sees. When I&#39;m in the vicinity and he does that, I&#39;ll <br/>\noften say, &quot;Thanks, Jaiden!&quot; or &quot;That was nice of you to throw that away for <br/>\nme - thanks, I appreciate it.&quot; He has been closing drawers and tossing trash <br/>\nfor months now, and I can see that he&#39;s happy every time he closes a <br/>\ndrawer - happy for *himself* and the situation; he doesn&#39;t look up at me <br/>\nafter closing a drawer and ask for approval or praise with that &quot;look&quot; of <br/>\n&quot;Did I do a &#39;good job&#39;?&quot;<br/>\n<br/>\nThat&#39;s where the distinction, I think, of societal praise vs. unschooling <br/>\npraise comes in to play. We are authentically acknowleding what we <br/>\nappreciate in their behavior; we aren&#39;t just giving them an A+ for putting <br/>\ntrash in the trash can.<br/>\n<br/>\nI also want to add, though, that there are times when a small deed like this <br/>\nseeks to be acknowledged with a huge &quot;YAY!&quot; or even a &quot;Way to go, bud!!! <br/>\nGood job!,&quot; in my opinion. But in such times, it&#39;s still very authentic. <br/>\nUsually, the kiddo is waaaaay excited about the trash, and his newly found <br/>\nsuccess, and you just want to reflect that big energy back to him.<br/>\n<br/>\n- Ariana<br/>\n(Mama to Josiah, 6, and Jaiden, 3)</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Etiquette & Politeness","postDate":"1229326724","msgId":41054,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENERUY4MTM5LUQyQkYtNDIwNi1BREMwLUEyOEUzNUQxOUFFMEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdpNTBqdStrc25jQGVHcm91cHMuY29tPg==","referencesHeader":"PGdpNTBqdStrc25jQGVHcm91cHMuY29tPg=="},"prevInTopic":41053,"nextInTopic":41056,"prevInTime":41053,"nextInTime":41055,"topicId":41053,"numMessagesInTopic":0,"msgSnippet":"-=-So are there times when I *should* tell my child to share, or do I step in and find other solutions? -=- I told my kids to share lots of times. More often I","messageBody":"<div id=\"ygrps-yiv-546333177\">-=-So are there times when I *should* tell my child to share, or do I<br/>\nstep in and find other solutions? -=-<br/>\n<br/>\nI told my kids to share lots of times.<br/>\n<br/>\nMore often I was persuasive and made suggestions that would help them  <br/>\nchoose to share and feel good about it.<br/>\n<br/>\n-=-I supposed this would also depend on age...my 6 year old  <br/>\nunderstands the idea of sharing, as does my 4 year old. But with both  <br/>\nof them I always did the &quot;You need to share. In a few minutes, let  <br/>\nthem have a turn...&quot; -=-<br/>\n<br/>\nDepending on the toy and situation, sometimes I just said &quot;When he&#39;s  <br/>\ndone, you can play with it if you still want to,&quot; and that worked  <br/>\npretty well.<br/>\n<br/>\n-=-But if one takes the toy from the other, I&#39;m not sure that me  <br/>\ntaking the toy back and returning it to the original child is  <br/>\nmodeling the right idea, either.-=-<br/>\n<br/>\nDepending on the method of the taking, and the attitude of the one  <br/>\nwho had it first, I might return it to the original child.  But one  <br/>\nof the best ways to get a kid to drop a toy (or an adult, for that  <br/>\nmatter) is to offer something interesting in its place.  If they  <br/>\nchoose another more exciting thing, cool.  (Either kid.)<br/>\n<br/>\n-=-Also, in light of reinforcing positive behavior, I&#39;ve noticed that<br/>\n<br/>\nunschoolers tend to put down the idea of saying things like, &quot;good<br/>\nboy&quot; or &quot;good job&quot; to their toddlers or children. Or at least that&#39;s<br/>\nthe impression I get. I don&#39;t try to do this in a childish or<br/>\nmanipulative &quot;do what makes mommy happy&quot; sort of way, but in a way<br/>\nthat I&#39;m hoping makes the child feel proud in an accomplishment of<br/>\ntheirs. Like when one of the babies first put a piece of garbage in<br/>\nthe trash can on their own without me even explaining what trash was,<br/>\nI said, &quot;Good job, Logan!&quot; And he grinned really big because he knew<br/>\nhe had picked up on something that &quot;big people&quot; do that he now did.<br/>\n<br/>\n-=-Is that kind of acknowledgment petty or simply what I meant it to  <br/>\nbe -<br/>\nan affirmation that he figured something out?-=-<br/>\n<br/>\nTo toddlers, &quot;Good&quot; is often fun for them to hear.  Some people avoid  <br/>\nit because it&#39;s the opposite of &quot;bad&quot; and they don&#39;t want to set up  <br/>\nthat dichotomy, I think.  Some people combine it with ideas of  <br/>\nintrinsic motivation and say kids should put things in the trash  <br/>\nbecause of logical larger reasons, but babies don&#39;t have logical  <br/>\nlarger reasons.<br/>\n<br/>\nThere are ways to communicate approval, relief, joy, and other  <br/>\npositive feedback.  What I use in my own life to gauge whether I&#39;m  <br/>\nbeing condescending to my kids (or just talking too much) is to think  <br/>\nwhether I would say it to an adult friend or to my husband.<br/>\n<br/>\nThe other day Holly and I left the mall and I walked right through  <br/>\nthe door without touching it, without looking back, and then I  <br/>\nnoticed Holly had stopped and held it open for an older man and two  <br/>\nolder women.  Yikes!  I hadn&#39;t even noticed they were there.  I don&#39;t  <br/>\nknow if I started to drop the door right in their faces or what, and  <br/>\nI was glad Holly had noticed and held the door.  They were nice to  <br/>\nher and thanked her, and when we were alone, I said I was glad she  <br/>\nhad seen them and held the door.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":356893003,"authorName":"prism7513","from":"&quot;prism7513&quot; &lt;penley75@...&gt;","profile":"prism7513","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Etiquette & Politeness","postDate":"1229325758","msgId":41053,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdpNTBqdStrc25jQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":41054,"prevInTime":41052,"nextInTime":41054,"topicId":41053,"numMessagesInTopic":0,"msgSnippet":"In reading over responses on various issues, I m confused about how to help a child understand both simple politeness as well as more refined etiquette","messageBody":"<div id=\"ygrps-yiv-2112338904\">In reading over responses on various issues, I&#39;m confused about how to <br/>\nhelp a child understand both simple politeness as well as more refined <br/>\netiquette practices for our culture.<br/>\n<br/>\nFor example, I&#39;ve read several times where a parent will talk about <br/>\nnot forcing a child to share or say &quot;Thank You&quot;. Some parents will say <br/>\n&quot;Thank You&quot; themselves for the child, or toys that the child might <br/>\nhold dear should be set aside before a play date, but I&#39;m wondering <br/>\nwhat other options people use?<br/>\n<br/>\nOn the other hand, I&#39;ve now seen two people use the word &quot;coach&quot; when <br/>\ndescribing how they helped their child(ren) respond politely in a <br/>\ngiven situation.<br/>\n<br/>\nSo are there times when I *should* tell my child to share, or do I <br/>\nstep in and find other solutions? <br/>\n<br/>\nI supposed this would also depend on age...my 6 year old understands <br/>\nthe idea of sharing, as does my 4 year old. But with both of them I <br/>\nalways did the &quot;You need to share. In a few minutes, let them have a <br/>\nturn...&quot; <br/>\n<br/>\nWith my twins I find it especially difficult just between them as they <br/>\nare both the same age (17 mo.) and often want the same thing of <br/>\ncourse. But if one takes the toy from the other, I&#39;m not sure that me <br/>\ntaking the toy back and returning it to the original child is modeling <br/>\nthe right idea, either.<br/>\n<br/>\nAlso, in light of reinforcing positive behavior, I&#39;ve noticed that <br/>\nunschoolers tend to put down the idea of saying things like, &quot;good <br/>\nboy&quot; or &quot;good job&quot; to their toddlers or children. Or at least that&#39;s <br/>\nthe impression I get. I don&#39;t try to do this in a childish or <br/>\nmanipulative &quot;do what makes mommy happy&quot; sort of way, but in a way <br/>\nthat I&#39;m hoping makes the child feel proud in an accomplishment of <br/>\ntheirs. Like when one of the babies first put a piece of garbage in <br/>\nthe trash can on their own without me even explaining what trash was, <br/>\nI said, &quot;Good job, Logan!&quot; And he grinned really big because he knew <br/>\nhe had picked up on something that &quot;big people&quot; do that he now did.<br/>\n<br/>\nIs that kind of acknowledgment petty or simply what I meant it to be - <br/>\nan affirmation that he figured something out?<br/>\n<br/>\nDeb</div>","specialLinks":[]}],"prevTopicId":41029,"nextTopicId":41057}}