{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Staying up all night","postDate":"1371297497","msgId":71621,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtwaGtzcCtrdTNhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBTUhKS0w5NUNPYlFMTE1SeHEwb1ZKdnJ5RnNPSFJNMFpvb1RqdjY3NHBnNFVnLTZwZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":71620,"nextInTopic":0,"prevInTime":71620,"nextInTime":71622,"topicId":71619,"numMessagesInTopic":0,"msgSnippet":"... Trying to talk about making thoughtful choices can be like trying to talk about how to ride a bike - it might be informative, but it s not necessarily","messageBody":"<div id=\"ygrps-yiv-688255687\">Sylvia Woodman &lt;sylvia057@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I&#39;ve  been trying to talk to Gabriella and Harry about making thoughtful<br/>\n&gt; choices about getting enough sleep.<br/>\n<br/>\n </span></blockquote>Trying to talk about making thoughtful choices can be like trying to talk about how to ride a bike - it might be informative, but it&#39;s not necessarily helpful in terms of actually learning to do it. <br/>\n<br/>\nPart of learning to make thoughtful choices involves watching other people make them - but it doesn&#39;t happen with just one viewing. Part of learning involves trying things out... which means making some impulsive choices, some choices based on mood, some choices based on mistaken ideas, As Well as some thoughtful choices. And even when you&#39;re pretty good at making thoughtful choices, you won&#39;t Always make thoughtful choices - think about how well you make decisions when you&#39;re tired. When Mo was younger and I sometimes was staying up later, I&#39;d try to set things up so I didn&#39;t need to do much thinking because I don&#39;t make thoughtful choices when I&#39;m a zombie ;)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think all they hear is, &quot;I&#39;m going to bed now and you have<br/>\n&gt; to be alone.&quot;<br/>\n<br/>\n </span></blockquote>To an extent, that&#39;s part of staying up late - it&#39;s absolutely part of staying up later than the people around you! If you&#39;re still up when all your friends go to bed, you&#39;re alone. Maybe rather than trying to soft-pedal that and re-frame it as something else, be really candid: yes, if you want to stay later, you&#39;ll be alone - everyone else is going to bed. I wouldn&#39;t leave both of them up together alone, since they have a hard time being quiet, but the 9yo, with a condition she lets everyone else sleep.<br/>\n<br/>\nIt&#39;s possible she&#39;s really not ready to go to sleep when you are - I remember staying up late reading under the covers as a kid - but I wasn&#39;t under the impression it was okay for me to bother other people. If she&#39;s not ready to sleep, isn&#39;t responsible on her own, and doesn&#39;t want to be alone, she can do something quiet in bed (or in a corner of the bedroom... or in the bedroom closet so the light doesn&#39;t bother anyone!).<br/>\n<br/>\nIt could help to look at the way the house is arranged and see if there&#39;s a way to change that to make things a little more fluid - so the 7yo isn&#39;t torn between going to sleep and staying where the action is. What does the 9yo like to do at night? Watch movies? Surf the web? Can you rearrange so there&#39;s a tv or computer in a room with a bed? Not necessarily the same bedroom your husband sleeps in, unless he&#39;s totally okay with that. <br/>\n<br/>\nOr you could actively plan to sleep in the living room for awhile - set up a bed, roll out a futon, get an air mattress... something that lets the kids crawl in with you.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Staying up all night","postDate":"1371273164","msgId":71620,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU5QjlERTk2LTA1NTAtNEU4Mi04OEUzLUM0NjE2NEI5QUI1M0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PENBTUhKS0w5NUNPYlFMTE1SeHEwb1ZKdnJ5RnNPSFJNMFpvb1RqdjY3NHBnNFVnLTZwZ0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBTUhKS0w5NUNPYlFMTE1SeHEwb1ZKdnJ5RnNPSFJNMFpvb1RqdjY3NHBnNFVnLTZwZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":71619,"nextInTopic":71621,"prevInTime":71619,"nextInTime":71621,"topicId":71619,"numMessagesInTopic":0,"msgSnippet":"... It sounds like you re trying to give them freedom rather than helping them pursue their interests in respectful, doable, safe ways. ... Even if they hear","messageBody":"<div id=\"ygrps-yiv-1992529115\">On Jun 14, 2013, at 6:57 PM, Sylvia Woodman wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Bedtime is becoming a nightly struggle. I know I have some sort of blind<br/>\n&gt; spot here but I can&#39;t see what it is.<br/>\n<br/>\n </span></blockquote>It sounds like you&#39;re trying to give them freedom rather than helping them pursue their interests in respectful, doable, safe ways.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; When what I am saying is - &quot;Hey, guys it&#39;s almost 2. At the<br/>\n&gt; end of this show/video why don&#39;t we all come upstairs and we can cuddle and<br/>\n&gt; I&#39;ll turn on a dvd for you while you fall asleep.&quot;<br/>\n<br/>\n<br/>\n </span></blockquote>Even if they hear what you mean to say, you&#39;re giving them the option to say, &quot;No, we don&#39;t want to. We want to do something else.&quot;<br/>\n<br/>\nGive them choices, yes. But don&#39;t give them choices that are disrespectful, not doable and unsafe. Present some choices as if-then conditions. If they want to stay up, they need to be quiet, otherwise they need to be in bed. That&#39;s not controlling. That&#39;s helping them live their lives in ways that take others into consideration.<br/>\n<br/>\nGive them information so they can make more informed choices. If they need to be up the next day at a certain time, count back a reasonable number of hours for sleeping so they know what time to go to bed. Then help them wind down then.<br/>\n<br/>\nBeing a radical unschooler involves thinking outside the box and questioning whether our limits are set in stone or are flexible. Perhaps others will come up with some out of the box solutions, but if you&#39;ve tried staying up past 1 and you just can&#39;t then be respectful of your own limitations.Give them that information and problem solve with them. Try out suggestions. If they don&#39;t work, try other ideas.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":345817076,"authorName":"Sylvia Woodman","from":"Sylvia Woodman &lt;sylvia057@...&gt;","profile":"sylviawoodman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Staying up all night","postDate":"1371232663","msgId":71619,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTUhKS0w5NUNPYlFMTE1SeHEwb1ZKdnJ5RnNPSFJNMFpvb1RqdjY3NHBnNFVnLTZwZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":71620,"prevInTime":71618,"nextInTime":71620,"topicId":71619,"numMessagesInTopic":0,"msgSnippet":"Gabriella (9) and Harry (7) want to stay up all night.  Every night.  They have never had a set bedtime but we did have bedtime routines to help them wind down","messageBody":"<div id=\"ygrps-yiv-321256593\">Gabriella (9) and Harry (7) want to stay up all night.  Every night.  They<br/>\nhave never had a set bedtime but we did have bedtime routines to help them<br/>\nwind down and fall asleep.  We&#39;ve had various sleeping arrangements over<br/>\nthe years, family bed, sleeping in their own bedrooms where one of us (me<br/>\nor my husband Jim) hangs out with them while they fall asleep.<br/>\n<br/>\nCurrently, they both want to sleep with us in our room but they do not want<br/>\nto go to sleep.  At all.  This is mostly being driven by Gabriella and<br/>\nHarry tends to want to do what she is doing.<br/>\n<br/>\nJim needs to go to be between 10 and 11 as he gets up very early for work<br/>\nso I stay downstairs with them to be with them, help to remind them to be<br/>\nquiet, make snacks etc.  Mostly as the hour gets later they like to watch<br/>\nshows on Netflix or youtube videos.<br/>\n<br/>\nI am a night owl.  I&#39;m fine to stay up until 1AM or even 2AM but I start to<br/>\nhave problems if it is much later than that.  So I&#39;ve tried several things,<br/>\nnapping on the couch in the room where they are - however sometimes I go<br/>\ninto a deep sleep and they have a hard time waking me up.<br/>\n<br/>\nJim likes to be awake early in the day and for several years that has been<br/>\nour time together while the kids sleep late.  But if I&#39;ve only gone to bed<br/>\nbetween 5 and 6 and Jim wants to wake me between 8 and 9 I&#39;m kind of a<br/>\nzombie the rest of the day.  Also, I still have things that need to get<br/>\ndone during the daytime hours.  Sometimes there are doctor appointments, I<br/>\nneed a repair man to come look at something in the kitchen, our car needs<br/>\nto go into the shop etc.  I try to make everything for as late in the day<br/>\nas possible but sometimes things are earlier.  Jim works from home one day<br/>\na week so I try to schedule lots of things for that morning so I can run<br/>\nerrands/go to appointments alone while the kids are sleeping and Jim is in<br/>\nthe house.<br/>\n<br/>\nI&#39;ve  been trying to talk to Gabriella and Harry about making thoughtful<br/>\nchoices about getting enough sleep.  How  if I need to get up I can;t stay<br/>\nup as late but I think all they hear is, &quot;I&#39;m going to bed now and you have<br/>\nto be alone.&quot;  When what I am saying is - &quot;Hey, guys it&#39;s almost 2.  At the<br/>\nend of this show/video why don&#39;t we all come upstairs and we can cuddle and<br/>\nI&#39;ll turn on a dvd for you while you fall asleep.&quot;  If I notice aloud that<br/>\nthey are yawning, or starting to bump into things sometimes I say, &quot;Hey<br/>\ndoes anyone want a bedtime snack and then we can go up?&quot; And they say,<br/>\n&quot;I&#39;ll have a snack with you but I&#39;m not going to bed yet.&quot; Or if it is<br/>\nHarry he will say, &quot;Is Gabriella going to bed yet?  Gabriella gets very<br/>\nupset if she sees that Harry and I are going upstairs.  Sometimes if Harry<br/>\nis tired I will go upstairs and lay down with him until he falls asleep.<br/>\n When I do that Gabriella usually comes up about 3 or 4 times to &quot;check on<br/>\nus&quot; and to ask when am I coming back downstairs.  Harry thinks this is<br/>\nfunny; I do not.  Now I&#39;m angry and I tend to speak sharply and Gabriella<br/>\nstarts to cry because it is so unfair that she has to be alone but I can&#39;t<br/>\nbe in two places at once.  And it is unfair.<br/>\n<br/>\nShould I just go to bed when I&#39;m tired and let them fall asleep on the<br/>\ncouch/chairs in the living room?  I hate the idea of them being awake and<br/>\nunsupervised. When they are tired it is harder for them to get along and<br/>\nremember to be quiet.<br/>\n<br/>\nBedtime is becoming a nightly struggle.  I know I have some sort of blind<br/>\nspot here but I can&#39;t see what it is.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":71610,"nextTopicId":71622}}