{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":172216154,"authorName":"Mark Shields","from":"Mark Shields &lt;shields@...&gt;","profile":"kulahawaii","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Toy Play Value","postDate":"1092807856","msgId":98283,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxQzQ4NEFCLkJBNEFFMTAwLnNoaWVsZHNAb2xkc2hvZXByZXNzLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":98282,"nextInTime":98284,"topicId":98283,"numMessagesInTopic":0,"msgSnippet":"Beanie Babies have been given quite a workout at our house too!  My son especially uses them in all kinds of imaginary play.  When we took our round the","messageBody":"<div id=\"ygrps-yiv-1437208041\">Beanie Babies have been given quite a workout at our house too!  My son <br/>\nespecially uses them in all kinds of imaginary play.  When we took our <br/>\nround the country trip last year, piggy was in quite a few photos and even <br/>\nhad photos just of him in places like Multnomah Falls and Banff.  I <br/>\nabsolutely love your kids&#39; campground idea.  Now, there&#39;s geography for <br/>\nyou!<br/>\n<br/>\nMy son has also gotten his money&#39;s worth from Brio which we have quite a <br/>\ncollection of due to gifts from grandparents.  At 9 he&#39;s still adding to <br/>\nit.  Ooh, that goes for Playmobil too.  My daughter (11) has gotten a lot <br/>\nof mileage from a wooden treehouse and adorable little natural accessories. <br/>\n We gave her the tree house at age 2 and the collection of doll house stuff <br/>\nhas grown a lot over the years.  She makes all kinds of things for it and <br/>\nplays with it a lot.  She shows no signs of growing out of it either. It <br/>\nwill definitely be a hand me down toy and if by chance we have no <br/>\ngrandchildren I would love to keep it as a decoration.  However, I doubt <br/>\nshe&#39;ll leave it behind she loves it so much.<br/>\n<br/>\nKristin<br/>\n<br/>\n-----Original Message-----<br/>\nFrom:\tGame-Enthusiast [SMTP:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a>]<br/>\n<br/>\nWe&#39;ve gotten a lot of mileage out of beanie babies too.  Two of the kids<br/>\nfavorites have gone almost everywhere with us for the last three years.<br/>\nThey&#39;ve been buried in dirt piles, gone swimming at the beach, been stirred<br/>\ninto flour water goop the kids were cooking with, fallen from great <br/>\nheights,<br/>\nand washed a million times.  They are still going strong.  We definitely <br/>\ngot<br/>\nour money&#39;s worth out of those toys when you consider the hours played <br/>\nwith.<br/>\nThe Breyers are more expensive but when you consider the hours they are<br/>\nplayed with the hourly rate is still low.  I love looking at it that way.<br/>\n<br/>\nIt&#39;s funny but the other day as I was printing out the 10th campground map<br/>\neach for the kids I had a flashing thought that we were wasting paper.  But<br/>\nthey played with those twenty sheets of paper for almost two days straight.<br/>\nThey picked campgrounds from all over the country, we printed the <br/>\ncampground<br/>\nsite maps, then they wrote in the names of each of the animals that were<br/>\nstaying at those campsites.  They planned the route they would take to stay<br/>\nat different camp sites all over the country so they could start in ME, go<br/>\nto the west coast, and camp their way back to ME.  Pretty cool when you<br/>\nthink about it.<br/>\n<br/>\nAngela</div>","specialLinks":[]}],"prevTopicId":97594,"nextTopicId":98166}}