{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Natrlmama@aol.com","from":"Natrlmama@...","replyTo":"LIST","senderId":"X-hICadehiTyIIOnT2DTJnVYzwVL23pFtIbCBhLWEg0n7MrXM07_vflftg46TYuuPYcy0mShYos","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Any Day in Our Unschooling Life","postDate":"954524023","msgId":7597,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZkLjI1YjBiZWEuMjYxNjNiNzdAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":7596,"nextInTime":7598,"topicId":7597,"numMessagesInTopic":0,"msgSnippet":"Ha, I didn t want to say typical day because there really is none.  Some days we are out all day running errands, others we are in.  What is typical is that my","messageBody":"<div id=\"ygrps-yiv-239699180\">Ha, I didn&#39;t want to say typical day because there really is none.  Some days <br/>\nwe are out all day running errands, others we are in.  What is typical is <br/>\nthat my children &quot;always&quot;  find something interesting and intriguing to do <br/>\nregardless of where we are or what we are doing.<br/>\nTuesday March 28, 2000<br/>\n*wake up to dh&#39;s voice on the answering machine saying wake up I need to talk <br/>\nto you &lt;g&gt; at 6:30.  Get up talk to him and go back to bed.  He calls back <br/>\nagain at 7 am, talk to him and go back to bed again.  Finally get back up at <br/>\n8 or 8:30.  Jared is trying to get us all up (they all were in my bed this <br/>\nam) and makes zach a duplo airplane<br/>\n*kids eat apples<br/>\n*kids build marble run toy<br/>\n*kids eat cereal<br/>\n*I go to office, drink coffee, read email, work on some business reports<br/>\nkids read books.  jessica cant&#39; find a couple of bob books so she starts on a <br/>\nnew one.  I help her out a bit.<br/>\n*kids see cricket in house.  set up elaborate &quot;trap&quot; to catch it.  tie wash <br/>\ncloth filled with grass to a string which is attached to a small bug cage.   <br/>\nThey put the kitchen chairs all around them and hide under them with the bait <br/>\nsitting out in the open. cricket never comes back out. mom takes pictures &lt;g&gt;<br/>\n*zach plays cars<br/>\n*kids put on cowboy boots and hats and put on a song/dance themed after toy <br/>\nstory 2 and their family<br/>\n*zach and jared play lego and duplo<br/>\n*jared runs around trying to scare kids, they decide to make scary masks.  <br/>\nGet construction paper as me to cut out eye holes.  They punch holes and <br/>\nbring string for me to tie onto mask.  jareds mask is white, he gets to be a <br/>\nghost.  jess and zach are boogeymans with black masks.  run around and play <br/>\nthis for awhile.<br/>\n*kids find rocks in the yard and wash them in a bowl in the kitchen.  never <br/>\nknew what that was all about as I was working in the office.<br/>\n*me empty dishwasher, put away load of laundry, start load, fix lunch.  kids <br/>\nread more books while I clean bathrooms since I am having friends come over <br/>\nto scrapbook tomorrow.  jump in the shower and get out of jammies at 1 pm!<br/>\n*kids decide to paint pictures.  zach is a little disappointed that his <br/>\npictures aren&#39;t quite as &quot;good&quot; as Jessica&#39;s although they are very good to <br/>\nme. He has a bit of trouble with hand coordination (perfectly reasonable for <br/>\nhis age) trying to do fine artwork.  I can still tell what he is painting <br/>\nnever the less.  jared is proud of his grey blob LOL.<br/>\n*I go back into the office to do more paper work, take and make calls.  talk <br/>\nto mom about some business (mom and dad retired contractors) and about jareds <br/>\nupcoming birthday<br/>\n*kids run around outside for awhile, climb trees. weather a bit cold and <br/>\ncloudy they seem to enjoy staying inside today.<br/>\n*eat bowls of kiwi <br/>\n*start dinner. albondigas soup (meatball)<br/>\n*jess finds a counting book we put together, she tells me she doesn&#39;t need it <br/>\nanymore since she knows how to count and proceeds to do so.  She said that <br/>\nthe boys can use it.<br/>\n*kids decide to clean the entire house counters, walls, furniture and windows <br/>\nwith wet rags and towels.  they spend easily a couple of hours doing this!!  <br/>\njess takes a break to paint another picture, a beautiful painting of one of <br/>\nour blooming fruit trees.  zach tells me he loves to clean!!  <br/>\n*take more calls check on zach and he is emptying out and cleaning my <br/>\ncupboard!!  I am amazed at his zealousness as he absolutely hates to pick up. <br/>\n guess cleaning is another thing altogether for him.<br/>\n*jared finally takes a break to nurse and falls asleep at 5:30!  kids snack <br/>\non carrots waiting for me to serve the soup.  zach still cleaning, standing <br/>\non my island cleaning the ceiling fan and light.<br/>\n*wake jared up so that I can feed kids, he&#39;s not to happy crying a bit.  <br/>\nDecides he&#39;ll eat dinner after all.  I eat with kids.<br/>\n*zach decides to clean some more and heads off to his bedroom with his rags <br/>\nin hand.<br/>\n*dad comes home, kids and I compete for dads attention as soon as he comes <br/>\nhome &lt;g&gt;.  dad and I need to talk business, kids need to show dad all their <br/>\nnew tricks.  <br/>\n*feed dad, we all have another bowl of soup.  dad and I put together a bid <br/>\nfor upcoming project.<br/>\n*zach and jared (and me) vacuum their room since they gleefully crushed <br/>\ncereal on the floor earlier today.  jessie takes a shower. I do another load <br/>\nof laundry.<br/>\n*kids settle down temporarily while dad makes calls.<br/>\n*everyone wrestles around on the bed<br/>\n*have a snack, cuddle, dad heads off to bed<br/>\n*boys make duplo airplanes and throw them through the air watching them fly <br/>\nand crash<br/>\n*kids fall asleep on the couch next to me (they wanted to sleep on the couch <br/>\ntonight) around 9:30 (much earlier than last night when they layed there and <br/>\njessica narrated stories until 11:30!<br/>\n*all is quiet and its 10:15<br/>\n*another day is done : )<br/>\n<br/>\nI am not usually this busy in my office, depends on the work schedule.  We <br/>\nhad played and ran around for three days in a row late  last week so <br/>\nyesterday and today I had things to take care of, and tomorrow is a play day <br/>\nwith company coming over.  <br/>\n dd 6 1/2, ds 5, ds 3<br/>\nKathy</div>","specialLinks":[]}],"prevTopicId":7453,"nextTopicId":7599}}