{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":0,"authorName":"Naykki2@aol.com","from":"Naykki2@...","replyTo":"LIST","senderId":"4KRBdoywUwbI-Glnw8RaWTdn5Xu812Dny8JM9Vh94STwOvMcIDy_jV9QLktWl9lh8sCqCqrt","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Newbie greetings!","postDate":"957063561","msgId":8377,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDczLjJkMzExZDcuMjYzY2ZiODlAYW9sLmNvbT4="},"prevInTopic":8274,"nextInTopic":0,"prevInTime":8376,"nextInTime":8378,"topicId":8267,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/22/00 5:58:50 PM Eastern Daylight Time, udderlymyra@yahoo.com writes: ","messageBody":"<div id=\"ygrps-yiv-421174444\">In a message dated 4/22/00 5:58:50 PM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:udderlymyra@...\">udderlymyra@...</a> writes:<br/>\n<br/>\n&lt;&lt; Thanks so much for responding and are your vocal cords injured because of <br/>\nteaching? &gt;&gt;<br/>\n<br/>\nSorry it&#39;s taken me awhile to respond.  We&#39;re running around like crazy <br/>\ngetting ready for my daughter&#39;s First Communion next week, with a party <br/>\nafterwards.<br/>\n<br/>\nThe club that I used to teach for didn&#39;t have a very good microphone, and <br/>\nevery time it broke we would end up having to shout.  I&#39;m not very loud, and <br/>\nI injured my voice.  For awhile, I&#39;d lose my voice every time I had a cold <br/>\nand sore throat.  Now that I&#39;m not teaching, I&#39;ve actually had a few colds <br/>\nand not lost my voice.  I&#39;m not sure at this point whether I&#39;m going to go <br/>\nback to teaching or not (certainly not at *that* club!).<br/>\n<br/>\n&lt;&gt;<br/>\n<br/>\nI&#39;m fairly type A, and I find that that&#39;s a temptation for me too.  <br/>\n<br/>\n&lt;&lt;Does it sound like I need to take a break too like you are?&gt;&gt;<br/>\n<br/>\nNot necessarily, but you may want to relax your standards a bit  - something <br/>\nI&#39;ve been struggling with lately.  What with having a baby last year and <br/>\nhomeschooling, I&#39;ve not been able to change my routine as often as I&#39;d like.  <br/>\nBut, until my voice got really bad, it was still important to me to teach, <br/>\neven though I wasn&#39;t able to do as much with it as I wanted to at the time.  <br/>\n<br/>\n&lt;&lt; I find that I&#39;ve spent up to 4 hours searching for choreog. on the net <br/>\n(turnstep.com & vitasvibe.com) and practicing what I&#39;ve found.&gt;&gt;<br/>\n<br/>\nI knew about turnstep, but I hadn&#39;t heard of the other one.  Thanks!<br/>\n<br/>\nI also find that taking other instructors classes helps me come up with new <br/>\nmoves.  Not that I&#39;m necessarily using their moves, but it seems to put me in <br/>\na good frame of mind to come up with new ones of my own. <br/>\n<br/>\n&lt;&lt;My hubby is a great help by spending time with them during the evenings, <br/>\nbut it&#39;s so hard to practice at night because of all the places they have to <br/>\ngo for lessons and activities.&gt;&gt;<br/>\n<br/>\nCan you bring a tape recorder and headphones and mentally run through your <br/>\nroutine while you&#39;re waiting for them at lessons?  I actually came up with a <br/>\nnew routine once while I was waiting in the jury pool for jury duty.  I <br/>\nbrought a notebook, and my headphones and went through my tape and wrote down <br/>\na new routine while sitting there.<br/>\n<br/>\n&lt;&lt; I am the type A personality that if I want to do it, I dive head over <br/>\nheals into it and nothing else around me exists.  &gt;&gt;<br/>\n<br/>\nI&#39;m very much this way too.  Not that, with a toddler, I get much time to do <br/>\nthings this way.<br/>\n<br/>\nI once went to a talk that Madeleine L&#39;Engle gave at Duke University.  I was <br/>\nin graduate school part-time at that point, and I had a 2 yo.  There was a <br/>\nquestion and answer period at the end, and I asked her how she was able to <br/>\nchange focus from her intense mental world in her writing to focusing on her <br/>\nchildren and their needs (I was having difficulties at this point!).  Her <br/>\nresponse was that the children are young for such a short time - not that she <br/>\nstopped writing altogether, but that it wasn&#39;t possible for it to be as <br/>\ncentral as it could be at other times (she wrote at night, and often fell <br/>\nasleep over the typewriter!).  <br/>\n<br/>\nI think it sometimes takes awhile to find a balance, though - especially when <br/>\nstarting something new like homeschooling.<br/>\n<br/>\nLaura</div>","specialLinks":[]},{"userId":0,"authorName":"FromMooToU","from":"FromMooToU &lt;udderlymyra@...&gt;","replyTo":"LIST","senderId":"eqoWPUKYNi-GiD3i6nORnimGeZUWDlyM_soiLR12INaBqI9InYwQOic2ddlGf3aWTquAtEkLX_kt22hJ8y9Obip0cR4XQMrHiA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Newbie greetings!","postDate":"956440701","msgId":8274,"canDelete":false,"contentTrasformed":true,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAwNDIyMjE1ODIxLjE0Mjg2LnFtYWlsQHdlYjEwMDUubWFpbC55YWhvby5jb20+"},"prevInTopic":8267,"nextInTopic":8377,"prevInTime":8273,"nextInTime":8275,"topicId":8267,"numMessagesInTopic":0,"msgSnippet":"Hi Laura! Thanks so much for responding and are your vocal cords injured because of teaching? Anyhow, I am having difficulty with just what you wrote:  making","messageBody":"<div id=\"ygrps-yiv-1475992277\"><p>Hi Laura!</p>\n<p>Thanks so much for responding and are your vocal cords injured because of teaching? Anyhow, I am having difficulty with just what you wrote:&nbsp; making the time to create new choreography.&nbsp; I teach 2 times a week and I&#39;m constantly changing my routine every week.&nbsp; Not the whole thing, but about 2 combos.&nbsp; I teach a step class and a class we call &quot;Cardio Smorgasbord&quot;, which is a little bit of everything, Latin, Step, Hi-Low, Military Drills and kickboxing.&nbsp; Soon I&#39;ll be certified to teach BodyPUMP, and I cannot wait because the routines will already be pre-choreographed and I don&#39;t have to find the time (except for learning it initially) to make up new choreography.&nbsp; I find that I&#39;ve spent up to 4 hours searching for choreog. on the net (turnstep.com &amp; vitasvibe.com) and practicing what I&#39;ve found.&nbsp; I am the type A personality that if I want to do it, I dive head over heals into it and nothing else around me exists.&nbsp; So, I&#39;ve felt guilty that my kids only have my extra attention for short amounts of time during the days I teach because I&#39;m trying like heck to put my routines together.&nbsp;&nbsp; Mind you, we&#39;ve only been doing the &quot;relaxed&quot; unschooling approach for a little under a year.&nbsp; When I see my kids not plunging into&nbsp;work-books or the like, I STILL get all stressed!!&nbsp; I think I have to be&nbsp;constantly with&nbsp;my kids 24 hours a day or I&#39;m not doing the homeschooling right.&nbsp; My 14 year old daughter takes care of my 7 year old son while I&#39;m gone teaching, which is great for me, I can get a break away from my little home.&nbsp;&nbsp; I&nbsp;also workout at home to videotapes or with the gym in my garage to cross-train.&nbsp; I&#39;ve only been teaching since January and I was fine with my homeschooling then, it was about the same I have it now, but my kids a little busier with music, karate &amp; tennis lessons.&nbsp; Where is the balance?&nbsp; Do I sound stressed or what?&nbsp; My hubby is a great help by spending time with them during the evenings, but it&#39;s so hard to practice at night because of all the places they have to go for lessons and activities.&nbsp; The only time I have is during the day, but isn&#39;t that the time I&#39;m supposed to have free for my kids?&nbsp; Early mornings are out because we do breakfast and chores.&nbsp; Does it sound like I need to take a break too like you are?</p>\n<p>Thanks for listening, I hope I made sense&nbsp; :o)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ~Myra</p>\n<p><tt>We unschool, and I&#39;ve been teaching aerobics part-time for 6 years <br>(currently, I&#39;m taking a break because of my voice).&nbsp; What, exactly, are you <br>having difficulty with?&nbsp; I find that when I&#39;m working on a new routine, I do <br>have to work on it in the evening, when dh is home, or get someone to take <br>care of the kids while I go to the gym to work on it (or, before the baby, <br>tell the kids *not to bother me* for an hour while I work).&nbsp; I&#39;ve been <br>teaching at 3 different places - once a week at each place - so, even if I <br>keep the same routine for awhile, the participants don&#39;t get *too* tired of <br>it since each class only gets it once a week.&nbsp; Lately, I just don&#39;t have as <br>much creativity to come up with a lot of new stuff, either, but I have a 15 <br>mo (along with an 8 yo and a 12 yo) so my energies are spread rather thin &lt;g&gt;.<br><br>I&#39;ve always found it important, though, to keep my own outside interests, <br>otherwise I focus *too* closely on what my kids are doing.&nbsp; I can be more <br>relaxed (and &quot;go with the flow&quot; more) when I have another focus.<br><br>Laura</tt></p><br>\n<hr>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://click.egroups.com/1/3413/7/_/448294/_/956288280/\">\n<blockquote><span title=\"qreply\"> <blockquote style=\"BORDER-LEFT:#1010ff 2px solid;MARGIN-LEFT:5px;PADDING-LEFT:5px;\">\n<center><img alt=\"\" border=\"0\" height=\"60\" src=\"https://ec.yimg.com/ec?url=http%3A%2F%2Fadimg.egroups.com%2Fimg%2F3413%2F7%2F_%2F448294%2F_%2F956288280%2Faddpoptoemail.gif&t=1571751010&sig=gaNiUOLc2dLuc.YRQmdPXQ--~E\" width=\"468\"></center>\n<center><font color=\"white\"></font></center></blockquote></span></blockquote></a>\n<hr>\n<tt>Message boards, timely articles, a free newsletter and more!<br>Check it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com/\">http://www.unschooling.com</a><br><br>To Unsubscribe: mailto:Unschooling-dotcom-unsubscribe@onelist.com<br></tt><br><br><br><b>Udderly,\nMyra<p>\n<img src=\"https://ec.yimg.com/ec?url=http%3A%2F%2Fmembers.aol.com%2Fespresso20006%2Fgraphics1%2Fcow1.gif&t=1571751010&sig=Ij1dwqs0AqqL1EsC3bsj8A--~E\">\n\nWife, Mother, Missionary, FirmBeliever, & Grazer<p><br><hr size=\"1\"><b>Do You Yahoo!?</b><br>\nSend online invitations with <a rel=\"nofollow\" target=\"_blank\" href=\"http://invites.yahoo.com/\">Yahoo! Invites</a>.</b></div>","specialLinks":[]},{"userId":0,"authorName":"Naykki2@aol.com","from":"Naykki2@...","replyTo":"LIST","senderId":"ms7MMfzc8lGuHn4IWg71oQCAzETwq01nKZTb7Z5Zc9GQDdh1k9G8lx91U0IT6XaJ3Y0_8VUl","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Newbie greetings!","postDate":"956288267","msgId":8267,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRmLjJhZmE4NDcuMjYzMTI3MGJAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":8274,"prevInTime":8266,"nextInTime":8268,"topicId":8267,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/20/00 9:07:26 PM Eastern Daylight Time, udderlymyra@yahoo.com writes: ","messageBody":"<div id=\"ygrps-yiv-213996423\">In a message dated 4/20/00 9:07:26 PM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:udderlymyra@...\">udderlymyra@...</a> writes:<br/>\n<br/>\n&lt;&lt; My family is currently researching the un-schooling approach (and we are <br/>\npleased so far) and I wanted to come out of lurkdom and ask if their was <br/>\nanyone by chance on this list that is a part-time aerobics instructor and <br/>\nhomeschools as well???    I&#39;m finding that this is one thing that I cannot do <br/>\nwith my children (13 & 7) there, even though it is an hour a day, twice a <br/>\nweek that I teach, I find it hard to have the time to prepare for my classes. <br/>\n I&#39;m beginning to think that I cannot have my own interests out of the house <br/>\nand homeschool at the same time.....anyone been through something similar?  I <br/>\nmust make my priorities straight, I know... &gt;&gt;<br/>\n<br/>\nWe unschool, and I&#39;ve been teaching aerobics part-time for 6 years <br/>\n(currently, I&#39;m taking a break because of my voice).  What, exactly, are you <br/>\nhaving difficulty with?  I find that when I&#39;m working on a new routine, I do <br/>\nhave to work on it in the evening, when dh is home, or get someone to take <br/>\ncare of the kids while I go to the gym to work on it (or, before the baby, <br/>\ntell the kids *not to bother me* for an hour while I work).  I&#39;ve been <br/>\nteaching at 3 different places - once a week at each place - so, even if I <br/>\nkeep the same routine for awhile, the participants don&#39;t get *too* tired of <br/>\nit since each class only gets it once a week.  Lately, I just don&#39;t have as <br/>\nmuch creativity to come up with a lot of new stuff, either, but I have a 15 <br/>\nmo (along with an 8 yo and a 12 yo) so my energies are spread rather thin &lt;g&gt;.<br/>\n<br/>\nI&#39;ve always found it important, though, to keep my own outside interests, <br/>\notherwise I focus *too* closely on what my kids are doing.  I can be more <br/>\nrelaxed (and &quot;go with the flow&quot; more) when I have another focus.<br/>\n<br/>\nLaura</div>","specialLinks":[]}],"prevTopicId":8373,"nextTopicId":8379}}