{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":92084939,"authorName":"Heidi","from":"&quot;Heidi&quot; &lt;bunsofaluminum60@...&gt;","profile":"heidic40","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"What a Good Day!","postDate":"1064422401","msgId":81438,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJrc2k2MStyb2h2QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":81437,"nextInTime":81439,"topicId":81438,"numMessagesInTopic":0,"msgSnippet":"Yesterday was the Autumnal Equinox...the First Day of Fall. And we celebrated with a Middle Earth Feast. Abbie has a book out from the library, which has","messageBody":"<div id=\"ygrps-yiv-358809289\">Yesterday was the Autumnal Equinox...the First Day of Fall.<br/>\n<br/>\nAnd we celebrated with a Middle Earth Feast. Abbie has a book out <br/>\nfrom the library, which has several recipes in it, based on foods <br/>\nmentioned in Tolkien&#39;s books.<br/>\n<br/>\nMrs. Maggot&#39;s Cottage Pie...basically a simple shepherd&#39;s pie with <br/>\nbeef, carrots, and onion topped with mashed potatoes. THAT was good! <br/>\nI&#39;m making it for the next potluck at church. <br/>\n<br/>\nSeed Cakes for Gimli...poppy seed muffins, actually!  they were a <br/>\ngood accompaniment to the Cottage Pie. <br/>\n<br/>\nWe really should have had a Strider Salad or something  and will, the <br/>\nnext time we plan a Middle Earth Feast. Or fruit something.<br/>\n<br/>\nAnd for dessert, Goldberry Pie, wherein we modified a basic berry pie <br/>\nto a cheesecake bottom, berry topped open face pie that was <br/>\nscrumptious!<br/>\n<br/>\nPart of the &quot;goodness&quot; of the day was shopping for the ingredients. <br/>\nThe kids got their allowance and had fun buying &quot;whatever you <br/>\nwant&quot;...which was candy. And we hit the library while we were out.<br/>\n<br/>\nThere is this very cool thing there: magnetic poetry. Only, instead <br/>\nof stuck to the fridge, it came with this board and a tray. I spent <br/>\nabout 45 minutes putting together such deep and meaningful phrases as:<br/>\n<br/>\n<br/>\ntingle mortal tongue<br/>\nmay his vow taste like<br/>\nan eternity<br/>\n<br/>\nand<br/>\n<br/>\nmischance beneath a wicked moon<br/>\n<br/>\n<br/>\nThat was so much fun, I&#39;m going to look for that set for my own self! <br/>\nThe kids played a computer game and checked out a few books, and we <br/>\nfound out we have a video out that is nine days overdue!!! but the <br/>\nlibrarian had mercy on us and let us check out. We&#39;ll owe a chunk <br/>\no&#39;money on that baby, though. ack.<br/>\n<br/>\nListened to Hank the Cow Dog on the way home, and then Abbie and I <br/>\nbusied ourselves in the kitchen, putting together our Feast. Katie <br/>\nhelped by chopping the potatoes and she also mashed them when ready.<br/>\n<br/>\nNow, this is the cool thing. Robby is my non-helper boy. The girls <br/>\nwill pitch in whenever, but Robby usually needs to be asked, and <br/>\nthough he usually does when asked...eh, he&#39;s just my non-helper. So <br/>\nlast night, the dishes needed doing. We had finished eating and had <br/>\ndigested for a little while, and the time had come. Inexorably, <br/>\nindubitably, undeniably DISH TIME! <br/>\n<br/>\nRobby was reading a book and I said &quot;come and help with these dishes, <br/>\nwouldja?&quot; He glanced up and said &quot;I&#39;m reading&quot; so instead of &quot;putting <br/>\nmy foot down&quot; and insisting, I said &quot;okay. I thought we&#39;d get some <br/>\nvisiting in. You don&#39;t have to, but if you want, you can come and dry <br/>\nwhile I wash.&quot;<br/>\n<br/>\nhalf a minute later, he was in there with me,  dish towel in hand, <br/>\nchatting about the Hulk and Rockman. It was absolutely THE BEST part <br/>\nof the day for me. He did not wander away, he did not leave, he kept <br/>\non going until we had finished the entire job: dishes washed, dried, <br/>\nand put away. Isn&#39;t that COOL?<br/>\n<br/>\nAnd for bed, we had pretty much giggle gas and chaos. My hubby&#39;s out <br/>\non a job for the week, and when one of us has to be gone, we usually <br/>\nopen up the bedroom to a kid to sleep with us. Well, I couldn&#39;t <br/>\nchoose between them last night, so we all ended up, all four of us, <br/>\nin my queen size bed. Which was fine. Until someone started giggling <br/>\nabout something, and then it was just hysteria, and I&#39;m not kidding. <br/>\nMore than an hour later, after we&#39;d moved into the front room, on the <br/>\nfloor where there was actually ROOM for us all, we were still <br/>\nlaughing about nothing.<br/>\n<br/>\nHank the Cow Dog put us to sleep, and I moved back to my bed about <br/>\n2:30 because I was getting a major kink in my neck. <br/>\n<br/>\nEveryone else is still sleeping and I&#39;m enjoying my reminiscences.<br/>\n<br/>\na Good Day!<br/>\n<br/>\nblessings, heidiC</div>","specialLinks":[]}],"prevTopicId":81013,"nextTopicId":81330}}