{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":10,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Unschooling sleep","postDate":"1306580912","msgId":61302,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ4NEUxQkIzLThFNUYtNDExMS1BQzZCLTkyMTBBNUMxNDcxOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlyb240NCtybjA1QGVHcm91cHMuY29tPg==","referencesHeader":"PGlyb240NCtybjA1QGVHcm91cHMuY29tPg=="},"prevInTopic":61290,"nextInTopic":0,"prevInTime":61301,"nextInTime":61303,"topicId":61276,"numMessagesInTopic":0,"msgSnippet":"-=-My daughter fights sleep too. She really ramps up when she is tired-=- I know the phrase fights sleep.  It s an old idiom.  But if sleep is the enemy,","messageBody":"<div id=\"ygrps-yiv-782580373\">-=-My daughter fights sleep too. She really ramps up when she is tired-=-<br/>\n<br/>\nI know the phrase &quot;fights sleep.&quot;  It&#39;s an old idiom.  But if sleep is the enemy, people SHOULD fight it.<br/>\n<br/>\nIt might be easier and more peaceful (in the mind of the person doing the thinking) to think of it as struggling to stay with the family, to participate, not to miss anything!<br/>\n<br/>\nIf what&#39;s going on is interesting and the child is learning, being awake might be preferable to sleeping for her.   <br/>\n<br/>\nWe made much use of music and videos we knew to be familiar and soothing.  The child was still awake and watching/listening, until the moment when he went to sleep without even knowing he had.  That&#39;s pretty peaceful.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":321996436,"authorName":"Alex","from":"&quot;Alex&quot; &lt;missalexmissalex@...&gt;","profile":"missalexmissalex","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling sleep","postDate":"1306517444","msgId":61290,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlyb240NCtybjA1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlybXM4NCtrbXJkQGVHcm91cHMuY29tPg=="},"prevInTopic":61288,"nextInTopic":61302,"prevInTime":61289,"nextInTime":61291,"topicId":61276,"numMessagesInTopic":0,"msgSnippet":"Hey Stephanie, My daughter fights sleep too. She really ramps up when she is tired. We have never been able to let her fall asleep doing stuff, driving her in","messageBody":"<div id=\"ygrps-yiv-1721332582\">Hey Stephanie, <br/>\n<br/>\nMy daughter fights sleep too. She really ramps up when she is tired. We have never been able to let her fall asleep doing stuff, driving her in the car at night, etc. She will be 4 next week and I am still almost always bouncing her to sleep on an exercise ball in a front carrier while she nurses. We have a children&#39;s sleep meditation CD that we bought off audible.com and it&#39;s mildly helpful when she doesn&#39;t want to bounce. We&#39;ve tried a lot of strategies with various amounts of success. <br/>\n<br/>\nIn her 2 year old year, when we were trying to be cool with her staying up until she was ready to go to bed, and feeling like we had to be available for any kind of fun, we were up until 1 and 2 sometimes and just miserable. We had a lot of depressing/unpleasant responsibilities as family caregivers and I figured out that try as we might we were generally pretty grumpy crappy parents after 9 or 10. We just literally couldn&#39;t find the time to take care of some family business/financial issues except at night IF she fell asleep and she wouldn&#39;t let anyone else watch her so we were up a creek. I finally told her that past a certain time she could do whatever she could do by herself but I would only be available for sleep-related activities. Totally your mileage my vary. I bought more bedtime stories, all sleep-related, and some nights we would read them for an hour or 2. I&#39;ve found that books with yawns in them like Don&#39;t Let The Pigeon Stay Up Late are particularly effective because it triggers a sympathetic yawn. We had the Goonight Moon DVD for a while but videos actually kept her up later because if she started it she was dead set on staying up until the end. <br/>\n<br/>\nWe found that active (mostly park) play in the first part of the day was VERY helpful but late afternoon active play made it harder for her to sleep. My grandpa told me that his family never had strollers and none of the 7 kids had trouble going to sleep when they were little because they were worn out. After that I noticed that moms whose walking kids seemed to have difficulty going to sleep and staying asleep often were pushing them in the strollers a lot, so reducing that might help you too.<br/>\n<br/>\nBTW I had night terrors only when I was dating my husband through when I was pregnant. They went away for me so hopefully they&#39;ll go away for you guys soon too! <br/>\n<br/>\nAlex</div>","specialLinks":[]},{"userId":233098946,"authorName":"Lisa E Biesemeyer","from":"Lisa E Biesemeyer &lt;l.biesemeyer@...&gt;","profile":"l.biesemeyer@sbcglobal.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Unschooling sleep","postDate":"1306510416","msgId":61288,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYxMDA2Ni41OTE1My5xbUB3ZWI4MzUwNC5tYWlsLnNwMS55YWhvby5jb20+","inReplyToHeader":"PGlybzBzYys5YjBzQGVHcm91cHMuY29tPg==","referencesHeader":"PGlybzBzYys5YjBzQGVHcm91cHMuY29tPg=="},"prevInTopic":61287,"nextInTopic":61290,"prevInTime":61287,"nextInTime":61289,"topicId":61276,"numMessagesInTopic":0,"msgSnippet":"My daughter dropped her naps around 22 months old.  After that, for about 6 months or so, she would some times fall asleep on car rides or walks, but usually","messageBody":"<div id=\"ygrps-yiv-1595998832\">My daughter dropped her naps around 22 months old.  After that, for about 6 <br/>\nmonths or so, she would some times fall asleep on car rides or walks, but <br/>\nusually she just ran and played all day until she was exhausted around 6pm. <br/>\n Then, I rocked her until she fell asleep; she stayed asleep until 6 or 7am. <br/>\n<br/>\nIf, for some reason, I missed her sleepy window around 5,6,7pm, she would often <br/>\nnot go to sleep until 9, 10, or 11pm, and much of that time was spent with her <br/>\nthrowing things, getting frustrated or angry, or just being absolutely wild (and <br/>\nnot is a fun way).<br/>\n<br/>\nI&#39;m wondering what you are doing, literally, around 5, 6, 7pm every evening. Is <br/>\nthat time when dad gets home?  Is that when dinner happens? Are you out running <br/>\nerrands?  Do you go out to the play ground?  I would experiment with not doing <br/>\nanything where you are not truly paying attention to her during these hours. See <br/>\nif she is acting sleepy or cranky or cuddly during these hours. Does she often <br/>\nwant to be held or be near you?  Does she pick on her sibling? She may be tired <br/>\nand ready for bed, but because other things are going on where mom is <br/>\npreoccupied (as they are in many homes at that time of day), her sleepy window <br/>\nis missed and she&#39;s getting revved up again. <br/>\n<br/>\nEven now, my daughter is 5yo and my twin boys are 18mo, I offer them some thing <br/>\nto eat around 5pm and around 6pm, they all start to settle down. We rock and <br/>\nwatch shows and talk and sing, and if they might run and play still, but I <br/>\ngenerally stay in a place where the kids can crawl up with me or sit nearby. <br/>\n This is not a bedtime, but a calm-ish time leading up to sleep.  My boys <br/>\nusually are asleep in my arms by 6:30 or 7pm, and my daughter is resting on the <br/>\ncouch and ready for bed anywhere between 7 and 8pm.  They all sleep until 6 or <br/>\n7am.<br/>\n<br/>\nLisa B<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":211875477,"authorName":"amylizkid1","from":"&quot;amylizkid1&quot; &lt;amylizkid1@...&gt;","profile":"amylizkid1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Unschooling sleep","postDate":"1306505440","msgId":61287,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlyb2JkMCtnZGppQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlybXM4NCtrbXJkQGVHcm91cHMuY29tPg=="},"prevInTopic":61285,"nextInTopic":61288,"prevInTime":61286,"nextInTime":61288,"topicId":61276,"numMessagesInTopic":0,"msgSnippet":"Can you buy a little swimming pool or join the Y?  Swimming makes a lot of people very sleepy.  You could try swimming in the early afternoon, have a nice","messageBody":"<div id=\"ygrps-yiv-1485908029\">Can you buy a little swimming pool or join the Y?  Swimming makes a lot of people very sleepy.  You could try swimming in the early afternoon, have a nice snack, and then everyone one could cuddle up with a favorite (calm) movie or book.  Even if she doesn&#39;t fall asleep, she might rest.<br/>\nMy daughter was pretty resistant to sleep for a few years.  I talked occasionally about how I love my big cozy bed, and snuggling, and relaxing.  I didn&#39;t push, just mentioned it in my normal conversations. I think people sometimes get &#39;bed equals bad&#39; from the world around them, and they just need someone to let them know that bed is okay!  At 8 years old, she loves going to bed!<br/>\n<br/>\nAmy<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;stephanie.weisner&quot; &lt;stephanie.weisner@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi everyone :)<br/>\n&gt; <br/>\n&gt; My family is whole-life unschooling and, while I totally believe in the philosophy and see how awesome it can be for us, we&#39;re having some issues with our toddler&#39;s sleep. Her normal schedule seems to be to go to sleep around 10 pm and wake up around 6 am. She&#39;s just over 2 and she&#39;s not napping anymore. The problem is that she acts very tired during the day (being violent towards her baby brother and her dad and I, contradicting everything she asks for...basically 2 year old behavior). Today she woke up at 3:30 am for the day and wouldn&#39;t go back to sleep. I&#39;m worried that she&#39;s not getting enough rest but she fights sleep like nothing else. Also, she has night terrors a few times a week where she acts very scared and can also lash out at us if we try to comfort her.<br/>\n&gt; <br/>\n&gt; Is 2 too young to let our daughter choose her bedtime? Is this just a case of riding it out and we&#39;ll look back at it in a few months and laugh?<br/>\n&gt; <br/>\n&gt; Thanks for any input you may have.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":426422274,"authorName":"christinebgilbert","from":"&quot;christinebgilbert&quot; &lt;christine.gilbert@...&gt;","profile":"christinebgilbert","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Unschooling sleep","postDate":"1306494668","msgId":61285,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlybzBzYys5YjBzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlybXM4NCtrbXJkQGVHcm91cHMuY29tPg=="},"prevInTopic":61281,"nextInTopic":61287,"prevInTime":61284,"nextInTime":61286,"topicId":61276,"numMessagesInTopic":0,"msgSnippet":"... What would the alternative be?  Forcing a bed time?  I wonder if that would cause more problems. We have a 15 month old and we re living in a studio","messageBody":"<div id=\"ygrps-yiv-1971689998\"><blockquote><span title=\"ireply\">&gt; Is 2 too young to let our daughter choose her bedtime? <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>What would the alternative be?  Forcing a bed time?  I wonder if that would cause more problems.<br/>\n<br/>\nWe have a 15 month old and we&#39;re living in a studio apartment, so our bed is in the same living space as everything else.  Our son will get beyond tired and fight to stay up as late as we do.  If I see that he&#39;s struggling (and usually there are some signs that it&#39;s coming), I just go to bed with him.  Then I get up after he has fallen asleep. Sometimes that just means hanging out on the bed, quietly for a few hours and then he goes off to play again.<br/>\n<br/>\nIt&#39;s not all the time.  Sort of depends on what is going on (he seems to fluctuate from day to day -- a few days of short or no naps, then I&#39;ll notice he&#39;ll catch up).</div>","specialLinks":[]},{"userId":67727291,"authorName":"wtexans","from":"&quot;wtexans&quot; &lt;wtexans@...&gt;","profile":"wtexans","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling sleep","postDate":"1306462904","msgId":61281,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlybjFybytobGFlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlybjFnbytsdWliQGVHcm91cHMuY29tPg=="},"prevInTopic":61280,"nextInTopic":61285,"prevInTime":61280,"nextInTime":61282,"topicId":61276,"numMessagesInTopic":0,"msgSnippet":"===Is she contracting Every Single Thing she asks for? If not, don t think of it in terms of everything , every single time , or always .=== Oops, that","messageBody":"<div id=\"ygrps-yiv-833501822\">===Is she contracting Every Single Thing she asks for? If not, don&#39;t think of it in terms of &quot;everything&quot;, &quot;every single time&quot;, or &quot;always&quot;.===<br/>\n<br/>\nOops, that should say, &quot;Is she CONTRADICTING&quot;...&quot;, not &quot;contracting&quot;. Sorry! (I even proofread before posting. Oy!)<br/>\n<br/>\nGlenda</div>","specialLinks":[]},{"userId":67727291,"authorName":"wtexans","from":"&quot;wtexans&quot; &lt;wtexans@...&gt;","profile":"wtexans","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Unschooling sleep","postDate":"1306462552","msgId":61280,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlybjFnbytsdWliQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlybXM4NCtrbXJkQGVHcm91cHMuY29tPg=="},"prevInTopic":61278,"nextInTopic":61281,"prevInTime":61279,"nextInTime":61281,"topicId":61276,"numMessagesInTopic":0,"msgSnippet":"===She s just over 2 and she s not napping anymore. The problem is that she acts very tired during the day (being violent towards her baby brother and her dad","messageBody":"<div id=\"ygrps-yiv-1858079442\">===She&#39;s just over 2 and she&#39;s not napping anymore. The problem is that she acts very tired during the day (being violent towards her baby brother and her dad and I, contradicting everything she asks for===<br/>\n<br/>\nAre you sure that she&#39;s eating before she reaches the point of being cranky? (In other words, she&#39;s not hungry when she starts getting tired.)<br/>\n<br/>\nIf she doesn&#39;t want to nap, you could set up places that are enticing for resting. Use sheets and blankets to make a fort inside the house -- put some pillows, stuffed animals, a flashlight, and some books in there -- or set it up somewhere where you can see the tv from inside the fort. <br/>\n<br/>\nAlong those same lines, maybe you could get your hands on an indoor kid-sized play tent where she can go when she wants some quiet time away from baby brother. <br/>\n<br/>\nIf the weather is nice where you live and you have a yard or patio, you can throw a blanket down on the ground and bring out some toys, books, pillows, and snacks.<br/>\n<br/>\nWhen the baby naps, perhaps your daughter would like to snuggle up on the couch or a bed with you and read or watch tv together. <br/>\n<br/>\nShe might enjoy playing in the tub in the middle of the day, then doing something lowkey, liked mentioned above.<br/>\n<br/>\nDoes she still like being rocked? When my son was that age, he would fight taking a nap because he was having so much fun that he didn&#39;t want to stop -- but he found being rocked comforting and would let me rock him, and would oftentimes fall asleep that way. When I would stop rocking and stand up, he&#39;d wake up. So sometimes I rocked him for the entirety of his nap; other times he would just get a short nap because I couldn&#39;t always rock him for a long nap. I know you also have a baby, so this might not be as doable an option as it was for me, but maybe you could take the idea and morph it to work for your family.<br/>\n<br/>\n<br/>\n===being violent towards her baby brother and her dad and I, contradicting everything she asks for...basically 2 year old behavior===<br/>\n<br/>\nThat&#39;s not necessarily behavior specific to a child&#39;s age, so it would be helpful to not think of it in that way, to not expect it to happen *because* she&#39;s 2 (or 10 or a teen).<br/>\n<br/>\nIf she&#39;s being violent towards her baby brother, notice what&#39;s happening BEFORE the violent behavior begins, then step in and help her out before she reaches the point of being that angry or frustrated. Be present (physically and mentally), and don&#39;t leave her in the position of being able to get to the baby and hurt him.<br/>\n<br/>\nIs she contracting Every Single Thing she asks for? If not, don&#39;t think of it in terms of &quot;everything&quot;, &quot;every single time&quot;, or &quot;always&quot;. <br/>\n<br/>\nIf the contradicting is happening often when she&#39;s tired, being aware that tiredness is a trigger will allow you to be aware that she needs an extra amount of patience in those moments. I know when I&#39;m tired or hungry, I have a difficult time making decisions -- my husband&#39;s aware of that too and is extra patient with me at those times.<br/>\n<br/>\nIf she&#39;s being predictable about the things she&#39;s being contradictory about, you could take advantage of that predictability. For example, if she often asks for a PB&J and then, when you offer the PB&J, she wants a grilled cheese instead, you could make both and present both to her (or offer a plate with a variety of things on it, but not so much that it&#39;ll overwhelm her!).<br/>\n<br/>\n<br/>\n===Also, she has night terrors a few times a week where she acts very scared and can also lash out at us if we try to comfort her.===<br/>\n<br/>\nCan you change up the sleeping arrangements? If she&#39;s sleeping in a different room from you, can you put a mattress for her in your room and see if that helps? If she already sleeps in your room,  maybe it would help to leave a small light on near her? <br/>\n<br/>\nMy youngest brother had night terrors for many years and touching him or trying to hold or hug him while he was in the midst of the night terrors was a bad idea. I would talk to him the whole time (he always came to my room when he had those), until he reached a point where he&#39;d awakened? snapped out of it?, until he was actually seeing me and hearing me. Only then would he be okay with being touched and comforted. So maybe when she&#39;s in the midst of the night terrors, you can be nearby, talking to her softly (unless that seems to aggravate her), but not touching her, until the terror has passed. And then comfort her in ways that are comforting to *her* -- ask her if she wants to be hugged, or have her back rubbed, or whatever.<br/>\n<br/>\n<br/>\n===Is this just a case of riding it out and we&#39;ll look back at it in a few months and laugh?===<br/>\n<br/>\n&quot;Riding it out&quot; sounds, to me, like &quot;endure it&quot;. If there are things you can do to make life more comfortable for all of you, do them! It may take trial and error to figure out what works today. And keep in mind that works today may not work in a week or a few months, so when you see it&#39;s no longer working, trial and error some other ideas.<br/>\n<br/>\nShe won&#39;t be 2 forever, and the baby won&#39;t be a baby forever. The dynamics will change as they get older.<br/>\n<br/>\nGlenda</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Unschooling sleep","postDate":"1306462163","msgId":61278,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJFMjM4RjA1LUQ4OTAtNEFGRi1CNkI0LURBRjIwRTMwNTFFMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlybXM4NCtrbXJkQGVHcm91cHMuY29tPg==","referencesHeader":"PGlybXM4NCtrbXJkQGVHcm91cHMuY29tPg=="},"prevInTopic":61277,"nextInTopic":61280,"prevInTime":61277,"nextInTime":61279,"topicId":61276,"numMessagesInTopic":0,"msgSnippet":"-=My family is whole-life unschooling and, while I totally believe in the philosophy and see how awesome it can be for us, we re having some issues with our","messageBody":"<div id=\"ygrps-yiv-816720622\">-=My family is whole-life unschooling and, while I totally believe in the philosophy and see how awesome it can be for us, we&#39;re having some issues with our toddler&#39;s sleep. -=-<br/>\n<br/>\nAs sleep isn&#39;t something people &quot;school,&quot; it&#39;s not something to think of as &quot;unschooling&quot; (not as in &quot;to unschool sleep&quot;).<br/>\n<br/>\nThink of it as providing a peaceful life for your child.  Everyone will sleep.  Make it inviting and easy, not scary and difficult.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":196677035,"authorName":"Tina Tarbutton","from":"Tina Tarbutton &lt;tina.tarbutton@...&gt;","profile":"dravensmomhome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Unschooling sleep","postDate":"1306460824","msgId":61277,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBTkxrVGk9NVpBTEhCMkNUX0FkM0VFcU1fZjRaPVZfWHZBQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGlybXM4NCtrbXJkQGVHcm91cHMuY29tPg==","referencesHeader":"PGlybXM4NCtrbXJkQGVHcm91cHMuY29tPg=="},"prevInTopic":61276,"nextInTopic":61278,"prevInTime":61276,"nextInTime":61278,"topicId":61276,"numMessagesInTopic":0,"msgSnippet":"When my son was that age, we didn t even know about the unschooling lifestyle but we also didn t live by the clock. When he was tired we d create a relaxing","messageBody":"<div id=\"ygrps-yiv-500718837\">When my son was that age, we didn&#39;t even know about the unschooling<br/>\nlifestyle but we also didn&#39;t live by the clock.<br/>\n<br/>\nWhen he was tired we&#39;d create a relaxing atmosphere, watching quiet or<br/>\nfamiliar movies cuddled in bed with the lights off or reading books together<br/>\nand talking quietly.  Typically this happened in whichever bed or space he<br/>\nmight be sleeping in that night, so either the two of us cuddled on his twin<br/>\nbed, or all of us cuddled in my bed.  Sometimes it just happened naturally<br/>\non the couch as I noticed he was already starting to doze off.<br/>\n<br/>\nEven once he stopped taking naps, we&#39;d spend some quiet time in the middle<br/>\nof the day doing the same thing.  This gave us all some down time as well as<br/>\nsome close cuddly time, even without expecting that sleep would come.<br/>\n Sometimes it did, mostly it didn&#39;t.<br/>\n<br/>\nI&#39;m not sure what your nighttime routine looks like now, but<br/>\nperhaps developing something that&#39;s more low key, earlier in the evening<br/>\nmight help her drift off a little earlier.<br/>\n<br/>\nSomething we learned early with our son is that baths energized him, so we<br/>\nmade it a point to make baths morning activities instead of part of the<br/>\nbedtime routine.  He still (at 11 y/o) can&#39;t take a bath and go straight to<br/>\nbed.<br/>\n<br/>\nTina<br/>\n<br/>\nOn Thu, May 26, 2011 at 8:45 PM, stephanie.weisner &lt;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:stephanie.weisner@...\">stephanie.weisner@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; Is 2 too young to let our daughter choose her bedtime? Is this just a case<br/>\n&gt; of riding it out and we&#39;ll look back at it in a few months and laugh?<br/>\n&gt;<br/>\n&gt; Thanks for any input you may have.<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>-- <br/>\nUnschooling Untitled &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschoolinguntitled.com\">http://www.unschoolinguntitled.com</a>&gt;  (<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschoolinguntitled.com\">http://www.unschoolinguntitled.com</a> )<br/>\nLiving an unschooled lifestyle, one experience at a time!<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":405688844,"authorName":"stephanie.weisner","from":"&quot;stephanie.weisner&quot; &lt;stephanie.weisner@...&gt;","profile":"stephanie.weisner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Unschooling sleep","postDate":"1306457156","msgId":61276,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlybXM4NCtrbXJkQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":61277,"prevInTime":61275,"nextInTime":61277,"topicId":61276,"numMessagesInTopic":0,"msgSnippet":"Hi everyone :) My family is whole-life unschooling and, while I totally believe in the philosophy and see how awesome it can be for us, we re having some","messageBody":"<div id=\"ygrps-yiv-1658855944\">Hi everyone :)<br/>\n<br/>\nMy family is whole-life unschooling and, while I totally believe in the philosophy and see how awesome it can be for us, we&#39;re having some issues with our toddler&#39;s sleep. Her normal schedule seems to be to go to sleep around 10 pm and wake up around 6 am. She&#39;s just over 2 and she&#39;s not napping anymore. The problem is that she acts very tired during the day (being violent towards her baby brother and her dad and I, contradicting everything she asks for...basically 2 year old behavior). Today she woke up at 3:30 am for the day and wouldn&#39;t go back to sleep. I&#39;m worried that she&#39;s not getting enough rest but she fights sleep like nothing else. Also, she has night terrors a few times a week where she acts very scared and can also lash out at us if we try to comfort her.<br/>\n<br/>\nIs 2 too young to let our daughter choose her bedtime? Is this just a case of riding it out and we&#39;ll look back at it in a few months and laugh?<br/>\n<br/>\nThanks for any input you may have.</div>","specialLinks":[]}],"prevTopicId":61249,"nextTopicId":34585}}