{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":17,"messages":[{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] So Confused!!!","postDate":"1323648399","msgId":64339,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMjM2NDgzOTkuMTAwNjIuWWFob29NYWlsTmVvQHdlYjEyMjUxNS5tYWlsLm5lMS55YWhvby5jb20+","inReplyToHeader":"PDEzMjM2MDgyNDEuNTAyNDIuWWFob29NYWlsTmVvQHdlYjExNDYwOS5tYWlsLmdxMS55YWhvby5jb20+","referencesHeader":"PGpidWxjMitwbnFzQGVHcm91cHMuY29tPiA8NEVFMzlGMkMuNTA3MDAwOEBnbWFpbC5jb20+IDwxMzIzNjA4MjQxLjUwMjQyLllhaG9vTWFpbE5lb0B3ZWIxMTQ2MDkubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":64313,"nextInTopic":0,"prevInTime":64338,"nextInTime":64340,"topicId":64241,"numMessagesInTopic":0,"msgSnippet":"***I would sit next to her and step in when I saw something I KNEW was innapropriate (people post real junk) I would say oh, that s grown-up stuff but that","messageBody":"<div id=\"ygrps-yiv-53231796\">***I would sit next to her and step in when I saw something I KNEW was innapropriate (people post real junk) I would say &quot;oh, that&#39;s grown-up stuff&quot; but that was way too much commentary for her, she really didn&#39;t care to know,<br/>\nthen I noticed she couldn&#39;t even tell it was an innapropriate image, she just wanted to watch her videos. So I before I did too much more damage to our communication/relationship I asked her to come to me if she ever had questions about something she saw. She said OK, but she may not, I may have messed it up already, like my mom did for me and her, when I was a kid.***<br/>\n<br/>\n<br/>\nWhen Margaux was little, The Lord of the Rings came out.  She wanted to watch it, but Gollum scared her.  At the time, we had the couch set up so that there were toys and such behind it.  I remember sitting back there with her while she would pop her head above the couch to watch and pop back down to play with toys, when it was too much.  I still haven&#39;t watched those movies straight through.  <br/>\n<br/>\nMargaux has a sister that is 7 1/2 yrs older than she is.  There was simply no way to shelter Margaux from more mature conversations.  Her older sister lived a much more sheltered life!  She watched age appropriate movies and tv shows, read lots of kid books, did lots of kid things.  Margaux is 10 and surrounded by older teens and older teen conversation and doings.  I can&#39;t change that even if I tried!  Her preference is kids her own age doing 10 yr old things and we set aside time to do that, but she settles for what is there, which is often hanging out with the teenagers, going along with their jokes, watching videos and movies with them and listening to their conversations.<br/>\n<br/>\nIf kids know without a doubt that they can come to their parents with questions, even embarrassing questions, without shame or judgement, they will do so.  Some kids are more private than others and may not ask about everything and that&#39;s okay because eventually they will come to a better understanding.  Margaux really likes the show How I Met Your Mother.  It&#39;s all about sex and relationships and most of it goes right over her head!  She likes the characters and the story lines and the comedic situations.  One day she&#39;ll connect the dots and see the show in a different way!  For now she views it in her own 10 yr old way, with her 10 yr old understanding of the world.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":475251512,"authorName":"Deb","from":"&quot;Deb&quot; &lt;vwb777@...&gt;","profile":"vwb777","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: So Confused!!!","postDate":"1323629539","msgId":64313,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpjMnU1MytydHZxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpidWxjMitwbnFzQGVHcm91cHMuY29tPg=="},"prevInTopic":64312,"nextInTopic":64339,"prevInTime":64312,"nextInTime":64314,"topicId":64241,"numMessagesInTopic":0,"msgSnippet":"I m a Christian and have wrestled with the same dilemmas that you re facing. I don t have it all figured out yet because there s a lot of info to sift through,","messageBody":"<div id=\"ygrps-yiv-616719825\">I&#39;m a Christian and have wrestled with the same dilemmas that you&#39;re facing. I don&#39;t have it all figured out yet because there&#39;s a lot of info to sift through, but you might want to check out  gentlechristianmothers.com.    They have a forum with a sub-forum for unschoolers. I think it would give you some peace to see how other Christians UNschool. Just a thought. Take care.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Amy&quot; &lt;amymodlin@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I am new to the list and the more I try to understand unschooling the more confused I seem to become.  I think I do not have a clear picture of what it really is.  In the beginning, I thought it seemed permissive and ego centric.<br/>\n&gt; <br/>\n&gt; I only know of one family in my community that &quot;unschools.&quot;  By her own admission she says that most unschoolers would not even consider her to be an unschooler.  She does not use a curriculum, but considers her style to be more of a montessori method.  So this is what I thought unschooling meant- no curriculum...  And then I stumbled on to AlwaysLearning.  <br/>\n&gt; <br/>\n&gt; I am a Catholic.  I am coservative.  And I believe in trying to preserve my children&#39;s innocense.  This makes me wonder if I can truly unschool.  Since being on this group, I have seriously started to reevaluate some of my ideas on child rearing.  However, there are things that I just do not see myself giving up my control over.  Some examples are: 1. Going to church  2. Listening to music or watching programs with sexual content.<br/>\n&gt; <br/>\n&gt; My daughter is 10 and loves being a child.  She is in no rush to grow up.  She loves playing with her dolls and barbies still.  She has asked for an american girl doll for Christmas.  I have the impression and I might be wrong, but I feel like most unschooled children probably know a lot more about &quot;life&quot; than she does.<br/>\n&gt; <br/>\n&gt; So I wonder if this unschooling lifestyle is not suited for me and I should just be eclectic. <br/>\n&gt; <br/>\n&gt; I hope that I have posted correctly.  I read all of the info on posting to the list.  My thoughts are heartfelt and do not intend to spark debates.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":217568290,"authorName":"Laureen","from":"Laureen &lt;splashing@...&gt;","profile":"elementalgrrl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] So Confused!!!","postDate":"1323625663","msgId":64312,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBSFdpbkJxa3dyVEJyd0g5MVl0THJSLVhHTk4yS1hqZks1UmFwd2NrYWE9ZmlkT3otQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGpidWxjMitwbnFzQGVHcm91cHMuY29tPg==","referencesHeader":"PGpidWxjMitwbnFzQGVHcm91cHMuY29tPg=="},"prevInTopic":64306,"nextInTopic":64313,"prevInTime":64311,"nextInTime":64313,"topicId":64241,"numMessagesInTopic":0,"msgSnippet":"Heya ... It can sound that way. ... That s a really interesting thing to explore. Would they bump into things naturally in your life that would damage that","messageBody":"<div id=\"ygrps-yiv-1276598780\">Heya<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Fri, Dec 9, 2011 at 7:57 PM, Amy &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:amymodlin@...\">amymodlin@...</a>&gt; wrote:<br/>\n<br/>\n&gt; I am new to the list and the more I try to understand unschooling the more<br/>\n&gt; confused I seem to become.  I think I do not have a clear picture of what<br/>\n&gt; it really is.  In the beginning, I thought it seemed permissive and ego<br/>\n&gt; centric.<br/>\n&gt;<br/>\n<br/>\nIt can sound that way.<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I am a Catholic.  I am coservative.  And I believe in trying to preserve<br/>\n&gt; my children&#39;s innocense.<br/>\n<br/>\n<br/>\nThat&#39;s a really interesting thing to explore. Would they bump into things<br/>\nnaturally in your life that would damage that innocence? Probably not,<br/>\nright? So as a Catholic and a conservative, sharing with your children<br/>\nthose things that inspire, intrigue, and motivate them that also inspire,<br/>\nintrigue, and motivate you, the likelihood that their innocence will remain<br/>\nintact for longer than it would in conventional school is pretty huge.<br/>\n<br/>\n<br/>\n&gt;  This makes me wonder if I can truly unschool.  Since being on this group,<br/>\n&gt; I have seriously started to reevaluate some of my ideas on child rearing.<br/>\n&gt;  However, there are things that I just do not see myself giving up my<br/>\n&gt; control over.  Some examples are: 1. Going to church  2. Listening to music<br/>\n&gt; or watching programs with sexual content.<br/>\n&gt;<br/>\n<br/>\nIs church interesting? Engaging? Motivational? The thing about unschooling<br/>\nis that it&#39;s easy to motivate someone towards something that is inherently<br/>\namazing. And Catholicism can be amazing, even to a non-Catholic. I&#39;m pretty<br/>\nsure it&#39;d be no trouble at all to make church be someplace so fascinating<br/>\nthat they&#39;d want to go there. If you are joyful and excited about church,<br/>\nthat will show, and if you and your kids are connected, they&#39;ll want to<br/>\nshare that joy and excitement with you.<br/>\n<br/>\nThe &quot;sexual content&quot; question is much more complicated, and that&#39;s<br/>\nsomething you want to explore in your own head. What is it you&#39;re trying to<br/>\ndo? If you&#39;re trying to ensure that you don&#39;t have to answer any<br/>\nuncomfortable questions... then your kids will get their information<br/>\nsomewhere (you cannot crush out interest in sex in the human species. It&#39;s<br/>\nimpossible.). So you might want to think about that.<br/>\n<br/>\n<br/>\n&gt;<br/>\n&gt; My daughter is 10 and loves being a child.  She is in no rush to grow up.<br/>\n&gt;  She loves playing with her dolls and barbies still.  She has asked for an<br/>\n&gt; american girl doll for Christmas.  I have the impression and I might be<br/>\n&gt; wrong, but I feel like most unschooled children probably know a lot more<br/>\n&gt; about &quot;life&quot; than she does.<br/>\n&gt;<br/>\n<br/>\nIs knowing about sex a bad thing? (if you&#39;re using &quot;life&quot; as a euphemism<br/>\nfor &quot;sex&quot; there, you might want to ask yourself why that is... euphemisms<br/>\nmuddy your thought, and prevent you from really facing what you&#39;re doing).<br/>\nI mean... knowledge about sex covers a continuum, from porn to immaculate<br/>\nconception.  Do I want my kids knowing about porn? Of course not. Do I want<br/>\nthem to understand normal, biological hormone surges and what those will<br/>\nfeel like, so they can tell me, so we can address reality directly and<br/>\ncomfortably, in a very connected, supportive way? Absolutely.<br/>\n<br/>\nIn movies, often, there&#39;s kissing. Say, &quot;Princess Bride&quot; for example. Is<br/>\nthat sexual content? Kind of. My husband and I started a tradition when the<br/>\nkids were babies, of yelling &quot;kissing!&quot; and hugging and kissing everyone<br/>\naround us. It&#39;s a celebration. Physical human affection! Hurrah!!! It<br/>\nemphasizes that kissing can be a lovely thing, while ignoring the whole<br/>\n&quot;sex&quot; thing.<br/>\n<br/>\nDo my husband and I kiss in front of them? Sure. Do they know anything<br/>\nbeyond that&#39;s what happily married in-love people often do? Nope. Age and<br/>\ncontext-appropriate information.<br/>\n<br/>\nIs it a failure of innocence for my kids to see their parents kissing? I<br/>\ndon&#39;t think so, but I might be different than you. You need to assess your<br/>\nown thoughts there, figure out what kind of message you&#39;re working with,<br/>\nand go from there. And the beauty of unschooling is that you can.<br/>\n<br/>\n<br/>\n&gt; So I wonder if this unschooling lifestyle is not suited for me and I<br/>\n&gt; should just be eclectic.<br/>\n&gt;<br/>\n<br/>\nMight want to focus less on labels, and more on relationships. Because<br/>\nthat&#39;s really what unschooling is (at least for us)... it&#39;s putting<br/>\ninformation and information-gathering activities within the context of<br/>\nsolid relationships.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\n~~L!<br/>\n<br/>\ns/v Excellent Adventure<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.theexcellentadventure.com/\">http://www.theexcellentadventure.com/</a><br/>\n<br/>\n&quot;The greatest expression of rebellion is *joy*.&quot;<br/>\n— Joss Whedon<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":441643010,"authorName":"Veronica Deleon-sutter","from":"Veronica Deleon-sutter &lt;vdeleonsutter@...&gt;","profile":"vdeleonsutter","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] So Confused!!!","postDate":"1323608241","msgId":64306,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMjM2MDgyNDEuNTAyNDIuWWFob29NYWlsTmVvQHdlYjExNDYwOS5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PDRFRTM5RjJDLjUwNzAwMDhAZ21haWwuY29tPg==","referencesHeader":"PGpidWxjMitwbnFzQGVHcm91cHMuY29tPiA8NEVFMzlGMkMuNTA3MDAwOEBnbWFpbC5jb20+"},"prevInTopic":64289,"nextInTopic":64312,"prevInTime":64305,"nextInTime":64307,"topicId":64241,"numMessagesInTopic":0,"msgSnippet":"As I have stumbled over this question myself with poor results, I have to say, this is how I preserve my 81/2 yr old daughter s innocence. When she s watched","messageBody":"<div id=\"ygrps-yiv-303465387\">As I have stumbled over this question myself with poor results, I have to say, this is how I preserve my 81/2 yr old daughter&#39;s innocence. When she&#39;s watched videos on youtube with teenagers acting awfully or watched tv and seen the same, she literally runs to me and cries that she doesn&#39;t want to be a teenager! I assure her she doesn&#39;t in any way have to be the way she sees them portrayed. I don&#39;t tell her it will be ok then, to act that way or it will be different when she is older... This same child has shown me that she DOES NOT want me censoring what videos she watches and that she will sneak to watch them if she has to. And not for the reasons I think, perhaps, but because they have the video  game characters she loves. I would sit next to her and step in when I saw something I KNEW was innapropriate (people post real junk) I would say &quot;oh, that&#39;s grown-up stuff&quot; but that was way too much commentary for her, she really didn&#39;t care to know,<br/>\n then I noticed she couldn&#39;t even tell it was an innapropriate image, she just wanted to watch her videos. So I before I did too much more damage to our communication/relationship I asked her to come to me if she ever had questions about something she saw. She said OK, but she may not, I may have messed it up already, like my mom did for me and her, when I was a kid.<br/>\n<br/>\n <br/>\n<br/>\n________________________________<br/>\n From: Frantz Family &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:frantzemail@...\">frantzemail@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\nSent: Saturday, December 10, 2011 1:04 PM<br/>\nSubject: Re: [AlwaysLearning] So Confused!!!<br/>\n <br/>\n<br/>\n <br/>\n   <br/>\n <br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 12/9/2011 8:57 PM, Amy wrote:<br/>\n&gt; I am a Catholic.  I am coservative.  And I believe in trying to preserve my children&#39;s innocense.  This makes me wonder if I can truly unschool.<br/>\n<br/>\nI am about half way through A Little Way of Homeschooling:Thirteen <br/>\nFamilies Discover Catholic Homeschooling by Suzie Andres.  This was <br/>\npublished this year.  The author also wrote Homeschooling with <br/>\nGentleness.  I have not read that one.  So there does seem to be other <br/>\nCatholic unschoolers in the world. :-)  I got this book through <br/>\ninterlibrary loan so you might be able to get them as well.<br/>\n<br/>\nMargo<br/>\n<br/>\n   <br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] So Confused!!!","postDate":"1323545527","msgId":64289,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhNeDJMaXVXa204elplV2ZPX3JRck9YMz14TkQ4eERoakpyamo3cWl6bVVyZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDk0NUI0MDA2LUYyNjMtNEJFMS1BQjA4LUUzNDg5OEMzOEIxREBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGpidWxjMitwbnFzQGVHcm91cHMuY29tPgk8RjlDMEFFODMtMUU1RC00MjYzLTlDNDItMDJGNTlEQjc4N0RGQHZlcml6b24ubmV0Pgk8OTQ1QjQwMDYtRjI2My00QkUxLUFCMDgtRTM0ODk4QzM4QjFEQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":64288,"nextInTopic":64306,"prevInTime":64288,"nextInTime":64290,"topicId":64241,"numMessagesInTopic":0,"msgSnippet":"About that particular song - it was played SO constantly on the radio stations we listened to in those days, that it is part of the soundtrack of my memories","messageBody":"<div id=\"ygrps-yiv-1137242977\">About that particular song - it was played SO constantly on the radio<br/>\nstations we listened to in those days, that it is part of the soundtrack of<br/>\nmy memories of those years of my life. I was in high school and I wondered<br/>\nand wondered about that song. I didn&#39;t know what &quot;spend the night together<br/>\nwould entail, exactly.&quot; And I&#39;d had boyfriends and we&#39;d kissed and it<br/>\nwasn&#39;t long AFTER that when I would have fully understood. But right then,<br/>\nin 1967, I was 15 and confused about lots of stuff. AND I was aware that it<br/>\nmeant something and that everybody else seemed to know, but I didn&#39;t ask<br/>\nanybody.<br/>\n<br/>\n-pam<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sat, Dec 10, 2011 at 8:49 AM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n&gt; When I was a kid, ten or eleven years old maybe, The Rolling Stones had a<br/>\n&gt; song with these horrible sinful lyrics:<br/>\n&gt;<br/>\n&gt; Let&#39;s spend the night together<br/>\n&gt; Now I need you more than ever<br/>\n&gt; Let&#39;s spend the night together now<br/>\n&gt;<br/>\n&gt; To me it was just nothing.<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] So Confused!!!","postDate":"1323545213","msgId":64288,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhON2pUU2gxeVdFcFV5ZzJRdnRvTjVvbWVqeDBudmlHc0F4cWdia1VHVlI5UUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEY5QzBBRTgzLTFFNUQtNDI2My05QzQyLTAyRjU5REI3ODdERkB2ZXJpem9uLm5ldD4=","referencesHeader":"PGpidWxjMitwbnFzQGVHcm91cHMuY29tPgk8RjlDMEFFODMtMUU1RC00MjYzLTlDNDItMDJGNTlEQjc4N0RGQHZlcml6b24ubmV0Pg=="},"prevInTopic":64280,"nextInTopic":64289,"prevInTime":64287,"nextInTime":64289,"topicId":64241,"numMessagesInTopic":0,"msgSnippet":"... innocence, but overlaps. I also was big on not exposing them to things that I didn t think they were old enough to cope with. For example, kids don t ","messageBody":"<div id=\"ygrps-yiv-729151892\">On Dec 9, 2011, at 10:57 PM, Amy wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &gt; And I believe in trying to preserve my children&#39;s innocense.<br/>\n&gt;<br/>\n&gt; I was big on protecting their childhood, which isn&#39;t quite the same as<br/>\n </span></blockquote>innocence, but overlaps. I also was big on not exposing them to things that<br/>\nI didn&#39;t think they were old enough to cope with. For example, kids don&#39;t<br/>\nunderstand statistics and they are egocentric. If they hear about how a<br/>\nchild was kidnapped and killed, they will be frightened that it might<br/>\nhappen to them, even if it was just one child out of millions and was far<br/>\naway, even in another country.<br/>\n<br/>\nI didn&#39;t protect my young kids from sweet and happy sexual stuff in movies<br/>\nor on tv. I did protect them from violent sex or overly-graphic sex that<br/>\nmight disturb them. It was ALL about what I thought the kids could handle.<br/>\nI tried to keep their lives happy and peaceful.<br/>\n<br/>\nAs young adults, my kids choose to protect themselves, too, from being<br/>\ninundated with negativity. They will choose not to watch a movie about some<br/>\nhorrible historical event, for example. They don&#39;t mind knowing about the<br/>\nevent, but they see no reason to wallow in the horrific nature of something<br/>\nthey can do absolutely nothing about.<br/>\n<br/>\nWe went to what was then a temporary 9/11 memorial museum in NYC and made<br/>\nit through the little video at the beginning and took about 5 steps down a<br/>\nhallway with photographs of all the people killed in the attacks. Rosie and<br/>\nI both just immediately backed out and went and waited for the rest of our<br/>\nparty out front. She was 16 so it wasn&#39;t that she wasn&#39;t &quot;old enough&quot; but<br/>\nthat that few seconds of exposure was enough for her. She doesn&#39;t want to<br/>\nbe ignorant - it isn&#39;t an ostrich burying its head in the sand thing. It is<br/>\na matter of how she wants to live her own life and knowing that making<br/>\nherself feel horrified, dismal, and hopeless isn&#39;t going to change anything<br/>\nEXCEPT her own outlook and experience of her own life.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] So Confused!!!","postDate":"1323541502","msgId":64280,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBBRjI2RUZGLUM0MkItNDc5MS1BMTRFLTgyRTg5OUY3NzhFNEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDRFRTM5RjJDLjUwNzAwMDhAZ21haWwuY29tPg==","referencesHeader":"PGpidWxjMitwbnFzQGVHcm91cHMuY29tPiA8NEVFMzlGMkMuNTA3MDAwOEBnbWFpbC5jb20+"},"prevInTopic":64278,"nextInTopic":64288,"prevInTime":64279,"nextInTime":64281,"topicId":64241,"numMessagesInTopic":0,"msgSnippet":"-=-I am about half way through A Little Way of Homeschooling:Thirteen Families Discover Catholic Homeschooling by Suzie Andres. This was published this year.","messageBody":"<div id=\"ygrps-yiv-789711961\">-=-I am about half way through A Little Way of Homeschooling:Thirteen <br/>\nFamilies Discover Catholic Homeschooling by Suzie Andres. This was <br/>\npublished this year. The author also wrote Homeschooling with <br/>\nGentleness. I have not read that one. So there does seem to be other <br/>\nCatholic unschoolers in the world. :-) I got this book through <br/>\ninterlibrary loan so you might be able to get them as well.-=-<br/>\n<br/>\nHere&#39;s an interview with the author:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.catholicnewsagency.com/cw/post.php?id=582\">http://www.catholicnewsagency.com/cw/post.php?id=582</a><br/>\n<br/>\nSome of the families from that book are in this small group.  Also some people who are religious but not Christian.  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/Religion_and_Unschooling/?yguid=247566989\">http://groups.yahoo.com/group/Religion_and_Unschooling/?yguid=247566989</a><br/>\n<br/>\nHere&#39;s a list of resources for Christian unschoolers:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/christian/resources.html\">http://sandradodd.com/christian/resources.html</a><br/>\n<br/>\nHere are some other pages on my site that deal with religion:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/religion\">http://sandradodd.com/religion</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/people/kathyward/\">http://sandradodd.com/people/kathyward/</a> (part of it is on fundamentalism)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/christian/\">http://sandradodd.com/christian/</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":393613672,"authorName":"Frantz Family","from":"Frantz Family &lt;frantzemail@...&gt;","profile":"smfmommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] So Confused!!!","postDate":"1323540268","msgId":64278,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRFRTM5RjJDLjUwNzAwMDhAZ21haWwuY29tPg==","inReplyToHeader":"PGpidWxjMitwbnFzQGVHcm91cHMuY29tPg==","referencesHeader":"PGpidWxjMitwbnFzQGVHcm91cHMuY29tPg=="},"prevInTopic":64273,"nextInTopic":64280,"prevInTime":64277,"nextInTime":64279,"topicId":64241,"numMessagesInTopic":0,"msgSnippet":"... I am about half way through A Little Way of Homeschooling:Thirteen Families Discover Catholic Homeschooling by Suzie Andres.  This was published this year.","messageBody":"<div id=\"ygrps-yiv-1282996344\">On 12/9/2011 8:57 PM, Amy wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I am a Catholic.  I am coservative.  And I believe in trying to preserve my children&#39;s innocense.  This makes me wonder if I can truly unschool.<br/>\n<br/>\n </span></blockquote>I am about half way through A Little Way of Homeschooling:Thirteen <br/>\nFamilies Discover Catholic Homeschooling by Suzie Andres.  This was <br/>\npublished this year.  The author also wrote Homeschooling with <br/>\nGentleness.  I have not read that one.  So there does seem to be other <br/>\nCatholic unschoolers in the world. :-)  I got this book through <br/>\ninterlibrary loan so you might be able to get them as well.<br/>\n<br/>\nMargo</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] So Confused!!!","postDate":"1323535746","msgId":64273,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk0NUI0MDA2LUYyNjMtNEJFMS1BQjA4LUUzNDg5OEMzOEIxREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEY5QzBBRTgzLTFFNUQtNDI2My05QzQyLTAyRjU5REI3ODdERkB2ZXJpem9uLm5ldD4=","referencesHeader":"PGpidWxjMitwbnFzQGVHcm91cHMuY29tPiA8RjlDMEFFODMtMUU1RC00MjYzLTlDNDItMDJGNTlEQjc4N0RGQHZlcml6b24ubmV0Pg=="},"prevInTopic":64271,"nextInTopic":64278,"prevInTime":64272,"nextInTime":64274,"topicId":64241,"numMessagesInTopic":0,"msgSnippet":"-=-This is especially true of songs. We had this discussion a bit ago, and at least for me as a child, I didn t really process the words in songs, even though","messageBody":"<div id=\"ygrps-yiv-233706747\">-=-This is especially true of songs. We had this discussion a bit ago, and at least for me as a child, I didn&#39;t really process the words in songs, even though I love words :-) They were just sounds that enhanced the music like the guitar or the keyboards. I picked up some phrases but they were just words, not usually meaningful words. Now I listen to some songs that I listened to as a teen and think &quot;Are they really saying what I think they&#39;re saying??&quot; ;-) My sports nut husband probably listened a couple hundred times to Meatloaf&#39;s Paradise By the Dashboard Lights, about a guy getting to all the &quot;bases&quot; with his girlfriend, but it&#39;s done as a baseball play by play. And my husband thought the song was about baseball until he was in college ;-)-=-<br/>\n<br/>\nWhen I was a kid, ten or eleven years old maybe, The Rolling Stones had a song with these horrible sinful lyrics:<br/>\n<br/>\nLet&#39;s spend the night together<br/>\nNow I need you more than ever<br/>\nLet&#39;s spend the night together now<br/>\n<br/>\nTo me it was just nothing.<br/>\nTo my mom and other parents it brought up pictures of bodily fluids and something I couldn&#39;t imagine that was outside of marriage, or sin, or something.  I didn&#39;t know what they were all ranting and wailing about, but they were. Adults on TV, adults on the radio were ranting and wailing and warning and shaming and going all kinds of crazy.<br/>\n<br/>\nOther songs at the time about which adults wailed:<br/>\nGood Golly Miss Molly<br/>\nLouie, Louie<br/>\n<br/>\nSo of course, lots of kids played those songs slowly, and often, to see what was so nasty.  What the parents pointed at as nasty sin was closely examined and focussed on.  What parents ignored was not closely examined.<br/>\n<br/>\nIn the early 21st century, I was driving along with two of my kids and two from another family, and a cassette tape was playing in my car (yeah, I still had a cassette player for a while, in the 21st century), and &quot;Under the Boardwalk&quot; came on.  The girl from the other family was maybe 11 years old; about as old as I was when my mom flipped out about Mick Jagger&#39;s as-usual unintelligible lyrics, because someone else told her to.   The girl covered her little brother&#39;s ears, calmly and pointedly, and said her dad said they shouldn&#39;t listen to that song.  So I turned it off.  <br/>\n<br/>\nUnder the boardwalk <br/>\nPeople walking above<br/>\nUnder the boardwalk<br/>\nWe&#39;ll be making love<br/>\n<br/>\nNone of those words are nasty.<br/>\n<br/>\nI happened to know that their dad first saw and was attracted to their mom while she was singing &quot;Turn back, oh man, forswear thy foolish ways&quot; which is a suggestive, bawdy performance within the musical Godspell.  I didn&#39;t mention the bump and grind that had spawned them. :-)<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: So Confused!!!","postDate":"1323534195","msgId":64271,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpjMDExais2ZmJuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEVDNzBBNjA1LTIwRDAtNEY3NC1BMEQyLUQyODI4NkIyQzcwQ0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":64270,"nextInTopic":64273,"prevInTime":64270,"nextInTime":64272,"topicId":64241,"numMessagesInTopic":0,"msgSnippet":"... **************** Ray has commented that the unschooling teens he s met seem very innocent to him. They cuddle more than other teens. They do goofy, sexy","messageBody":"<div id=\"ygrps-yiv-1696854502\">Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; My oldest was much more innocent than his two younger siblings.  It&#39;s easy with an only child.  He didn&#39;t mind at all not knowing more, and by the time there was  a third child and the older kids had discovered a rougher, larger world, she didn&#39;t know otherwise, and all in all the results weren&#39;t different.  They all were (still are) interested in a great range of things.  Holly watched cartoons this week.  My oldest sent me a link to a Sesame Street song done in a different style on facebook today.  <br/>\n </span></blockquote>****************<br/>\n<br/>\nRay has commented that the unschooling teens he&#39;s met seem very innocent to him. They cuddle more than other teens. They do goofy, sexy things, but they&#39;re mostly Goofy sexy things, not as hard edged and desperate as schooled teens. Ray only had a few years of unschooling, preceded by a couple very rough years in school, so he&#39;s harder and older and more jaded than the unschoolers he&#39;s met who are the same age. He&#39;s Not as jaded and hard as the local highschool kids - unschooling let him do a Lot of healing in that capacity - but he&#39;s not as sweet as kids who&#39;ve had years more time to explore the scary process of growing up at their own pace. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] So Confused!!!","postDate":"1323534116","msgId":64270,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY5QzBBRTgzLTFFNUQtNDI2My05QzQyLTAyRjU5REI3ODdERkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGpidWxjMitwbnFzQGVHcm91cHMuY29tPg==","referencesHeader":"PGpidWxjMitwbnFzQGVHcm91cHMuY29tPg=="},"prevInTopic":64269,"nextInTopic":64271,"prevInTime":64269,"nextInTime":64271,"topicId":64241,"numMessagesInTopic":0,"msgSnippet":"... I like what Sandra said about not deciding in advance. Unschooling is responding to your child s wants and needs. Some kids If you think about the word","messageBody":"<div id=\"ygrps-yiv-1105187690\">On Dec 9, 2011, at 10:57 PM, Amy wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And I believe in trying to preserve my children&#39;s innocense.<br/>\n<br/>\n </span></blockquote>I like what Sandra said about not deciding in advance. Unschooling is responding to your child&#39;s wants and needs. Some kids <br/>\n<br/>\nIf you think about the word preserving, it means keeping longer than it would naturally.<br/>\n<br/>\nAnd if you examine the word &quot;naturally&quot; does it mean this here and now world or the safe, happy world created for most children&#39;s stories that adults assume kids want to live in.<br/>\n<br/>\nWhich is why it&#39;s important to put a high priority on the child&#39;s desires rather than the mom&#39;s desires for the child. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; However, there are things that I just do not see myself giving up my control over. Some examples are: 1. Going to church<br/>\n<br/>\n </span></blockquote>Religion is a separate philosophy. It&#39;s up to individual unschoolers to decide how to mesh them since there may be parts that are incompatible with each other.<br/>\n<br/>\nI think Christians have an easy out since they can say God wants this of us rather than the parent being the one making thm. ;-) <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have the impression and I might be wrong, but I feel like most unschooled children probably know a lot more about &quot;life&quot; than she does.<br/>\n<br/>\n </span></blockquote>Totally completely depends on the child.<br/>\n<br/>\nIt probably gets especially confusing when list members are discussing letting go of controls. It *sounds* like people are saying you must let your kids watch any program on TV, you must get them a video game system, you must let them eat any and all foods. But you must not tell them about slaughter houses ;-)<br/>\n<br/>\nBut for unschooling the emphasis is on what the child wants and likes. Help them get more of what they like. Help them avoid what they don&#39;t like. It&#39;s not about opening the flood gates and allowing everything and anything to wash over the child. It&#39;s about partnering with them, using your greater knowledge to help them get more of what they like, show them things you believe they might like, and filtering out what *the child* isn&#39;t interested in.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; 2. Listening to music or watching programs with sexual content.<br/>\n<br/>\n </span></blockquote>Does your child want to watch them? That&#39;s the key unschooling question.<br/>\n<br/>\nThe problem with saying no to a child *who wants to explore something* is that the no increases curiosity. A child whose parent is their partner in exploring, feels free to try something and decided they don&#39;t (yet) like it. If the parent is being a protective roadblock between the child and what the child&#39;s curious about, if the child gets to finally explore it (after pleading, after sneaking, after patiently waiting until they&#39;re &quot;old enough&quot;) they&#39;ve got a lot invested in getting to the thing that they&#39;ll hold onto it despite how they feel because they&#39;ve finally &quot;won&quot; the right to do it.<br/>\n<br/>\nThe problem with saying yes to a child is they don&#39;t always have a good grasp of what they&#39;re asking to explore. That&#39;s where parents can lend their knowledge to provide a clearer picture. *Not* stack the information to convince the child to the mom&#39;s way of thinking. But provide information so the child can make a more informed choice. If she&#39;s choosing something that you&#39;re not entirely comfortable with, that&#39;s where being with her comes into play. <br/>\n<br/>\n*If* a child knows her mom&#39;s priority is helping her explore, helping her get what she wants in safe, respectful doable ways, when the mom *does* occasionally say &quot;No, I don&#39;t feel comfortable with that,&quot; that will be taken much differently than a child who hears lots of (protective) nos.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; 2. Listening to music or watching programs with sexual content.<br/>\n<br/>\n </span></blockquote>I do want to add that kids in general don&#39;t see the sexual content the same way adults do. It comes across *very* differently to kids. They may even be tuning it out. Just as they do to other parts of the movies, like the talky parts, the political maneuverings. Anything that isn&#39;t action or comedy ;-) They&#39;ll be thinking about something else until the good parts start up again.<br/>\n<br/>\nThis is especially true of songs. We had this discussion a bit ago, and at least for me as a child, I didn&#39;t really process the words in songs, even though I love words :-) They were just sounds that enhanced the music like the guitar or the keyboards. I picked up some phrases but they were just words, not usually meaningful words. Now I listen to some songs that I listened to as a teen and think &quot;Are they really saying what I think they&#39;re saying??&quot; ;-) My sports nut husband probably listened a couple hundred times to Meatloaf&#39;s Paradise By the Dashboard Lights, about a guy getting to all the &quot;bases&quot; with his girlfriend, but it&#39;s done as a baseball play by play. And my husband thought the song was about baseball until he was in college ;-)<br/>\n<br/>\nThis won&#39;t be true of every child. It depends on their personality and what fascinates them. But the opposite that kids will absorb everything they see is not true either.<br/>\n<br/>\nIt depends on the child.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: So Confused!!!","postDate":"1323533838","msgId":64269,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpjMDBtZStvcGk0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpidWxjMitwbnFzQGVHcm91cHMuY29tPg=="},"prevInTopic":64256,"nextInTopic":64270,"prevInTime":64268,"nextInTime":64270,"topicId":64241,"numMessagesInTopic":0,"msgSnippet":"... ****************** If going to church and catechism are things your kids enjoy, then the issue of control need never not come up. It s just a part of","messageBody":"<div id=\"ygrps-yiv-1087794056\">&quot;Amy&quot; &lt;amymodlin@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;However, there are things that I just do not see myself giving up my control over.  Some examples are: 1. Going to church <br/>\n </span></blockquote>******************<br/>\n<br/>\nIf going to church and catechism are things your kids enjoy, then the issue of &quot;control&quot; need never not come up. It&#39;s just a part of your family culture like going to coffee shops and working crossword puzzles are part of My family culture. The issues come up if kids don&#39;t want to go - and there are plenty of ways to live a Christian lifestyle, even a Catholic lifestyle, without forcing unhappy children to resent having to sit through yet another dull service or class. <br/>\n<br/>\nThat&#39;s when it helps to get past the surface of what unschoolers do and think about why you want certain things for your kids. Is it really &quot;going to church&quot; which is important? Or your kids relationship with their creator? One does not depend on the other. <br/>\n<br/>\n<br/>\n 2. Listening to music or watching programs with sexual content.<br/>\n<br/>\nDo your kids Want to listen to music or watch programs with sexual content? That&#39;s a big mistake a lot of parents make, thinking that those sorts of topics have any interest to little kids. Mostly they find them dull or vaguely icky - until the hormones start flowing and then all the attempts in the world won&#39;t &quot;preserve&quot; a child&#39;s &quot;innocence&quot;. Sheltering them doesn&#39;t keep teenage girls from getting pregnant, and never has. <br/>\n<br/>\nWhich isn&#39;t to say you should expose your kids blindly to anything and everything - but adolescents who have had sex marked &quot;off limits&quot; *will* very often blindly expose themselves to anything and everything they can get their hands on, to find out what&#39;s the Big Secret. Too much &quot;sheltering&quot; very often sets kids up to get hurt - or at best spectacularly misinformed.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; My daughter is 10 and loves being a child.  She is in no rush to grow up.  She loves playing with her dolls and barbies still.<br/>\n </span></blockquote>********************<br/>\n<br/>\nThen she&#39;ll likely respond much like my daughter and cover her eyes voluntarily when mere kissing comes on the screen. No need to say &quot;oh, look away, this is sexy!&quot; she&#39;s already appalled.<br/>\n<br/>\nIn terms of music, the worst that would happen if your daughter heard something sexual is she&#39;d ask about out. Correction! The worst that would happen is she&#39;d be too worried about your reaction to ask You and would ask another kid and maybe get a slew of misinformation. The Best thing that could happen is she would ask you, giving you a chance to have a gentle, respectful conversation with your little girl. <br/>\n<br/>\nKids are curious and will ask awkward questions at times. The danger - a very very real danger! of sheltering them is they learn not to ask those awkward questions of their parents. How much do you trust the kids next door to get the details right?<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":363518215,"authorName":"Claire","from":"&quot;Claire&quot; &lt;claire.horsley08@...&gt;","profile":"claire.horsley08","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: So Confused!!!","postDate":"1323525000","msgId":64256,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpidm8yOCtlczYzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEVDNzBBNjA1LTIwRDAtNEY3NC1BMEQyLUQyODI4NkIyQzcwQ0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":64247,"nextInTopic":64269,"prevInTime":64255,"nextInTime":64257,"topicId":64241,"numMessagesInTopic":0,"msgSnippet":"... Unschooling is a way of life in which a close, honest and loving relationship between parent and child forms the scaffolding (a great term I read on this","messageBody":"<div id=\"ygrps-yiv-791473036\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;\tI am new to the list and the more I try to understand unschooling the more confused I seem to become.  I think I do not have a clear picture of what it really is. &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>Unschooling is a way of life in which a close, honest and loving relationship between parent and child forms the scaffolding (a great term I read on this list) for a life of learning. Parents use their experience and resourcefulness to provide their kids with a life rich in possibilities and opportunities. In an unschooling context, notions of &#39;permissiveness&#39; and &#39;ego-centricity&#39; fall away; instead there is the idea of helping kids explore their interests, and actively nurturing a close and trusting relationship between parent and child.<br/>\n<br/>\nYou can hold strong convictions and still be an unschooler if you allow that those convictions may not suit other people. I have been a vegetarian for over 15 years, but I happily buy and cook organic meat for my kids because they like it. I also cook lots of meatless meals which they also enjoy. It doesn&#39;t have to be all or nothing. Just attending church does not make your children Catholic. Missing church will not instantly destroy any beliefs they may hold. Lived principles are much more convincing than sermons. Your children are more likely to share your principles if those principles support a loving and respectful relationship between you.<br/>\n<br/>\nAs for sexual matters, my kids are 6 & 4, and their knowledge of sex has mainly come through watching nature documentaries. So they started by seeing animals mating, and seeing that this led to babies being born, and gradually there has come the realisation that this applies to the human animal too! I have kept any conversations about sex at a very basic, matter-of-fact level, allowing them to ask for information as they need it. I have no fear around the topic, I don&#39;t want to ever give the impression that sex and bodies are somehow shameful, but there&#39;s no need to go into too much detail at this point.<br/>\n<br/>\nUnschooling can be hard work, but the rewards are huge.<br/>\n<br/>\nClaire<br/>\nMelbourne, Australia</div>","specialLinks":[]},{"userId":464512853,"authorName":"Amy Modlin","from":"Amy Modlin &lt;amymodlin@...&gt;","profile":"amymodlin@ymail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] So Confused!!!","postDate":"1323494510","msgId":64247,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMjM0OTQ1MTAuMjAxMzcuWWFob29NYWlsTmVvQHdlYjExMzcxMS5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PERDMTEwREM5LUY3QUMtNDcwNy04NTNDLUIwRjQ5N0FBNDBDOUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGpidWxjMitwbnFzQGVHcm91cHMuY29tPiA8REMxMTBEQzktRjdBQy00NzA3LTg1M0MtQjBGNDk3QUE0MEM5QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":64243,"nextInTopic":64256,"prevInTime":64246,"nextInTime":64248,"topicId":64241,"numMessagesInTopic":0,"msgSnippet":"- = - Whose ego?  Parent or child? :-) - = -   I thought the parents seemed to be feeding the child s ego to excess.  My oppinion has changed on that","messageBody":"<div id=\"ygrps-yiv-269681513\">- = - Whose ego?  Parent or child? :-) - = -<br/>\n <br/>\nI thought the parents seemed to be feeding the child&#39;s ego to excess.  My oppinion has changed on that point.  Not 100%, but I do believe I have come a long way.   I have definitely started to see my son and daughter as people not JUST children.  Their needs and wants are no less significant just because their children.   <br/>\n<br/>\nFrom: Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\nSent: Friday, December 9, 2011 10:35 PM<br/>\nSubject: Re: [AlwaysLearning] So Confused!!!<br/>\n<br/>\n<br/>\n  <br/>\n-=-I think I do not have a clear picture of what it really is. In the beginning, I thought it seemed permissive and ego centric.-=-<br/>\n<br/>\nWhose ego? Parent or child? :-)<br/>\n<br/>\nThese might help you form a fuller picture of the range of things we&#39;re discussing.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschool/definition.html\">http://sandradodd.com/unschool/definition.html</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/typical\">http://sandradodd.com/typical</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/seeingit\">http://sandradodd.com/seeingit</a><br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] So Confused!!!","postDate":"1323492001","msgId":64243,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVDNzBBNjA1LTIwRDAtNEY3NC1BMEQyLUQyODI4NkIyQzcwQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpidWxjMitwbnFzQGVHcm91cHMuY29tPg==","referencesHeader":"PGpidWxjMitwbnFzQGVHcm91cHMuY29tPg=="},"prevInTopic":64242,"nextInTopic":64247,"prevInTime":64242,"nextInTime":64244,"topicId":64241,"numMessagesInTopic":0,"msgSnippet":"-=-I believe in trying to preserve my children s innocense. This makes me wonder if I can truly unschool. Since being on this group, I have seriously started","messageBody":"<div id=\"ygrps-yiv-1512259401\">-=-I believe in trying to preserve my children&#39;s innocense. This makes me wonder if I can truly unschool. Since being on this group, I have seriously started to reevaluate some of my ideas on child rearing.-=-<br/>\n<br/>\nMy oldest was much more innocent than his two younger siblings.  It&#39;s easy with an only child.  He didn&#39;t mind at all not knowing more, and by the time there was  a third child and the older kids had discovered a rougher, larger world, she didn&#39;t know otherwise, and all in all the results weren&#39;t different.  They all were (still are) interested in a great range of things.  Holly watched cartoons this week.  My oldest sent me a link to a Sesame Street song done in a different style on facebook today.  <br/>\n<br/>\n-=- I feel like most unschooled children probably know a lot more about &quot;life&quot; than she does.-=-<br/>\n<br/>\nThere can be too much knowledge and too little, and maybe the best thing is not to decide in advance exactly what it will be, since you can influence but not control.<br/>\n<br/>\n-=-So I wonder if this unschooling lifestyle is not suited for me and I should just be eclectic. -=-<br/>\n<br/>\nEven if you decide unschooling is too far from your comfort level, there might be ideas you can use.  Nobody has to sign up; there&#39;s not a test; no inspectors will call.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] So Confused!!!","postDate":"1323491731","msgId":64242,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERDMTEwREM5LUY3QUMtNDcwNy04NTNDLUIwRjQ5N0FBNDBDOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpidWxjMitwbnFzQGVHcm91cHMuY29tPg==","referencesHeader":"PGpidWxjMitwbnFzQGVHcm91cHMuY29tPg=="},"prevInTopic":64241,"nextInTopic":64243,"prevInTime":64241,"nextInTime":64243,"topicId":64241,"numMessagesInTopic":0,"msgSnippet":"-=-I think I do not have a clear picture of what it really is. In the beginning, I thought it seemed permissive and ego centric.-=- Whose ego?  Parent or","messageBody":"<div id=\"ygrps-yiv-487595973\">-=-I think I do not have a clear picture of what it really is. In the beginning, I thought it seemed permissive and ego centric.-=-<br/>\n<br/>\nWhose ego?  Parent or child? :-)<br/>\n<br/>\nThese might help you form a fuller picture of the range of things we&#39;re discussing.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschool/definition.html\">http://sandradodd.com/unschool/definition.html</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/typical\">http://sandradodd.com/typical</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/seeingit\">http://sandradodd.com/seeingit</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":464512853,"authorName":"Amy","from":"&quot;Amy&quot; &lt;amymodlin@...&gt;","profile":"amymodlin@ymail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"So Confused!!!","postDate":"1323489474","msgId":64241,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpidWxjMitwbnFzQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":64242,"prevInTime":64240,"nextInTime":64242,"topicId":64241,"numMessagesInTopic":0,"msgSnippet":"I am new to the list and the more I try to understand unschooling the more confused I seem to become.  I think I do not have a clear picture of what it really","messageBody":"<div id=\"ygrps-yiv-99460119\">I am new to the list and the more I try to understand unschooling the more confused I seem to become.  I think I do not have a clear picture of what it really is.  In the beginning, I thought it seemed permissive and ego centric.<br/>\n<br/>\nI only know of one family in my community that &quot;unschools.&quot;  By her own admission she says that most unschoolers would not even consider her to be an unschooler.  She does not use a curriculum, but considers her style to be more of a montessori method.  So this is what I thought unschooling meant- no curriculum...  And then I stumbled on to AlwaysLearning.  <br/>\n<br/>\nI am a Catholic.  I am coservative.  And I believe in trying to preserve my children&#39;s innocense.  This makes me wonder if I can truly unschool.  Since being on this group, I have seriously started to reevaluate some of my ideas on child rearing.  However, there are things that I just do not see myself giving up my control over.  Some examples are: 1. Going to church  2. Listening to music or watching programs with sexual content.<br/>\n<br/>\nMy daughter is 10 and loves being a child.  She is in no rush to grow up.  She loves playing with her dolls and barbies still.  She has asked for an american girl doll for Christmas.  I have the impression and I might be wrong, but I feel like most unschooled children probably know a lot more about &quot;life&quot; than she does.<br/>\n<br/>\nSo I wonder if this unschooling lifestyle is not suited for me and I should just be eclectic. <br/>\n<br/>\nI hope that I have posted correctly.  I read all of the info on posting to the list.  My thoughts are heartfelt and do not intend to spark debates.</div>","specialLinks":[]}],"prevTopicId":64060,"nextTopicId":64253}}