{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"A. Yates","from":"&quot;A. Yates&quot; &lt;hooperck@...&gt;","replyTo":"LIST","senderId":"QhEyEvVoJbf_at-QFkvRj1d7LuBQflJckghDglQAwZT1-YvTPB_z-DygJvTx1FrAEWZykZcyaZ9VhjAzMY6zQUMgZ36qcSg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: KnoK NEWS for 5 Feb. 2000","postDate":"949776498","msgId":6210,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy40MDQuNjIxMC45NTkyNjk3NDZAZUdyb3Vwcy5jb20+"},"prevInTopic":6205,"nextInTopic":0,"prevInTime":6209,"nextInTime":6211,"topicId":6205,"numMessagesInTopic":0,"msgSnippet":"Covert Family, Our homeschool group in NC, USA, is looking for some pen pals.  Are you interested?  If you are, I ll send more details. Thanks, Ann","messageBody":"<div id=\"ygrps-yiv-1875557127\">Covert Family,<br/>\nOur homeschool group in NC, USA, is looking for some pen pals.  Are you<br/>\ninterested?  If you are, I&#39;ll send more details.<br/>\nThanks,<br/>\nAnn</div>","specialLinks":[]},{"userId":0,"authorName":"Covert","from":"Covert &lt;covert@...-net.ne.jp&gt;","replyTo":"LIST","senderId":"qR3qtr-B-V1zpvNFNXTIk1cmxPSUsUcEPQpzbzeh2vqpuZKH6WJKDQkrUzxyE9Mv11nbLE9eVKwHunyIk6-vHvYjZP6LCIY","spamInfo":{"isSpam":false,"reason":"0"},"subject":"KnoK NEWS for 5 Feb. 2000","postDate":"949743713","msgId":6205,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy40MDMuNjIwNS45NTkyNjk3NDZAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":6210,"prevInTime":6204,"nextInTime":6206,"topicId":6205,"numMessagesInTopic":0,"msgSnippet":"****  KnoK NEWS  **** -- Views from the world of learning in Japan -- Happy Chinese New Year! And welcome to the 5 Feb. 2000 edition of KnoK (pronounced","messageBody":"<div id=\"ygrps-yiv-1697606224\">****  KnoK NEWS  ****<br/>\n     -- Views from the world of learning in Japan --<br/>\n<br/>\n<br/>\nHappy Chinese New Year!<br/>\n<br/>\nAnd welcome to the 5 Feb. 2000 edition of KnoK (pronounced &quot;knock&quot;) NEWS, <br/>\nan informal and periodic bulletin concerning issues of learning in Japan <br/>\n-- at home or otherwise. It is brought to you by the Covert family -- <br/>\nKazumi, Kenya and Brian -- a multicultural, homelearning family in Osaka, <br/>\nJapan.<br/>\n<br/>\nKnoK stands for *KODOMO no KOKORO*, which means &quot;Heart of a Child&quot; in <br/>\nJapanese. It is our belief that the heart of any child is indeed at the <br/>\ncenter of true learning, wherever and however such learning may take <br/>\nplace. <br/>\n<br/>\n<br/>\n           /////////////////////////  *  /////////////////////////<br/>\n<br/>\n<br/>\n5 February 2000<br/>\n<br/>\n[Editor&#39;s Note:  Hi everybody. We continue this edition of KnoK NEWS with <br/>\na deeper look at the latest buzzwords in Japan: *gakkyu hokai* -- <br/>\nclassroom breakdown -- and its larger cousin, *gakko hokai*, or school <br/>\nbreakdown. The following (rather lengthy!) article, penned by a veteran <br/>\nschoolteacher in Japan, provides many points for debate, as well as some <br/>\ninsights into just how mainstream Japanese educators view the problems <br/>\nand the solutions.<br/>\n<br/>\nHomelearners reading the following article about Japan will recognize <br/>\nsome familiar scenarios from their own countries right off, most notably <br/>\nthe role of educator as Official Pointer of Blame at every party <br/>\nimaginable: the students, their parents, the government, the media, <br/>\nresearchers, society, foreigners -- at every party, that is, except that <br/>\ninstitution known as school. In a hierarchical society like Japan where <br/>\nthe *appearance* of order often takes priority over actual learning, <br/>\nJapanese teachers find themselves longing more than ever for the &quot;good <br/>\nol&#39; days&quot; when their pupils just shut up and obeyed authority. But those <br/>\ndays are gone forever. More and more Japanese families are questioning <br/>\nconventional schooling and seeking alternatives on their own. Although <br/>\nhomelearning families in Japan do remain far fewer in number compared <br/>\nwith their counterparts in other nations, this situation is slowly but <br/>\nsteadily changing. A seed of educational revolution is taking root in <br/>\nJapan and, just as with other countries, a major factor in that <br/>\ninevitable change has undoubtedly been classroom/school breakdown. --BC]<br/>\n<br/>\n----------------<br/>\n<br/>\nCLASSROOM BREAKDOWN AND SCHOLASTIC DECLINE IN JAPAN<br/>\n<br/>\n[By] Yamagishi Shunsuke<br/>\n<br/>\n<br/>\nEducation in any country has its bright sides and its dark. The bright <br/>\nside of Japanese education was once the excellence of its primary and <br/>\nsecondary schools. A 1976 OECD report on Japan prepared by a team of <br/>\nexaminers including former prime minister of France Edgar Faure and <br/>\nBritain&#39;s Ronald P. Dore, then professor at Sussex University, stated, <br/>\n&quot;the Examiners&#39; strong feeling has been that compared to their own <br/>\ncountries, Japanese achievements in these levels of education are very <br/>\nsubstantial.&quot; For nearly a quarter of a century thereafter, Japan&#39;s <br/>\nMinistry of Education, local boards of education, as well as elementary, <br/>\njunior high, and senior high schools hosted numerous inspection groups <br/>\nand study teams, not only from countries in the developing world but from <br/>\nthe industrialized countries as well.<br/>\n<br/>\nTen years after the OECD report was published, Edwin O. Reischauer, then <br/>\nHarvard University professor and formerly U.S. ambassador to Japan, wrote <br/>\nin the introduction to Benjamin Duke&#39;s *The Japanese School: Lessons for <br/>\nIndustrial America*, &quot;In the past four decades, Japan has moved in U.S. <br/>\nminds from being an economic basket case to becoming an economic <br/>\nmiracle.&quot; That impression of Japan continued to be current for a long <br/>\ntime, until very recently. Reischauer observed the significant role the <br/>\nschool education system had played in Japan&#39;s economic success, noting <br/>\nthat &quot;the quality and morale of persons becoming educators in <br/>\nJapan[,]...far more important than school facilities&quot; and the &quot;high <br/>\nregard the Japanese show their teachers and the respect for teaching as a <br/>\nhigh calling...[and the] strong supportive attitude for education on the <br/>\npart of Japanese families,&quot; were the crucial factors responsible for what <br/>\nJapanese education had achieved.<br/>\n<br/>\nThoroughly conversant with Japanese society and culture, Reischauer was <br/>\nwell aware of the dark side of Japanese education. He did not overlook <br/>\nthe notorious entrance-examination system that &quot;rewards rote memory <br/>\nrather than reasoning,&quot; the &quot;poor teaching and very little study&quot; at the <br/>\nuniversity level, and the English-language education practices that <br/>\nproduce remarkably few fluent speakers and writers of English capable of <br/>\ntaking an active role in international intellectual society. But he <br/>\nappeared to believe that the achievements were of such a scale that they <br/>\ncould, in large part, compensate for such weaknesses.<br/>\n<br/>\nReischauer was not the only one to comment on the role of education in <br/>\neconomic growth; many scholars of Japanese society from the United States <br/>\nand Europe have acclaimed it. While Japanese themselves were not <br/>\nparticularly confident of their own educational system, they ultimately <br/>\nbegan to believe these high estimations voiced by outside observers.<br/>\n<br/>\nThe economic crisis that struck Japan in the 1990s, however, shook <br/>\nJapanese society, bringing profound changes to people&#39;s lifestyles and <br/>\nattitudes. These changes are still going on, and education is very much <br/>\npart of it. People&#39;s confidence in the educational system that helped <br/>\nmake Japan a world economic power and that sustained its growth has been <br/>\nseriously undermined. What has really caught them off guard, however, is <br/>\nthe unexpected emergence of the problems of classroom breakdown and <br/>\ndeclining scholastic achievement, phenomena of the schools that seem all <br/>\nthe more sinister because their causes are unknown.<br/>\n<br/>\nThe breakdown and collapse of classroom order (*gakkyu hokai*) has been <br/>\nparticularly startling. The teacher&#39;s attempts to call the class to order <br/>\nare to no avail: students continue to chatter and play among themselves, <br/>\nneither opening their textbooks nor taking out their notebooks. When <br/>\nchided or reprimanded, students talk back or speak insultingly to the <br/>\nteacher, sometimes even walking out of class. There have been cases when <br/>\nthe entire class suddenly left the room.<br/>\n<br/>\nTeaching, under such conditions, is obviously impossible. Similar <br/>\nsituations occurred during a period about twenty years ago when violence <br/>\nand trouble in the schools became pronounced. Such cases, however, were <br/>\ngenerally confined to certain high schools and junior high schools where <br/>\ntrouble-making students disrupted discipline and classroom order. This is <br/>\nthe first time, moreover, that the specter of classroom breakdown has <br/>\nvisited elementary schools, even first and other lower grades.<br/>\n<br/>\nAn NHK television program aired in early 1999 showed a lower-grade <br/>\nelementary school class in which some students, completely ignoring <br/>\ninstructions, were wandering around the classroom at will. The veteran <br/>\nteacher in charge was completely at a loss to deal with the situation. <br/>\nThe program helped to impress the general public with the seriousness of <br/>\nthe classroom-breakdown phenomenon.<br/>\n<br/>\nThere were many until very recently who did not believe that such loss of <br/>\nclassroom control was possible in Japanese schools; they included <br/>\nspecialists in education and many dedicated teachers. One professor of <br/>\nthe department of education of a national university at first wrote that <br/>\nhe did not think the term classroom collapse was appropriate to the field <br/>\nof education, reminiscent as it is of the &quot;collapse of the bubble <br/>\n(*baburu hokai*),&quot; referring to the deep recession that set in when the <br/>\noverheated economy suddenly deflated. After he began visiting elementary <br/>\nschools to study the actual situation, however, he confessed that he <br/>\nceased to have any reservations whatsoever about using the term.<br/>\n<br/>\nThere was no longer any doubt in his mind, the professor reported, of the <br/>\nseverity and the reality of classroom breakdown, after watching one boy <br/>\nin music class suddenly stop playing his recorder. When asked to continue <br/>\nby [the] teacher, he got up and ran out of the classroom, with most of <br/>\nthe others in the class following along [with] him. In another case, he <br/>\nobserved a child of about ten, returning to school after classes had <br/>\nended to get something forgotten, turn on a veteran teacher with insults <br/>\nand shouts of hatred, throw chalk, and overturn a goldfish tank in rage.<br/>\n<br/>\nIn any era, at any time, [there] are always a few children who cause <br/>\ntrouble and pose special discipline problems. We need to know how <br/>\nwidespread the classroom breakdown syndrome has become in Japan, but so <br/>\nfar the problem has not been adequately measured. The Ministry of <br/>\nEducation, citing the difficulty of conducting a nationwide survey, has <br/>\nso far done nothing. When specialists in education do studies on a <br/>\nlimited scale, they invariably uncover cases such as those described <br/>\nabove. Some believe that in the Tokyo Metropolitan area, one class out of <br/>\nevery twelve is out of control, but that estimate is by no means certain.<br/>\n<br/>\nOne important source of information on this sinister problem that seems <br/>\nto be spreading through the schools like a plague is *Gakkyu hokai* <br/>\n[Classroom Breakdown] (Asahi Shimbunsha, 1999), a compilation of articles <br/>\nreporting on specific cases in the national daily *Asahi Shimbun* <br/>\n[newspaper]. Through this book, one sees how the newspaper initially <br/>\nreported on the phenomenon.<br/>\n<br/>\nThe causes of classroom breakdown are not yet clearly identified, but a <br/>\nbook entitled *Gakko hokai* [School Breakdown] by Kawakami Ryoichi <br/>\n(Soshisha) (see this issue, p. 14) explains changes in the living <br/>\nenvironment that have contributed to the transformation in children, from <br/>\nthe viewpoint of a junior high school teacher. With thirty-three years of <br/>\nteaching experience behind him, the author notes that more children in <br/>\nrecent years find it difficult to sit properly in their chairs or stand <br/>\nat attention during school assemblies. Many are generally frail of build <br/>\nand seem unable to move their bodies easily and smoothly, and, while <br/>\nstubborn and self-centered, they tend to be afraid of others. They cannot <br/>\neasily put up with difficulty or pressure and their feelings are easily <br/>\nhurt, but they lack common consideration for others. Giving a number of <br/>\nexamples, he shows the pronounced differences between today&#39;s junior high <br/>\nschool students and those of twenty years ago.<br/>\n<br/>\nParents have changed a great deal as well. Kawakami points out that <br/>\nchildren betray little remorse even if caught shoplifting, and their <br/>\nparents are less likely to require children to show a sense of <br/>\nresponsibility for their own actions. The eye of the community and adult <br/>\nsociety as a restraining factor on children&#39;s behavior, meanwhile, has <br/>\nnoticeably weakened.<br/>\n<br/>\nThe issue of classroom breakdown is still at the stage when it is known <br/>\nmostly from often-sensationalized mass-media reporting. It has yet to be <br/>\ndealt with in systematic surveys or research, analyzing the conjunction <br/>\nof classroom phenomena with changes in juvenile behavior, examined <br/>\nagainst the backdrop of overall changes of society.<br/>\n<br/>\nClassroom breakdown is a serious concern not just for educators but for <br/>\nthe business leaders who exercise influence in Japanese society. It was <br/>\nreported that in seminars targeted at businesspeople ordinarily <br/>\ninterested in little beyond matters of the economy, lectures on classroom <br/>\ncollapse draw a noticeably larger crowd than usual. Their anxiety about <br/>\nwhat is happening to their young grandchildren, rather than their <br/>\ngrown-up children, is notable.<br/>\n<br/>\nEven more difficult for the general public to grasp than the phenomenon <br/>\nof classroom breakdown is that of the decline in scholastic achievement. <br/>\nPublic concern about the trend appears to be limited, although those <br/>\ninvolved in education are seriously worried.<br/>\n<br/>\nFollowing the defeat [of Japan] in World War II, the Japanese educational <br/>\nsystem underwent drastic reform. Not long after the curriculum was <br/>\nrevised and teaching methods following American models were introduced to <br/>\nthe schools, the decline in scholastic achievement became evident, <br/>\nstirring considerable controversy; the recent debate is apparently the <br/>\nfirst time since then that the issue has resurfaced.<br/>\n<br/>\nIt is understandable that educators, whose boast that their education <br/>\nsystem was among the most efficient and effective in the world is now <br/>\nbeing doused by charges of a &quot;distressing decline in scholastic <br/>\nachievement,&quot; are feeling a bit shell-shocked. The cruel verdict has been <br/>\npassed down by university teachers. The jacket blurb for *Bunsu ga <br/>\ndekinai daigakusei* [University Students Can&#39;t Do Fractions] (Toyo Keizai <br/>\nShimposha, 1999) says: &quot;You may find it difficult to believe, but two out <br/>\nof every ten university students cannot do primary school-level <br/>\narithmetic.&quot;<br/>\n<br/>\nThese figures are the result of tests given by Nishimura Kazuo (one of <br/>\nthe editors of the book and professor of the Institute of Economic <br/>\nResearch, Kyoto University) and others to students in economic classes, <br/>\nfeaturing mainly arithmetic and mathematics problems at the elementary <br/>\nand junior-high school level -- problems like 7/8 minus 4/5 = ? and 2 <br/>\ndivided by 0.25 = ?<br/>\n<br/>\nThe book says that more than 20 percent of the students in the faculty of <br/>\neconomics of one of Japan&#39;s leading private universities could not do <br/>\nthis kind of problem. Such students, it turns out, are not tested in <br/>\nmathematics in the highly competitive entrance examinations; since they <br/>\nhave not seriously studied math for years, believes Nishimura, they <br/>\nsimply forgot what they learned in primary school.<br/>\n<br/>\nMost students in the national universities, for whom mathematics is a <br/>\nrequired subject for the entrance examinations, are strong in the <br/>\nsubject. Judging from the test results for private university economics <br/>\nfaculties in which basic mathematical ability is needed just to <br/>\nunderstand the lectures, private university students in general appear to <br/>\nbe deplorably poor at math.<br/>\n<br/>\nPointing to the pronounced decline in the basic arithmetic and math <br/>\nskills of university students, especially those in the humanities at <br/>\nprivate universities, Nishimura calls for greater public attention to <br/>\nthis trend, declaring that it stems directly from the decision by the <br/>\nhumanities faculties of private universities to drop math and <br/>\nscience-related subjects from their entrance examinations.<br/>\n<br/>\nNishimura blames the universities&#39; way of administering entrance <br/>\nexaminations for the problem, arguing that they deliberately invite <br/>\nstudents who cannot do math by allowing them to choose between math, <br/>\ngeography, history, and social studies for their elective examination <br/>\nsubject (English and Japanese only being required). In every other major <br/>\ncountry, math is a subject required for college entrance: the Scholastic <br/>\nAptitude Test (SAT) in the United States measures students&#39; scholastic <br/>\nability on the basis of English and math skills; China, Korea and all <br/>\nother leading countries of both East and West designate math as a <br/>\nrequired subject for university entrance exmination.<br/>\n<br/>\nThe problem with this scholastic achievement decline is not just a matter <br/>\nof being poor at math. Students in recent years do not ask questions and <br/>\nseem to have little appetite for learning; they will master the learning <br/>\ntasks they are assigned but show little interest in pursuing knowledge on <br/>\ntheir own. University faculty do not hide their indignation at the <br/>\nincreasingly frequent number of students who enter engineering or science <br/>\ndepartments by choice, but have taken only one subject (either physics or <br/>\nchemistry) in high school and must receive remedial classes in <br/>\nhigh-school level subjects as soon as they get into university.<br/>\n<br/>\nFrom April 2002, Japanese schools will go completely onto the five-day <br/>\nweek and will put into effect a considerably revised set of Ministry of <br/>\nEducation guidelines for the curriculum. Since the number of hours of <br/>\nclassroom time will decrease, the content of the curriculum must be cut <br/>\nback. The ministry says its 30 percent trimming of the curriculum has <br/>\nbeen done with meticulous care, but critics declare that such an <br/>\neducational policy will only accelerate the decline in scholastic <br/>\nachievement.<br/>\n<br/>\nAt a time when administrations in many nations of the West have made <br/>\nenhancement of the quality of primary and secondary education a priority <br/>\ntask and are adopting educational reforms aimed at raising standards of <br/>\nscholastic achievement, critics charge that only Japan, ostensibly to <br/>\nease the pressure of competitive education on children, is moving in the <br/>\nopposite direction with its cutbacks on curriculum that could aggravate <br/>\nthe decline in scholastic standards.<br/>\n<br/>\nThe issue of declining scholastic achievement is difficult to verify <br/>\nscientifically or statistically, so it has been difficult to carry on a <br/>\nbalanced discussion of the problems. The qualities that were once so <br/>\nhighly praised and looked up to in Japan&#39;s primary and secondary <br/>\neducation are no longer even mentioned. One wonders whether the high <br/>\nestimation Japan&#39;s education system once enjoyed was nothing more than a <br/>\nfleeting dream.<br/>\n<br/>\n*(Yamagishi Shunsuke is professor at Tama University and a specialist on <br/>\neducation.)*<br/>\n<br/>\n<br/>\n(copyright - The Japan Foundation 1999)<br/>\n<br/>\n[Source: &quot;Japanese Book News,&quot; Number 28, Winter 1999, pp. 1-3. Published <br/>\nquarterly by The Japan Foundation; Tokyo, Japan]<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; NEXT TIME:  Q & A on Homeschooling in Japan &lt;<br/>\n<br/>\n </span></blockquote>                     * * * *<br/>\n<br/>\n       WISH I&#39;D SAID THAT (Quote of the Day):<br/>\n<br/>\n&quot;My first art teacher was neither a professional nor a professional <br/>\nartist. Instead he was a bricklayer and a stone mason.&quot;   <br/>\n    --Eugene Grigsby Jr., in *Black Art: Ancestral Legacy,* 1989</div>","specialLinks":[]}],"prevTopicId":6207,"nextTopicId":6211}}