{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":67247159,"authorName":"Nanci Kuykendall","from":"Nanci Kuykendall &lt;aisliin@...&gt;","profile":"aisliin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[AlwaysLearning] Getting Kids to Stay In OR Go Out","postDate":"1067019329","msgId":16983,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMDI0MTgxNTI5LjkyMTk4LnFtYWlsQHdlYjEzNzA4Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDEwNjY5ODM1MjMuNDIxLjQ4NzY1Lm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":16968,"nextInTopic":0,"prevInTime":16982,"nextInTime":16984,"topicId":16957,"numMessagesInTopic":0,"msgSnippet":"... Well, I always say, don t waste energy being jealous, change your reality if you don t like where you are. ... My husband has been out of work for 7","messageBody":"<div id=\"ygrps-yiv-182504501\"><blockquote><span title=\"ireply\">&gt;Oh Nanci K.<br/>\n<br/>\n&gt;I&#39;m so jealous of you.  I would love to move farther<br/>\n&gt;out.<br/>\n<br/>\n </span></blockquote>Well, I always say, don&#39;t waste energy being jealous,<br/>\nchange your reality if you don&#39;t like where you are.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;It sounds like you have a lot of work to do.  Is it<br/>\n&gt;possible the kids feel like they are getting the<br/>\n&gt;short end of the stick on attention? <br/>\n<br/>\n </span></blockquote>My husband has been out of work for 7 months, so right<br/>\nnow our schedule looks like this.  Every morning hubby<br/>\ngets up with older son and plays computer games with<br/>\nhim for a couple of hours.  Then they cook breakfast<br/>\nfor everyone together.  Our younger son and I are<br/>\nlater night/later sleepers, he climbs in bed with me<br/>\nwhen the other two get up and we talk and cuddle<br/>\nsleepily and read or tell stories to each other till<br/>\nbreakfast.  Then we take care of the dishes together. <br/>\nHe likes to rinse.<br/>\n<br/>\nUsually after that the boys go off to get dressed and<br/>\nplay something together.  Hubby and I take care of<br/>\nchores, talk, read together, or we all go to town if<br/>\nwe need to or there is something happening that we<br/>\nwant to go do/see, or we go to the beach, or take a<br/>\nwalk in the woods.  If we have things to do outside we<br/>\ndo them then.  The kids like to help stack split wood<br/>\nas hubby cuts it, or help out in the garden, but<br/>\ngenerally they run around and play together while we<br/>\nare working.  Various times in the day we pause to<br/>\nread stories or play games with the kids as they<br/>\nrequest.<br/>\n<br/>\nIn the afternoon hubby shuts himself in our room with<br/>\nour computer and does internet and telephone job<br/>\nsearching stuff.  After dinner we might play a board<br/>\ngame together, watch a movie together, or hubby and I<br/>\ndo something while the kids play on the computer or<br/>\nelsewhere.  After that, when he says he&#39;s tired and<br/>\nready for bed, I climb in bed with our older son and<br/>\nread him some chapters of whatever chapter books we<br/>\nare reading now for an hour or so.  Then I trade<br/>\nplaces with his dad, whom he likes to go to sleep<br/>\nwith, and I go hang out with our younger son, who<br/>\nstays up late.  We either do something together, or we<br/>\ndo our own things there with each other, keeping<br/>\ncompany and chatting.  When he&#39;s ready to go to sleep,<br/>\nI tuck him in and hit the hay myself.<br/>\n<br/>\nThat doesn&#39;t strike me as the schedule of a couple of<br/>\nattention starved little boys.  My kids are 5 and 6,<br/>\nfor someone who asked that.<br/>\n<br/>\nAnyway, I CAN do chores around them and I often have<br/>\nto.  Mainly they need to go play outside because they<br/>\nNEED to go play outside.  Particularly it becomes an<br/>\nissue when they are doing outdoor things in the house<br/>\nand clearly need to go do them outside (making mud<br/>\npies in the bathroom sink, running, screaming, playing<br/>\nball, etc.  They are VERY active.  They also sometimes<br/>\nstay in even when we are outside doing chores, and I<br/>\noften find them up to something they should not be<br/>\nwhen I come in the house to check on them (ie:<br/>\nwrestling on our bed, throwing all the bedding on the<br/>\nfloor; OR climbing on furniture to get things of ours<br/>\nthat we have put up because they abuse them; OR making<br/>\na huge mess in the kitchen playing with food they do<br/>\nnot intend to eat; OR teasing a cat; OR etc, you get<br/>\nthe picture.<br/>\n<br/>\nThey&#39;re great kids, just very active and need to go<br/>\nout and play hard some evey day if possible.  What<br/>\nabout days when they want to just do quiet things, you<br/>\nmay ask?  When those days ever occur in my lifetime, I<br/>\nwill say a prayer of thanks.  Times when they are<br/>\ndoing something relatively quiet, briefly, I don&#39;t<br/>\ncare if they are painting in the middle of the kitchen<br/>\nfloor while I cook dinner and have to step over them<br/>\n(like last night) because it&#39;s such a relief not to<br/>\nhave the screaming and the running in the house.<br/>\n<br/>\nNanci K.</div>","specialLinks":[]},{"userId":109856460,"authorName":"nellebelle","from":"&quot;nellebelle&quot; &lt;nellebelle@...&gt;","profile":"lamaribelle","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Getting Kids to Stay In OR Go Out","postDate":"1066922968","msgId":16968,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwN2QwMWMzOTk3YiQ0OWZmNDg4MCQ2NDAxYThjMEBvZW1jb21wdXRlcj4=","referencesHeader":"PDIwMDMxMDIzMDYyMzU1LjU0NDA4LnFtYWlsQHdlYjEzNzA3Lm1haWwueWFob28uY29tPg=="},"prevInTopic":16959,"nextInTopic":16983,"prevInTime":16967,"nextInTime":16969,"topicId":16957,"numMessagesInTopic":0,"msgSnippet":"Sometimes my kids will ice skate on the kitchen floor with a couple of wet rags for skates.  It doesn t get the floor as clean as I d like, but it s always","messageBody":"<div id=\"ygrps-yiv-1176327410\">Sometimes my kids will &quot;ice skate&quot; on the kitchen floor with a couple of wet rags for skates.  It doesn&#39;t get the floor as clean as I&#39;d like, but it&#39;s always better than it was.<br/>\n<br/>\nMary Ellen <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":144628419,"authorName":"Kelli Traaseth","from":"&quot;Kelli Traaseth&quot; &lt;tktraas@...&gt;","profile":"kellitraas","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Getting Kids to Stay In OR Go Out","postDate":"1066915999","msgId":16959,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGMwMWMzOTk2YSQzOTM3ODliMCRhMjMzMTlhY0B5b3VyZ2c4N3Zxem96cT4=","referencesHeader":"PDIwMDMxMDIzMDYyMzU1LjU0NDA4LnFtYWlsQHdlYjEzNzA3Lm1haWwueWFob28uY29tPg=="},"prevInTopic":16957,"nextInTopic":16968,"prevInTime":16958,"nextInTime":16960,"topicId":16957,"numMessagesInTopic":0,"msgSnippet":"... From: Nanci Kuykendall  **I have not been able to get them outside to play for ... My kids are the same way.  They want to be where I","messageBody":"<div id=\"ygrps-yiv-1513213237\"><blockquote><span title=\"qreply\">----- Original Message ----- <br/>\nFrom: &quot;Nanci Kuykendall&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:aisliin@...\">aisliin@...</a>&gt;<br/>\n<br/>\n**I have not been able to get them outside to play for<br/>\n&gt; more than 20 minutes at a time, MAYBE twice a day, if<br/>\n&gt; I&#39;m lucky, for the last two months.  They want to be<br/>\n&gt; where we are all the time, every minute.  This is<br/>\n&gt; nothing new, they have always wanted to be where we<br/>\n&gt; are all the time.  **<br/>\n<br/>\nMy kids are the same way.  They want to be where I am.   I know this may not<br/>\nbe what you want to hear, but can you look at it from the point of view that<br/>\nthey like being with you.<br/>\n<br/>\nI&#39;ve learned to see the good in the fact that they are here with me.  I see<br/>\nnow how lucky I am to have them here.   I didn&#39;t always feel this way,  I<br/>\nhad to learn it from some other wise Moms.<br/>\n<br/>\n I might not be able to clean right when I want or get things done right<br/>\nwhen I want,  but I&#39;m glad they&#39;re here.   I try and accomplish these things<br/>\naround them.   A clean house isn&#39;t a big priority right now.   I know there<br/>\nwill be a time in my life, when they are grown,  my house will possibly be<br/>\nin order and clean (maybe),,,,and very quiet, :(   and then I will miss<br/>\nthem.<br/>\n<br/>\nHow old are your kids?   Are they quite young?  My two oldest 10 and 9, are<br/>\nless inclined to wanting me with them now.  But, they also don&#39;t like to be<br/>\noutside much.   I used to sit and fret about it,  thinking,  &quot;oh the weather<br/>\nis so nice, they should be outside&quot;.  Well,  I wasn&#39;t out there,  I was<br/>\nsitting inside.  I was doing stuff inside and they want to also.<br/>\n<br/>\nIf I really want to enjoy the outside I go out and ask them if they want to<br/>\ngo out with me.  Sometimes they do, sometimes they don&#39;t.  I&#39;m OK with that.<br/>\nIt all depends on what they are doing.<br/>\n<br/>\n<br/>\n**But lately it&#39;s been worse**<br/>\n<br/>\nHave you been more busy with house stuff?   More busy with stuff other than<br/>\nthem?   I know this is what happens at our house when there is alot going<br/>\non,  if people are coming to visit and I try and clean or something like<br/>\nthis.   Maybe they need a little mom time?<br/>\n<br/>\nBreathe......<br/>\nThis will pass and soon they&#39;ll be grown.<br/>\n<br/>\nKelli~ </span></blockquote></div>","specialLinks":[]},{"userId":67247159,"authorName":"Nanci Kuykendall","from":"Nanci Kuykendall &lt;aisliin@...&gt;","profile":"aisliin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[AlwaysLearning] Getting Kids to Stay In OR Go Out","postDate":"1066890235","msgId":16957,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMDIzMDYyMzU1LjU0NDA4LnFtYWlsQHdlYjEzNzA3Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDEwNjY4NzY2ODEuMTc4NS43NTQwNS5tOUB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":16959,"prevInTime":16956,"nextInTime":16958,"topicId":16957,"numMessagesInTopic":0,"msgSnippet":"I am following this conversation about keeping kids in when it s unsafe to go out alone with interest. However, we have the opposite problem, if anyone has any","messageBody":"<div id=\"ygrps-yiv-614743853\">I am following this conversation about keeping kids in<br/>\nwhen it&#39;s unsafe to go out alone with interest. <br/>\nHowever, we have the opposite problem, if anyone has<br/>\nany helpful suggestions.  <br/>\n<br/>\nWe live in a small home (under 1000 sq. feet) and we<br/>\nlive way out in the country.  It&#39;s almost a mile down<br/>\nour driveway to the mailbox.  Because of all the<br/>\nforests, hills and mountains, we cannot see any<br/>\nneighbors, except one house, with binoculars, vaguely,<br/>\nacross the lake, from between two certain trees, while<br/>\nstanding on a chair in the kitchen.  <br/>\n<br/>\nAnyhow, my point is, it&#39;s very safe for my children to<br/>\ngo exploring, go look for frogs in the ankle high<br/>\ncreek, climb trees and run around, even late at night,<br/>\non our acerage.  Being young, their comfort zone for<br/>\ndistance they go alone is about what I am comfortable<br/>\nwith for them as their mom.  In good weather, they may<br/>\ngo as far as the meadow down the hill from our house,<br/>\nmaybe 600 yards away.  Most times they stay closer to<br/>\nthe house.  I have a military whistle I blow on when I<br/>\ncan&#39;t hear or see them for more than a little bit at a<br/>\ntime and they let me know where they are when they<br/>\nhear it, so I won&#39;t worry.   <br/>\n<br/>\nNow here&#39;s MY problem.  I can&#39;t get them outside this<br/>\nfall!  In fall and winter it rains a fair amount here.<br/>\n When the weather is more mild, I like the kids to go<br/>\noutside to play for several reasons:  <br/>\n1) They go a bit stir crazy if they don&#39;t get to run<br/>\naround outside for a few days in a row if there is<br/>\nnasty weather.<br/>\n2) They are ACTIVE, rowdy boys, and WE go a bit crazy<br/>\nafter being cooped up with them for a few days. <br/>\nThey&#39;re wrestling, screaming, furniture jumping kinda<br/>\nrowdy.  There are not many sedentary activities which<br/>\ncan get them relatively quiet for more than 10 minutes<br/>\nat a time.<br/>\n3) I use fair weather time to sweep out and air the<br/>\nhouse, beat and air rugs, clean muddy floors, etc and<br/>\nso forth.  It&#39;s hard to do this in our small home when<br/>\nthey are underfoot.<br/>\n<br/>\nSo when it&#39;s mild out I ask the boys to go play<br/>\noutside, I try to make it sound really fun, I make<br/>\nsure they are dressed to stay a comfortable<br/>\ntemperature and not get cold in 10 minutes (although<br/>\nit&#39;s not THAT cold here.)  I suggest things they might<br/>\nplay or investigate.  I explain why I need them out of<br/>\nthe way to mop, or sweep, or change bed linens.  I<br/>\nmake them &quot;picnics&quot; to take outside in their tin<br/>\npails.  We emptied a wooden shed and converted it to a<br/>\nplayhouse for them.<br/>\n<br/>\nI have not been able to get them outside to play for<br/>\nmore than 20 minutes at a time, MAYBE twice a day, if<br/>\nI&#39;m lucky, for the last two months.  They want to be<br/>\nwhere we are all the time, every minute.  This is<br/>\nnothing new, they have always wanted to be where we<br/>\nare all the time.  But lately it&#39;s been worse.  The<br/>\nonly way to get them outside for any length of time is<br/>\nif we are doing chores outdoors.  If we have things to<br/>\ntake care of indoors, they are there, running around,<br/>\nbeing rowdy, making things difficult.  I can ask them<br/>\nto go play in their room (they have the biggest room<br/>\nin the house and we built them a loft and play space<br/>\nso they have even more room in it) but that only lasts<br/>\nso long, AND it prevents me from cleaning floors,<br/>\nbeds, etc in there, which usually needs it most.<br/>\n<br/>\nAsking them to help clean is like asking them to help<br/>\npull their own fingernails out by the roots, or at<br/>\nleast that&#39;s how they act.  Hey I had a<br/>\nthought...maybe I could say only people cleaning can<br/>\nbe in the house until we are done.  hmmmmm.  Well they<br/>\nwould not darken the door long if I did, but then that<br/>\nonly takes care of time when we have chores and still<br/>\nleaves the problem of time when THEY really need to<br/>\nget out and run around outside and WE are going stir<br/>\ncrazy and have things to do inside and would REALLY<br/>\nlove for them to play outside and run off some steam<br/>\nfor a while.<br/>\n<br/>\nAny Ideas?<br/>\n<br/>\nNanci K.</div>","specialLinks":[]}],"prevTopicId":16917,"nextTopicId":16985}}