{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":50009731,"authorName":"Heidi Wordhouse-Dykema","from":"Heidi Wordhouse-Dykema &lt;heidi@...&gt;","profile":"heidi_wd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Help again","postDate":"1048126625","msgId":13056,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMS4wLjE0LjAuMjAwMzAzMTkxODAzMzkuMDBiYmZkYzhAbWFpbC5keWtlbWEubmV0Pg==","inReplyToHeader":"PDY5OTc2MDEuMTA0ODExNzM3MDY4OC5KYXZhTWFpbC5ub2JvZHlAZGV3ZXkucHNwLnBhcy5lYXJ0aGwgaW5rLm5ldD4="},"prevInTopic":13049,"nextInTopic":0,"prevInTime":13055,"nextInTime":13057,"topicId":13049,"numMessagesInTopic":0,"msgSnippet":"... Sure, invite me over for cake! (grin) ... Well, here s something to consider, maybe.  When I was a kid, there were times that I really didn t want to be","messageBody":"<div id=\"ygrps-yiv-223814338\"><blockquote><span title=\"ireply\">&gt;And we have 2 cakes.<br/>\n &gt;Any suggestions again?<br/>\n<br/>\n </span></blockquote>Sure, invite me over for cake! (grin)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Right now Ashley has a friend over. She has been begging to have her <br/>\n&gt;brother out of her room. He melts down when she does this, so they are locked.<br/>\n<br/>\n </span></blockquote>Well, here&#39;s something to consider, maybe.  When I was a kid, there were <br/>\ntimes that I really didn&#39;t want to be bothered by someone else (anyone <br/>\nelse) or just wanted some quiet to spend with a particular chosen other <br/>\nbeing.  We had a &#39;rule&#39; at our house that a person&#39;s room is their own <br/>\nprivate space and they have the right and ability to decide what is allowed <br/>\nand not allowed to be in that space.  Toys, people, activities, etc.  All <br/>\nof us kids thought it was an excellent idea and it ended out working pretty <br/>\nwell in the end (cutting down on teasing and that annoying popping in and <br/>\nout of the door threshold business.)  Actually, after the &#39;ruling&#39;, it was <br/>\nalmost an honor to be invited into someone elses room, it being their <br/>\nking/queendom and all.  (and you had to be Invited to enter, you couldn&#39;t <br/>\njust barge in (unless you were mom with the laundry!))  Maybe when they&#39;re <br/>\nnot locked over the whole &#39;out of my room&#39; thing, it could be discussed and <br/>\nthen have a fun session of &#39;In/Out Of My Room!&#39;, starting with the mom or <br/>\nthe brother banishing and inviting toys, clothing and maybe even parents <br/>\nfrom their respective rooms.<br/>\n<br/>\nI realize (I think) that it&#39;s not really just about being in her room, but <br/>\nmore that it&#39;s about their relationship together and how they work out what <br/>\nthey need and what they want.  I was thinking though that maybe if they <br/>\neach had a place that they could &#39;control&#39;, that it might make it easier to <br/>\ncontrol being with (or not being with) the other person so much?  Give them <br/>\nsome space, as it were.<br/>\n<br/>\nI hope your cakes are nummy!<br/>\nHeidiWD</div>","specialLinks":[]},{"userId":117956499,"authorName":"maryfhickman@jps.net","from":"maryfhickman@...","profile":"mfhickman95616","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Help again","postDate":"1048117368","msgId":13049,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY5OTc2MDEuMTA0ODExNzM3MDY4OC5KYXZhTWFpbC5ub2JvZHlAZGV3ZXkucHNwLnBhcy5lYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":0,"nextInTopic":13056,"prevInTime":13048,"nextInTime":13050,"topicId":13049,"numMessagesInTopic":0,"msgSnippet":"Hello, Pam, I picked up a copy of The Explosive Child. Wow. Helps put a lot into perspective. So help folks, I have 2 exploding kids. Each unique in what","messageBody":"<div id=\"ygrps-yiv-1689763515\">Hello,<br/>\n<br/>\nPam, I picked up a copy of The Explosive Child. Wow. Helps put a lot into perspective. So help folks, I have 2 exploding kids. Each unique in what pushes them over into meltdown. Tim (dh)too explodes .  Right now Ashley has a friend over. She has been begging to have her brother out of her room. He melts down when she does this, so they are locked. I will have to endure a meltdown from 1 of them. Hum... Which one? I offer Riley all kinds of distracting ideas, games, sweets, nothing. He wants to be with them. Now they all want to make a cake. Sure, except Ashley wants to do it just with her friend and Riley wants to do it with them also.<br/>\n<br/>\nRiley had a chance to go to a playgroup, except he wanted me with him, which I could not do today.I did remove Riley from Ashley&#39;s room because he started to damage things. He tried to hit me and slap me. He calmed down, we hugged and wondered why its so important to his sister to leave him out. He has been home all day, she at school. Hum. She was like this before she went to school this fall. Makes me want to not have kids over for her...<br/>\n<br/>\nMy kids induce meltdowns in eachother. Both want what they want and are non negotiating it seems.<br/>\n<br/>\nCake scene over. I told the kids since it was so difficult this time to find a solution, I would help them cook together. Ashley stormed into her room. Her friend stayed with me and the 2 other kids. Her friend then wandered down the hall to be with Ashley. I told them we were cooking and wanted help. They opted out to wait until we were done. Riley and Tessa were able to bake a cake together. Ashley and her friend were then able to bake another cake. I think everyone is ok. It seems so unnecessary though. The overall spent feeling of satisfying them all. Not at all the warm fuzzy feeling that making them was. And we have 2 cakes.<br/>\n<br/>\nAny suggestions again?<br/>\n<br/>\nMary H.<br/>\n<br/>\nmy kids are having far fewer meltdown, when I can keep the environment user-friendly. Ashley loves having friends over yet this always puts Riley into a vapor lock/meltdown state. Yikes for the rest of our lives. Then there is Tessa,3, the pirate ballerina. Come meet us in the playroom at the Home=Ed. Conference in Sacto this summer.</div>","specialLinks":[]}],"prevTopicId":13019,"nextTopicId":13061}}