{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Teens, writing, jobs","postDate":"1240948423","msgId":44400,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlDNTI3QzBCLUExOUEtNDFFRS1BOUEwLUNCQkIxNTQwOEE2QkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":44399,"nextInTime":44401,"topicId":44400,"numMessagesInTopic":0,"msgSnippet":"Pam Sorooshian posted this, but it would have stayed under sidewalk paint forever, so I m bringing it to a new topic of its own. ","messageBody":"<div id=\"ygrps-yiv-1841761534\">Pam Sorooshian posted this, but it would have stayed under &quot;sidewalk  <br/>\npaint&quot; forever, so I&#39;m bringing it to a new topic of its own.<br/>\n<br/>\n======================================<br/>\n<br/>\nRosie (18 year old) is taking a political science class at the community<br/>\ncollege and this morning the professor asked her to stay after class. He<br/>\nsaid he&#39;d shown her term paper to his editor (he writes textbooks) and<br/>\nthey really like her writing and want to know if she&#39;d like a job doing<br/>\nsome writing for a comparative political systems book they&#39;re working on<br/>\nover the summer.<br/>\n<br/>\nFUNNY thing - Rosie doesn&#39;t think of herself as a good writer at ALL.<br/>\nRoxana is the big writer - Rosie&#39;s opinion of her own writing ability<br/>\nwas pretty low (but she really only had Roxana to compare herself to,<br/>\nand Roxana is a really truly gifted writer). She had been really<br/>\nsurprised to get 100 percent on her term paper, but I&#39;d told her it was<br/>\na really good paper. She hasn&#39;t taken any other college courses that<br/>\nrequire writing - this is the first. Other than this, she&#39;s written<br/>\nNaNoWriMo novels and SriptFrenzy screenplays. She&#39;s had no writing<br/>\ninstruction of any kind. Always unschooled.<br/>\n<br/>\nShe told him she&#39;d think about it, but told me she doesn&#39;t think she<br/>\nwants to do it. I told her to ask if they&#39;d be interested in her sister<br/>\nbecause she be more interested in that kind of work.<br/>\n<br/>\n-pam<br/>\n<br/>\n====================================<br/>\n<br/>\nThis is so cool.   These stories are like fireworks in the world of  <br/>\nthe opportunities teens are offered overall in the world.<br/>\n<br/>\nShe might like to do it.  It might inspire her to write about martial  <br/>\narts and sign language and the treatment of children in the world.<br/>\n<br/>\nHolly was going to quit her job at the mall after Christmas.  It was  <br/>\ncalled &quot;a Christmas job&quot; and she figured, Christmas was over, she  <br/>\nshould quit.   But they wanted her to stay.  She did, but not  <br/>\nenthusiastically.   She thought more of it when others older than she  <br/>\nwas quit, or were let go for incompetence (or worse).  she thought  <br/>\neven more of it when other people came to apply to work, and now that  <br/>\nit&#39;s spring and there are LOTS of applications...   she realizes it&#39;s  <br/>\ncool to have a job, I guess.  And she has two.  And I almost feel  <br/>\nguilty, because there are kids out there who would love to have ONE  <br/>\njob.  But there are kids out there by the thousands who couldn&#39;t be  <br/>\ntrusted as Holly is, who aren&#39;t as quick to learn, or as fun to be  <br/>\naround.   Her boss said she&#39;s the only person who&#39;s ever worked there  <br/>\nwho would run to do something.  And it&#39;s a skateboard shop, and they  <br/>\nlet people skateboard in the shop, and still, the employees take their  <br/>\nsweet slow time to do anything, except for Holly.<br/>\n<br/>\nThat story was intended to suggest that maybe Rosie has no idea how  <br/>\nstunningly cool it is to have been asked to help write that way.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":44378,"nextTopicId":44429}}