{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":500859192,"authorName":"","from":"lilianfox1@...","profile":"lilianfox1@ymail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Sexual feelings in a young girl","postDate":"1424440303","msgId":75692,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PG1jN2Rocysxa2F2a29yQFlhaG9vR3JvdXBzLmNvbT4=","inReplyToHeader":"PDk5NTMzRjE0LUVEMUMtNDYyNS04NTE5LTMxQTBDMjQ3OUNEQUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDk5NTMzRjE0LUVEMUMtNDYyNS04NTE5LTMxQTBDMjQ3OUNEQUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":75691,"nextInTopic":0,"prevInTime":75691,"nextInTime":75693,"topicId":75685,"numMessagesInTopic":0,"msgSnippet":"... It may be the case that that your daughter is experiencing these thoughts and emotions now because she has more space and time to so so. Perhaps the","messageBody":"<div id=\"ygrps-yiv-1455794388\"><pre style=\"line-height:21.2999992370605px;white-space:normal;font-family:'Segoe UI', 'Segoe UI Web Regular', 'Segoe UI Symbol', 'Helvetica Neue', 'BBAlpha Sans', 'S60 Sans', Arial, sans-serif;color:rgb(68, 68, 68);font-size:15px;\">--- In the last 2-3 months my 9 yr old has come up to me and my husband, struggling with certain type of thoughts and emotions---<br style=\"line-height:21.2999992370605px;\"><br style=\"line-height:21.2999992370605px;\">It may be the case that that your daughter is experiencing these thoughts and emotions now because she has more space and time to so so. Perhaps the busyness and structure of attending pre-school and later school have prevented or distracted her from being in touch with some of her thoughts and emotions. Perhaps it did not feel safe enough for her to experience them before and now she has more opportunity and space (in terms of time and reflection) to do so?<br style=\"line-height:21.2999992370605px;\"><br style=\"line-height:21.2999992370605px;\">You did not mention the reasons that you decided to begin your unschooing journey and whether this was in response to anything that had happened in your lives? I wondered whether this change has also meant that you and/or your husband are more available to your daughter now and so she feels safer to approach you with concerns relating to her relationships and her inner world. I also agree with Joanna Stonesifer that it is great that she could express these thoughts and feelings to you.<br style=\"line-height:21.2999992370605px;\"><br style=\"line-height:21.2999992370605px;\">The other aspects I was considering is that at 9yrs old your daughter might also be starting to notice changes that might be taking place in her body. This might make her more aware or curious about her own sexuality and the sexuality of others. I have a 3yr old (nearly 4yrs) and an 8yr old daughter and I would say that they are both curious about their bodies and how they work. I have talked with my older daughter about issues of sexuality and masturbation in response to questions she has asked and topics that have come up in conversation. I have spoken in simple terms about the functions of various body parts and how certain body parts can feel pleasurable to touch, stroke and how people can enjoy doing this. We also have quite a laugh about butts for example as she has been curious about them and we have watched music videos where they feature in a prominent way. I tend to talk about these issues with them as and when they come up as part of everyday conversations.&nbsp;<br style=\"line-height:21.2999992370605px;\"><br style=\"line-height:21.2999992370605px;\">I wondered how open you are and have been about issues around her body and also about sexuality? How relaxed has she felt to come and talk to you about these kind of issues in a general way over the years? If she has not has the opportunity to do this it might be that in some way she has got the message that butts and breasts and sexuality are not the kind of topics that can be easily spoken about. This in itself could create some internal conflict if a child is feeling naturally curious or even anxious about their body for any reason.<br style=\"line-height:21.2999992370605px;\"><br style=\"line-height:21.2999992370605px;\">You mentioned that you were sexually abused yourself and that you have noticed similarities between you and your daughter in terms of your thinking and behaviour. While it is possible that you are picking up on something, it might also be helpful to consider how your experiences may be different. It can be beneficial to reflect on your own experience but not to confuse the two. Therapy could be useful in terms of reflecting on your own experience and your feelings and thoughts around sexuality and your body. This can impact on how you communicate your level of comfort around issues of sex and sexuality.&nbsp;<br style=\"line-height:21.2999992370605px;\"><br style=\"line-height:21.2999992370605px;\">---In a nut shell, she finds herself kissing imaginary guys, wants attention from other guys, is drawn to billboards that are sexual in nature, imagines me and her father kissing other men and women, is drawn to breasts and butt---<br style=\"line-height:21.2999992370605px;\"><br style=\"line-height:21.2999992370605px;\">If a child or young person has experienced or is continuing to experience an ongoing disconnection or difficulties in their attachment relationship with their parents it is possible that your daughter is craving, yearning for a sense of intimacy and connection. It might be that she is trying to make sense of strong feelings of wanting to love and to be loved, connected and close to someone. Perhaps she is exploring the ideas of romantic and sexualised forms about intimacy because she is feeling a sense of lack or disconnection in her relationships in her life and at the age of 9yrs issues connected with changes in her body might be making this more salient. She might also be feeling confused and/or curious about the nature of intimacy and the relationship that you have with her father.&nbsp;<br style=\"line-height:21.2999992370605px;\"><br style=\"line-height:21.2999992370605px;\">---She also struggles with angry thoughts (like when she and her sister fight or when I have upset her)and calls us names in her mind like bitch, boobs, stupid, fatty, arse. She told us she looks at other moms and dads and wishes they were her parents. She feels quite bad about these thoughts and cries often. ---<br style=\"line-height:21.2999992370605px;\"><br style=\"line-height:21.2999992370605px;\">It could be helpful to understand more about why she is feeling angry. Whether there are things that have happened in the past that have caused her to feel angry and things in the present.&nbsp;<br style=\"line-height:21.2999992370605px;\"><br style=\"line-height:21.2999992370605px;\">You mentioned that she had attended pre-school from a young age (3-5yrs) and ---there was a period during her preschool years when she stayed back in her teacher&#39;s home till evening as I was working. ---<br style=\"line-height:21.2999992370605px;\"><br style=\"line-height:21.2999992370605px;\">You daughter may have found it difficult to manage being separated you for long periods from such a young age. It is also possible that she was left to manage experiences on her own that she was not developmentally ready or able to deal with (not necessarily sexual in nature). A young child being separated from their parent for long periods (at school) can in itself be experienced as stressful and give rise to feelings of anger and sadness. How is anger expressed at home? Is it acceptable feel angry towards other family members? Perhaps until more recently your daughter has felt she has had to manage her feelings on her own? It may also be that previously she has been unable to articulate how she was feeling but she may have shown it in other ways?<br style=\"line-height:21.2999992370605px;\"><br style=\"line-height:21.2999992370605px;\">I agree with Sandra that it would be useful to find out what kind of parents she wishes she had and to understand how you could better meet her needs. By sharing her concerns and her inner world with you your daughter has provided an opportunity to review your relationship together and to create a relationship where she feels loved, cared for and understood.&nbsp;<br style=\"line-height:21.2999992370605px;\"><br style=\"line-height:21.2999992370605px;\">I also agree with Sandra that deschooling does take some time and it sounds like your daughter&#39;s feelings might be emerging now as part of this process. I also think be curious about and wanting to explore aspects of sexuality is part of childhood development.&nbsp;<br style=\"line-height:21.2999992370605px;\"><br style=\"line-height:21.2999992370605px;\">However, because you mention --- She feels quite bad about these thoughts and cries often. --- I think having the opportunity to meet with a practitioner who is experienced with working with children and their families may help to explore some of the issues in more depth and look at the factors involved. Talking it through with someone might also enable you to think more carefully about whether there could be any concerns of your daughter having been sexually abused either in the past or present and how your own experience may be having an impact on your relationship.&nbsp;<br style=\"line-height:21.2999992370605px;\"><br style=\"line-height:21.2999992370605px;\">A practitioner should enable you to address some of these relational issues and help to facilitate your connection with your daughter. You could always have an initial consultation or several yourself (without your daughter present) to explore some of the issues and to see if the practitioner is someone you feel you and your daughter could benefit from working with.<br style=\"line-height:21.2999992370605px;\"><br style=\"line-height:21.2999992370605px;\">Emma Forde</pre></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Sexual feelings in a young girl","postDate":"1424291938","msgId":75691,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMzRkI0Nzg1LTAwQjktNDQwMy1BQjJDLTE4M0M0RjEyNzk1QUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDk5NTMzRjE0LUVEMUMtNDYyNS04NTE5LTMxQTBDMjQ3OUNEQUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDk5NTMzRjE0LUVEMUMtNDYyNS04NTE5LTMxQTBDMjQ3OUNEQUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":75690,"nextInTopic":75692,"prevInTime":75690,"nextInTime":75692,"topicId":75685,"numMessagesInTopic":0,"msgSnippet":"-=-She told us she looks at other moms and dads and wishes they were her parents. -=- It s normal for children to think about what if? about other families,","messageBody":"<div id=\"ygrps-yiv-357081672\">-=-She told us she looks at other moms and dads and wishes they were her parents. -=-<br/>\n<br/>\nIt&#39;s normal for children to think about &quot;what if?&quot; about other families, houses, towns, siblings.  It&#39;s just thinking.<br/>\n<br/>\nIf what she&#39;s trying to express is that she&#39;s seeing other parents behaving toward her, or toward their own children, in ways that make her wish that her own parents were different (kinder?  More patient?  More fun?) then take that as communication!  <br/>\n<br/>\nMaybe ask her what about that other family is appealing to her.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Sexual feelings in a young girl","postDate":"1424291915","msgId":75690,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZFNzg0OTQ0LTE3RDYtNEUwNS05MzhGLThDNzM3RjcxN0RBMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDk5NTMzRjE0LUVEMUMtNDYyNS04NTE5LTMxQTBDMjQ3OUNEQUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDk5NTMzRjE0LUVEMUMtNDYyNS04NTE5LTMxQTBDMjQ3OUNEQUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":75689,"nextInTopic":75691,"prevInTime":75689,"nextInTime":75691,"topicId":75685,"numMessagesInTopic":0,"msgSnippet":"I asked for some clarification from the mom: Clarifying questions, for me to put on Always Learning Before you were unschooling, were they in school? Do you","messageBody":"<div id=\"ygrps-yiv-484902293\">I asked for some clarification from the mom:<br/>\n<br/>\n<br/>\nClarifying questions, for me to put on Always Learning<br/>\n<br/>\nBefore you were unschooling, were they in school?<br/>\nDo you think there was teasing at school that was sexual?<br/>\nDo you have reasons to think she&#39;s been molested?<br/>\n<br/>\nI think you&#39;ll get good feedback from that group.  I hope. :-)<br/>\n<br/>\n_____________<br/>\nShe responded:<br/>\n_____________<br/>\n<br/>\n1. Yes, they were in school. The concerned child was in a private play school from age 3-5yrs and then in mainstream school till about 8 yrs of age.<br/>\n<br/>\n2. Nothing that she ever came home and told me about. She would sometimes talk about the older students using bad language. <br/>\n<br/>\n3. I have often wondered if she was molested in anyway, for the same reasons. Also because there was a period during her preschool years when she stayed back in her teacher&#39;s home till evening as I was working then. Anything could have happened there. Ive asked her about it as well. Why am I so cued in on this? I was sexually abused myself and I see similarities between her and me in this regard (thinking, behaviour). But so far, she has not communicated memory of any such experience.<br/>\n<br/>\nOne of your pages is about parent issues. Im still dealing with my own past. To think my lil one may have gone though some form of what I went through tears me. <br/>\n__________________________<br/>\n<br/>\nI don&#39;t think it necessarily means she has had any molestation at all, anyway, but thought I would see if the mom was concerned or focussed on that.  I would assume for starters that she&#39;s just seen movies or listened to song lyrics or had someone tell her stories about love and kissing or whatever she&#39;s thinking about.<br/>\n<br/>\nDeschooling does, always, take a while.<br/>\nSmiles and happy encouragement do, always, help everything.<br/>\n<br/>\nAs to counselling, I wouldn&#39;t get a counsellor for the daughter.  I&#39;d recommend that the mom find an unschooling advisor of one sort or another (from my list, I recommended Amy Childs in this case; she had daughters and has done podcasts on sexuality) to help her (the mom) think through these things calmly and clearly.<br/>\n<br/>\nMarty (when he was maybe six or seven?) and another young neighbor once drew (and colored in) a life-size (their size) &quot;woman&quot; on a long piece of paper, lay it down by the side of the house (in an area with wall, fence gate—secluded) and humped it.   It was interesting.  I didn&#39;t flip out.  As aberrant child-behavior goes, it wasn&#39;t bad.   I still have that, somewhere.  I teased Marty once that I would bring it out someday when he was going to be married.  I didn&#39;t.  Maybe when he has a curious son I should see if he wants to use it as a historical visual aid. :-)<br/>\n<br/>\nExploration IS normal, and stronger in some kids than in others.  Some people are very sexual and others aren&#39;t.  This has been a source of cultural shame and pressure.  Younger people these days are looking at it more objectively.  There is more and more talk of some people being asexual, and of varying degrees and types of sexual interest.   What adults know now is not what adults of twenty years from now will know, so some of the advice you hear here might already be outdated. :-)<br/>\n<br/>\nWorrying won&#39;t help.  Kindness and distraction and good relationships will help.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":355496843,"authorName":"Joanna Stonesifer","from":"Joanna Stonesifer &lt;jrfehlauer@...&gt;","profile":"jrfehlauer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Sexual feelings in a young girl","postDate":"1424290372","msgId":75689,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdCNUNCMTYzLUZDQkItNDQxRS1BREE4LTdDMEFGODZCNTk5M0BnbWFpbC5jb20+","inReplyToHeader":"PDk5NTMzRjE0LUVEMUMtNDYyNS04NTE5LTMxQTBDMjQ3OUNEQUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDk5NTMzRjE0LUVEMUMtNDYyNS04NTE5LTMxQTBDMjQ3OUNEQUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":75685,"nextInTopic":75690,"prevInTime":75688,"nextInTime":75690,"topicId":75685,"numMessagesInTopic":0,"msgSnippet":"First, I think it s great that she s able to come to you and express these thoughts and feelings. Second, I think a counselor could be helpful since you said","messageBody":"<div id=\"ygrps-yiv-2008270355\"><html><head></head><div>First, I think it&#39;s great that she&#39;s able to come to you and express these thoughts and feelings.&nbsp;</div><div>Second, I think a counselor could be helpful since you said she feels bad about these thoughts and cries often. It could be a helpful space for her to process more in a safe non-judgmental space. I&#39;m not sure labeling it as &quot;normal&quot; or &quot;abnormal&quot; is helpful. It is what it is and since it&#39;s upsetting your daughter I think you should seek help to help her be more at peace.&nbsp;<br></div><div>But my kids have not yet had similar experiences.&nbsp;</div><div><br></div><div>Joanna</div><div><br></div><div><br><blockquote><span title=\"qreply\"> On Feb 18, 2015, at 14:09, Sandra Dodd <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a> [AlwaysLearning] &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>&gt; wrote:<br><br></span></blockquote></div><blockquote type=\"cite\"><div>\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n<span style=\"display:none;\">&nbsp;</span>\n\n\n\n    <div id=\"ygrps-yiv-2008270355ygrp-text\">\n      \n      \n      <p>A mom as asked me to post this anonymously. <br>\n<br>\n_____________________<br>\n<br>\nWe started on our unschooling journey with our two daughters age 12 and 9 , in 2014. In the last 2-3 months my 9 yr old has come up to me and my husband, struggling with certain type of thoughts and emotions. In a nut shell, she finds herself kissing imaginary guys, wants attention from other guys, is drawn to billboards that are sexual in nature, imagines me and her father kissing other men and women, is drawn to breasts and butt.  She also struggles with angry thoughts (like when she and her sister fight or when I have upset her)and calls us names in her mind like bitch, boobs, stupid, fatty, arse. She told us she looks at other moms and dads and wishes they were her parents. She feels quite bad about these thoughts and cries often. My husband I have been thinking of seeing a counsellor with her. But I just wanted to know for other parents if this is normal? My elder daughter has not come to us with such issues, rather, she has not told us anything of such nature.<br>\n<br>\nHave other children gone thorough such stuff?<br>\n______________________<br>\n<br>\nShe wrote &quot;If you would rather that I only connect with those listed on <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/issues/therapy\">http://sandradodd.com/issues/therapy</a>, I am open to that as well.&quot;  But I think both would be good.  <br>\n<br>\nSandra<br>\n<br>\n</p>\n\n    </div>\n     \n\n    \n\n\n\n\n\n\n\n</div></blockquote></html></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Sexual feelings in a young girl","postDate":"1424286550","msgId":75685,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk5NTMzRjE0LUVEMUMtNDYyNS04NTE5LTMxQTBDMjQ3OUNEQUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":75689,"prevInTime":75684,"nextInTime":75686,"topicId":75685,"numMessagesInTopic":0,"msgSnippet":"A mom as asked me to post this anonymously. _____________________ We started on our unschooling journey with our two daughters age 12 and 9 , in 2014. In the","messageBody":"<div id=\"ygrps-yiv-2135296479\">A mom as asked me to post this anonymously. <br/>\n<br/>\n_____________________<br/>\n<br/>\nWe started on our unschooling journey with our two daughters age 12 and 9 , in 2014. In the last 2-3 months my 9 yr old has come up to me and my husband, struggling with certain type of thoughts and emotions. In a nut shell, she finds herself kissing imaginary guys, wants attention from other guys, is drawn to billboards that are sexual in nature, imagines me and her father kissing other men and women, is drawn to breasts and butt.  She also struggles with angry thoughts (like when she and her sister fight or when I have upset her)and calls us names in her mind like bitch, boobs, stupid, fatty, arse. She told us she looks at other moms and dads and wishes they were her parents. She feels quite bad about these thoughts and cries often. My husband I have been thinking of seeing a counsellor with her. But I just wanted to know for other parents if this is normal? My elder daughter has not come to us with such issues, rather, she has not told us anything of such nature.<br/>\n<br/>\nHave other children gone thorough such stuff?<br/>\n______________________<br/>\n<br/>\nShe wrote &quot;If you would rather that I only connect with those listed on <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/issues/therapy,\">http://sandradodd.com/issues/therapy,</a> I am open to that as well.&quot;  But I think both would be good.  <br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":75684,"nextTopicId":75611}}