{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":12,"messages":[{"userId":113028911,"authorName":"Dnowens@aol.com","from":"Dnowens@...","profile":"echomygecko","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] THE DAY HOMESCHOOLING DIES by Chris Davis","postDate":"1067110274","msgId":83230,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxLjM1YTI0Mzc4LjJjY2MyOTgyQGFvbC5jb20+"},"prevInTopic":83223,"nextInTopic":0,"prevInTime":83229,"nextInTime":83231,"topicId":83189,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/24/03 04:58:14 PM Central Daylight Time, jana@coyotescorner.com writes: I love it!! I love the way so many will understand it....but","messageBody":"<div id=\"ygrps-yiv-259584920\">In a message dated 10/24/03 04:58:14 PM Central Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jana@...\">jana@...</a> writes:<br/>\nI love it!! I love the way so many will &#39;understand&#39; it....but hey, I&#39;ve been <br/>\nmistaken before - show me where/how I&#39;m mistaken?<br/>\nJanis<br/>\n#################<br/>\n<br/>\nWell, I thought I did show where the holes were, and I know Sandra did better <br/>\nthan me anyway. Maybe reread my post and definitely read Sandra&#39;s!<br/>\n~Nancy<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":113028911,"authorName":"Dnowens@aol.com","from":"Dnowens@...","profile":"echomygecko","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] THE DAY HOMESCHOOLING DIES by Chris Davis","postDate":"1067100507","msgId":83223,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcxLjM2ODQ5MzA1LjJjY2MwMzViQGFvbC5jb20+"},"prevInTopic":83222,"nextInTopic":83230,"prevInTime":83222,"nextInTime":83224,"topicId":83189,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/24/03 01:54:47 PM Central Daylight Time, SandraDodd@aol.com writes: PROMISE I DIDN T COPY OFF NANCY S PAPER!! (Gosh, all that talk of the","messageBody":"<div id=\"ygrps-yiv-618963107\">In a message dated 10/24/03 01:54:47 PM Central Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\nPROMISE I DIDN&#39;T COPY OFF NANCY&#39;S PAPER!!<br/>\n<br/>\n(Gosh, all that talk of the good old days gave me bad school flashbacks!)<br/>\n<br/>\nSandra<br/>\n############<br/>\n<br/>\nAnd I guess I should read through all the posts before I reply to the ones I <br/>\nwant to reply to. &lt;BEG&gt; But that would take all the fun out of things wouldn&#39;t <br/>\nit? <br/>\n~Nancy<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":70316959,"authorName":"AimeeL73@cs.com","from":"AimeeL73@...","profile":"aimeel73","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] THE DAY HOMESCHOOLING DIES by Chris Davis","postDate":"1067099551","msgId":83222,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYzLjI0MDE5NzVhLjJjY2JmZjlmQGNzLmNvbT4="},"prevInTopic":83213,"nextInTopic":83223,"prevInTime":83221,"nextInTime":83223,"topicId":83189,"numMessagesInTopic":0,"msgSnippet":"... That s how I saw it too.  I found it to be very heartening that a Christian homeschooler would embrace some of the freedom and ideals of unschooling, and I","messageBody":"<div id=\"ygrps-yiv-42231858\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HMSL2@...\">HMSL2@...</a> writes: <br/>\n<blockquote><span title=\"ireply\"> &gt; I didn&#39;t read it for the Christian parts AT ALL!<br/>\n&gt; To me it was cut and dry. <br/>\n&gt; What I got out of it was shake the curricula and be with your family.<br/>\n<br/>\n<br/>\n </span></blockquote>That&#39;s how I saw it too.  I found it to be very heartening that a Christian <br/>\nhomeschooler would embrace some of the freedom and ideals of unschooling, and I <br/>\nthank you for sharing the article.  <br/>\n<br/>\n~Aimee<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":96795689,"authorName":"tuckervill@aol.com","from":"tuckervill@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] THE DAY HOMESCHOOLING DIES by Chris Davis","postDate":"1067085845","msgId":83213,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhOC4xYjQ4NDg3ZC4yY2NiY2ExNUBhb2wuY29tPg=="},"prevInTopic":83206,"nextInTopic":83222,"prevInTime":83212,"nextInTime":83214,"topicId":83189,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/24/2003 12:15:53 PM Central Daylight Time, SandraDodd@aol.com writes: That whole article is part of the Christian propaganda base of that","messageBody":"<div id=\"ygrps-yiv-1590695414\">In a message dated 10/24/2003 12:15:53 PM Central Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\nThat whole article is part of the Christian propaganda base of that <br/>\n&quot;movement&quot; which some people even on this list still don&#39;t seem to believe <br/>\nexists.<br/>\nI&#39;m disturbed by your points (even though I agree with them) because I&#39;ve met <br/>\nand had an in-depth unschooling discussion with Chris Davis and I always <br/>\nthought he was one of the more sane ones in that arena.  harumph.<br/>\n<br/>\nTuck<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126884268,"authorName":"HMSL2@aol.com","from":"HMSL2@...","profile":"dobsiedoe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] THE DAY HOMESCHOOLING DIES by Chris Davis","postDate":"1067041283","msgId":83206,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY2LjMyMjgxNmU3LjJjY2IxYzAzQGFvbC5jb20+"},"prevInTopic":83203,"nextInTopic":83213,"prevInTime":83205,"nextInTime":83207,"topicId":83189,"numMessagesInTopic":0,"msgSnippet":"I posted the article and I also saw it differently. I didn t read it for the Christian parts AT ALL! To me it was cut and dry. What I got out of it was shake","messageBody":"<div id=\"ygrps-yiv-674726077\">I posted the article and I also saw it differently. <br/>\n<br/>\nI didn&#39;t read it for the Christian parts AT ALL!<br/>\nTo me it was cut and dry. <br/>\nWhat I got out of it was shake the curricula and be with your family.<br/>\nAs far as the Father comment I simply saw that as dahh many Mom&#39;s dont need <br/>\nhelp spending time with their kids. I dont think I have seen one father post <br/>\nabout a mom that disagreed with Unschooling?<br/>\n<br/>\nAs for the word HOMESCHOOLING which was the main topic I felt he was saying <br/>\nthat Traditional HS puts blocks between families. Call me simple...<br/>\n<br/>\nWhen I posted this it had just come off our Maine lists. On our lists many <br/>\nparents are textbook Traditional Christian Homeschoolers.<br/>\nIn my mind and heart it hit a cord for me in my day to day dealings. <br/>\n<br/>\n NOW, I am fully aware that the E company is well known to be firm <br/>\nChristian&#39;s. BUT I read and judge how I feel about each article, topic and writer. I <br/>\ndont black them out because I read one thing and now I think they are freaks in <br/>\nevery article they write. If I was to take in everything someone said I would <br/>\nbe in a bitter light as someone would be wrong, right?  <br/>\nI came to Unschooling before I even knew it had a name, was even done or that <br/>\nsomeone had been doing it in their state for 20 years. I didn&#39;t change <br/>\nbecause someone said it was a better way, I found it myself.  <br/>\n<br/>\nI dont practice any religion and I could care less about it. The bible was <br/>\nforced on me as a child so I take no interest in it now. The &quot;god&quot; references <br/>\nbugged me a bit but I saw the article not as a religious post.<br/>\n<br/>\nI read articles all the time that go on and on about nothing. Some make no <br/>\nsense to new homeschoolers/unschoolers.  If a potential newbie is reading they <br/>\nare searching for that one or two articles that strike a cord and get them off <br/>\ntheir feet.  To me this article spoke to new Homeschoolers about families and <br/>\nbonding NOT curricula/books which is what they sell. To me it said bring your <br/>\nchildren home, spend time as a family and dont worry about the books its not <br/>\nas important. To me that is closer to Unschooling than any other type or label.<br/>\n<br/>\nI can see if I was a remotely religious that this would have been a <br/>\ncalculated post. It was not that at all.  What I said was---&gt;&gt;&gt;&quot;This was posted to <br/>\nanother list I am on. I thought this would be a good read for new Unschooling <br/>\nparents and those struggling with not using a curricula.&quot;<br/>\n<br/>\n<br/>\n<br/>\nLaura D<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":3899762,"authorName":"coyote&#39;s corner","from":"&quot;coyote&#39;s corner&quot; &lt;jana@...&gt;","profile":"calourojm","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] THE DAY HOMESCHOOLING DIES by Chris Davis","postDate":"1067032304","msgId":83203,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBkZDUwMWMzOWE3OSQwNDY0YzhhMCQxNGRjMDA0NEBBb3Blbj4=","referencesHeader":"PDZhLjM3MDQ3MDQyLjJjY2FjYjQ4QGFvbC5jb20+"},"prevInTopic":83201,"nextInTopic":83206,"prevInTime":83202,"nextInTime":83204,"topicId":83189,"numMessagesInTopic":0,"msgSnippet":"I love it!! I love the way so many will understand it....but hey, I ve been mistaken before - show me where/how I m mistaken? Janis ... From: Dnowens@aol.com","messageBody":"<div id=\"ygrps-yiv-277017586\">I love it!! I love the way so many will &#39;understand&#39; it....but hey, I&#39;ve been mistaken before - show me where/how I&#39;m mistaken?<br/>\nJanis<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Dnowens@...\">Dnowens@...</a> <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a> <br/>\n  Sent: Friday, October 24, 2003 2:36 PM<br/>\n  Subject: Re: [UnschoolingDiscussion] THE DAY HOMESCHOOLING DIES by Chris Davis<br/>\n<br/>\n<br/>\n  In a message dated 10/24/03 11:02:50 AM Central Daylight Time, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HMSL2@...\">HMSL2@...</a> <br/>\n  writes:<br/>\n  This was posted to another list I am on. I thought this would be a good read <br/>\n  for new Unschooling parents and those struggling with not using a curricula. <br/>\n  It is long but worth the read. See below:<br/>\n<br/>\n  Laura D<br/>\n  Mom to:<br/>\n  Dustin 12<br/>\n  Cassidy 4<br/>\n  Nicholas 18mo<br/>\n  EDD 5/3/04<br/>\n  ##############<br/>\n  I don&#39;t know if this really is the best thing to have new unschooling parents <br/>\n  read. But me saying that smacks of censorship &lt;g&gt; I guess what I should say <br/>\n  is that MY personal opinion is that there are hidden-read-between-the-lines <br/>\n  things in this article that makes it not as innocent as it seems.<br/>\n  ################<br/>\n  it wasn’t until around the mid<br/>\n  1800&#39;s that entire nations decided to take children out of the home and<br/>\n  &quot;school&quot; them. I will briefly mention the two main causes for this<br/>\n  &lt;snip&gt;<br/>\n  First, in the mid-1800’s the Industrial Revolution began. &lt;snip&gt;<br/>\n  Around this same time, another movement was taking shape: The Common<br/>\n  (Public) School movement. The leaders of the Public School movement were,<br/>\n  for the most part, humanists who were concerned about two things they<br/>\n  believed endangered America’s future: The continuation of what they<br/>\n  called religious superstitious beliefs and the influx of illiterate<br/>\n  immigrants seeking jobs and a better life in this country. These leaders<br/>\n  believed that realizing their two-fold goal of ridding our society of<br/>\n  religion and providing an education for immigrant children mandated<br/>\n  compulsory education for every child. Soon, the various states were<br/>\n  passing compulsory attendance laws and children began to be public<br/>\n  schooled en masse. <br/>\n  ##############<br/>\n  While some of the public schools may have been started by so called <br/>\n  humanists, most if not almost all were started by small communities across the nation, <br/>\n  largely christian. One room school houses sometimes also the church (only <br/>\n  church) in town as well. Single female teacher hired by the male *school board* <br/>\n  and boarded by a family near the school. My own great grandmothers diary reads <br/>\n  something like this; *A good strong, God fearing community. Asked if I would be <br/>\n  attending church services locally, I had no problems answering in the <br/>\n  affirmative. I only asked that I be boarded by a good Lutheran family, and the large <br/>\n  man laughed jovially as if there were any question in the matter. Of course I <br/>\n  will not be seeing Otto for the term, teachers do not go out with gentlemen <br/>\n  and certainly do not announce an engagement of marriage.* My g-grandma was <br/>\n  certainly not a humanist nor were the men who hired her. <br/>\n  #################<br/>\n<br/>\n  So, as dads were leaving home with a promise of employment, children were<br/>\n  also leaving home with a promise of being made employable for the next<br/>\n  generation. Within a very short period of time, the family unit that had<br/>\n  been tightly held together for generations, became a set of individuals<br/>\n  going their separate ways. To the factories went the dads. To the schools<br/>\n  went the kids. Where Mom went is the subject of another article. <br/>\n  ##################<br/>\n  Yes, we won&#39;t be reading much about Mom in the rest of this article. Where is <br/>\n  Mom? <br/>\n  ##################<br/>\n<br/>\n  It wasn’t long before people forgot what it was like to be a family with<br/>\n  Dad as the head of a &quot;family enterprise&quot; and the whole family working<br/>\n  together as co-producers. In one generation, the cultural memory of<br/>\n  children growing up at home was forgotten. <br/>\n<br/>\n  ########################<br/>\n  This idea of yesteryear being the ideal didn&#39;t start after this so called on <br/>\n  generation. There is a word for this, it slips my mind now. As for this idea <br/>\n  of cultural memory, he also brings up another term of identity-dirrected <br/>\n  homeschooling, both which leave me thinking of nazism and racism. Chills.<br/>\n  ########################<br/>\n<br/>\n  In the 1950&#39;s—one hundred years after the of the public school movement<br/>\n  began—some middle class parents began to desire an educational experience<br/>\n  for their children whose curricula was more individualized. It was at<br/>\n  this time that the private school movement began. I attended one of these<br/>\n  schools in what should have been my fourth grade. It was little more than<br/>\n  an experimental school run by one man who was also the only teacher. He<br/>\n  didn’t like having one fourth grader, so I was skipped to fifth grade<br/>\n  where there was one other student. I don&#39;t remember learning much, but it<br/>\n  was more fun than public school! <br/>\n<br/>\n  #####################<br/>\n  He is talking about educational reform. Not some middle class movement. <br/>\n  Schools across the country tried this or something like this for a year or two and <br/>\n  then someone else came along with a new idea. He spends his entire article <br/>\n  trying desperately to have us believe he doesn&#39;t believe in school=learning and <br/>\n  learing=school and brings the whole facade down in one small sentence. &quot;I don&#39;t <br/>\n  remember learning much, but it was more fun than public school!&quot; Even he <br/>\n  still equates school with learning and that one year, failed attempt didn&#39;t work, <br/>\n  i.e. he didn&#39;t &quot;learn&quot; the unsaid words here are *what he was supposed to.* as <br/>\n  in what he implied, but didn&#39;t write is; &quot;I don&#39;t remember learning what I <br/>\n  was supposed to, but it was more fun than public school.&quot;<br/>\n  ######################<br/>\n<br/>\n  During the Civil Rights years, the Christian school movement began along<br/>\n  with its own particular brand of curricula which was mainly<br/>\n  &quot;Christianized&quot; public school material. The concept remained that<br/>\n  children were to be brought out of their homes and taught by educators,<br/>\n  (presumably Christian), who, because they were &quot;professionals&quot; would do a<br/>\n  better job of training children than could the children’s parents. It<br/>\n  seemed that parents would now get the best of both worlds: a public-style<br/>\n  education that was also Christian. <br/>\n<br/>\n  ##################<br/>\n  WRONG! He really needs to reread his copy of Gatto! I think he must have <br/>\n  missed a chapter or five. Schools were until this time largely christian.<br/>\n  ################## <br/>\n<br/>\n  Are the &quot;not-being-homeschooled&quot; children receiving a<br/>\n  quality upbringing, including a quality education? Today enough research<br/>\n  exists that I can honestly say an unequivocal &quot;yes&quot;. I would even go so<br/>\n  far as to say that the not-being-homeschooled child is receiving an<br/>\n  education which is superior to the child being homeschooled. [For a<br/>\n  fuller discussion on this, see our article, &quot;Identity-Directed<br/>\n  Homeschooling&quot;]. <br/>\n<br/>\n  ##############<br/>\n  Here he tries to get the reader to believe that this *Identity-Directed <br/>\n  Homeschooling* would be the same as unschooling. Notice he never uses the term <br/>\n  unschooling, yet tries to imply to the reader that that is what he intends. One <br/>\n  should never equate identity-directed with unschooling, ever. <br/>\n  ##############<br/>\n<br/>\n  This article is not intended to discourage, but to give hope.&lt;snip&gt;<br/>\n  Be encouraged. You are allowed to do what your heart tells you is right. <br/>\n  IF WE AREN&#39;T HOMESCHOOLING, THEN WHAT ARE WE DOING? <br/>\n  Right now, nearly two million children are spending their days at home<br/>\n  rather than &quot;at school,&quot; thus putting an end to a 150 year &quot;detour&quot; which<br/>\n  began in the 1850’s and which seriously harmed family life and Kingdom<br/>\n  community as God initially intended them to be lived. As families leave<br/>\n  this detour and turn onto the road whose name is &quot;Life As It Was Intended<br/>\n  To Be,&quot; we will see vistas we have only read about in books. <br/>\n<br/>\n  #####################<br/>\n  White supermacist propaganda. &quot;Kingdom community&quot; &quot;As God intended...&quot; &quot;Life <br/>\n  as it was intended to be&quot; No Blacks in our neighborhood, no Jews in our <br/>\n  clubs.. If people seriously don&#39;t believe there are christians out there <br/>\n  homeschooling their kids in this way, they really need to do some reading. No, not all <br/>\n  christians, but many.<br/>\n  #####################<br/>\n<br/>\n  Dad&#39;s heart must turn toward his children and the hearts of the<br/>\n  children must turn toward Dad. Ultimately, this may bring Dad out of the<br/>\n  corporate workforce to come home. This final step may take another<br/>\n  generation to be fulfilled. But, for it to be fulfilled, Dads must at<br/>\n  least begin moving in that direction (i.e. Giving his children the option<br/>\n  of becoming entrepreneurs). <br/>\n<br/>\n  ################<br/>\n  Here we are again! Where is Mom? I think she is in the laundry room washing a <br/>\n  mountain of clothes or in the kitchen preparing a meal and sneaking sips of <br/>\n  the wine she tells her husband she uses to flavor that favorite dish of his. <br/>\n  Really though, in families like this mom is a teacher, dad is the principal, god <br/>\n  is the superintendent. <br/>\n  ################<br/>\n<br/>\n  God has asked us to raise a generation prepared for the future by<br/>\n  becoming exactly what He intended each person to become. This will be<br/>\n  different for each and every child. Your home is the place where the<br/>\n  acorn can become the oak tree. Or, the seed can become the maple tree.<br/>\n  Or, the other seed can become the pine tree. Plant your children squarely<br/>\n  in their own home and allow the individual God created to grow. <br/>\n<br/>\n  ################ <br/>\n  Not really as individualistic as he would like us to believe.<br/>\n  ################<br/>\n<br/>\n  Chris Davis is the founder of the Elijah Company and a father of 4<br/>\n  children<br/>\n<br/>\n  ################<br/>\n  And he too has something to sell.<br/>\n<br/>\n  ~Nancy<br/>\n<br/>\n  Genius may have its limitations, but stupidity is not thus handicapped. <br/>\n  Elbert Hubbard <br/>\n<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n              ADVERTISEMENT<br/>\n             <br/>\n       <br/>\n       <br/>\n<br/>\n  &quot;List Posting Policies&quot; are provided in the files area of this group. <br/>\n<br/>\n  To unsubscribe from this send an email to:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\n  Visit the Unschooling website and message boards: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":3899762,"authorName":"coyote&#39;s corner","from":"&quot;coyote&#39;s corner&quot; &lt;jana@...&gt;","profile":"calourojm","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] THE DAY HOMESCHOOLING DIES by Chris Davis","postDate":"1067031189","msgId":83201,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBjMmYwMWMzOWE3NiQ2YjY3ZDA5MCQxNGRjMDA0NEBBb3Blbj4=","referencesHeader":"PDEyOS4zMzk4ZDE1NC4yY2NhYTY2NEBhb2wuY29tPg=="},"prevInTopic":83199,"nextInTopic":83203,"prevInTime":83200,"nextInTime":83202,"topicId":83189,"numMessagesInTopic":0,"msgSnippet":"Thanks so very much!! I d like to post it on my site (eventually) in the unschooling section.....is there a place I can read the rest of this? Janis ... From:","messageBody":"<div id=\"ygrps-yiv-780409625\">Thanks so very much!! I&#39;d like to post it on my site (eventually) in the unschooling section.....is there a place I can read the rest of this?<br/>\nJanis<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HMSL2@...\">HMSL2@...</a> <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-101@yahoogroups.com\">Unschooling-101@yahoogroups.com</a> ; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a> <br/>\n  Sent: Friday, October 24, 2003 11:59 AM<br/>\n  Subject: [UnschoolingDiscussion] THE DAY HOMESCHOOLING DIES by Chris Davis<br/>\n<br/>\n<br/>\n  This was posted to another list I am on. I thought this would be a good read <br/>\n  for new Unschooling parents and those struggling with not using a curricula. <br/>\n  It is long but worth the read. See below:<br/>\n<br/>\n  Laura D<br/>\n  Mom to:<br/>\n  Dustin 12<br/>\n  Cassidy 4<br/>\n  Nicholas 18mo<br/>\n  EDD 5/3/04<br/>\n<br/>\n  THE DAY HOMESCHOOLING DIES<br/>\n  Email | 21 Oct 03 | Chis Davis<br/>\n  Posted on 10/21/2003 7:15 PM EDT by SLB<br/>\n  My oldest son, Seth, was homeschooled the entire time he lived at home.<br/>\n  This past summer, as he and I were discussing his upbringing, I had a<br/>\n  realization about this movement we all call &quot;homeschooling,&quot; and I said<br/>\n  to Seth, &quot;When you have kids, they will not be public schooled. They<br/>\n  won&#39;t be private schooled. They won&#39;t be Christian schooled.&quot; <br/>\n  &quot;And,&quot; I concluded, &quot;your kids won&#39;t be home schooled, either.&quot; <br/>\n  The realization I had while talking with Seth is that God had begun<br/>\n  something twenty years ago that came to be called &quot;homeschooling,&quot; but<br/>\n  which really wasn \u0019t about schooling at all. Here&#39;s what I mean. <br/>\n  THE COLLAPSE OF THE FAMILY <br/>\n  For thousands of years children have grown up in what today would be<br/>\n  considered an unnatural place—the home. In this setting, parents never<br/>\n  thought of themselves as &quot;home schoolers.&quot; There was no alternative to<br/>\n  children spending their days at home, having knowledge, experiences and<br/>\n  character passed to them by their parents and extended family. What<br/>\n  children needed to know, they learned as part of their daily lives:<br/>\n  sowing and reaping, weather, how a business works, how to treat customers<br/>\n  (and everyone else, for that matter). Life was their education. <br/>\n  Throughout history, small, homogeneous groups have attempted to provide a<br/>\n  common education for their youth, yet it wasn’t until around the mid<br/>\n  1800&#39;s that entire nations decided to take children out of the home and<br/>\n  &quot;school&quot; them. I will briefly mention the two main causes for this<br/>\n<br/>\n  dramatic change in the way we began raising our children. Interestingly,<br/>\n  both occurred at approximately the same time. <br/>\n  First, in the mid-1800’s the Industrial Revolution began. The new<br/>\n  factories needed laborers and the siren call went out for men to leave<br/>\n  their homes and be paid a salary (something new for most men). The<br/>\n  possibility of being able to increase one’s family&#39;s standard of living<br/>\n  was the draw that caused men to cease being patriarchs of a family<br/>\n  enterprise and become employees. <br/>\n  Around this same time, another movement was taking shape: The Common<br/>\n  (Public) School movement. The leaders of the Public School movement were,<br/>\n  for the most part, humanists who were concerned about two things they<br/>\n  believed endangered America’s future: The continuation of what they<br/>\n  called religious superstitious beliefs and the influx of illiterate<br/>\n  immigrants seeking jobs and a better life in this country. These leaders<br/>\n  believed that realizing their two-fold goal of ridding our society of<br/>\n  religion and providing an education for immigrant children mandated<br/>\n  compulsory education for every child. Soon, the various states were<br/>\n  passing compulsory attendance laws and children began to be public<br/>\n  schooled en masse. <br/>\n  So, as dads were leaving home with a promise of employment, children were<br/>\n  also leaving home with a promise of being made employable for the next<br/>\n  generation. Within a very short period of time, the family unit that had<br/>\n  been tightly held together for generations, became a set of individuals<br/>\n  going their separate ways. To the factories went the dads. To the schools<br/>\n  went the kids. Where Mom went is the subject of another article. <br/>\n  It wasn’t long before people forgot what it was like to be a family with<br/>\n  Dad as the head of a &quot;family enterprise&quot; and the whole family working<br/>\n  together as co-producers. In one generation, the cultural memory of<br/>\n  children growing up at home was forgotten. Children belonged &quot;in school&quot;<br/>\n  during the most productive hours of their day, learning whatever would<br/>\n  make them employable, becoming independent, establishing strong<br/>\n  friendships that replaced the bonds of family. And what had been a<br/>\n  lifestyle of learning became &quot;book learning&quot; as learning became separated<br/>\n  from real life. Of course, there was always a small group of families<br/>\n  whose children never attended public school. Typically, these were<br/>\n  American&#39;s wealthiest whose children received exclusive private<br/>\n  educations in areas intended to prepare them for leadership in<br/>\n  government, education, science and business. Most Americans don’t realize<br/>\n  that public school was never intended to prepare leaders. It has always<br/>\n  been intended to prepare employees. [For a fuller understanding of this<br/>\n  subject, read John Gatto&#39;s books, The Underground History of American<br/>\n  Education, A Different Kind of Teacher, and Dumbing us Down]. <br/>\n  HOW SHOULD WE THEN SCHOOL? <br/>\n  In the 1950&#39;s—one hundred years after the of the public school movement<br/>\n  began—some middle class parents began to desire an educational experience<br/>\n  for their children whose curricula was more individualized. It was at<br/>\n  this time that the private school movement began. I attended one of these<br/>\n  schools in what should have been my fourth grade. It was little more than<br/>\n  an experimental school run by one man who was also the only teacher. He<br/>\n  didn’t like having one fourth grader, so I was skipped to fifth grade<br/>\n  where there was one other student. I don&#39;t remember learning much, but it<br/>\n  was more fun than public school! <br/>\n  During the Civil Rights years, the Christian school movement began along<br/>\n  with its own particular brand of curricula which was mainly<br/>\n  &quot;Christianized&quot; public school material. The concept remained that<br/>\n  children were to be brought out of their homes and taught by educators,<br/>\n  (presumably Christian), who, because they were &quot;professionals&quot; would do a<br/>\n  better job of training children than could the children’s parents. It<br/>\n  seemed that parents would now get the best of both worlds: a public-style<br/>\n  education that was also Christian. <br/>\n  Then, in the late 1970&#39;s and early 1980&#39;s, a new schooling movement<br/>\n  began. All over the country, parents began keeping their children home<br/>\n  instead of sending them to one of the other schooling options. Some<br/>\n  parents made this decision out of concern for their children’s safety.<br/>\n  Others didn’t like the education their children were receiving. However,<br/>\n  the majority decided to keep their children home simply because they<br/>\n  wanted a relationship with them and parents didn’t think this could<br/>\n  happen very well if the kids were gone all day long. It was quite a novel<br/>\n  (and controversial) idea that children should be kept home during the<br/>\n  schooling hours of the day. <br/>\n  So, today, parents have several choices as to how their children might be<br/>\n  educated: <br/>\n  Public School Private School Christian School Home School <br/>\n  Note that the above choices relate to where and how the child is<br/>\n  educated. In the past 150 years we have changed the first word, but we<br/>\n  have not changed the last word, &quot;School.&quot; Each choice still emphasizes<br/>\n  the fact that children are to be &quot;schooled.&quot; <br/>\n  A MISUNDERSTOOD MOVEMENT? <br/>\n  I don&#39;t know how keeping our children home during the day came to be<br/>\n  known as &quot;Home Schooling,&quot; but I do have a theory: If I asked most<br/>\n  adults, &quot;What is the appropriate activity for every child, age six to age<br/>\n  eighteen, during the days Monday through Friday?&quot; Most adults would say,<br/>\n  &quot;These are the years when a child is being schooled, of course.&quot; That is<br/>\n  why we have such phrases in our vocabulary as the &quot;school age child.&quot; So,<br/>\n  if a child is to be &quot;schooled&quot; during these formative years, the only<br/>\n  real question is, &quot;Where will he be schooled?&quot; Today, the answer is, &quot;He<br/>\n  will either be public schooled, private schooled, Christian schooled, or<br/>\n  home schooled.&quot; <br/>\n  Assuming, then, that every child is to &quot;be schooled&quot; during the day, if<br/>\n  he is home during the day, he will be home schooled during the day. Hence<br/>\n  the origin of the label &quot;homeschooling.&quot; <br/>\n  Is &quot;schooling&quot; really supposed to be a child’s primary daily activity? It<br/>\n  wasn’t until the advent of the modern public school movement. Schooling a<br/>\n  child was never meant to be the &quot;constant&quot; with the variable being where<br/>\n  the child spends his or her day. It has always been just the other way<br/>\n  around. <br/>\n  What is so problematic with the term &quot;Home Schooling&quot; is what it has done<br/>\n  to parents whose children are spending their days at home. Giving an<br/>\n  activity a label means something to those involved in the activity. If we<br/>\n  are comfortable with certain words in the label and not so comfortable<br/>\n  with other words, those words with which we feel least secure will take<br/>\n  on greater significance. Insecurity is a nice word for fear. Whatever we<br/>\n  fear becomes a driver in our lives as we attempt to overcome our fear and<br/>\n  feel secure again. <br/>\n  When we sent our children to school, we felt a sense of security that<br/>\n  trained professionals were educating them. We didn&#39;t pretend that we<br/>\n  could do a job which others had spent years being trained to do. We might<br/>\n  feel that we could raise our children in some areas, but not to provide<br/>\n  for their education. <br/>\n  Then, one day, we became homeschoolers. Insecure homeschooler; but<br/>\n  homeschoolers nevertheless. However, since what we were doing was labeled<br/>\n  &quot;homeschooling,&quot; we, in our insecurity, actually became home-SCHOOLERS<br/>\n  rather than HOME-schoolers. The importance of our children becoming<br/>\n  educated (isn&#39;t that what children do during the day?) took on greater<br/>\n  prominence than the importance of them being home. This is understandable<br/>\n  when we realize that there is no cultural memory of what having our<br/>\n  children home really means to the family or to society. <br/>\n  What did I mean when I told my son, &quot;And, your kids won&#39;t be<br/>\n  homeschooled&quot;? During Seth&#39;s years at home, his academic education was<br/>\n  never the main priority. In our home, we did have a rigid priority<br/>\n  structure, but those priorities were first relationships; second,<br/>\n  practical skills; and, finally, academics. Seth grew up with a strong<br/>\n  academic upbringing, but academics were never our priority. Seth is a<br/>\n  skilled, very competent individual of the highest character. He is also<br/>\n  one of the happiest young men I have ever known. As I look back at Seth&#39;s<br/>\n  time at home, I have come to realize that he was never &quot;homeschooled.&quot; He<br/>\n  simply grew up in a most remarkable place—his home <br/>\n  When our children were young we would take them with us to the store.<br/>\n  Other kids were in school. The check-out lady would inevitably ask, &quot;You<br/>\n  boys aren’t in school today?&quot; Since the boys knew we were homeschoolers,<br/>\n  they would respond, &quot;No, ma’am, we’re homeschooled.&quot; <br/>\n  STARTING OVER <br/>\n  If I could do it all over again, I would not call ourselves<br/>\n  &quot;homeschoolers.&quot; I have actually come to dislike the term because I think<br/>\n  it creates significant problems. If I were starting over again, when the<br/>\n  lady at the store says, &quot;You boys aren&#39;t in school today?&quot; I would teach<br/>\n  the boys to say, simply, &quot;No ma&#39;am,&quot; and let it go at that. <br/>\n  In just the past year I have noticed a growing distinction between<br/>\n  families who are homeschooling and those whose children are home, but not<br/>\n  being homeSCHOOLED. Are the &quot;not-being-homeschooled&quot; children receiving a<br/>\n  quality upbringing, including a quality education? Today enough research<br/>\n  exists that I can honestly say an unequivocal &quot;yes&quot;. I would even go so<br/>\n  far as to say that the not-being-homeschooled child is receiving an<br/>\n  education which is superior to the child being homeschooled. [For a<br/>\n  fuller discussion on this, see our article, &quot;Identity-Directed<br/>\n  Homeschooling&quot;]. <br/>\n  The availability of what has come to be known as &quot;prepackaged curricula&quot;<br/>\n  is helping manifest a separation of the two types of families who were<br/>\n  once grouped together under the one term: &quot;homeschoolers.&quot; Many parents<br/>\n  purchase prepackaged curricula because they don&#39;t understand what God<br/>\n  originally intended when He began this movement over twenty years ago. <br/>\n  What do you think your children should be doing all day now that they are<br/>\n  home? Probably the most obvious way to determine what you really believe<br/>\n  is to ask yourself, &quot;Is my child the constant or is my child’s education<br/>\n  the constant?&quot; Look at the materials you use to bring learning into your<br/>\n  child’s life. Do you use graded, prepackaged, curricula? Is your child in<br/>\n  a grade as he would be if he were in an institutional setting? Do you<br/>\n  follow the institutionalized Scope & Sequence educational model? Or, have<br/>\n  you stepped completely out of the lock-step, institutional way of raising<br/>\n  your child? <br/>\n  This article is not intended to discourage, but to give hope. In most<br/>\n  parents’ hearts is the desire to reprioritize their lives around what is<br/>\n  truly important to them: having a relationship with their children. To<br/>\n  bring your children home can be an immense lifestyle change. For some,<br/>\n  making this change has to be done in stages. If you have brought your<br/>\n  children home it may have been necessary (for a season) to place before<br/>\n  them the ever popular &quot;curriculum-in-a-box.&quot; Hopefully, that season will<br/>\n  be short. Our children never went to school, were never in a grade, and<br/>\n  we never used a prepackaged curriculum. Nevertheless, it took us a while<br/>\n  to learn all that I am sharing with you here. Be encouraged. You are<br/>\n  allowed to do what your heart tells you is right. <br/>\n  IF WE AREN&#39;T HOMESCHOOLING, THEN WHAT ARE WE DOING? <br/>\n  Right now, nearly two million children are spending their days at home<br/>\n  rather than &quot;at school,&quot; thus putting an end to a 150 year &quot;detour&quot; which<br/>\n  began in the 1850’s and which seriously harmed family life and Kingdom<br/>\n  community as God initially intended them to be lived. As families leave<br/>\n  this detour and turn onto the road whose name is &quot;Life As It Was Intended<br/>\n  To Be,&quot; we will see vistas we have only read about in books. Let me offer<br/>\n  some suggestions. <br/>\n  1 | Don’t send your children to school. Any school. Bring them home.<br/>\n  Raise them to be the individuals God has created them to become. <br/>\n  2 | Don’t bring the school, any school (along with its &quot;efficient&quot;, but<br/>\n  arbitrary, grade levels, scope & sequence, and boxed curriculum) into<br/>\n  your home. Allow your children to learn through life and the<br/>\n  relationships around them. <br/>\n  3 | Learn how to awaken curiosity in your children. (This is the subject<br/>\n  of a future EJournal.) <br/>\n  4 | The only thing that should be prepackaged is your child. By this I<br/>\n  mean your child was born with all the talents, giftings, and callings put<br/>\n  into him or her since the foundation of the world. Find out what these<br/>\n  are and let your child become truly good at what you find. [For a fuller<br/>\n  discussion of this, order the Davis&#39; tape, &quot;Identity Directed<br/>\n  Homeschooling&quot;] <br/>\n  5 | Dad&#39;s heart must turn toward his children and the hearts of the<br/>\n  children must turn toward Dad. Ultimately, this may bring Dad out of the<br/>\n  corporate workforce to come home. This final step may take another<br/>\n  generation to be fulfilled. But, for it to be fulfilled, Dads must at<br/>\n  least begin moving in that direction (ie. Giving his children the option<br/>\n  of becoming entrepreneurs). <br/>\n  6 | In your own home, let &quot;homeschooling&quot; die. In other words, don&#39;t<br/>\n  homeschool your children. <br/>\n  God has asked us to raise a generation prepared for the future by<br/>\n  becoming exactly what He intended each person to become. This will be<br/>\n  different for each and every child. Your home is the place where the<br/>\n  acorn can become the oak tree. Or, the seed can become the maple tree.<br/>\n  Or, the other seed can become the pine tree. Plant your children squarely<br/>\n  in their own home and allow the individual God created to grow. <br/>\n  Chris Davis is the founder of the Elijah Company and a father of 4<br/>\n  children<br/>\n<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n              ADVERTISEMENT<br/>\n             <br/>\n       <br/>\n       <br/>\n<br/>\n  &quot;List Posting Policies&quot; are provided in the files area of this group. <br/>\n<br/>\n  To unsubscribe from this send an email to:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\n  Visit the Unschooling website and message boards: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] THE DAY HOMESCHOOLING DIES by Chris Davis","postDate":"1067021733","msgId":83199,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjOS4xMGRiZTVmZC4yY2NhY2ZhNUBhb2wuY29tPg=="},"prevInTopic":83198,"nextInTopic":83201,"prevInTime":83198,"nextInTime":83200,"topicId":83189,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/24/03 12:40:55 PM, Dnowens@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-1905828467\">In a message dated 10/24/03 12:40:55 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Dnowens@...\">Dnowens@...</a> writes:<br/>\n<br/>\n&lt;&lt; Here we are again! Where is Mom? I think she is in the laundry room <br/>\nwashing a <br/>\n<br/>\nmountain of clothes or in the kitchen preparing a meal and sneaking sips of <br/>\n<br/>\nthe wine she tells her husband she uses to flavor that favorite dish of his.  <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n<br/>\n </span></blockquote>NANCY, get out of my head, you spy!<br/>\n<br/>\nIn the past hour I have changed laundry, I have brought out and started on <br/>\nfood (for a potluck tonight, but still, yesterday I cooked TONS for home), and I <br/>\ntasted the Triple Sec I&#39;m going to use to steam the chicken.  Then I tasted <br/>\nit again. &lt;g&gt;  Then I sat down here and found that you saw the same stuff in <br/>\nthat article I saw.   Either YOU copied or I&#39;m not crazy.<br/>\n<br/>\n(No, wait--those aren&#39;t my only two options. &lt;bwg&gt;)<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] THE DAY HOMESCHOOLING DIES by Chris Davis","postDate":"1067021549","msgId":83198,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcwLjMzYzczOTc0LjJjY2FjZWVkQGFvbC5jb20+"},"prevInTopic":83197,"nextInTopic":83199,"prevInTime":83197,"nextInTime":83199,"topicId":83189,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/24/03 12:40:55 PM, Dnowens@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-1154809597\">In a message dated 10/24/03 12:40:55 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Dnowens@...\">Dnowens@...</a> writes:<br/>\n<br/>\n&lt;&lt; This idea of yesteryear being the ideal didn&#39;t start after this so called <br/>\non <br/>\n<br/>\ngeneration. There is a word for this, it slips my mind now. As for this idea <br/>\n<br/>\nof cultural memory, he also brings up another term of identity-dirrected <br/>\n<br/>\nhomeschooling, both which leave me thinking of nazism and racism. Chills. &gt;&gt;<br/>\n<br/>\nI PROMISE I DIDN&#39;T COPY OFF NANCY&#39;S PAPER!!<br/>\n<br/>\n(Gosh, all that talk of the good old days gave me bad school flashbacks!)<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":113028911,"authorName":"Dnowens@aol.com","from":"Dnowens@...","profile":"echomygecko","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] THE DAY HOMESCHOOLING DIES by Chris Davis","postDate":"1067020616","msgId":83197,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZhLjM3MDQ3MDQyLjJjY2FjYjQ4QGFvbC5jb20+"},"prevInTopic":83193,"nextInTopic":83198,"prevInTime":83196,"nextInTime":83198,"topicId":83189,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/24/03 11:02:50 AM Central Daylight Time, HMSL2@aol.com writes: This was posted to another list I am on. I thought this would be a good","messageBody":"<div id=\"ygrps-yiv-274732207\">In a message dated 10/24/03 11:02:50 AM Central Daylight Time, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HMSL2@...\">HMSL2@...</a> <br/>\nwrites:<br/>\nThis was posted to another list I am on. I thought this would be a good read <br/>\nfor new Unschooling parents and those struggling with not using a curricula. <br/>\nIt is long but worth the read. See below:<br/>\n<br/>\nLaura D<br/>\nMom to:<br/>\nDustin 12<br/>\nCassidy 4<br/>\nNicholas 18mo<br/>\nEDD 5/3/04<br/>\n##############<br/>\nI don&#39;t know if this really is the best thing to have new unschooling parents <br/>\nread. But me saying that smacks of censorship &lt;g&gt; I guess what I should say <br/>\nis that MY personal opinion is that there are hidden-read-between-the-lines <br/>\nthings in this article that makes it not as innocent as it seems.<br/>\n################<br/>\nit wasn’t until around the mid<br/>\n1800&#39;s that entire nations decided to take children out of the home and<br/>\n&quot;school&quot; them. I will briefly mention the two main causes for this<br/>\n&lt;snip&gt;<br/>\nFirst, in the mid-1800’s the Industrial Revolution began. &lt;snip&gt;<br/>\nAround this same time, another movement was taking shape: The Common<br/>\n(Public) School movement. The leaders of the Public School movement were,<br/>\nfor the most part, humanists who were concerned about two things they<br/>\nbelieved endangered America’s future: The continuation of what they<br/>\ncalled religious superstitious beliefs and the influx of illiterate<br/>\nimmigrants seeking jobs and a better life in this country. These leaders<br/>\nbelieved that realizing their two-fold goal of ridding our society of<br/>\nreligion and providing an education for immigrant children mandated<br/>\ncompulsory education for every child. Soon, the various states were<br/>\npassing compulsory attendance laws and children began to be public<br/>\nschooled en masse. <br/>\n##############<br/>\nWhile some of the public schools may have been started by so called <br/>\nhumanists, most if not almost all were started by small communities across the nation, <br/>\nlargely christian. One room school houses sometimes also the church (only <br/>\nchurch) in town as well. Single female teacher hired by the male *school board* <br/>\nand boarded by a family near the school. My own great grandmothers diary reads <br/>\nsomething like this; *A good strong, God fearing community. Asked if I would be <br/>\nattending church services locally, I had no problems answering in the <br/>\naffirmative. I only asked that I be boarded by a good Lutheran family, and the large <br/>\nman laughed jovially as if there were any question in the matter. Of course I <br/>\nwill not be seeing Otto for the term, teachers do not go out with gentlemen <br/>\nand certainly do not announce an engagement of marriage.* My g-grandma was <br/>\ncertainly not a humanist nor were the men who hired her. <br/>\n#################<br/>\n<br/>\nSo, as dads were leaving home with a promise of employment, children were<br/>\nalso leaving home with a promise of being made employable for the next<br/>\ngeneration. Within a very short period of time, the family unit that had<br/>\nbeen tightly held together for generations, became a set of individuals<br/>\ngoing their separate ways. To the factories went the dads. To the schools<br/>\nwent the kids. Where Mom went is the subject of another article. <br/>\n##################<br/>\nYes, we won&#39;t be reading much about Mom in the rest of this article. Where is <br/>\nMom? <br/>\n##################<br/>\n<br/>\nIt wasn’t long before people forgot what it was like to be a family with<br/>\nDad as the head of a &quot;family enterprise&quot; and the whole family working<br/>\ntogether as co-producers. In one generation, the cultural memory of<br/>\nchildren growing up at home was forgotten. <br/>\n<br/>\n########################<br/>\nThis idea of yesteryear being the ideal didn&#39;t start after this so called on <br/>\ngeneration. There is a word for this, it slips my mind now. As for this idea <br/>\nof cultural memory, he also brings up another term of identity-dirrected <br/>\nhomeschooling, both which leave me thinking of nazism and racism. Chills.<br/>\n########################<br/>\n<br/>\nIn the 1950&#39;s—one hundred years after the of the public school movement<br/>\nbegan—some middle class parents began to desire an educational experience<br/>\nfor their children whose curricula was more individualized. It was at<br/>\nthis time that the private school movement began. I attended one of these<br/>\nschools in what should have been my fourth grade. It was little more than<br/>\nan experimental school run by one man who was also the only teacher. He<br/>\ndidn’t like having one fourth grader, so I was skipped to fifth grade<br/>\nwhere there was one other student. I don&#39;t remember learning much, but it<br/>\nwas more fun than public school! <br/>\n<br/>\n#####################<br/>\nHe is talking about educational reform. Not some middle class movement. <br/>\nSchools across the country tried this or something like this for a year or two and <br/>\nthen someone else came along with a new idea. He spends his entire article <br/>\ntrying desperately to have us believe he doesn&#39;t believe in school=learning and <br/>\nlearing=school and brings the whole facade down in one small sentence. &quot;I don&#39;t <br/>\nremember learning much, but it was more fun than public school!&quot; Even he <br/>\nstill equates school with learning and that one year, failed attempt didn&#39;t work, <br/>\ni.e. he didn&#39;t &quot;learn&quot; the unsaid words here are *what he was supposed to.* as <br/>\nin what he implied, but didn&#39;t write is; &quot;I don&#39;t remember learning what I <br/>\nwas supposed to, but it was more fun than public school.&quot;<br/>\n######################<br/>\n<br/>\nDuring the Civil Rights years, the Christian school movement began along<br/>\nwith its own particular brand of curricula which was mainly<br/>\n&quot;Christianized&quot; public school material. The concept remained that<br/>\nchildren were to be brought out of their homes and taught by educators,<br/>\n(presumably Christian), who, because they were &quot;professionals&quot; would do a<br/>\nbetter job of training children than could the children’s parents. It<br/>\nseemed that parents would now get the best of both worlds: a public-style<br/>\neducation that was also Christian. <br/>\n<br/>\n##################<br/>\nWRONG! He really needs to reread his copy of Gatto! I think he must have <br/>\nmissed a chapter or five. Schools were until this time largely christian.<br/>\n################## <br/>\n<br/>\nAre the &quot;not-being-homeschooled&quot; children receiving a<br/>\nquality upbringing, including a quality education? Today enough research<br/>\nexists that I can honestly say an unequivocal &quot;yes&quot;. I would even go so<br/>\nfar as to say that the not-being-homeschooled child is receiving an<br/>\neducation which is superior to the child being homeschooled. [For a<br/>\nfuller discussion on this, see our article, &quot;Identity-Directed<br/>\nHomeschooling&quot;]. <br/>\n<br/>\n##############<br/>\nHere he tries to get the reader to believe that this *Identity-Directed <br/>\nHomeschooling* would be the same as unschooling. Notice he never uses the term <br/>\nunschooling, yet tries to imply to the reader that that is what he intends. One <br/>\nshould never equate identity-directed with unschooling, ever. <br/>\n##############<br/>\n<br/>\nThis article is not intended to discourage, but to give hope.&lt;snip&gt;<br/>\nBe encouraged. You are allowed to do what your heart tells you is right. <br/>\nIF WE AREN&#39;T HOMESCHOOLING, THEN WHAT ARE WE DOING? <br/>\nRight now, nearly two million children are spending their days at home<br/>\nrather than &quot;at school,&quot; thus putting an end to a 150 year &quot;detour&quot; which<br/>\nbegan in the 1850’s and which seriously harmed family life and Kingdom<br/>\ncommunity as God initially intended them to be lived. As families leave<br/>\nthis detour and turn onto the road whose name is &quot;Life As It Was Intended<br/>\nTo Be,&quot; we will see vistas we have only read about in books. <br/>\n<br/>\n#####################<br/>\nWhite supermacist propaganda. &quot;Kingdom community&quot; &quot;As God intended...&quot; &quot;Life <br/>\nas it was intended to be&quot; No Blacks in our neighborhood, no Jews in our <br/>\nclubs.. If people seriously don&#39;t believe there are christians out there <br/>\nhomeschooling their kids in this way, they really need to do some reading. No, not all <br/>\nchristians, but many.<br/>\n#####################<br/>\n<br/>\nDad&#39;s heart must turn toward his children and the hearts of the<br/>\nchildren must turn toward Dad. Ultimately, this may bring Dad out of the<br/>\ncorporate workforce to come home. This final step may take another<br/>\ngeneration to be fulfilled. But, for it to be fulfilled, Dads must at<br/>\nleast begin moving in that direction (i.e. Giving his children the option<br/>\nof becoming entrepreneurs). <br/>\n<br/>\n################<br/>\nHere we are again! Where is Mom? I think she is in the laundry room washing a <br/>\nmountain of clothes or in the kitchen preparing a meal and sneaking sips of <br/>\nthe wine she tells her husband she uses to flavor that favorite dish of his. <br/>\nReally though, in families like this mom is a teacher, dad is the principal, god <br/>\nis the superintendent. <br/>\n################<br/>\n<br/>\nGod has asked us to raise a generation prepared for the future by<br/>\nbecoming exactly what He intended each person to become. This will be<br/>\ndifferent for each and every child. Your home is the place where the<br/>\nacorn can become the oak tree. Or, the seed can become the maple tree.<br/>\nOr, the other seed can become the pine tree. Plant your children squarely<br/>\nin their own home and allow the individual God created to grow. <br/>\n<br/>\n################ <br/>\nNot really as individualistic as he would like us to believe.<br/>\n################<br/>\n<br/>\nChris Davis is the founder of the Elijah Company and a father of 4<br/>\nchildren<br/>\n<br/>\n################<br/>\nAnd he too has something to sell.<br/>\n<br/>\n~Nancy<br/>\n<br/>\nGenius may have its limitations, but stupidity is not thus handicapped. <br/>\nElbert Hubbard <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] THE DAY HOMESCHOOLING DIES by Chris Davis","postDate":"1067015694","msgId":83193,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYuMWIwNjU3NDAuMmNjYWI4MGVAYW9sLmNvbT4="},"prevInTopic":83189,"nextInTopic":83197,"prevInTime":83192,"nextInTime":83194,"topicId":83189,"numMessagesInTopic":0,"msgSnippet":"-=- thought this would be a good read for new Unschooling parents-=- Because it s not real history, I think it s NOT a good read for new unschooling parents. ","messageBody":"<div id=\"ygrps-yiv-778676455\">-=- thought this would be a good read <br/>\n<br/>\nfor new Unschooling parents-=-<br/>\n<br/>\nBecause it&#39;s not real history, I think it&#39;s NOT a good read for new <br/>\nunschooling parents.<br/>\n<br/>\n<br/>\n&lt;&lt; These leaders<br/>\n<br/>\nbelieved that realizing their two-fold goal of ridding our society of<br/>\n<br/>\nreligion and providing an education for immigrant children mandated<br/>\n<br/>\ncompulsory education for every child. &gt;&gt;<br/>\n<br/>\nThis is nonsense.<br/>\n<br/>\nMost of those early schools were HEAVILY Christian-based, and part of <br/>\nenculturation in the 19th century was learning to live as Christians or to shut up if <br/>\nyou weren&#39;t Christian.<br/>\n<br/>\n&lt;&lt;Within a very short period of time, the family unit that had<br/>\n<br/>\nbeen tightly held together for generations, became a set of individuals<br/>\n<br/>\ngoing their separate ways.&gt;&gt;<br/>\n<br/>\nThat article is Christian revisionist, simplified history.  Before the <br/>\nindustrial age, LOTS of kids were put out of the home, either to work (labor or <br/>\napprenticeship) and rich families were sending their kids to schools or to live <br/>\nwith richer families to increase their exposure and opportunity.  SOME kids <br/>\nstayed at home to learn the family trade, but it wasn&#39;t a happy peaceful existence <br/>\nfrom much of the records and reports, but harsh forced labor with physical <br/>\npunishments.<br/>\n<br/>\n&lt;&lt;It wasn’t long before people forgot what it was like to be a family with<br/>\n<br/>\nDad as the head of a &quot;family enterprise&quot; and the whole family working<br/>\n<br/>\ntogether as co-producers.&gt;&gt;<br/>\n<br/>\nThis kind of nostalgia for the agricultural past is called &quot;pastoralism,&quot; and <br/>\nit&#39;s existed for hundreds of years.   <br/>\n<br/>\n&lt;&lt;Of course, there was always a small group of families<br/>\n<br/>\nwhose children never attended public school. Typically, these were<br/>\n<br/>\nAmerican&#39;s wealthiest whose children received exclusive private<br/>\n<br/>\neducations in areas intended to prepare them for leadership in<br/>\n<br/>\ngovernment, education, science and business. &gt;&gt;<br/>\n<br/>\nA large group, actually; not so small in some parts of the country.  And not <br/>\nexclusively an American situation, but a long-time fact of educational life <br/>\nback before there was a U.S.<br/>\n<br/>\n&lt;&lt;Most Americans don’t realize<br/>\n<br/>\nthat public school was never intended to prepare leaders. It has always<br/>\n<br/>\nbeen intended to prepare employees.&gt;&gt;<br/>\n<br/>\n&quot;It&quot; when referring to John Taylor Gatto&#39;s American school history has to do <br/>\nwith industrial cities on the East coast in the waves of immigration in the <br/>\n1880s.  Gatto&#39;s view of history is a New Yorker&#39;s view of New York history, in <br/>\nmy opinion.   In the ACTUAL pastoral parts of the U.S. the schools were to <br/>\npromote literacy and citizenship.  This is documented out the wazoo, but Gatto <br/>\ndidn&#39;t address the local one-room-schoolhouse models which existed in most of the <br/>\nU.S.<br/>\n<br/>\n&lt;&lt;In the 1950&#39;s—one hundred years after the of the public school movement<br/>\n<br/>\nbegan—some middle class parents began to desire an educational experience<br/>\n<br/>\nfor their children whose curricula was more individualized. It was at<br/>\n<br/>\nthis time that the private school movement began. &gt;&gt;<br/>\n<br/>\nThis talk of &quot;movements&quot; is another falsehood.<br/>\n<br/>\n&lt;&lt;I attended one of these<br/>\n<br/>\nschools in what should have been my fourth grade. It was little more than<br/>\n<br/>\nan experimental school run by one man who was also the only teacher. He<br/>\n<br/>\ndidn’t like having one fourth grader, so I was skipped to fifth grade<br/>\n<br/>\nwhere there was one other student.&gt;&gt;<br/>\n<br/>\nHe&#39;s talking abut educational reform, if he&#39;s talking about experimental <br/>\nschools.  School reform wasn&#39;t &quot;a private school movement.&quot;  That was the research <br/>\nand activity out of which unschooling came.<br/>\n<br/>\n&lt;&lt;During the Civil Rights years, the Christian school movement began along<br/>\n<br/>\nwith its own particular brand of curricula which was mainly<br/>\n<br/>\n&quot;Christianized&quot; public school material. The concept remained that<br/>\n<br/>\nchildren were to be brought out of their homes and taught by educators,<br/>\n<br/>\n(presumably Christian), who, because they were &quot;professionals&quot; would do a<br/>\n<br/>\nbetter job of training children than could the children’s parents. It<br/>\n<br/>\nseemed that parents would now get the best of both worlds: a public-style<br/>\n<br/>\neducation that was also Christian. &gt;&gt;<br/>\n<br/>\nParochial schools were already strongly established (though they took MUCH <br/>\nlegal wrangling to get the government to relax about) so that Catholic kids <br/>\nwerne&#39;t being subjected to the Protestant-leaning curriculum which already existed.<br/>\n<br/>\nThe &quot;Christian school movement&quot; he&#39;s talking about is another lie-with-terms. <br/>\n They wanted whites-only schools.  How many African Americans were not <br/>\nChristian?  But calling it the &quot;White Christian school movement which wants their <br/>\nkids not to be with Jews or black kids&quot; sounds so...  honestly what it was!<br/>\n<br/>\n&lt;&lt;This is understandable<br/>\n<br/>\nwhen we realize that there is no cultural memory of what having our<br/>\n<br/>\nchildren home really means to the family or to society. &gt;&gt;<br/>\n<br/>\nThis just made me shudder.<br/>\n&quot;Cultural memory&quot; is another white supremist buzzword.<br/>\n<br/>\n-=-[For a fuller discussion on this, see our article, &quot;Identity-Directed<br/>\n<br/>\nHomeschooling&quot;]. -=-<br/>\n<br/>\n&quot;Identity&quot; is another one.<br/>\n<br/>\n-=-If I were starting over again, when the<br/>\n<br/>\nlady at the store says, &quot;You boys aren&#39;t in school today?&quot; I would teach<br/>\n<br/>\nthe boys to say, simply, &quot;No ma&#39;am,&quot; and let it go at that. -=-<br/>\n<br/>\nI didn&#39;t teach my kids what to say.  Y&#39;know what they say?<br/>\n&quot;We don&#39;t go to school.&quot;<br/>\n<br/>\n-=-Many parents<br/>\n<br/>\npurchase prepackaged curricula because they don&#39;t understand what God<br/>\n<br/>\noriginally intended when He began this movement over twenty years ago. -=-<br/>\n<br/>\nI&#39;m really not comfortable with this list being a conduit for what someone <br/>\nthinks God intended, and being from New Mexico where there were alternative <br/>\nschools since the 60&#39;s and where alternative education was taught at the <br/>\nuniversity in the late 60&#39;s and early 70&#39;s, I know for a fact that the unschooling this <br/>\nlist has been about is NOT part of anything that guy&#39;s God might have <br/>\n&quot;originally intended&quot; over 20 years ago.  <br/>\n<br/>\nThat whole article is part of the Christian propaganda base of that <br/>\n&quot;movement&quot; which some people even on this list still don&#39;t seem to believe exists.<br/>\n<br/>\n-=-. . .thus putting an end to a 150 year &quot;detour&quot; which<br/>\n<br/>\nbegan in the 1850’s and which seriously harmed family life and Kingdom<br/>\n<br/>\ncommunity as God initially intended them to be lived. -=-<br/>\n<br/>\nMaybe you could bring some links to this list so people who are interested in <br/>\n&quot;the Kingdom Community&quot; could go somewhere else and read about it, because it <br/>\ngags me to have it here.<br/>\n<br/>\n-=-Dad&#39;s heart must turn toward his children and the hearts of the<br/>\n<br/>\nchildren must turn toward Dad.-=-<br/>\n<br/>\nWhere&#39;s mom?<br/>\nProbably doing what dad says to do.<br/>\nIf you look into the Christian homeschooling stuff further, they refer to <br/>\ndads and the principals and moms as the teachers.<br/>\n<br/>\nLet&#39;s talk about how kids can learn from the world WITHOUT tying it in with <br/>\nGod&#39;s personal movement to restore the families to Bible Belt fundamentalist <br/>\nChristian values.<br/>\n<br/>\nIf you want to read more about what that guy believes, here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.elijahco.com/help/index2.htm\">http://www.elijahco.com/help/index2.htm</a><br/>\n(And YES! He has something to sell.)<br/>\n<br/>\nA quote:<br/>\n-=-Christians don&#39;t speak much of &quot;destiny&quot; anymore, mainly because it has <br/>\nbecome a catch-word among humanists and New Agers. But we need to look again at <br/>\nthe concept of destiny. The Bible is full of hints that each one of us is <br/>\ncreated for a specific time and purpose in God&#39;s unfolding plan. Ephesians 2: 10 <br/>\neven says we each have &quot;good works which God predestined for us&quot; before the <br/>\nworld was ever created. Before time began, God had your son or daughter on His <br/>\nmind, He chose your child, and He prearranged a life for him or her to live. So <br/>\nparents, those teenagers in your home are not just biological events. They are <br/>\nbeings pre-determined by God and destined to, just as the Bible says of <br/>\nDavid, &quot;serve their generation well.&quot;-=-<br/>\n<br/>\nSo he understands &quot;catch-word&quot; problems, yet he&#39;s using &quot;cultural memory&quot; <br/>\n(one step from racial memory) and &quot;identity,&quot; both of which triggered me to think <br/>\nof KKK and such.<br/>\n<br/>\n-=-A special plea to fathers: I am convinced that one of the most important <br/>\nresponsibilities a father has is to identify his children. What do I mean by <br/>\n&quot;identify?&quot; I mean that he helps his children know who they really are.-=-<br/>\n<br/>\nHere&#39;s what he says about &quot;identity,&quot; though.  It&#39;s something fathers do.<br/>\n<br/>\nThat stuff is about Christianity in quite a political way, not much about <br/>\nunschooling.<br/>\n<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":126884268,"authorName":"HMSL2@aol.com","from":"HMSL2@...","profile":"dobsiedoe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"THE DAY HOMESCHOOLING DIES by Chris Davis","postDate":"1067011172","msgId":83189,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyOS4zMzk4ZDE1NC4yY2NhYTY2NEBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":83193,"prevInTime":83188,"nextInTime":83190,"topicId":83189,"numMessagesInTopic":0,"msgSnippet":"This was posted to another list I am on. I thought this would be a good read for new Unschooling parents and those struggling with not using a curricula. It is","messageBody":"<div id=\"ygrps-yiv-1741878931\">This was posted to another list I am on. I thought this would be a good read <br/>\nfor new Unschooling parents and those struggling with not using a curricula. <br/>\nIt is long but worth the read. See below:<br/>\n<br/>\nLaura D<br/>\nMom to:<br/>\nDustin 12<br/>\nCassidy 4<br/>\nNicholas 18mo<br/>\nEDD 5/3/04<br/>\n<br/>\nTHE DAY HOMESCHOOLING DIES<br/>\nEmail | 21 Oct 03 | Chis Davis<br/>\nPosted on 10/21/2003 7:15 PM EDT by SLB<br/>\nMy oldest son, Seth, was homeschooled the entire time he lived at home.<br/>\nThis past summer, as he and I were discussing his upbringing, I had a<br/>\nrealization about this movement we all call &quot;homeschooling,&quot; and I said<br/>\nto Seth, &quot;When you have kids, they will not be public schooled. They<br/>\nwon&#39;t be private schooled. They won&#39;t be Christian schooled.&quot; <br/>\n&quot;And,&quot; I concluded, &quot;your kids won&#39;t be home schooled, either.&quot; <br/>\nThe realization I had while talking with Seth is that God had begun<br/>\nsomething twenty years ago that came to be called &quot;homeschooling,&quot; but<br/>\nwhich really wasn \u0019t about schooling at all. Here&#39;s what I mean. <br/>\nTHE COLLAPSE OF THE FAMILY <br/>\nFor thousands of years children have grown up in what today would be<br/>\nconsidered an unnatural place—the home. In this setting, parents never<br/>\nthought of themselves as &quot;home schoolers.&quot; There was no alternative to<br/>\nchildren spending their days at home, having knowledge, experiences and<br/>\ncharacter passed to them by their parents and extended family. What<br/>\nchildren needed to know, they learned as part of their daily lives:<br/>\nsowing and reaping, weather, how a business works, how to treat customers<br/>\n(and everyone else, for that matter). Life was their education. <br/>\nThroughout history, small, homogeneous groups have attempted to provide a<br/>\ncommon education for their youth, yet it wasn’t until around the mid<br/>\n1800&#39;s that entire nations decided to take children out of the home and<br/>\n&quot;school&quot; them. I will briefly mention the two main causes for this<br/>\n<br/>\ndramatic change in the way we began raising our children. Interestingly,<br/>\nboth occurred at approximately the same time. <br/>\nFirst, in the mid-1800’s the Industrial Revolution began. The new<br/>\nfactories needed laborers and the siren call went out for men to leave<br/>\ntheir homes and be paid a salary (something new for most men). The<br/>\npossibility of being able to increase one’s family&#39;s standard of living<br/>\nwas the draw that caused men to cease being patriarchs of a family<br/>\nenterprise and become employees. <br/>\nAround this same time, another movement was taking shape: The Common<br/>\n(Public) School movement. The leaders of the Public School movement were,<br/>\nfor the most part, humanists who were concerned about two things they<br/>\nbelieved endangered America’s future: The continuation of what they<br/>\ncalled religious superstitious beliefs and the influx of illiterate<br/>\nimmigrants seeking jobs and a better life in this country. These leaders<br/>\nbelieved that realizing their two-fold goal of ridding our society of<br/>\nreligion and providing an education for immigrant children mandated<br/>\ncompulsory education for every child. Soon, the various states were<br/>\npassing compulsory attendance laws and children began to be public<br/>\nschooled en masse. <br/>\nSo, as dads were leaving home with a promise of employment, children were<br/>\nalso leaving home with a promise of being made employable for the next<br/>\ngeneration. Within a very short period of time, the family unit that had<br/>\nbeen tightly held together for generations, became a set of individuals<br/>\ngoing their separate ways. To the factories went the dads. To the schools<br/>\nwent the kids. Where Mom went is the subject of another article. <br/>\nIt wasn’t long before people forgot what it was like to be a family with<br/>\nDad as the head of a &quot;family enterprise&quot; and the whole family working<br/>\ntogether as co-producers. In one generation, the cultural memory of<br/>\nchildren growing up at home was forgotten. Children belonged &quot;in school&quot;<br/>\nduring the most productive hours of their day, learning whatever would<br/>\nmake them employable, becoming independent, establishing strong<br/>\nfriendships that replaced the bonds of family. And what had been a<br/>\nlifestyle of learning became &quot;book learning&quot; as learning became separated<br/>\nfrom real life. Of course, there was always a small group of families<br/>\nwhose children never attended public school. Typically, these were<br/>\nAmerican&#39;s wealthiest whose children received exclusive private<br/>\neducations in areas intended to prepare them for leadership in<br/>\ngovernment, education, science and business. Most Americans don’t realize<br/>\nthat public school was never intended to prepare leaders. It has always<br/>\nbeen intended to prepare employees. [For a fuller understanding of this<br/>\nsubject, read John Gatto&#39;s books, The Underground History of American<br/>\nEducation, A Different Kind of Teacher, and Dumbing us Down]. <br/>\nHOW SHOULD WE THEN SCHOOL? <br/>\nIn the 1950&#39;s—one hundred years after the of the public school movement<br/>\nbegan—some middle class parents began to desire an educational experience<br/>\nfor their children whose curricula was more individualized. It was at<br/>\nthis time that the private school movement began. I attended one of these<br/>\nschools in what should have been my fourth grade. It was little more than<br/>\nan experimental school run by one man who was also the only teacher. He<br/>\ndidn’t like having one fourth grader, so I was skipped to fifth grade<br/>\nwhere there was one other student. I don&#39;t remember learning much, but it<br/>\nwas more fun than public school! <br/>\nDuring the Civil Rights years, the Christian school movement began along<br/>\nwith its own particular brand of curricula which was mainly<br/>\n&quot;Christianized&quot; public school material. The concept remained that<br/>\nchildren were to be brought out of their homes and taught by educators,<br/>\n(presumably Christian), who, because they were &quot;professionals&quot; would do a<br/>\nbetter job of training children than could the children’s parents. It<br/>\nseemed that parents would now get the best of both worlds: a public-style<br/>\neducation that was also Christian. <br/>\nThen, in the late 1970&#39;s and early 1980&#39;s, a new schooling movement<br/>\nbegan. All over the country, parents began keeping their children home<br/>\ninstead of sending them to one of the other schooling options. Some<br/>\nparents made this decision out of concern for their children’s safety.<br/>\nOthers didn’t like the education their children were receiving. However,<br/>\nthe majority decided to keep their children home simply because they<br/>\nwanted a relationship with them and parents didn’t think this could<br/>\nhappen very well if the kids were gone all day long. It was quite a novel<br/>\n(and controversial) idea that children should be kept home during the<br/>\nschooling hours of the day. <br/>\nSo, today, parents have several choices as to how their children might be<br/>\neducated: <br/>\nPublic School Private School Christian School Home School <br/>\nNote that the above choices relate to where and how the child is<br/>\neducated. In the past 150 years we have changed the first word, but we<br/>\nhave not changed the last word, &quot;School.&quot; Each choice still emphasizes<br/>\nthe fact that children are to be &quot;schooled.&quot; <br/>\nA MISUNDERSTOOD MOVEMENT? <br/>\nI don&#39;t know how keeping our children home during the day came to be<br/>\nknown as &quot;Home Schooling,&quot; but I do have a theory: If I asked most<br/>\nadults, &quot;What is the appropriate activity for every child, age six to age<br/>\neighteen, during the days Monday through Friday?&quot; Most adults would say,<br/>\n&quot;These are the years when a child is being schooled, of course.&quot; That is<br/>\nwhy we have such phrases in our vocabulary as the &quot;school age child.&quot; So,<br/>\nif a child is to be &quot;schooled&quot; during these formative years, the only<br/>\nreal question is, &quot;Where will he be schooled?&quot; Today, the answer is, &quot;He<br/>\nwill either be public schooled, private schooled, Christian schooled, or<br/>\nhome schooled.&quot; <br/>\nAssuming, then, that every child is to &quot;be schooled&quot; during the day, if<br/>\nhe is home during the day, he will be home schooled during the day. Hence<br/>\nthe origin of the label &quot;homeschooling.&quot; <br/>\nIs &quot;schooling&quot; really supposed to be a child’s primary daily activity? It<br/>\nwasn’t until the advent of the modern public school movement. Schooling a<br/>\nchild was never meant to be the &quot;constant&quot; with the variable being where<br/>\nthe child spends his or her day. It has always been just the other way<br/>\naround. <br/>\nWhat is so problematic with the term &quot;Home Schooling&quot; is what it has done<br/>\nto parents whose children are spending their days at home. Giving an<br/>\nactivity a label means something to those involved in the activity. If we<br/>\nare comfortable with certain words in the label and not so comfortable<br/>\nwith other words, those words with which we feel least secure will take<br/>\non greater significance. Insecurity is a nice word for fear. Whatever we<br/>\nfear becomes a driver in our lives as we attempt to overcome our fear and<br/>\nfeel secure again. <br/>\nWhen we sent our children to school, we felt a sense of security that<br/>\ntrained professionals were educating them. We didn&#39;t pretend that we<br/>\ncould do a job which others had spent years being trained to do. We might<br/>\nfeel that we could raise our children in some areas, but not to provide<br/>\nfor their education. <br/>\nThen, one day, we became homeschoolers. Insecure homeschooler; but<br/>\nhomeschoolers nevertheless. However, since what we were doing was labeled<br/>\n&quot;homeschooling,&quot; we, in our insecurity, actually became home-SCHOOLERS<br/>\nrather than HOME-schoolers. The importance of our children becoming<br/>\neducated (isn&#39;t that what children do during the day?) took on greater<br/>\nprominence than the importance of them being home. This is understandable<br/>\nwhen we realize that there is no cultural memory of what having our<br/>\nchildren home really means to the family or to society. <br/>\nWhat did I mean when I told my son, &quot;And, your kids won&#39;t be<br/>\nhomeschooled&quot;? During Seth&#39;s years at home, his academic education was<br/>\nnever the main priority. In our home, we did have a rigid priority<br/>\nstructure, but those priorities were first relationships; second,<br/>\npractical skills; and, finally, academics. Seth grew up with a strong<br/>\nacademic upbringing, but academics were never our priority. Seth is a<br/>\nskilled, very competent individual of the highest character. He is also<br/>\none of the happiest young men I have ever known. As I look back at Seth&#39;s<br/>\ntime at home, I have come to realize that he was never &quot;homeschooled.&quot; He<br/>\nsimply grew up in a most remarkable place—his home <br/>\nWhen our children were young we would take them with us to the store.<br/>\nOther kids were in school. The check-out lady would inevitably ask, &quot;You<br/>\nboys aren’t in school today?&quot; Since the boys knew we were homeschoolers,<br/>\nthey would respond, &quot;No, ma’am, we’re homeschooled.&quot; <br/>\nSTARTING OVER <br/>\nIf I could do it all over again, I would not call ourselves<br/>\n&quot;homeschoolers.&quot; I have actually come to dislike the term because I think<br/>\nit creates significant problems. If I were starting over again, when the<br/>\nlady at the store says, &quot;You boys aren&#39;t in school today?&quot; I would teach<br/>\nthe boys to say, simply, &quot;No ma&#39;am,&quot; and let it go at that. <br/>\nIn just the past year I have noticed a growing distinction between<br/>\nfamilies who are homeschooling and those whose children are home, but not<br/>\nbeing homeSCHOOLED. Are the &quot;not-being-homeschooled&quot; children receiving a<br/>\nquality upbringing, including a quality education? Today enough research<br/>\nexists that I can honestly say an unequivocal &quot;yes&quot;. I would even go so<br/>\nfar as to say that the not-being-homeschooled child is receiving an<br/>\neducation which is superior to the child being homeschooled. [For a<br/>\nfuller discussion on this, see our article, &quot;Identity-Directed<br/>\nHomeschooling&quot;]. <br/>\nThe availability of what has come to be known as &quot;prepackaged curricula&quot;<br/>\nis helping manifest a separation of the two types of families who were<br/>\nonce grouped together under the one term: &quot;homeschoolers.&quot; Many parents<br/>\npurchase prepackaged curricula because they don&#39;t understand what God<br/>\noriginally intended when He began this movement over twenty years ago. <br/>\nWhat do you think your children should be doing all day now that they are<br/>\nhome? Probably the most obvious way to determine what you really believe<br/>\nis to ask yourself, &quot;Is my child the constant or is my child’s education<br/>\nthe constant?&quot; Look at the materials you use to bring learning into your<br/>\nchild’s life. Do you use graded, prepackaged, curricula? Is your child in<br/>\na grade as he would be if he were in an institutional setting? Do you<br/>\nfollow the institutionalized Scope & Sequence educational model? Or, have<br/>\nyou stepped completely out of the lock-step, institutional way of raising<br/>\nyour child? <br/>\nThis article is not intended to discourage, but to give hope. In most<br/>\nparents’ hearts is the desire to reprioritize their lives around what is<br/>\ntruly important to them: having a relationship with their children. To<br/>\nbring your children home can be an immense lifestyle change. For some,<br/>\nmaking this change has to be done in stages. If you have brought your<br/>\nchildren home it may have been necessary (for a season) to place before<br/>\nthem the ever popular &quot;curriculum-in-a-box.&quot; Hopefully, that season will<br/>\nbe short. Our children never went to school, were never in a grade, and<br/>\nwe never used a prepackaged curriculum. Nevertheless, it took us a while<br/>\nto learn all that I am sharing with you here. Be encouraged. You are<br/>\nallowed to do what your heart tells you is right. <br/>\nIF WE AREN&#39;T HOMESCHOOLING, THEN WHAT ARE WE DOING? <br/>\nRight now, nearly two million children are spending their days at home<br/>\nrather than &quot;at school,&quot; thus putting an end to a 150 year &quot;detour&quot; which<br/>\nbegan in the 1850’s and which seriously harmed family life and Kingdom<br/>\ncommunity as God initially intended them to be lived. As families leave<br/>\nthis detour and turn onto the road whose name is &quot;Life As It Was Intended<br/>\nTo Be,&quot; we will see vistas we have only read about in books. Let me offer<br/>\nsome suggestions. <br/>\n1 | Don’t send your children to school. Any school. Bring them home.<br/>\nRaise them to be the individuals God has created them to become. <br/>\n2 | Don’t bring the school, any school (along with its &quot;efficient&quot;, but<br/>\narbitrary, grade levels, scope & sequence, and boxed curriculum) into<br/>\nyour home. Allow your children to learn through life and the<br/>\nrelationships around them. <br/>\n3 | Learn how to awaken curiosity in your children. (This is the subject<br/>\nof a future EJournal.) <br/>\n4 | The only thing that should be prepackaged is your child. By this I<br/>\nmean your child was born with all the talents, giftings, and callings put<br/>\ninto him or her since the foundation of the world. Find out what these<br/>\nare and let your child become truly good at what you find. [For a fuller<br/>\ndiscussion of this, order the Davis&#39; tape, &quot;Identity Directed<br/>\nHomeschooling&quot;] <br/>\n5 | Dad&#39;s heart must turn toward his children and the hearts of the<br/>\nchildren must turn toward Dad. Ultimately, this may bring Dad out of the<br/>\ncorporate workforce to come home. This final step may take another<br/>\ngeneration to be fulfilled. But, for it to be fulfilled, Dads must at<br/>\nleast begin moving in that direction (ie. Giving his children the option<br/>\nof becoming entrepreneurs). <br/>\n6 | In your own home, let &quot;homeschooling&quot; die. In other words, don&#39;t<br/>\nhomeschool your children. <br/>\nGod has asked us to raise a generation prepared for the future by<br/>\nbecoming exactly what He intended each person to become. This will be<br/>\ndifferent for each and every child. Your home is the place where the<br/>\nacorn can become the oak tree. Or, the seed can become the maple tree.<br/>\nOr, the other seed can become the pine tree. Plant your children squarely<br/>\nin their own home and allow the individual God created to grow. <br/>\nChris Davis is the founder of the Elijah Company and a father of 4<br/>\nchildren<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":83219,"nextTopicId":83191}}