{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"stephaniecurrier@xxxxxxxxxx.xxx","from":"stephaniecurrier@...","replyTo":"LIST","senderId":"hHOoD8kFJxAtiOYrt-1cU5yUexFR1Q7vougphxIXKyClqInATUwpR-I1BPVYSndjfSrX3o84hwEVfDtVSq-vb7QUA2e4SQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Unschooling Highschoolers","postDate":"930059481","msgId":1221,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy45Mi4xMjIxLjk1OTI2OTc0MEBlR3JvdXBzLmNvbT4="},"prevInTopic":1219,"nextInTopic":0,"prevInTime":1220,"nextInTime":1222,"topicId":1219,"numMessagesInTopic":0,"msgSnippet":"... to get special permission. He passed it the first time without studying anything.  ","messageBody":"<div id=\"ygrps-yiv-402101760\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt; He got his GED at 16, for which I had<br/>\n </span></blockquote>to get special permission. He passed it the first time without studying<br/>\nanything.  &lt;&lt;&lt;&lt;<br/>\n<br/>\nSo did I.<br/>\nWell, I was 17, but I had spent more time out of school than in for the few<br/>\nyears before that. My home life was nuts and I wanted to start earning a<br/>\nliving. :)<br/>\n<br/>\nI then went to community college, learned to love learning again, became the<br/>\nyoungest manager ever at the retail store I worked in, and supported myself.<br/>\nI regret not pushing through to finish my bachelor&#39;s degree right then and<br/>\nthere since I&#39;m still working on it at a snail&#39;s pace, but I don&#39;t regret<br/>\nbypassing those highschool years at all.<br/>\n<br/>\nFunny that I mentioned this to dh last night. I didn&#39;t study at all. I<br/>\ndidn&#39;t even get stressed out over it or *try.* I just knew how to take<br/>\ntests.<br/>\n<br/>\nI do tend to like the idea of kids learning to take tests somewhere during<br/>\nthe course of their schooling. I know many don&#39;t, and I understand why they<br/>\ndon&#39;t, but I have found it to be a rather valuable skill-albeit a deceptive<br/>\none. ;-)<br/>\n<br/>\nI also would hope that my kids won&#39;t be in such a hurry to leave the house.<br/>\nI hope they take their time deciding how they want to achieve their dreams.<br/>\nDh and I work hard to create an environment where I pray that they&#39;ll be<br/>\nnurtured, mentally stimulated, supported, and somewhat contented~so I expect<br/>\nthat this will be the case~but we&#39;ll see won&#39;t we. LOL<br/>\n<br/>\nSteph</div>","specialLinks":[]},{"userId":0,"authorName":"Leslie Montemayor","from":"Leslie Montemayor &lt;montemayor@...","replyTo":"LIST","senderId":"J2A_64MmtV5L-kyT_OHgUHXSohdVhNkD-P4oNrFsQFBIKrE3uZuj5Gmibm-Lq4bvh86W-XbASHTsBOTUgrpY5WydV4uQdGCJj1aMl4ywf8lYsqgt","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Unschooling Highschoolers","postDate":"930056676","msgId":1219,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy45Mi4xMjE5Ljk1OTI2OTc0MEBlR3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":1221,"prevInTime":1218,"nextInTime":1220,"topicId":1219,"numMessagesInTopic":0,"msgSnippet":"Hi, This is the first time I ve posted here so I ll let you know a little about us.  We have been un-schooling for almost 4 years now.  I was brought to this","messageBody":"<div id=\"ygrps-yiv-209889669\">Hi,<br/>\n<br/>\nThis is the first time I&#39;ve posted here so I&#39;ll let you know a little about<br/>\nus.  We have been un-schooling for almost 4 years now.  I was brought to<br/>\nthis by my oldest 18yo ds.  When he entered 9th grade he decided he was not<br/>\ndoing anything they told him to.  No school work at all.  I tried and tried<br/>\nto work within the system and lo and behold discovered that the system was<br/>\nall lip service.  I pulled him out.  He got his GED at 16, for which I had<br/>\nto get special permission. He passed it the first time without studying<br/>\nanything.  (why waste 4 years in high school if you can do this?)  Anyway<br/>\nthe next year my younger son came home and the next year my oldest daughter<br/>\nand the next year my middle daughter.  My youngest will never set foot in a<br/>\nps.  I have a wonderfully supportive husband that I&#39;ve been married to for<br/>\nalmost 21 years.  <br/>\n<br/>\nNow as to un-schooling high schoolers.........My oldest never understood<br/>\nwhat I was trying to do with his education.  He still feels like he is a<br/>\ndropout instead of a drop in.  It is hard to watch someone not be able to<br/>\nsee all the good things about himself because he can&#39;t see outside the<br/>\nmold.  We are still working on these things with him and trying to help<br/>\nformulate a plan for his life.  My oldest daughter 14, is returning to ps<br/>\nthis fall.  I am very against this and she knows it.  We live in Conyers,<br/>\nGA where the school shooting was.  She is doing a project on school<br/>\nviolence and social hierarchy(sp) of high schools this summer so maybe she<br/>\nwill be more prepared for what she is getting into.  There are very few<br/>\nolder home-schoolers in our area and as she put it the ones she has met are<br/>\nweird(her word not mine).  She is VERY social and that is why she wants to<br/>\ngo back.  She tried to attend an eighth grade dance with a friend at a<br/>\nlocal middle school and was asked to leave.  I don&#39;t want her in ps but I<br/>\nhave made her in charge of her education and this is how she wants to get<br/>\nit.  I may have to pull her out if things get too bad but right now we are<br/>\ngoing there.  <br/>\n<br/>\nThe other three 12yo ds, 8yo dd, 4yo dd are happy at home.  They love<br/>\nun-schooling and are happy to not be in ps.  I am the co-leader of an<br/>\ninclusive support group and we are actively recruiting new members,<br/>\nhopefully some will be older.  However, we live right outside Atlanta and<br/>\nthere are several groups that have teen activities that we can participate<br/>\nin if we choose.  We pick and choose as the activities are open to all not<br/>\njust the group that sponsors them.  That seems to be the best way to get<br/>\nthe teens together around here.<br/>\n<br/>\nOur local school system does not allow home-schoolers on campus or to<br/>\nparticipate in any school function.  It seems to me that most of the<br/>\npschoolers I talk to don&#39;t enjoy these things anyway.  They are forced to<br/>\nbe in band etc.. so it is not enjoyable to them.  <br/>\n<br/>\nWell anyway that is my .02 cents on the subject.  I do think that<br/>\nun-schooling high schoolers that have ps ingrained into them and haven&#39;t<br/>\nproperly de-schooled is a hard thing to do.<br/>\n<br/>\nThanks for reading.<br/>\n<br/>\nLeslie</div>","specialLinks":[]}],"prevTopicId":1213,"nextTopicId":1228}}