{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":3381156,"authorName":"Ingrid Bauer","from":"&quot;Ingrid Bauer&quot; &lt;instinct@...&gt;","profile":"natural_wisdom2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"NVC Parent Peer Leadership Program--correction!","postDate":"1140892911","msgId":112415,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwOGIwMWM2M2EzYiRlMTUyMGM1MCQ0OGIxYjVkMEBpbmdyaWRzbGFwdG9wPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":112414,"nextInTime":112416,"topicId":112415,"numMessagesInTopic":0,"msgSnippet":"Hi all, I was so disappointed to learn that my last email about the NVC Parent Peer Leadership Program contained an incorrect email address for returning the","messageBody":"<div id=\"ygrps-yiv-245252140\">Hi all,<br/>\n<br/>\n<br/>\n<br/>\nI was so disappointed to learn that my last email about the NVC Parent Peer Leadership Program contained an incorrect email address for returning the questionaire. I regret any inconvencience. Here is the email again with the correct address (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nvcparenting@...\">nvcparenting@...</a>). <br/>\n<br/>\nwarmly,<br/>\n<br/>\ningrid<br/>\n<br/>\nDear Friends,<br/>\n<br/>\nI¹m excited to let you know about the NVC Parent Peer Leadership Program, a new program of the Peaceful Families, Peaceful World Project that I coordinate jointly for the Center for Nonviolent Communication and BayNVC. Modeled after the highly successful North American NVC Leadership Program that I have been co-directing for the past four years ( <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.baynvc.org/leadership_program.php\">http://www.baynvc.org/leadership_program.php</a> ), the Parent Peer Leadership Program is specifically aimed at nurturing and developing peer leaders who are committed to spreading NVC to parents in their communities, especially where there are no NVC trainers.<br/>\n<br/>\nThe idea of training peer leaders is inspired by the La Leche League¹s model of lay leadership as a way to reach more parents while building local communities. Using this model, we hope to reach parents around the world with consciousness, skills and support that are critical to making peace within families and in our world. With the training they receive, participants in the program will agree to initiate and lead NVC groups for parents in their communities free of charge for at least one year, so that NVC can be spread to additional parents regardless of their ability to pay. I am thrilled about the potential of this program to contribute to realizing the mission of CNVC&#39;s Peaceful Families, Peaceful World Project: to support families to live with compassion, connection and peace and to develop consciousness and skills that contribute to peace in the world.<br/>\n<br/>\nWe are hoping to hear back as soon as possible from any of you who might be interested in participating in this program, so we can determine the extent of interest and begin to plan logistically and financially. To this end, if you think you may be interested in participating, we ask you to respond to a short questionnaire at the end of this letter immediately, or by March 1 at the latest. <br/>\n<br/>\nHere are some details that will help you assess whether this program is of interest to you: <br/>\n<br/>\nDates & Location: The Parent Peer Leadership Program (PPLP) begins in August 2006 and runs through April 2007. The only residential aspect of the program is a family camp that will take place in Northern California from August 21-28. Everything else will happen from your home.<br/>\n<br/>\nParticipants: We have space for a total of 20 participants from around the U.S. and Canada. (People from outside North America are also welcome.) We anticipate that most participants will be parents, but non-parents who want to focus primarily on sharing NVC with parents are also welcome. <br/>\n<br/>\nProgram Components: The PPLP includes a week-long Family Camp (August 21-28), weekly study assignments, twice-a-month teleclasses, weekly buddy support, and individualized tele-support from Program Assistants. We anticipate that the non-residential parts of the program ­ reading, writing, phone calls - will involve a 4-8 hour weekly commitment from participants. Our hope and plan is that all participants will initiate and lead parent groups focused on empathy and NVC practice in their local communities starting in February 2007, and for at least one year after the end of the program.<br/>\n<br/>\nNote that this program does not lead to certification as a CNVC Certified Trainer, though it can vitally support the process that leads to certification and the training hours count toward certification. (For more information on the certification process see <a rel=\"nofollow\" target=\"_blank\" href=\"http://cnvc.org/trnrtobe_en.htm\">http://cnvc.org/trnrtobe_en.htm</a> . For information on sharing NVC without certification see <a rel=\"nofollow\" target=\"_blank\" href=\"http://cnvc.org/guidelines_en.htm\">http://cnvc.org/guidelines_en.htm</a> .)<br/>\n<br/>\nRequested Experience: At a minimum, we request that all participants have the following experiences with NVC:<br/>\no Commitment to bringing NVC to one¹s inner life and family life for at least 9 months before applying to the program. (This element is important to me because people¹s relationship to NVC changes over time, and I want confidence that applicants¹ interest in the program arises out of engagement with and commitment to NVC over time).<br/>\no In-person training of at least 3 days with an NVC trainer, AND/OR ongoing attendance at practice groups, AND/OR viewing NVC videotapes, listening to audiotapes and reading NVC publications (specifically all parenting-related publications plus Marshall Rosenberg¹s NVC book).<br/>\no Equivalent exposure and experience. If you don¹t have the experience requested above but still want to be considered for the program, let us know.<br/>\n<br/>\nApplication Deadline & Process: The application deadline for the program is May 15, 2006. A full application packet will be available by March 15 and will be sent to everyone who expresses interest on the questionnaire below.<br/>\n<br/>\nFinances: Financial details are still being worked out and will be available by March 15. As always, we hope and intend to accommodate applicants regardless of ability to pay. So far in our experience at BayNVC, we have been delighted to include nearly everyone who has requested support. In addition to scholarships, we also offer extended payment plans and work exchange opportunities. We also encourage people to seek support from their local communities and will give you some ideas for how to do that.<br/>\n<br/>\nThere are three distinct costs for this program:<br/>\n<br/>\n1) We request a tuition contribution for participation in the PPLP. The sliding scale for tuition will likely be between $1,000 - $2,000. This covers the tuition for family camp and all other program components, except room and board for family camp. Depending on the need, we may try to develop a scholarship fund for this program.<br/>\n<br/>\n2) For the August Family Camp, there will be a room and board cost per adult and per child. We do not yet have the exact cost, but based on past camp experiences and this year¹s location costs, this cost is likely to be in the range of $500 per adult and $300 per child for the week.<br/>\n<br/>\n3) A Family Camp tuition contribution will be requested for family members (children and co-parents) who are participating in the camp but who are not participating in the PPLP. Family Camp tuition usually ranges on a sliding sclae from $200-800 per adult and $100-400 per child.<br/>\n<br/>\nIf you think you might be interested in this program, please respond to the following brief questionnaire and email your responses back immediately, or by March 1st at the latest. These responses are crucial to us, as they will help us determine next steps in our planning for this program. <br/>\n<br/>\nIf you are uncertain as to whether you meet the expectations regarding NVC training and experience, please fill out the relevant section of the questionnaire and we will get in touch with you after we receive your response.<br/>\n<br/>\nPlease email your completed questionnaire to Karin Morris, my assistant, at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nvcparenting@...\">nvcparenting@...</a>. <br/>\n<br/>\nWarmly,<br/>\n<br/>\nInbal<br/>\n--<br/>\nInbal Kashtan<br/>\nDirector, Peaceful Families, Peaceful World<br/>\nA project of the Center for Nonviolent Communication and BayNVC<br/>\nwww.cnvc.org<br/>\nwww.baynvc.org<br/>\n510-433-0700<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nvcparenting@...\">nvcparenting@...</a><br/>\n<br/>\n====================<br/>\nINTEREST SURVEY<br/>\nPARENT LEADERSHIP PROGRAM<br/>\n<br/>\nYour name:<br/>\n<br/>\nEmail:<br/>\n<br/>\nPhone:<br/>\n<br/>\nCity, State/Province, Country:<br/>\n<br/>\n1) Interest: <br/>\nWhat is your level of interest in the program? (Please choose one of the following)<br/>\n     Interested and very likely to apply.<br/>\n     Interested and thinking about applying.<br/>\n     Interested but unlikely to apply at this time.<br/>\n<br/>\nIf you are not sure about applying, would you share briefly what your considerations are?<br/>\n<br/>\n<br/>\n<br/>\n2) Family:<br/>\na. Are you a parent? <br/>\n__ yes<br/>\n__ no<br/>\n<br/>\nb. If yes, how many children do you have?                  <br/>\n<br/>\nc. What are their ages?                <br/>\n<br/>\nd. Would your children come with you to the Family Camp in August? <br/>\n__ yes<br/>\n__ only ___ of my children would come (ages of those coming: ______________ )<br/>\n__ no<br/>\n<br/>\ne. If you are not a parent, please tell us why you would want to participate in this program: <br/>\n<br/>\n<br/>\n<br/>\n3) Finances:<br/>\n(Note: We will not make decisions based on your ability to pay; we are asking the following questions so we know whether or not the program will be sustainable through contributions alone, of if we would need to seek additional funding.)<br/>\n<br/>\na. Do you think you will be able to cover the room and board expenses for yourself and your children at Family Camp?  <br/>\n__ yes<br/>\n__ no<br/>\n<br/>\nIf no, what amount do you anticipate being able to pay for yourself and your children? <br/>\n   <br/>\n<br/>\nb. Do you think you will be able to contribute within the anticipated Family Camp tuition sliding-scale for your family members?<br/>\n__ yes<br/>\n__ no <br/>\n<br/>\nWhat amount, approximately, do you anticipate being able to pay for tuition?<br/>\n   <br/>\n<br/>\nc. Do you think you will be able to contribute within the anticipated PPLP tuition sliding-scale for yourself for the full program? <br/>\n__ yes<br/>\n__ no <br/>\n<br/>\nWhat amount, approximately, do you anticipate being able to pay for tuition?<br/>\n   <br/>\n<br/>\n<br/>\n4) Concerns you¹d like to express & hear back from us on: Are there any questions you¹d like to have answered ASAP in order to assess your ability to participate in this program? (Include here any questions you might have about requested NVC experience and training.)<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":112403,"nextTopicId":112349}}