{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":251210887,"authorName":"shirarocklin","from":"&quot;shirarocklin&quot; &lt;shirarocklin@...&gt;","profile":"shirarocklin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Courteous Kids in an Un-Courteous World","postDate":"1336877442","msgId":67123,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpvbjdpMitwYXM0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpvanN2Nit1OW5qQGVHcm91cHMuY29tPg=="},"prevInTopic":67117,"nextInTopic":0,"prevInTime":67122,"nextInTime":67124,"topicId":67115,"numMessagesInTopic":0,"msgSnippet":"I was like that as a child, very overly shy and polite.  My mother wanted me to not be a doormat, and pushed me to ask people for the time, directions,","messageBody":"<div id=\"ygrps-yiv-1206871281\">I was like that as a child, very overly shy and polite.  My mother wanted me to &#39;not be a doormat,&#39; and pushed me to ask people for the time, directions, turns, whatever it was... with emotional coercion, and I resented it.  On my own, I became less shy when it mattered to me.  I started to speak up in school because I realized I had opinions and wanted to share.  The things she pushed me to do the most took me the longest to do on my own... like asking for the time, or making phone calls.  I still check the time on pay phones or other places I know about, rather than asking someone.   I just wrote a note to my childhood nanny inviting her over for something, because I&#39;m having a block about calling her.  I didn&#39;t want my mother&#39;s &#39;help,&#39; I wanted to be shy, I was comfortable being shy.  <br/>\n<br/>\nWhat I wanted was for my mother to help me get what I wanted, like by making a phone call for me sometimes.  Or, if I had felt more comfortable, I would have liked to know how she was comfortable being as forward and pushy as she was.  <br/>\n<br/>\nShira</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Courteous Kids in an Un-Courteous World","postDate":"1336827609","msgId":67117,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpvbG1zcCs2OTh1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpvanN2Nit1OW5qQGVHcm91cHMuY29tPg=="},"prevInTopic":67116,"nextInTopic":67123,"prevInTime":67116,"nextInTime":67118,"topicId":67115,"numMessagesInTopic":0,"msgSnippet":"... *************** You re framing this in terms of courtesy and I think that s part of the problem. It might be more helpful to consider that they re","messageBody":"<div id=\"ygrps-yiv-1035535618\">&quot;JustSayin&quot; &lt;mfcappella@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;they have an underlying expectation that everyone will be as courteous as they are<br/>\n </span></blockquote>***************<br/>\n<br/>\nYou&#39;re framing this in terms of courtesy and I think that&#39;s part of the problem. It might be more helpful to consider that they&#39;re struggling to communicate their desires. They&#39;re lacking some skills - but they may not realize it. They don&#39;t necessarily have to realize that in order to learn new skills, but it could be helpful if they&#39;re seeing &quot;other people&quot; or &quot;the world&quot; as the problem. They can&#39;t change other people, but they can learn to be more assertive. <br/>\n<br/>\nI was a shy kid growing up and that was seen as a character flaw, which wasn&#39;t particularly helpful. One of the things that helped me was pretending I was someone else! It also helped to have friends who were a little older (or a lot older) who could actively model their strategies for me - I learn a lot by watching, but it didn&#39;t help me to watch people who already seemed to be totally self-confident doing what they did. It did help me to have someone I thought was pretty self-confident say &quot;oh, I hate asking for directions&quot; take a deep breath, make a face and do it. It helped to be around people who were somewhat transparent about their mental processes so I could learn the tricks. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Courteous Kids in an Un-Courteous World","postDate":"1336777912","msgId":67116,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhPeGFaX1dndG1qa3d6eG84RnptY3R0bWhDSEQyRDJ0akNGQzJ5NlUwY2s4UUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGpvanN2Nit1OW5qQGVHcm91cHMuY29tPg==","referencesHeader":"PGpvanN2Nit1OW5qQGVHcm91cHMuY29tPg=="},"prevInTopic":67115,"nextInTopic":67117,"prevInTime":67115,"nextInTime":67117,"topicId":67115,"numMessagesInTopic":0,"msgSnippet":"It makes me a little uncomfortable when moms want to help kids with something if the kids aren t asking for help. Mostly the way they d learn this kind of","messageBody":"<div id=\"ygrps-yiv-296431530\">It makes me a little uncomfortable when moms want to help kids with<br/>\nsomething if the kids aren&#39;t asking for help. Mostly the way they&#39;d learn<br/>\nthis kind of thing is through experience with you there to coach them if<br/>\nthey want it. If they later express disappointment or resentment, you could<br/>\nsay, &quot;Do you wish you&#39;d spoken up?&quot; Or you could say, &quot;Next time, you might<br/>\nwant to say something, huh?&quot; Asking about what they&#39;d like do do would help<br/>\nthem think (in their own head) about what to do next time.<br/>\n<br/>\nHow do you handle it yourself, now that you&#39;re grown? Have you modeled<br/>\nbeing passive, or have you modeled how to be assertive without being rude?<br/>\nAre you still worried about being rude to the point that you feel<br/>\noverlooked or taken advantage of, yourself?<br/>\n<br/>\nIt isn&#39;t the unschooling - it is personality and upbringing. Unschooled<br/>\nkids can be demanding and attention-grabbing, too. And passive kids who are<br/>\nin school don&#39;t learn to be more aggressive in school - they learn to keep<br/>\nquiet, stay out of things, not stick their neck out, and to feel resentful.<br/>\n<br/>\nBy the way - I don&#39;t think it is as much a matter of courtesy as it is<br/>\ntemperament. Being passive can be rude in some circumstances, too. We had a<br/>\nguest at our house who was so &quot;courteous&quot; that she&#39;d never let on what she<br/>\nwanted. It drove us nuts because we had to work so hard to find out where<br/>\nshe wanted to go, what she wanted to eat, etc. Made everything we tried to<br/>\ndo more difficult.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Fri, May 11, 2012 at 1:31 PM, JustSayin &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mfcappella@...\">mfcappella@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt; Any thoughts on how to help me help them with this?<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":283530155,"authorName":"JustSayin","from":"&quot;JustSayin&quot; &lt;mfcappella@...&gt;","profile":"mfcappella","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Courteous Kids in an Un-Courteous World","postDate":"1336768294","msgId":67115,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpvanN2Nit1OW5qQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":67116,"prevInTime":67114,"nextInTime":67116,"topicId":67115,"numMessagesInTopic":0,"msgSnippet":"Just wondering if there is a way I can manage this better; both of my boys are very polite and courteous. Because of this, they are often tromped on by other","messageBody":"<div id=\"ygrps-yiv-1596895303\">Just wondering if there is a way I can manage this better; both of my boys are very polite and courteous. Because of this, they are often tromped on by other kids and often ignored by adults. For example, my son will wait patiently for his turn on &quot;X&quot;.  When his turn comes, more often that not some other kid comes pushing in and jumps right in front of him and takes a turn.  Usually my kids are too polite to say anything, but I know it bothers them because they&#39;ll bring it up later.  One of the many reasons I took my older son out of school several years ago was because he was so often overlooked by his teachers because he was not loud and obnoxious while vying for their attention. <br/>\n<br/>\nIf I am right there during an &quot;incident&quot;, I can intervene, and have.  But as they get older and are doing more things on their own, I am wanting them not to be doormats and be sure they get what they want - but without being discourteous to others (I don&#39;t think I could un-do their courteousness at this point if I tried, and I don&#39;t want to try).<br/>\n<br/>\nAs a kid I was the same way, and I felt like I missed out on some things because I was too quiet to assert myself, so I&#39;m sure I&#39;m projecting a bit. But I have seen evidence of this with them and I don&#39;t want them to feel put-upon or passed over because they are &quot;too nice&quot;. <br/>\n<br/>\nBeing unschoolers (at least for us), tends to lean more toward courteousness, since my kids are not constantly competing with other kids for attention/grades/gold stars, etc., and so they are not conditioned to get what they want in a &quot;dog eat dog&quot; way, and in fact they have an underlying expectation that everyone will be as courteous as they are.  However that is not always the case, and when they are in a situation where they have to assert themselves, I&#39;m not sure they&#39;re entirely equipped to do it. <br/>\n<br/>\nAny thoughts on how to help me help them with this?  <br/>\n<br/>\n--Melissa</div>","specialLinks":[]}],"prevTopicId":67119,"nextTopicId":67099}}