{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"challenges, schedules and influence","postDate":"1108839664","msgId":103694,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyRDEwMjg2LjMwOTFFMEY4LjBDOEQ0NUE4QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":103693,"nextInTime":103695,"topicId":103694,"numMessagesInTopic":0,"msgSnippet":"-=-If a person (and I mean anyone) could live their lives however they wanted doing whatever they wanted, how ever they wanted, where would be the challenge?","messageBody":"<div id=\"ygrps-yiv-60345878\">-=-If a person (and I mean anyone) could live their lives however they wanted doing whatever<br/>\nthey wanted, how ever they wanted, where would be the challenge? Where would be the test?-=-<br/>\n<br/>\nChallenge is inevitable.  Creating false hardship as a test is cruel.<br/>\n<br/>\nAnd you do live your life doing what you want.  You seem to really want to be with your child, and you&#39;re choosing to do that.  I commend you for your choices there.  If you doubt you&#39;re making choices, please read this:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/choice\">http://sandradodd.com/choice</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/joyce/logic\">http://sandradodd.com/joyce/logic</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/benrules\">http://sandradodd.com/benrules</a><br/>\n<br/>\nEarlier in the same post:<br/>\n<br/>\n-=-We lost several family members (close relations) within in few months period. It was so bewildering and life changing. We suddenly had no money. I mean, no money. It was actually quite terrifying.-=-<br/>\n<br/>\nWasn&#39;t that a test of everything? And naturally occurring.<br/>\n<br/>\n<br/>\n-=-I believe my son is being challenged daily because he&#39;s learning to live with people and around people and compromising and finding that you don&#39;t always get your way, period. There are things that must be done, so put down that game and get to it. I need you to help with the laundry because I can&#39;t get down the steps<br/>\ntoday. Or I need you to help with the dishes because I can&#39;t hold them. Your cat needs to be fed and you will do it... sorry, turn off the tv there are things to be done. -=-<br/>\n<br/>\nFrom those specific examples, it sounds like you&#39;re doing more than asking for his help.  You&#39;re telling him when and how to do the things your way.  Otherwise, you could ask him to turn the game off when he gets to a good stopping place, rather than &quot;so put down that game and get to it.&quot;  Are you partners, or are you the manager and he&#39;s the employee?<br/>\n<br/>\nCats need to eat, but food can be put down in any thirty second window.  It doesn&#39;t have to be a specific one.  <br/>\n<br/>\n-=-My son doesn&#39;t have a sense of time. He doesn&#39;t understand the passing of time until it&#39;s gone. He is always shocked when the day turns to evening and so much time has passed.-=-<br/>\n<br/>\nShocked in a bad way, or surprised to have had so much fun and not even noticed the time has passed?  The latter isn&#39;t so bad.  How many of us have read until it got too dark to read and hadn&#39;t realized how much time had passed.  It&#39;s pretty cool!<br/>\n<br/>\n-=-The idea that things fit into half an hour slots continually seems confusing to him and it makes him angry because of it. So, I say, time&#39;s up, you&#39;ve been there for two hours, time to do something else &#39;cause Mom needs help. <br/>\n-=-<br/>\n<br/>\nThings don&#39;t &quot;fit into half an hour slots continually.&quot;  WHAT things?  Half hour sitcoms, but you don&#39;t have TV.  Why think of your life as half hour slots in the absence of TV? &lt;g&gt;<br/>\n<br/>\n-=-So, I say, time&#39;s up, you&#39;ve been there for two hours, time to do something else-=-<br/>\n<br/>\nThat&#39;s arbitrary.  If you need help, you need help when you need it, and two hours isn&#39;t a real measure of need or of anything else (except those 8:00 to 10:00 p.m. movie slots on TV, and you don&#39;t have TV).<br/>\n<br/>\n&quot;Time to do something else&quot; isn&#39;t a friend to natural learning, nor to peace, nor to someone&#39;s involvement in something fascinating.<br/>\n<br/>\n-=-As far as a TV being another window to the world... in some cases I believe you are correct. But over all, it&#39;s not like that for me.  That&#39;s my personal view. Whether my son would agree with that or not, I don&#39;t know,-=-<br/>\n<br/>\nIf he&#39;s free to make different decisions different days, different hours, different moments, you don&#39;t need to know.  Things change.  Kids&#39; needs change.<br/>\n<br/>\nYou have an only child and you&#39;re not well.  Why deprive him of a window to the world just because you don&#39;t need one?  You&#39;ve been to school, you&#39;ve been out there.  He&#39;s twelve and has no siblings and no dad. Maybe he could use TV if for no other reason than to consider situations of sibling interaction and of larger families.<br/>\n<br/>\n-=-So, I think, really, the larger issue here, the bigger debate, would be whether we influence our children and their choices or not? I would have to say we do. Even if we don&#39;t mean to. -=-<br/>\n<br/>\nYes, we influence our children all the time.<br/>\nLimitations aren&#39;t &quot;influence.&quot;  They&#39;re limits.<br/>\n<br/>\n-=-I would say that children watch us and they make their choices based on a lot different things... but they watch us and they do learn from us and we definately learn from them. We learn soooooo much from them it&#39;s amazingly wonderful. Why isn&#39;t it equally wonderful to have that available for a child?<br/>\n-=-<br/>\n<br/>\nThat they can learn from their children?<br/>\nThat they can learn from watching and thinking?<br/>\nWhy should it be just one parent he&#39;s watching and thinking about and learning from?<br/>\n<br/>\n-=-I think a little challenge is a danged good thing. <br/>\n-=-<br/>\n<br/>\nI think the world is full of challenges and parents shouldn&#39;t impose them on children.<br/>\n<br/>\n<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":103693,"nextTopicId":103695}}