{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":156503492,"authorName":"Teresa Jones","from":"&quot;Teresa Jones&quot; &lt;mostofus@...&gt;","profile":"mumto5kidz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Food Allergies","postDate":"1079474298","msgId":19073,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwOWMwMWM0MGJhMSRjYjMwZjUwMCQ5NjY2N2NjYUB0ZXJlc2FybW5yMjBybj4=","referencesHeader":"PDFkMi4xYzFmMDkzMS4yZDg3MmIzYkBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":19072,"nextInTime":19074,"topicId":19073,"numMessagesInTopic":0,"msgSnippet":"Hi Sandra, Yes, I can see what you re getting at but, for some reason, a lot more kids are truly allergy prone these days.  I don t know if it s the quality of","messageBody":"<div id=\"ygrps-yiv-1509689810\">Hi Sandra,<br/>\n<br/>\nYes, I can see what you&#39;re getting at but, for some reason, a lot more kids are truly allergy prone these days.  I don&#39;t know if it&#39;s the quality of food we are now consuming (laden with artificial additives such as chicken feathers), or environmental factors with more poisons being sprayed.   But things are changing, and a lot of people are finding consistent benefits with removing certain allergic foods from the diet - benefits that remain over a long period and are not changeable.<br/>\n<br/>\nThere is no need to worry about quality of diet so long as you substitute with other good quality foods.  For example, when removing wheat from the diet, there are many other grains that you can still eat that have great health benefits.  For removing milk you substitute  with soy milk or rice milk or almond milk.  It is very easy to still have a healthy diet.<br/>\n<br/>\nBehavioural reactions to certain foods is very real and is proven with the consistent results over a long period when the food is removed.  For example, my son has out of control tantrums when he eats too much wheat, and when wheat is drastically reduced in his diet and then other grains used, he is a different little boy.  He still has tantrums that, yes, need to be dealt with by helping him learn to settle himself and express himself.  However, when off wheat, his tantrums last all of 1 or 2 minutes.  When eating large amounts of wheat (which is very easy to do as it is in so many products) his tantrums last at least 20 minutes and you can&#39;t communicate with him at all.  He totally loses control and must be taken to a quiet room where, slowly (and I mean slowly!) he regains control and I then give him a hug.  There is just no comparison!  I have re-introduced this food again, and every single time I have problems.  When I remove it and keep it extremely low or removed altogether, I have consistent good results of a happier little boy.<br/>\n<br/>\nWhen it comes down to it, it is a desperate mother with mother&#39;s instinct and she must see if something will help.  If common sense is used I think a solution can be found.  <br/>\n<br/>\n A little note:  Some allergies are inherited.  My husband passed his milk allergy down to all my kids! (All his brothers and his sister had bad milk allergies when little.)  I have found my kids, though older, still have to keep milk consumption to a low level for good health.<br/>\n<br/>\nTeresa<br/>\nMumto5kidz  :D<br/>\nliving in New Zealand <br/>\n             <br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\n  Sent: Tuesday, March 16, 2004 4:52 AM<br/>\n  Subject: Re: [AlwaysLearning] Re: [Somewhat Off] Horrbile Tantrums<br/>\n<br/>\n<br/>\n<br/>\n  In a message dated 3/14/04 9:25:04 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mostofus@...\">mostofus@...</a> writes:<br/>\n<br/>\n  &lt;&lt; <br/>\n  The final test is to re-introduce the suspect food.  If the problems return <br/>\n  then you have a confirmation as to whether this was the problem or not.  :D &gt;&gt;<br/>\n<br/>\n  I understand the theory, but it could still fail.  <br/>\n  There are lots of factors in life, and kids just get older and grow into and <br/>\n  out of and through different phases.<br/>\n<br/>\n  There seems to be a fad lately of magically controlling kids with drugs or <br/>\n  deprivations or dietary restrictions, when in many cases talking to them and <br/>\n  helping them figure out how to make decisions and express themselves would help <br/>\n  MUCH more.<br/>\n<br/>\n  Yes, there are allergies.<br/>\n<br/>\n  But there seem to be more and more moms who turn to look for allergies <br/>\n  instead of learning to deal with interpersonal issues.<br/>\n<br/>\n  And granted, Howard Gardners ideas of multiple intelligences (which I love a <br/>\n  bunch) suggest that some people just are better than others with interpersonal <br/>\n  stuff.  And that might be passed on genetically, just as other talents can <br/>\n  be, but can and should be nurtured and discussed.  <br/>\n<br/>\n  &lt;&lt;What if you had made sure he was wearing green socks the whole month during <br/>\n    which he had a growth-spurt in the awareness area?  Could you then be sure <br/>\n    green socks were to be creditted?<br/>\n<br/>\n  &lt;&lt; There are correlations which aren&#39;t causes, and children change many time <br/>\n  and <br/>\n    many different ways just by growing older and having more experience in how <br/>\n    to handle their own emotions and moods and sensitivities.&gt;&gt;<br/>\n<br/>\n  If the green socks are removed and a problem returns, it might not have been <br/>\n  because of the socks.  <br/>\n<br/>\n  Much religious practice and superstition seems based in futile attempts to <br/>\n  control the world, some of which seemed to work a time or two and so are <br/>\n  repeated through the centuries.<br/>\n<br/>\n  &lt;&lt;My daughter started having &quot;horrible tantrums&quot; when she was <br/>\n<br/>\n  2&1/2 and at first I thought it was the &quot;terrible twos&quot; that had <br/>\n<br/>\n  finally kicked in. Then when that didn&#39;t sit well my my mother&#39;s <br/>\n<br/>\n  intuition/instincts, I realized that I had started eating peanut butter <br/>\n<br/>\n  again recently after a long time of not eating it. Since I was <br/>\n<br/>\n  nursing her, she was getting it too. I quit eating PB and within 24 <br/>\n<br/>\n  hours they were gone. The only time this has reocured is when <br/>\n<br/>\n  she has accidentally ingested PB and she wakes up at night <br/>\n<br/>\n  completely disoriented, screaming and crying.&gt;&gt;<br/>\n<br/>\n  This account seems plausible, but not all sworn food-sensitivities have this <br/>\n  close a correlation.  I&#39;m not talking about specific people here on this list, <br/>\n  but about the overall trend toward people wanting outside causes for <br/>\n  personality traits.<br/>\n<br/>\n  And this inability to process peanut butter could easily be something a child <br/>\n  grows out of.  Lots of kids will get hives or stomach upsets from one food or <br/>\n  another (strawberries, common on the hives) when they&#39;re little but be able <br/>\n  to tolerate the foods fine when they&#39;re older.<br/>\n<br/>\n  Sandra<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n              ADVERTISEMENT<br/>\n             <br/>\n       <br/>\n       <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysLearning/\">http://groups.yahoo.com/group/AlwaysLearning/</a><br/>\n      <br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a><br/>\n      <br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]}],"prevTopicId":19072,"nextTopicId":17495}}