{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":200155843,"authorName":"Rodney and Rebecca Atherton","from":"&quot;Rodney and Rebecca Atherton&quot; &lt;rebeccawow@...&gt;","profile":"wow_academy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] more about what we know and what that means","postDate":"1113486356","msgId":22018,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDFlMS4zYTU3NjlhNS4yZjhmYzRmYkBhb2wuY29tPg=="},"prevInTopic":22013,"nextInTopic":0,"prevInTime":22017,"nextInTime":22019,"topicId":22013,"numMessagesInTopic":0,"msgSnippet":"... or no That she was me and what Sandra said it so true.  Though I asked about the game, the inquiry wasn t at all about the game.  It was based on a","messageBody":"<div id=\"ygrps-yiv-385831570\"><blockquote><span title=\"ireply\">&gt;What she wanted to know was  NOT &quot;is this one game good enough to lure a <br/>\n&gt;schoolkid toward  unschooling?&quot;  That question was unanswerable.  Any &quot;yes&quot;<br/>\n </span></blockquote>or &quot;no&quot;<br/>\n<br/>\n <br/>\n<br/>\nThat &quot;she&quot; was me and what Sandra said it so true.  Though I asked about the<br/>\ngame, the inquiry wasn&#39;t at all about the game.  It was based on a fear; I<br/>\nwas scared that my son would not want to come back home after trying out<br/>\npublic school.  Though, after I asked the list I could tell by a few<br/>\nresponses that I was being silly and selfish.  I had to reevaluate things.<br/>\n<br/>\n <br/>\n<br/>\n(He was in public school because he wanted to try it out and I thought,<br/>\n&quot;well, he&#39;ll either do very well and enjoy it or he&#39;ll realize that it isn&#39;t<br/>\nall that he imagined it to be.&quot; Either way, we would win.  But, I was<br/>\nstarting to get scared that he wouldn&#39;t want to return home and I panicked!)<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.geocities.com/rebeccawow.geo\">http://www.geocities.com/rebeccawow.geo</a>&gt; Rebecca<br/>\n<br/>\nToo often we give children answers to remember rather than problems to<br/>\nsolve. -Roger Lewin<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"more about what we know and what that means","postDate":"1113484027","msgId":22013,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlMS4zYTU3NjlhNS4yZjhmYzRmYkBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":22018,"prevInTime":22012,"nextInTime":22014,"topicId":22013,"numMessagesInTopic":0,"msgSnippet":"This is about knowing. I pulled it out of the other response about the two questions, because that was long and this is off to the side of it. There are","messageBody":"<div id=\"ygrps-yiv-407226790\">This is about &quot;knowing.&quot;<br/>\nI pulled it out of the other response about the two questions, because that  <br/>\nwas long and this is off to the side of it.<br/>\n <br/>\nThere are people who will say they KNOW that children need structure and  <br/>\ndiscipline.<br/>\n <br/>\nThere are people who say they KNOW in their being that there is a  heaven.  <br/>\nOthers KNOW in their being that life is suffering and we are  reincarnated many <br/>\ntimes but counting them would be pointless and wrong,  so just be as virtuous <br/>\nas you can be this moment and don&#39;t think about  the rest.  There are people <br/>\nwho know uglier things than those, and act on  them.<br/>\n <br/>\n <br/>\n-=-I know that if my child says he is hungry thirsty scared tired lonely  <br/>\nbored, frightened, warm, cold, angry, sad, happy, jolly, full of fun,  <br/>\ncomfortable, not hungry, not thirsty and just plain OK then he is right and I  have no <br/>\nright to question or contradict this.-=-<br/>\n <br/>\nOf all the statements in the original list, this is the one that I would&#39;ve  <br/>\nchucked out as the least knowable.  Or maybe it just needs to be rethought  <br/>\nand rephrased.<br/>\n <br/>\nHere&#39;s another statement that does kinda contradict it:<br/>\n <br/>\n-=-I trust that my children know what they are capable of and when they are  <br/>\nable to do something. I know that they will ask if they need help not just in  <br/>\nwords but In signs that I must learn to detect. I know that if I am asked for <br/>\n that help I must ask what it is they want me to do and not do what I think <br/>\nthey  want.-=-<br/>\n <br/>\nChildren will say &quot;not hungry&quot; when they are, for various reasons.   Adults <br/>\nwill say it for even more reasons.   Different people will  react differently <br/>\nto that, but taking all statements at face value is to ignore  non-verbal signs <br/>\nand even verbal signs the person was unaware of  providing.<br/>\n <br/>\n-=-I know that if I am asked for that help I must ask what it is they want  <br/>\nme to do and not do what I think they want.-=--=-<br/>\n <br/>\nIn unschooling discussions ALL THE TIME people think they want one thing  and <br/>\nend up finding out they had asked a question that opened up all kinds of  <br/>\nother areas of need.   Kinda like this very exchange.  Jay asked  two questions, <br/>\nbut they were a little window into a big area.  Someone  asked recently <br/>\nwhether offering a particular video game would be a good way to  lure her child home <br/>\nfrom school.  The question seemed to be about the value  of that video game, <br/>\nbut no one could answer that simple question without asking  more questions.  <br/>\nWhy was the boy in school?  Couldn&#39;t she just get the  game and let him play <br/>\nit even if he stayed in school?  (And many  other related questions came up.)  <br/>\nWhat she wanted to know was  NOT &quot;is this one game good enough to lure a <br/>\nschoolkid toward  unschooling?&quot;  That question was unanswerable.  Any &quot;yes&quot; or &quot;no&quot; <br/>\n would&#39;ve been coldly worthless.<br/>\n <br/>\n[Here I will refrain from going at length into Howard Gardner&#39;s writings on  <br/>\ninterpersonal and intrapersonal intelligences, but just will insert this <br/>\npublic  service reminder that some people have it and some people don&#39;t; with some <br/>\nit  looms large, with some it&#39;s not a blip, others have a big blip or a <br/>\nsmaller  loom.]<br/>\n <br/>\nA researcher (probably several-to-many by now) started collecting song  <br/>\nlyrics about love to try to puzzle out what love was.  He was researching  <br/>\nbiochemistry and brain stuff.  But there are song lyrics and poetry with  huge clues <br/>\nto what people have known for a long time.  <br/>\n&quot;I feel it in my fingers, I feel it in my toes...<br/>\nYou know I love you, I always will; my mind&#39;s made up by the way that I  <br/>\nfeel...&quot;<br/>\n <br/>\n <br/>\nI&#39;ll just quote the whole thing, and continue in another post:<br/>\n <br/>\n <br/>\n<br/>\n<br/>\n     <br/>\n<br/>\nI feel it in my fingers, I feel it in my toes<br/>\nLove is  all around me and so the feeling grows<br/>\nIt&#39;s written on the wind, it&#39;s  everywhere I go<br/>\nSo if you really love me, come on and let it  show<br/>\n<br/>\nYou know I love you I always will<br/>\nMy mind&#39;s made up by the  way that I feel<br/>\nThere&#39;s no beginning, there&#39;ll be no end<br/>\n&#39;Cause on  my love you can depend<br/>\n<br/>\nI see your face before me, as I lay on my  bed<br/>\nI kinda get to thinking of all the things we said<br/>\nYou  gave your promise to me, and I gave mine to you<br/>\nI need someone  beside me in everything I do<br/>\n<br/>\nYou know I love you I always  will<br/>\nMy mind&#39;s made up by the way that I feel<br/>\nThere&#39;s no beginning,  there&#39;ll be no end<br/>\n&#39;Cause on my love you can depend<br/>\n<br/>\nIt&#39;s written  on the wind, it&#39;s everywhere I go<br/>\nSo if you really love me, come on and  let it show<br/>\nCome on and let it show <br/>\n<br/>\n(Reg Presley, of the Troggs, late  60&#39;s)<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":22011,"nextTopicId":22010}}