{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"The Mowery Family","from":"&quot;The Mowery Family&quot; &lt;jkkddmowery@...&gt;","replyTo":"LIST","senderId":"ggfXXeCJXsgBl--MeUid30bCo8hitpmbyT2ieIWPka9MuRdAs4IYSeDIHfyLi5ji8q_Cc3zG7ghmg7ygLNQHldCzET6WiE6nE9LSEK2PH7CjoMrINDdU","spamInfo":{"isSpam":false,"reason":"0"},"subject":"found this on the HEM loop - seems appropriate","postDate":"982583828","msgId":16588,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMmMwMWMwOWE2YiQxN2JjYzgwMCQ5M2QwNzlhNUBtb3dlcnk+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":16587,"nextInTime":16589,"topicId":16588,"numMessagesInTopic":0,"msgSnippet":"Message: 4 Date: Sun, 18 Feb 2001 23:27:41 -0600 From: Susan Frederick  Subject: [Fwd: Educated Parents Respond to ER] ... Subject: Educated","messageBody":"<div id=\"ygrps-yiv-1226306946\">\n<html><head>\n \n \n<style></style>\n</head>\n \n<div><font color=\"#800080\">Message: 4<br>&nbsp;&nbsp; Date: Sun, 18 Feb 2001 \n23:27:41 -0600<br>&nbsp;&nbsp; From: Susan Frederick &lt;<a rel=\"nofollow\"\n target=\"_blank\" href=\"mailto:sjf@...\">sjf@...</a>&gt;<br>Subject: [Fwd: Educated \nParents Respond to ER]<br><br>thought some might find this of \ninterest:<br><br>-------- Original Message --------<br>Subject: Educated Parents \nRespond to ER<br>Date: Sun, 18 Feb 2001 12:45:12 -0600<br><br><br>thought yall \nmight find this interesting. Parent are telling their views<br>about the recent \nER show that a child died from not being vaccinated.<br><br><br><br><blockquote><span title=\"ireply\"> &gt;Dear \n </span></blockquote>PROVE Members,<br><blockquote><span title=\"ireply\"> &gt;As you know, on February 15th, 2001, NBC&#39;s television \n </span></blockquote>drama ER contained a<br>highly controversial story line about a family who chose \nnot to<br>vaccinate<br>their children, and one of the children contracts measles \nand dies from<br>complications while the doctors on the show lash out at the \nmother and<br>categorically deny any risks posed by the \nvaccine.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;NBC&#39;s lack of responsibility, compassion and sensitivity \n </span></blockquote>about a very real<br>problem is highly disturbing.&nbsp; Measles containing \nvaccines do sometimes<br>injure and kill children.&nbsp; A death or injury from \na vaccine is just as<br>awful<br>as a death or injury from a \ndisease.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;Anyone wanting to read some of the MMR vaccine adverse \n </span></blockquote>event reports can do<br>so at&nbsp;&nbsp; <a rel=\"nofollow\"\n target=\"_blank\" href=\"http://www.fedbuzz.com/vaccine/vac.html\">http://www.fedbuzz.com/vaccine/vac.html</a>.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;Here \n </span></blockquote>is one that would have been a more realistic basis for a story \nline.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;VAERS ID 105905<br>&gt;State FR<br>&gt;Vaccine Type \n </span></blockquote>MMR<br><blockquote><span title=\"ireply\"> &gt;Vaccination Name MMR II<br>&gt;Manufacturer MSD<br>&gt;Age in Years \n </span></blockquote>1<br><blockquote><span title=\"ireply\"> &gt;Sex M<br>&gt;Lab Data biopsy brain measles inclusion bodies; Reported \n </span></blockquote>Text pt recv vax<br>1997 &amp; pt exp encephalitis &amp; was hosp; COD \nencephalitis, viral &amp; measles<br>inclusions bodies were found @ the brain \nbiopsy;investigation found type<br>1<br>virus;<br><blockquote><span title=\"ireply\"> &gt;Life Threating Illness \n </span></blockquote>Y<br><blockquote><span title=\"ireply\"> &gt;Died Y<br>&gt;Recovered N<br>&gt;Disability Y<br>&gt;<br>&gt;Families \n </span></blockquote>across the country are lashing back in their letters to NBC.&nbsp; I \nam<br>forwarding just a small sampling to our readers. As these \nletters<br>demonstrate, parents concerned about vaccine safety are hardly \nthe<br>blubbering idiots portrayed by NBC&#39;s ER (which is supported with \nvaccine<br>manufacturers&#39; advertising money).<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;Pass this on to \n </span></blockquote>anyone asking you questions about this latest<br>pharmaceutical stunt so the \ntruth can shine.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;Also, it is not too late to send your letters to \n </span></blockquote>NBC.&nbsp; Go to <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nbc.com\">www.nbc.com</a>,<br>and on the \nright side there is a scroll box where you can select &quot;your<br>favorite \nshow&quot;.&nbsp; Click on &quot;ER&quot; and then scroll to the bottom section<br>entitled \n&quot;Contact Us&quot;, and click on &quot;Email ER&quot;.&nbsp; There is an online form<br>where \nyou can let the producers know what you think about this \nepisode.<br><blockquote><span title=\"ireply\"> &gt;___________<br>&gt;<br>&gt;I&#39;ve been a faithful ER fan for \n </span></blockquote>years. It&#39;s the ONLY show I have ever been<br>able to say that about. Last night \nwas my last viewing. I was actually<br>watching the show in my daughter&#39;s \nhospital room. She was admitted<br>suffering<br>from yet another side effect \nfrom one of the horrible treatments she<br>received for her autoimmune disease. \nAn autoimmune disease caused by the<br>MMR<br>vaccine. I&#39;m thankful she was so \nsedated from her pain medication that<br>she<br>missed the whole show. We \nusually watch it together.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;I found it sadly ironic that in the \n </span></blockquote>same show you showed such compassion<br>for the man suffering from lupus, the \ndisease that my daughter&#39;s<br>hemotologist believes she is developing. Are you \neven remotely aware of<br>the<br>connection between the vaccine and autoimmune \ndiseases? You could have<br>at<br>least had the sensibility to catch that sad \ninsult. After your<br>condescending<br>and reprehensible treatment of the \nparents, you cut immediately to a<br>vaccine<br>commercial. You left me spinning \nwith nausea. Now I leave your viewing<br>audience.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;Shame on \n </span></blockquote>you.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;Sara Smith<br>&gt;__________<br>&gt;As a pediatric physician \n </span></blockquote>in the alternative health care field, I am<br>becoming increasingly alarmed by \nthe growing incidence of chronic,<br>debilitating auto-immune and \nimmunodeficiency diseases in my pediatric<br>patients. It is not merely \ncoincidental that the disease symptoms<br>presented<br>by these helpless \nchildren, whose ages vary from six months to seventeen<br>years old, either \nstarted or became severely aggravated shortly after a<br>vaccination or series \nof vaccinations.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;It is very frustrating, if not infuriating, to \n </span></blockquote>witness such a biased and<br>obviously unethically promoted view of vaccination \nin a recent ER. You<br>people have not done your homework. If, at a minimum, \nthis promotion was<br>a<br>public service message courtesy of a government \nregulatory agency in<br>need of<br>more regulatory control over the lives of its \npeople, your message is<br>little<br>more than propaganda for the sake of &quot;the \nend justifies the means&quot;. If,<br>on<br>the other hand, this advertisment was an \nattempt to educate your<br>audience<br>about the benefits of vaccination, your \nmessage will end up benefiting<br>the<br>pharmaceutical industry far more than \nit will the millions of children<br>who<br>are at high risk for adverse \nreactions and/or long term consequences<br>from<br>our<br><blockquote><span title=\"ireply\"> &gt;very reckless \n </span></blockquote>mandated vaccine policy.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;For your information, there is not only \n </span></blockquote>plenty of measurable scientific<br>evidence to suggest that our reckless vaccine \npolicy is dangerous; there<br>also exists a number of ethical premises upon \nwhich the very notion of<br>health is predicated (such as: &quot;Doctor, do no harm&quot;) \nthat lead<br>intelligent<br>people to question whether the application of our \nreckless vaccine<br>policy is<br>flawed.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;Without considering or \n </span></blockquote>weighing the pros and cons of vaccination, one need<br>only understand that the \nfundamental issue of importance in this vaccine<br>controversy is the right of \nconsent. You have not only done a disservice<br>to<br>people by insulting our \ncollective intelligence with your biased view<br>(and<br>incomplete facts) of \nthis controversial medical procedure, you have<br>succeeded in leading us \nfurther down the slippery slope towards<br>political<br>expedience and moral \ndecay by condoning the repression of \nour<br>constitutional<br>freedoms.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;This particular ER program was \n </span></blockquote>another example of ignorance on display in<br>the media and another reason why \nmore and more rational people are<br>turning<br>television off and looking for \nnews in other places.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;Toni \n </span></blockquote>Krehel<br><blockquote><span title=\"ireply\"> &gt;__________<br>&gt;<br>&gt;I am a long time fan of ER but I was \n </span></blockquote>shocked last night by the inaccuracy<br>of the measles story line. First of all \nto portray the parents in the<br>light<br>that you did is unconscionable. This \nis 2001. Not only do parents have a<br>right to make an informed decision for \ntheir child it is their<br>responsibility.&nbsp;&nbsp; Did the people who wrote \nthis story&nbsp; have any idea<br>that<br>there are children being injured every \nday in the United States from<br>vaccine<br>reactions. In 1986 Congress passed a \nlaw to compensate these<br>individuals.<br>This government program has paid out \nover $1 billion to children who<br>have<br>been injured and killed by mandated \nchildhood vaccines, including the<br>measles vaccine.&nbsp; To flat out say \nthere is no connection between autism<br>and<br>vaccination is a lie and \ndisservice to your audience.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;There is evidence and studies are \n </span></blockquote>ongoing at the National Institutes of<br>Health, the Institute of Medicine and \nthe M.I.N.D. Institute to name a<br>few.<br>You have done a great disservice to \nyour viewers by presenting such a<br>biased<br>story.&nbsp;&nbsp; About the only \nthing that was accurate were the way doctors<br>treat<br>parents on this issue. \nMany parents are berated by health care providers<br>for<br>exercising their \ninformed consent rights on the vaccination issue which<br>pushes parents away \nfrom their health care providers.&nbsp; I would like to<br>know<br>why your \nproducers would think that the life of a child that dies from a<br>disease is \nmore valuable than the life of a child who dies<br><blockquote><span title=\"ireply\"> &gt;or is permanently injured \n </span></blockquote>by a vaccine?<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;As a viewer I have to wonder who brought this \n </span></blockquote>storyline to ER. I&#39;m sure it<br>was only a coincidence that the first \nadvertisement was for a new<br>childhood<br>vaccine, Prevnar. You sold out and \nyou should be ashamed of yourselves.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;Kathi \n </span></blockquote>Williams<br><blockquote><span title=\"ireply\"> &gt;Co-Founder and Director National Vaccine Information Center \n </span></blockquote>Vienna, VA<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;__________<br>&gt;You&#39;ve gone too far. As a registered \n </span></blockquote>nurse, disabled with an<br>&#39;undifferentiated connective tissue disease&#39; and \nsevere peripheral<br>sensory<br>neuron disease because of multiple vaccines \nincluding: influenza, DPT,<br>hepatitis B and MMR series - mandated as a \ncondition for clinical<br>practice -<br>I have a &quot;desk job&quot; which affords me the \noption of working flexible<br>shifts.<br>Uncharacteristically, I was home to see \nthe &#39;ER&#39; episode February 8,<br>2001,<br>including previews for February 15th \npromising something outrageous in<br>the<br>way of infectious \ndiseases.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;&#39;Lordie, what now?&#39; I pondered. &#39;Small pox?&#39; It was \n </span></blockquote>obvious that the<br>Vaccine Machine had reached into their deep pockets and \nbought an<br>episode of<br>&#39;ER.&#39; I chose to work my usual preferred evening \nshift and avoid<br>watching<br>the exaggerated infectious disease scenario, to \nmiss this episode that<br>promised further insult and condescension to vaccine \ncasualties like<br>myself.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;It was my responsibility to do \n </span></blockquote>professional fee abstraction for the ER at<br>Children&#39;s Hospital of \nPhiladelphia in 1997, and for 15 months reviewed<br>an<br>average of 150 \npediatric&#39; ER medical records per day, 5 days a week. I<br>never<br>read of one \nincident of death from wild measles virus presenting to<br>Children&#39;s Hospital \nof Philadelphia&#39;s Emergency Room.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;On the other hand, there were \n </span></blockquote>countless, daily reminders of the<br>pervasiveness of Attention Deficit \nHyperactivity Disorder, Autism,<br>Asthma,<br>Diabetes, metabolic and other \nchronic disorders in this generation of<br>vaccine mutated children. Are we \ngoing to tamper and promote chronic<br>disabling conditions in our society by \nterrifying them with horror<br>stories<br>of infectious disease epidemics when \nwe&#39;ve barely shaken hands with<br>human<br>genome prototypes?&nbsp; Your ties to \nyour sponsors, the promoters of<br>Prevnar,<br>were shamelessly \ntransparent.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;May I suggest, as a way of making amends with the \n </span></blockquote>increasingly large<br>autoimmunity and otherwise vaccine-injured community - how \nabout a story<br>line about Dr. Green&#39;s pathology report, owning up to the fact \nthat his<br>malignancy is seeded with SV40? That Dr. Green was one of the \nhundreds<br>of<br>millions of citizens, 100 million in the U.S. alone, infected \n+/- 40<br>years<br>ago from the polio vaccine that was contaminated by Simian \nVirus 40. You<br>might win back a few of us, your Former Fans that you&#39;ve \noffended.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;If it is sensationalism you&#39;re after. Give credit that \n </span></blockquote>a few of us out here<br>can still appreciate subtlety in ethical \nissues.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;Disappointed RN, CPC<br>&gt;_________<br>&gt;I have been \n </span></blockquote>wondering over the years why ER and other medical shows haven&#39;t<br>gone near \nthis issue regarding the vaccination controversy.&nbsp; You have<br>chosen<br>to \nair one side of the controversy.&nbsp; Why not go to the Vaccine \nAdverse<br>Events Reporting System and select 1 of the thousands of reports \nof<br>children<br>who have reacted to a vaccination, been rushed to the ER in \nfull blown<br>tonic/clonic seizures, brain swelling, projectile vomiting, edema, \nrash<br>all<br>over the body, fever, etc.&nbsp; Have the ER crew valiantly try \nto save the<br>child<br>but fail.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;Then {the doctors would} \n </span></blockquote>console the parents saying that most children that<br>survive this sort of \nvaccine reaction are left severely damaged and<br>maybe<br>this outcome was best \nfor all. And as the parents slowly leave the<br>hospital,<br>Elizabeth Corday \ndoes a little research and finds that same lot of<br>vaccine<br>given to the \nchild that died had 136 other reports of vaccine reactions,<br>of<br>which: 68 \nwere rushed to the ER, 2 had life threatening conditions, \n19<br>were<br>hospitalized, 1 was immediately and permanently disabled, 19 had \nunknown<br>recovery, 3 had no recovery, and 5 died, and the FDA new this, \nbut<br>didn&#39;t<br>recall the vaccine.&nbsp; Then Elizabeth Corday would throw \ndown her<br>stethescope<br>in outrage and say &quot;those \nbastards&quot;.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;Barabara Loe Fisher of the National Vaccine \n </span></blockquote>Information Center could be<br>your medical \nconsultant/expert.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;Michael Framson<br>&gt;__________<br>&gt;I am \n </span></blockquote>writing to you today because of the ER episode in which a<br>non-vaccinated \nchild died on your show.&nbsp; My suggestion to you is that<br>you do<br>your \nhomework on vaccines.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;You see, my son is vaccine injured.&nbsp; \n </span></blockquote>He is one of the victims of<br>vaccination. We should all be allowed to do our \nhomework and decide what<br>is<br>best for our children and protect them the \nbest way we know how.&nbsp; The<br>way<br>you portrayed the family was wrong. I \nam an educated person from the<br>medical<br>field. The condescending tone you \nused to the family was disgusting.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;My son is severely and \n </span></blockquote>permanently brain injured. He had many complications<br>following his \nvaccinations.&nbsp; He eventually had an aneurysm rupture in<br>his<br>brain, he \ndied three times and was resuscitated, his aneurysm ruptured a<br>2nd<br>time 10 \ndays later. He was only 4 months old.&nbsp; He was hospitalized for<br>over<br>4 \nmonths and he was not expected to live many, many times during \nthis<br>stay.<br>No one can understand the pain that this can cause.&nbsp; Since \nthis happened<br>to<br>my son I have done extensive research and have been \nsickened by what I<br>have<br>uncovered.&nbsp; My son will never receive another \nvaccine.&nbsp; I will not play<br>Russian Roulette with his life \nagain.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;I suggest that you do your homework, read the package \n </span></blockquote>inserts, and<br>hopefully you will never need to deal with vaccine injury \npersonally.<br><blockquote><span title=\"ireply\"> &gt;I also noticed that you ran an ad for Prevnar during this \n </span></blockquote>show. You can<br>view a 33 page research paper on this which shows all the \nconflicts of<br>interest in getting this vaccine approved. I would be happy to \nsupply<br>you<br>with this research paper. It has killed children already. No \nchild<br>should be<br>expendable in the name of the public \ngood.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;When one child died from getting locked inside a trunk of a \n </span></blockquote>car the world<br>was mortified and made changes in automobile manufacturing. The \nresult<br>was a<br>release latch inside the trunk. One child&#39;s death was one too \nmany.&nbsp; Why<br>does this rule not apply to my child?&nbsp; To the millions \nof vaccine<br>injured<br>children?<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;Because shows like yours \n </span></blockquote>mislead people about the truth.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;I am shocked that you would run \n </span></blockquote>something like this and I am never going to<br>watch your show again. I truly \nbelieve that you owe the entire vaccine<br>injured community (there are millions \nof them out there) an apology.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;Tammy \n </span></blockquote>Carrington<br><blockquote><span title=\"ireply\"> &gt;__________<br>&gt;<br>&gt;How much research did the writers \n </span></blockquote>for this script do on MMR&#39;s &amp; Autism?<br>The actor, Anthony Edwards who \nplays Dr. Mark Green - (CAN - Cure Autism<br>Now<br>Board Member) was he ever \nasked about Autism?&nbsp; Does anyone on one&#39;s<br>staff<br>have a child who has \nsuffered from receiving a vaccination or even died<br>from<br>receiving \none?<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;I have a child who was born without traces of Autism.&nbsp; \n </span></blockquote>He developed<br>&quot;normally&quot;; however, after receiving his MMR shot at 14-15 \nmonths of age<br>-<br>within a few amount of weeks, he started to lose speech \nand as time went<br>on - he developed Autistic Traits.&nbsp; Fortunately, today \n(3 1/2 years<br><blockquote><span title=\"ireply\"> &gt;later), he still is weak in the speech area but has \n </span></blockquote>dramatically improved<br>in other areas due to&nbsp; our intense therapy \napproaches, supplementations,<br>testing, gluten/free - casein/free diet and \nother approaches as well.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;He has had a colonoscopy and an \n </span></blockquote>endoscopy - he is currently having tests<br>run in Ireland which is a Measles \nVirus Detection Analysis Report.&nbsp; He<br>has<br>had DMSA (heavy metals \ndetoxification) treatments to remove the vaccine<br>parts of Mercury that is in \nthe MMR shot.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;I understand that TV scripts cover only a short \n </span></blockquote>version of the truths.<br>However, though my thoughts will more than likely be \noverlooked - I do<br>feel<br>that how one portrayed the family on \nthe<br><blockquote><span title=\"ireply\"> &gt;show which aired (Feb. 15, 2001) regarding MMR vaccination truly did \n </span></blockquote>an<br>injustice to families regarding their decisions not to vaccinate.&nbsp; \nIf<br>one<br>really wants to pass judgement - then I suggest that one does an \nepisode<br>on<br>Merck Industries the makers of vaccines and other \ndrugs.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;Check on the legal levels of Mercury and other toxins that \n </span></blockquote>go into vaccines<br>(aborted fetus tissue is in some vaccines).<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;I \n </span></blockquote>assure NBC that the network will be receiving numerous comments regarding<br>the \nairing of ER and MMR-Vaccines. Anthony Edwards - please help to<br>educate<br>in \nthis area.&nbsp; I&#39;m sure you are aware of the effects and \npossibilities<br>regarding vaccines.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;Though I&#39;m not totally \n </span></blockquote>against vaccines, I&#39;m against all of the additives<br>that are going into them \nand the increasing amount of vaccines that one<br>feels forced to give to such \nsmall children.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;To let one know, I felt somewhat offended due to \n </span></blockquote>one&#39;s true lack of<br>knowledge regarding vaccines - today.&nbsp; The toxin \nlevels of heavy metal<br>incased in a vial and injected into an innocent child \nwho doesn&#39;t<br>understand<br>what is happening.&nbsp; As days go by this child \ncould develop high fevers,<br>seizures, lose speech, or begin living a life of \ndazed looks and<br>withdrawing<br>from the world.&nbsp; This is AUTISM.&nbsp; My \nson lives it and so does his<br>family. We<br>are doing everything in the world \nto make his world a better reality. <br>He<br>will not ever receive another MMR \nvaccine.&nbsp; His levels of MMR in his<br>blood<br>system (Titer&#39;s Test) are \nextremely above normal - meaning that his body<br>had<br>a reaction to that \nvaccine - the tainted MMR shot.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;Please ask one&#39;s self this \n </span></blockquote>question, what if this were my child?&nbsp; What<br>would I do to make a \ndifference in his world?&nbsp; Educate people about<br>vaccines<br>and the \neffects that vaccines could cause.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;Contact me for info.&nbsp; I \n </span></blockquote>am an advocate, consultant, and an educator<br>regarding Autism, vaccines, and \ndisabilities.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;Darlene Carl<br>&gt;__________<br>&gt;Above, the \n </span></blockquote>preamble says the you value opinion and feedback.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;I would like to \n </span></blockquote>think that that is not some sort of platitudinous garbage<br>put in as corporate \nweasel-speak.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;No doubt in your intent as executive producer and \n </span></blockquote>creator of ER - and as a<br>person who can do what you want, was to do your \npaediatrician a favour. <br>The<br>programme, about which I am sure you are \nheartily sick of hearing about,<br>concerns a boy who dies as a result of \nmeasles, because his mother makes<br>an<br>informed choice not to vaccinate \nhim.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;The problem with this program is that it misrespresents the \n </span></blockquote>truth in two<br>ways.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt; Firstly, to my knowledge there has never \n </span></blockquote>been a death of a child, by<br>measles, to a parent who has conscientiously \nchosen not to vaccinate. <br>That<br>is borne out by statements issued in the \npast by the FDA and CDC saying<br>that<br>the problem of vaccine uptake has \nnothing to do with choice, but<br>everything<br>to do with delivery of \nservice.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;<br>&gt;While children who are not vaccinated do get \n </span></blockquote>measles, recent medical<br>articles facilely suggest&nbsp; that we should not \nhave exemptions, because<br>the<br>vaccinated children get it to.&nbsp; What is \na vaccine supposed to do? <br>Prevent<br>you getting &quot;IT&quot;.&nbsp; So why are \nfully vaccinated children getting measles?<br>Could it perhaps be.... that is \ndoesn&#39;t work?<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;In New Zealand, we recently had an interesting \n </span></blockquote>double lesson.&nbsp; Firstly, a<br>huge measles vaccination campaign using MMR \nto pre-empt a measles<br>outbreak.<br>Of the 150,000 children revaccinated, I \nhave documented evidence of 8<br>children who landed up in ICU with \nencephalopathy between 8 - 14 days<br>after<br>the vaccine. One child \ndied.&nbsp; Every parent tells me that the medical<br>personnel tested for every \n&quot;OTHER&quot; thing that could have caused<br>encephalopathy and got a \nblank<br><blockquote><span title=\"ireply\"> &gt;sheet.&nbsp; Interestingly, not one child was tested for MMR \n </span></blockquote>viral<br>encephalopathy.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;Such good science - good medicine, don&#39;t \n </span></blockquote>you think? So naturally, my<br>documented evidence is classified as &quot;anecdotal&quot; \nand proves nothing. <br>Now,<br>why do you think that might be, Mr Wells?&nbsp; \nThat is real life - and would<br>portay reality far more accurately than your \nprogramme.&nbsp; But ER is about<br>glorifying everything medical theory stands \nfor, not showing another<br>reality, John,<br><blockquote><span title=\"ireply\"> &gt;isn&#39;t \n </span></blockquote>it.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;Shortly after this MMR campaign, I got involved with a family \n </span></blockquote>near me,<br>whose 10 month boy got encephalopathy after MMR, and they did all \nthe<br>right<br>things. But did they get a correct diagnosis?&nbsp; No. He was \nmisdiagnosed<br>as<br>microcephaly.&nbsp; Fortunately I knew a thing or three, \nand the child, after<br>evaluation by a knowledgeable doctor,was correctly \ndiagnosed.&nbsp; Not only<br>that, the child now has government compensation, \nand is state supported.<br>That that child, also subsequently developed \nautism.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;But lets also talk about this measles epidemic that was \n </span></blockquote>supposed to be<br>forestalled by this campaign - during which some children \nreceived their<br>third MMR.&nbsp; The Health Department said the campaign \nprevented an<br>estimated<br>90% of cases that COULD HAVE HAPPENED.&nbsp; They \nof course tell the future<br>and<br>have crystal balls which mere mortals \ndon&#39;t...&nbsp; But what they don&#39;t tell<br>you, is<br><blockquote><span title=\"ireply\"> &gt;that of the thousands \n </span></blockquote>of children who did happen to get measles, most were<br>appropriately \nvaccinated, and some had had 3 MMR shots.&nbsp; And that some<br>of<br>the \nchildren hospitalised had severe measles. What they also don&#39;t tell<br>you<br>is \nthat of the unvaccinated pre-school children, very few landed in<br>hospital, \nnone had serious complication - and.... wait for it... most of<br>them caught it \nfrom the vaccinated children. That is actually the most<br>inter<br>esting thing \nabout this epidemic - that the early notifications were all<br>in<br>vaccinated \nchildren.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;Right now, we are in the midst of a whooping cough \n </span></blockquote>epidemic.&nbsp; And guess<br>what.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;Nearly all the cases are in \n </span></blockquote>fully vaccinated children.&nbsp; Who by our<br>regulations, are allowed to stay \nat school, since according to school<br>records, they are protected.&nbsp; This \nsituation is compounded, because many<br>cases are diagnosed incorrectly, so \nthat these vaccinated infectious<br>children, are erroneously at school with \nwhooping cough, because idiotic<br>doctors who believe vaccinated children can&#39;t \nget it, won&#39;t test for it<br>-<br>they just prescribe steroids for \nasthma.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;And these vaccinated infection spreading children, whose \n </span></blockquote>parents haven&#39;t a<br>clue that they have whooping cough, are spreading it to all \nthe other<br>vaccinated - and a few unvaccinated children.&nbsp; The Health \nDepartment is<br>aware of this.&nbsp; Are they doing anything?&nbsp; Yes, \nShowing an advertisement<br>of a<br>6 month old child with whooping cough and \nsaying &quot;Vaccination prevents<br>this...&quot;<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;My hope for you, and \n </span></blockquote>your family would usually be for the best of health.<br>After this program, \nI&nbsp; hope that circumstances in the future will bring<br>home<br>to you the \nreality of what hundreds of thousands of parents in USA \nare<br>now<br>suffering.&nbsp; So please, make sure your children and \ngrandchildren are<br>fully<br>vaccinated with all their boosters.&nbsp; Without \nyou taking this action, you<br>are<br><blockquote><span title=\"ireply\"> &gt;less likely to share, or understand, \n </span></blockquote>their pain.<br><blockquote><span title=\"ireply\"> &gt;Unless a close friend wakes you from your present \n </span></blockquote>torpor.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;Hilary Butler.<br>&gt;__________<br>&gt;I was \n </span></blockquote>disappointed in the handling of the measles case in last night&#39;s ER<br>episode \n(2/15/2001).&nbsp; It included distortions that can mislead \nthe<br>public<br>and, ultimately, affect the health of \nchildren.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;The incidence of autism as well as other chronic, \n </span></blockquote>auto-immune diseases<br>(asthma, diabetes, etc.) among children is growing at an \nalarming rate,<br>and<br>coincides with the increase in the number of \nvaccinations routinely<br>given to<br>children.&nbsp; The possible relationship \nbetween these diseases and various<br>vaccines has been recognized for a \ngeneration.&nbsp; Some physicians have<br>offered<br><blockquote><span title=\"ireply\"> &gt;the explanation that \n </span></blockquote>the chemicals included in vaccines tamper with the<br>body&#39;s immune system, both \nsuppressing and over-stimulating, until the<br>immune system finally starts \nattacking itself.&nbsp; New vaccines put forth<br>by<br>drug companies are being \naccepted by pediatricians and, in many cases,<br>mandated by state laws, without \nthe necessary long-term studies to<br>guarantee<br>safety.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;In \n </span></blockquote>last night&#39;s episode, the ER doctor dismisses these concerns with<br>statements \nthat there is &quot;no relationship&quot; between vaccines and autism,<br>and<br>that \n&quot;vaccines improve the immune system.&quot;&nbsp; Parents who take the time \nto<br>study the risks and benefits, and make their own choice \nagainst<br>vaccination,<br>rather than leaving it up to the experts, are \ndismissed as &quot;fringe<br>lunatics.&quot;&nbsp; The statistic of &quot;1 in 500 children die \nfrom measles&quot; does<br>not<br>take into account the previous health of the child, \nmanagement of the<br>disease, other complications, etc.&nbsp; In fact, this type \nof statement is<br>often<br>used by doctors to scare parents who question \nvaccine safety and make<br>them<br>fall into line.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;I would \n </span></blockquote>encourage you to balance the scales by presenting the other side of<br>the \nissue.&nbsp; You might present an episode where a child dies or \nbecomes<br>severely retarded following a vaccination.&nbsp; The parents then \ndecide not<br>to<br>give that vaccine to their younger child but are hounded by \nhealth and<br>child<br>welfare authorities because of state vaccination \nlaws.&nbsp; If you want to<br>study<br>some real-life cases for background \ninformation, the National Vaccine<br>Information Center at 1-800-909-SHOT or <a rel=\"nofollow\"\n target=\"_blank\" href=\"http://www.909shot.com/\">http://www.909shot.com/</a>&nbsp; could<br>surely \nprovide them.&nbsp; (Believe me, this situation is no more rare than a<br>health \nchild dying of measles.)<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;Martha \n </span></blockquote>Fitzgerald<br><blockquote><span title=\"ireply\"> &gt;__________<br>&gt;I&#39;m quite sad to say this, as a loyal viewer \n </span></blockquote>and fan of ER, but I believe<br>the Thursday, February 15 show was the last one \nI&#39;ll ever watch. And,<br>unfortunately, I&#39;ll most likely give up Will and Grace \nas well as the<br>West<br>Wing and Law and Order and Law and Order \nSVU.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;In your thinly disguised propaganda piece for vaccine \n </span></blockquote>manufacturers ER just<br>goes beyond anything a reasonable, fair-minded \nproduction should do. You<br>vacated the principle I wrongly believed was one of \nthe tenets for ER.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;I have not always agreed with the story lines \n </span></blockquote>of certain characters and,<br>frankly, this is the last<br><blockquote><span title=\"ireply\"> &gt;straw.&nbsp; When \n </span></blockquote>you portrayed the woman who was into herbs as slighly kooky<br>and astral, I let \nthat pass, when you have had highly medicated,<br>technical,<br>overly \ncomplicated births, I&#39;ve let those pass. I mean after all, I<br>expect<br>you to \nportray the allopathic opinion as this is an &quot;ER&quot; docu-drama. \nBut<br>the<br>vaccine episode was the end. The only accurate part of this story \nline<br>was<br>the condecension and pretentiousness as well as the \nclosemindedness and<br>parroting of the physicians.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;This wasn&#39;t a \n </span></blockquote>case of strong arguments on both sides where a doctor<br>disagrees with a \npatients desires or doctors differ about treatments --<br>those story lines \ncatch you and make you think -- that is one thing I&#39;ve<br>always admired about \nthe show, it&#39;s ability to put people between a rock<br>and<br>hard place with no \ndefinitive answer.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;Not only was the vaccine information presented \n </span></blockquote>inaccurate and highly<br>inflammatory, but it was<br><blockquote><span title=\"ireply\"> &gt;delivered so \n </span></blockquote>condesending and patronizing as to make me feel \nphysically<br>ill.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;It only takes a short look to determine that \n </span></blockquote>physicians are not always<br>correct in what they believe and do -- vaccine \ndoses, administration<br>schedules and formulas are as different around the \nglobe as the<br>languages<br>and colors of the people who inhabit this planet. \nThis is not the<br>proven,<br>safe, effective treatment physicians would have us \nbelieve it is.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;In addition, your portrayal of this woman as a \n </span></blockquote>blabbering ninny is<br>uncomprehensible and unforgivable.&nbsp; In the time I \nhave been researching<br>this<br>subject and making decisions (going on 11 years \nnow), I have found<br>people<br>who opt out of the vaccine roulette game to be \nintelligent, educated and<br>VERY concerned about their children. They know and \nunderstand concepts<br>and<br>information that would make you shrink and hide in \nthe closet. For most<br>of<br>us this has come at a dear \nprice.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;For me, my first son became quite ill the day after his \n </span></blockquote>first shot. I<br>thought he was going to die. From that day, until the time I \nquit doing<br>what<br>our pediatrician told us to do,he was one sick \nchild.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;For many of us parents, this can be categorized under the \n </span></blockquote>heading &quot;More<br>than We Wanted to Know.&quot; I was brought up in a midwestern state \nby a<br>highly-educated mom who was a physical therapist and convinced me \nthat<br>any<br>other approach was just quackery. I did not come to CHANGE my \nbeliefs<br>easily<br>or quickly. (Which BTW, I think most of us conscientious \nobjectors are<br>converts)<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;It was only after much agony and \n </span></blockquote>strenuous research I discovered the<br>dangers and issues associated with this \nprocess.&nbsp; (11 years ago there<br>WAS NO<br>internet for us, just a few \nbooks and a couple of people willing to<br>question<br>this). Just like the \nwoman in your story line I was LIED to! I live in<br>Minnesota where it is a \nparents&#39; free choice to opt out of this<br>dangerous<br>and untested practice. \nGuess what?!?!? NO ONE, not one single person<br>advised<br>me I had the right \nto opt out of this. Why would the doctors and others<br>have<br>to lie if this \nwas such a great, safe, effective thing?<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;It is this dissociative, \n </span></blockquote>mechanistic view of the world that causes the<br>problems. I too have been \npatronized by the John Carters, Deb Chens and<br>Cleo<br>Finch&#39;s of the world. \nIn most cases I was well into adulthood before<br>these<br>children were out of \ntheir diapers!<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;In this case, I have a free choice to discontinue \n </span></blockquote>viewing a tv show<br>blatantly bought and paid for by big drug \nmoney.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;Celia Cezzium<br>&gt;___________<br>&gt;From Feat <a rel=\"nofollow\"\n></a></span></blockquote>href=&quot;http://www.feat.org:&quot;&gt;www.feat.org:<br><blockquote><span title=\"ireply\"> &gt;The Mean Spirit of NBC&#39;s ER \n </span></blockquote>Episode<br><blockquote><span title=\"ireply\"> &gt;Commentary and Letters<br>&gt;<br>&gt;&nbsp;&nbsp;&nbsp;&nbsp; It \n </span></blockquote>is perhaps, the most overused cliché in medical television drama.<br>The patient \nlies motionless on a platform in surgery or the emergency<br>room<br>surrounded \nby medical types in high drama. Everyone is racing to<br>resuscitate<br>a \ncardiac arrest.&nbsp; &quot;Clear!&quot; shouts the rescuer.&nbsp; Paddles are \nslapped<br>down on<br>the victim&#39;s chest.&nbsp; The lifeless body arch in \nresponse to the thumping<br><blockquote><span title=\"ireply\"> &gt;sound of electricity supplied with a jolt.&nbsp; \n </span></blockquote>The pulse is checked.&nbsp; Nothing.<br>Again, &quot;Clear&quot; is shouted and another \njolt is hopefully applied, this<br>time<br>with some success. &quot;I&#39;m getting a \npulse!&quot; shouts a tech or nurse. <br>Cautious<br>sighs of relief are passed \naround to everyone in room, and also to the<br>loved<br>ones observing from a \ndistance.&nbsp; Most of the time the viewer can guess<br>whether the patient is \ngoing to make it or not depending on the context<br>of<br>the \nplot.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;&nbsp;&nbsp;&nbsp;&nbsp; On last night&#39;s episode of NBC&#39;s \n </span></blockquote>ER, this cliché played out again with<br>a handsome blond-hair, blue-eyed, \nnourished, four year old boy with<br>morbid<br>complications from \nmeasles.&nbsp;&nbsp; The mother explains that she intentionally<br>did<br>not \nhave her children inoculated out of her concern over possible<br>vaccine<br>side \neffects.&nbsp; Autism is specifically mentioned.&nbsp; The boy gets his \nheart<br>restarted, but he remains unconscious and \nmotionless.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;&nbsp;&nbsp;&nbsp;&nbsp; &quot;Is he ok?&quot; asks the \n </span></blockquote>frightened mother.&nbsp; &quot;Yea, he&#39;s doing fine,&quot; the<br>doctor sarcastically \nsneers back without looking at her.&nbsp; Portraying the<br>mother as suburban \nand articulate highlights the contempt.&nbsp; This is not<br>white trash \noperating from ignorance.&nbsp; No sir, this is one of those<br>educated<br>moms \nwho gets her information on vaccines and autism from questionable<br>sources on \nthe Internet and not the family pediatrician. Every word of<br>dialog that \naddresses the mother from that point on is expressed \nwith<br>utter<br>contempt.&nbsp; The writers could have added the phrase &quot;you \nstupid,<br><blockquote><span title=\"ireply\"> &gt;irresponsible twit&quot; to end of every sentence spoken to her.&nbsp; \n </span></blockquote>The boy dies<br>shortly thereafter. You couldn&#39;t make it any more heavy handed \nwithout<br>having the ER set morphing into a Smack Down Wrestling \nevent.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Considering that this \n </span></blockquote>publication is the most-read, highest profile<br>independent source of \ninformation on autism and vaccines on the<br>Internet,<br>the program&#39;s \nreferences are to you, our readers, and to us, the FEAT<br>newsletter.&nbsp; We \nhad a role in killing that beautiful, innocent little<br>boy,<br>is the \nimplication.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;&nbsp;&nbsp;&nbsp; The mean spiritedness of NBC&#39;s ER \n </span></blockquote>message can only add heat, not light<br>to the public conversation now going on \nabout the safety of vaccines. <br>The<br>desire for parents to make informed \ndecisions about their children&#39;s<br>health<br>should be encourage, and not \nvilified with comic book theatrics like \nthe<br>ER<br>production.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;&nbsp;&nbsp;&nbsp; The autism community \n </span></blockquote>demonstrates every day its commitment to a fair<br>handed and competent \neducation of ourselves on the issue of vaccines and<br>their \nsafety.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;&nbsp;&nbsp;&nbsp; With the incidence of autism being at \n </span></blockquote>its historical high, it is only a<br>matter of time before someone close in the \nfamily of an ER writer or<br>producer has an autistic child.&nbsp; It is only a \nmatter of time before<br>someone<br>in the family of a programming executive at \nNBC gets autism.&nbsp; And when<br>that<br>happens we suggest that you avoid \nyour own spin and theatrical<br>productions;<br>it won&#39;t help you much.&nbsp; We \nsuggest you come here to get a balanced<br>presentation of the facts on vaccines \nand autism.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;&nbsp;&nbsp;&nbsp; When you come you will find a \n </span></blockquote>responsible commitment to the facts, and<br>not theatrics and scare tactics, if \nyou read this newsletter.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; You will \n </span></blockquote>find that we do not sneer sarcastically at families who<br>suddenly find \nthemselves with disasters like autism or any of the other<br>possible side \neffects of vaccines, no matter where you come from,<br>hometowns<br>or \nHollywood.&nbsp; We won&#39;t bash you - simply because at the least, you \nhave<br>now<br>become one of us.&nbsp; It&#39;s just a matter of time.<br><blockquote><span title=\"ireply\"> &gt;Lenny \n </span></blockquote>Schafer<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;P.S.<br>&gt;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; From the early \n </span></blockquote>letters, a number of readers noted the contradiction<br>of ER Show star Anthony \nEdwards and character Dr. Green, being connected<br>to<br>this production.&nbsp; \nEdwards is a high-profile supporter of autism research<br>and<br>works closely \nwith Cure Autism Now (CAN).&nbsp; Often it is asked, &quot;Why<br>didn&#39;t he<br>say \nsomething to someone about this awful presentation of \nparents<br>concerned<br><blockquote><span title=\"ireply\"> &gt;about autism?&quot;<br>&gt;<br>&gt;Jon Shestack of CAN \n </span></blockquote>provides following explanation of Edward&#39;s \nrole.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; I have spoken with Anthony \n </span></blockquote>Edwards who did not agree nor endorse that<br>storyline and was in fact \ndistressed by the patronizing dismissal of<br>family<br>concerns about vaccine \nsafety. Evidence of this is that Tony&#39;s,<br>character,<br>Dr. Green, did not \nparticipate in that story.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;&nbsp;&nbsp;&nbsp;&nbsp; The idea for \n </span></blockquote>the episode rests totally with John Wells who is the<br>executive producer and \ncreator of the show and who basically gets to do<br>what<br>he wants. That he \nwas influenced by his pediatrician, the American<br>Academy<br>of Pediatricians, \nthe National Institute of Child Health, and vaccine<br>manufacturers is possible \nand even likely but totally beyond Tony&#39;s<br>sphere<br>of \ninfluence.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;__________<br>&gt;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; First \n </span></blockquote>the vaccine commercial with the episode (who say&#39;s advertisers<br>don&#39;t pay for \nHollywood scripts), then the worst case of scare tactics I<br>have ever seen on \nTV. ER and those associated with that program should<br>be<br>ashamed of \nthemselves. Bought and paid for to the highest bidder. At the<br><blockquote><span title=\"ireply\"> &gt;very least \n </span></blockquote>they should disclose in the credits the names of the<br>scriptwriters from Merck \nwho wrote this fiction.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;&nbsp;&nbsp;&nbsp;&nbsp; First Hollywood \n </span></blockquote>makes &quot;Rain Man&quot; and tells us it&#39;s about autism, later<br>we find out the \ncharacter the story is based in part, on someone who is<br>not<br>even \nautistic!&nbsp; Now tonight Hollywood does it again, this time \nserving<br>as<br>the mouthpiece of the vaccine manufacturers and their cronies \nin the<br>public<br>health department telling us about autism and MMR, nothing \nbased on<br>science<br>mind you, only scare tactics designed to coerce parents \ninto vaccinating<br>their children at all \ncosts.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;&nbsp;&nbsp;&nbsp; Hollywood should stick to what it does \n </span></blockquote>best: making cartoons.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;Rick \n </span></blockquote>Rollens<br><blockquote><span title=\"ireply\"> &gt;__________<br>&gt;<br>&gt;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; \n </span></blockquote>WOW!!&nbsp; I can&#39;t believe what I just saw on ER tonight.&nbsp; Did you \ndo<br>your homework?&nbsp; What a pathetic display of misinformation.&nbsp; Do \nyou have<br>any<br>idea of how many families are touched by horrible reactions \nto<br>vaccination<br>(including death)?&nbsp; If your actors were aware of the \ntruth would they<br>agree<br>to portray this information in the light it was \npresented?&nbsp; I find the<br>timing of this program quite ironic with all the \ncontroversy over the<br>validity and safety of our current vaccination \nprogram.&nbsp; I sure hope you<br>are<br>prepared to present the other side of \nthis story.<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; A funny thing \n </span></blockquote>happened to me about a month ago.&nbsp; I was at one of our<br>local elementary \nschools to do a presentation.&nbsp; During the two hours I<br>was<br>there two \nstudents presented to the school nurse, one with mumps and one<br>with \nmeasles.&nbsp; Both were vaccinated.&nbsp; What&#39;s up with \nthat?<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;You lost a viewer.<br>&gt;<br>&gt;Yvonne Wood, \n </span></blockquote>D.C.<br><blockquote><span title=\"ireply\"> &gt;__________<br>&gt;<br>&gt;&nbsp;&nbsp;&nbsp; Parents of children of \n </span></blockquote>with Autism are accustomed to humiliation.&nbsp; For<br>thirty years, mothers \nwere blamed and humiliated for causing their<br>children&#39;s illness.&nbsp; These \ndays parents face the humiliation of stares<br>and<br>comments from the \nmisinformed public as we go about the concerns of<br>daily<br>living.&nbsp; We \nare humiliated as we beg the medical community to turn their<br>attention to \nthis long neglected area of medical research.&nbsp; We are<br>humiliated as we \nbeg doctors to look at our children&#39;s physical as well<br>as<br>behavioral \nsymptoms.&nbsp; We are humiliated as we beg educators to teach<br>rather<br>than \nbaby-sit our children.<br><blockquote><span title=\"ireply\"> &gt;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Last night you \n </span></blockquote>ensured that thousands of parents would continue to be<br>humiliated, when you \ndismissed the possible nexus between vaccines and<br>autism and, by example, \nhelp make it publicly acceptable to treat<br>parents<br>who have concerns about \nvaccines with contempt and disdain.<br><blockquote><span title=\"ireply\"> &gt;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; I \n </span></blockquote>challenge you, NBC, to do better.&nbsp; Because of Anthony Edward&#39;s<br>support \nfor autism research, we parents have looked to ER as a place of<br>comfort and \nadvocacy.&nbsp; Why not take a stand for our children, by<br>creating \nan<br>episode where regressive autism and what really happens to parents \nand<br>children on this journey are depicted in a realistic way?&nbsp; And, \nhaving<br>profited from dismissing our children during sweeps month, why not \nshare<br>those profits by making a generous donation toward Autism \nresearch?&nbsp; It<br>is<br>not too late to put things right \nhere.<br><blockquote><span title=\"ireply\"> &gt;Heather Coburn \n </span></blockquote>Snyder<br><blockquote><span title=\"ireply\"> &gt;<br>&gt;<br>&gt;-------------------------------------------------------------------<br>&gt;Dawn \n </span></blockquote>Richardson<br><blockquote><span title=\"ireply\"> &gt;PROVE(Parents Requesting Open Vaccine Education)<br>&gt;<a rel=\"nofollow\"\n></a></span></blockquote>href=&quot;mailto:prove@...&quot;&gt;prove@... (email)<br><blockquote><span title=\"ireply\"> &gt;<a rel=\"nofollow\"\n></a></span></blockquote>href=&quot;http://vaccineinfo.net/&quot;&gt;http://vaccineinfo.net/ (web \nsite)<br><blockquote><span title=\"ireply\"> &gt;-------------------------------------------------------------------<br>&gt;PROVE \n </span></blockquote>provides information on vaccines, and immunization policies and<br>practices \nthat affect the children and adults of Texas.&nbsp; Our mission \nis<br>to<br>prevent vaccine injury and death and to promote and protect the \nright of<br>every person to make informed independent vaccination decisions \nfor<br>themselves and their \nfamily.<br><blockquote><span title=\"ireply\"> &gt;-------------------------------------------------------------------<br>&gt;This \n </span></blockquote>information is not to be construed as medical OR legal \nadvice.<br><blockquote><span title=\"ireply\"> &gt;-------------------------------------------------------------------<br>&gt;Subscribe \n </span></blockquote>to PROVE Email Updates:<br><blockquote><span title=\"ireply\"> &gt;Click here <a rel=\"nofollow\"\n></a></span></blockquote>href=&quot;http://vaccineinfo.net//subscribe.htm&quot;&gt;http://vaccineinfo.net//subscribe.htm<br><blockquote><span title=\"ireply\"> &gt;-------------------------------------------------------------------<br><br><br> </span></blockquote>________________________________________________________________________<br>________________________________________________________________________<br><br><br></font></div></html></div>","specialLinks":[]}],"prevTopicId":16517,"nextTopicId":16583}}