{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":132800757,"authorName":"encadia@aol.com","from":"encadia@...","profile":"lasvegashillgirl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"child entertaining PS thoughts","postDate":"1044596975","msgId":58185,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNC4xYWI4OWYyZC4yYjc0YTJlZkBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":58184,"nextInTime":58186,"topicId":58185,"numMessagesInTopic":0,"msgSnippet":"I would like to share my thoughts on children that entertain PS thoughts. I am on my second time around homeschooling the same child. He reached a point of","messageBody":"<div id=\"ygrps-yiv-416766689\">I would like to share my thoughts on children that entertain<br/>\nPS thoughts. <br/>\n<br/>\nI am on my second time around homeschooling the same child.<br/>\nHe reached a point of wanting to go back to school, the pressure<br/>\nwas intense. Not only from him, but everyone else who had<br/>\nreservations about homeschooling in the first place, jumped<br/>\non the band wagon and cheered him on. His mind was made up.<br/>\nI let him go back, it was a new school, I had high hopes for him.<br/>\nHe was 12.<br/>\nIt was wonderful in the begining. Thats what you would call the<br/>\nhoneymoon period. That ended quite abrubtly.<br/>\n<br/>\nBecause I have been through this, I know first hand that<br/>\nIt can be very damaging, to both of you. I would recommend<br/>\nthinking things through before making any changes.<br/>\nAlso, keep in mind that putting them in to PS, and taking<br/>\nthem out, its not that easy, espcially if you are not expecting it<br/>\nwhen the time comes.<br/>\n<br/>\nBe prepared for open arms from the school when the first<br/>\nday comes, and then watch your back, as its going to come <br/>\nback on YOU hard and fast when your child doesn&#39;t handle<br/>\nthe school work, or a situation the right way.<br/>\nIf you have had a hard time understanding unschooling, but<br/>\ntrying it out, I will tell you right now, that this unschooling not well<br/>\nknown in the PS system, and YOUR child will probably turn into<br/>\nthe best damn spokesperson on the subject, when asked<br/>\nwhat was homeschool like by a teacher, or other peers!<br/>\n<br/>\nMy Son recieved so many compliments when he first started<br/>\nschool, his kindness, and manners, impressed the school staff.<br/>\nHe went to school, nicely dressed and handsome!<br/>\nAs the months passed, I watched our son turn into a selfish<br/>\nbrat. He didn&#39;t care if his clothes were clean or dirty, or were<br/>\nplay clothes. Screamed if I told him to take a bath, or just<br/>\nwash his hair. I had forgotten this PS side of him. I hated<br/>\nthe mornings with a passion. <br/>\n<br/>\nIf you think your child has any learning disabilities, brace yourself<br/>\nfor and special ed. services or something called an IEP. <br/>\n<br/>\nI found out what had been going on at school. My son broke<br/>\ndown at the kitchen table one night crying and told me everything.<br/>\nThe damage was done. I was furious, and immediately pulled him.<br/>\n<br/>\nStarting a family business and making it work is hard. Having<br/>\nDrew home has been a big change and has added more to my<br/>\nday, I am also not used to having him around everyday. This<br/>\nis a small price to pay, not many understand my commitment,<br/>\nand thats ok. I used to constantly worry, about way too many<br/>\nwhat if&#39;s when I had him home before. (I had a very long list<br/>\nof anxieties!) LOL. <br/>\n<br/>\nGod and I have alot of talks. <br/>\n<br/>\nI don&#39;t know everything, but I know where we have been.<br/>\n<br/>\nLinda<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":58174,"nextTopicId":58085}}