{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":197421595,"authorName":"Katy Jennings","from":"&quot;Katy Jennings&quot; &lt;kjennings95@...&gt;","profile":"coyotegoddess95","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"[AlwaysLearning] Expressing feelings of dissapointment","postDate":"1112558253","msgId":21946,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTUtREFWMzBGMEQzNDBGREE5NkUzNDk5QzUzMUJFM0EwQHBoeC5nYmw+","referencesHeader":"PDFhYy4zNDQ4MTkxMy4yZjZhZjViMEBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":21945,"nextInTime":21947,"topicId":21946,"numMessagesInTopic":0,"msgSnippet":"I guess I am going to be the lone dissenter. I think that showing disappointment is fine, but I do think that it should be done with some restraint.  While I","messageBody":"<div id=\"ygrps-yiv-1483018061\">I guess I am going to be the lone dissenter.<br/>\nI think that showing disappointment is fine, but I do think that it should be done with some restraint.  While I do think it would be nice to see some of the &quot;movie stars&quot; show disappointment when they lose, I don&#39;t want to be sitting watching with my child and see them say &quot;F--k!&quot;    <br/>\n<br/>\nMy son does taekwondo.  At one of the testings, there was an adult testing for his black belt.  He had done really well, then he didn&#39;t break one of his boards after 3 tries, an automatic retest.  He was visibly upset, ok, I can handle that, but then he hangs his head, punches the air, curses under his breath, and kicks the mat.  I am sorry, but I don&#39;t think that was necessary.  My son asked why he acted like that, after all he can retest in 2 months, and it wasn&#39;t a life or death thing.  I guess it is just a perspective issue.  We all get disappointed at times, but I would rather any energy that I expend be positive.  <br/>\n<br/>\nPlease understand that I am not talking about not honoring children&#39;s feelings of disappointment, or telling them that they &quot;should&quot; act a certain way.  I would just rather model positive behavior for my son when I can.  He has seen me upset, and very disappointed, but I prefer to &quot;take the high road.&quot;  <br/>\n<br/>\nA while back Richard&#39;s child care provider decided that she didn&#39;t want Richard coming any more.  She never gave me a reason why.  She said that she was dropping from 6 to 4 kids, and that Richard had to be one of the ones to go.  This didn&#39;t make sense to me, because one of the ones that she was keeping hadn&#39;t been there as long as Richard.  I was extremely upset, angry, hurt, pissed off.  I wanted to tell her that she was a f------ b---- for hurting my child (he felt like they were a second family).  I probably would have been less upset if she had justified her decision to me, but she didn&#39;t offer any explanation at all.  I did cry with Richard, and I yelled when talking about it, but to her I didn&#39;t yell or cry (well,  maybe a little).  I tried to stay calm while I told her how wrong I thought she was, and that she owed us an explanation.   It wouldn&#39;t have helped my son any to call her names, or to curse and yell.  Much later I thought that maybe she kept that other boy instead of Richard because his home life is less than stable and he would have been sent to public school if she dropped him, but without a real explanation I am just guessing.  <br/>\n<br/>\nKaty<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":21914,"nextTopicId":21947}}