{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":332164648,"authorName":"Rippy Dusseldorp","from":"&quot;Rippy Dusseldorp&quot; &lt;ripgray@...&gt;","profile":"rdusseldorp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Deschooling (parents)","postDate":"1316299251","msgId":62964,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo1MzdsaitpbDk1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEwNkVCNzBDLUI4MTMtNDZFRC04OEVDLURCRTVDREY1REJGN0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":62935,"nextInTopic":0,"prevInTime":62963,"nextInTime":62965,"topicId":62894,"numMessagesInTopic":0,"msgSnippet":"-=-times when something you were doing as an adult strengthened your confidence in natural learning -=- My different experiences with learning to read in","messageBody":"<div id=\"ygrps-yiv-99763335\">-=-times when something you were doing as an adult strengthened<br/>\nyour confidence in natural learning -=-<br/>\n<br/>\nMy different experiences with learning to read in different languages has been something that has given me confidence in natural learning.<br/>\n<br/>\nI learned to read English in elementary school and I ended having to go to remedial class. I have memories of it being painfully difficult and boring. It only clicked for me when I was 8 years old and I&#39;ve loved reading in English ever since.<br/>\n<br/>\nWhen I was 8, I learned how to read Hindi in about 3 weeks. My parents had sent me away to India to live in a boarding school for a few months. I had never been exposed to Hindi before this. The teachers used physical punishment to accelerate learning - making me find sticks that they would use to hit me across the palms of my hand. I lost my ability to read Hindi within a few months of leaving India.<br/>\n<br/>\nWhen I was 12, I took French and struggled for the next 6 years. I did okay in the exams, but never learned more than necessary to pass the exams. I took one year of French in University and did not enjoy it, struggling all the time. I got an A in the course, but my knowledge was all smoke and mirrors. Today I would struggle with simple sentences.<br/>\n<br/>\nWhen I was 14, I was sitting in prayers in the temple and I didn&#39;t want to be there. I felt I could not leave without my mom&#39;s disapproval, so I decided to decode our Punjabi hymn book as a fun mental challenge. I first taught myself the numbers and letters using the table of contents and once I had figured those out, I matched the words that were being sung to the words in the hymn book. I figured out the vowels and consonants. Within a couple of hours, I had decoded Punjabi and I could read at a beginner&#39;s level. I rarely read any Punjabi now, but if I have a few minutes to review, I can usually make out the text if I had to.<br/>\n<br/>\nWhen I was 29, I had to enroll in a Dutch language course for Dutch citizenship. I was interested and I wanted to be there. After about one year of biweekly night classes, I got an A in the reading section of the course for the minimal level I needed. Dutch is the only other language I read in - never for pleasure, only for information.<br/>\n<br/>\nRippy</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Deschooling (parents)","postDate":"1316255948","msgId":62935,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUwRDA1MzgyLUVGQkItNDlDNy05Q0JFLTdDQkZFMTI0MDAxOUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDEwNkVCNzBDLUI4MTMtNDZFRC04OEVDLURCRTVDREY1REJGN0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDEwNkVCNzBDLUI4MTMtNDZFRC04OEVDLURCRTVDREY1REJGN0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":62901,"nextInTopic":62964,"prevInTime":62934,"nextInTime":62936,"topicId":62894,"numMessagesInTopic":0,"msgSnippet":"... Oh, just this week! This is mostly a pulling in a big chunk of knowledge story that added to a natural accumulation of knowledge to do something new. ","messageBody":"<div id=\"ygrps-yiv-155493\">On Sep 15, 2011, at 6:11 AM, Sandra Dodd wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Think of things like that in your own life that weren&#39;t about  <br/>\n&gt; interactions with your children, but times when something you were  <br/>\n&gt; doing as an adult strengthened your confidence in natural learning,  <br/>\n&gt; or shed light on an aspect you hadn&#39;t considered, maybe.<br/>\n<br/>\n </span></blockquote>Oh, just this week! This is mostly a &quot;pulling in a big chunk of  <br/>\nknowledge&quot; story that added to a natural accumulation of knowledge to  <br/>\ndo something new.<br/>\n<br/>\nI&#39;ve been admiring some very creative cakes on deviantArt. The ones  <br/>\nwith the hard shiny coatings in bright colors. They look like  <br/>\nSculpey :-) (Apparently they&#39;ve also been a big deal on cooking shows  <br/>\nand a staple of wedding cakes for some time but those aren&#39;t circles I  <br/>\nfrequent.)<br/>\n<br/>\nI didn&#39;t even know what they were called but there was a bake sale for  <br/>\nthe church coming up and I decided I wanted to try making some. And,  <br/>\nvia the internet, within an hour or so I not only knew what they were  <br/>\ncalled (fondant, it even feels like Sculpey) but through YouTube had  <br/>\ngained enough additional skills to add to the years of playing with  <br/>\nPlayDoh and Sculpey to actually create some that look pretty  <br/>\ndecent :-) (I&#39;ll take some pictures.)<br/>\n<br/>\nThe internet helped with the cake part too since though I&#39;ve baked  <br/>\ncookies, muffins, pies and bread, I&#39;ve probably made like 3 cakes in  <br/>\nmy life before this. None of us are big cake fans so it wasn&#39;t a skill  <br/>\nI really needed before this. And when I needed it, I went out and got  <br/>\nit. ;-)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":336246301,"authorName":"NCMama","from":"&quot;NCMama&quot; &lt;dharmamama1@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Deschooling (parents)","postDate":"1316105122","msgId":62901,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo0dGEzMis4ZzRyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEwNkVCNzBDLUI4MTMtNDZFRC04OEVDLURCRTVDREY1REJGN0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":62900,"nextInTopic":62935,"prevInTime":62900,"nextInTime":62902,"topicId":62894,"numMessagesInTopic":0,"msgSnippet":"I have a facility for hearing accents, and knowing where a person is from, especially which part of my own state, North Carolina. There is a town not far from","messageBody":"<div id=\"ygrps-yiv-1536468555\">I have a facility for hearing accents, and knowing where a person is from, especially which part of my own state, North Carolina. There is a town not far from here whose residents (to me) have a very distinct way of almost slurring their words. I&#39;ll ask someone, &quot;Oh, are you from Gastonia?&quot; and they&#39;re surprised I know. I can usually tell if someone is Native American by their accent. I usually know if someone is from Maine, because we vacationed there when I was a child, and can usually &quot;hear&quot; the difference between a Maine accent and a New Hampshire or Massachusetts accent.<br/>\n<br/>\nI&#39;ve never studied linguistics, or checked out any books on phonology. It&#39;s from observing, and listening. It&#39;s not something I even consciously did - I did not set out one day, thinking, &quot;Today, I&#39;m going to learn dialects!&quot; Some part of me must have enjoyed that categorization.<br/>\n<br/>\nI&#39;ve also been playing a lot of Solitaire on my phone, the game called &quot;Klondike&quot;, which is the one with seven cards across on which you place descending cards in alternate colors, and you build up the suits in order on 4 separate stacks. I had the thought a few days ago that I could probably tell very early on which games I was going to lose, by paying close attention to the remaining cards in the deck. I wouldn&#39;t need to play for even 1 whole minute, I could determine really quickly if winning was possible. <br/>\n<br/>\nI haven&#39;t done that, but just the thought was exciting to me. Normally, I would not have felt &quot;smart&quot; enough to even think about doing that. I did really well in math in school, until it came time for statistics and probability. I still &quot;did well&quot; and made A&#39;s, because I figured out the formulae to get the correct answers, but I never understood what I was doing. When I&#39;ve heard people talk about players in Vegas counting cards, I would think, &quot;Oh, I couldn&#39;t do that - that&#39;s that whole statistics thing.&quot;<br/>\n<br/>\nKnowing that, if I wanted to put the time and effort into learning how to parse out the remaining cards, I could, made me feel more capable. <br/>\n<br/>\nCaren</div>","specialLinks":[]},{"userId":237699340,"authorName":"messy_boys","from":"&quot;messy_boys&quot; &lt;messy_boys@...&gt;","profile":"messy_boys","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Deschooling (parents)","postDate":"1316099848","msgId":62900,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo0dDR1OCt1MWNwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEwNkVCNzBDLUI4MTMtNDZFRC04OEVDLURCRTVDREY1REJGN0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":62894,"nextInTopic":62901,"prevInTime":62899,"nextInTime":62901,"topicId":62894,"numMessagesInTopic":0,"msgSnippet":"... Recently I needed to figure out how much mulch I needed for a flower bed.  Mulch is sold in bags by cubic feet.  I had no idea how to figure how many","messageBody":"<div id=\"ygrps-yiv-1010548329\"><blockquote><span title=\"ireply\">&gt;&gt;Think of things like that in your own life that weren&#39;t about &gt;&gt;interactions with your children, but times when something you were &gt;&gt;doing as an adult strengthened your confidence in natural learning, &gt;&gt;or shed light on an aspect you hadn&#39;t considered, maybe.<br/>\n<br/>\n<br/>\n </span></blockquote>Recently I needed to figure out how much mulch I needed for a flower bed.  Mulch is sold in bags by &#39;cubic feet.&#39;  I had no idea how to figure how many bags I needed.  I&#39;m sure somewhere in public school I learned how to figure cubic feet, but it&#39;s blank now.<br/>\n<br/>\nI simply got on the computer and searched for &quot;calculate cubic feet.&quot;  A calculator came up, I put in the needed measurements, and voila - I knew exactly how many bags I needed.<br/>\n<br/>\nThanks for making me think about this!<br/>\nKristie</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Deschooling (parents)","postDate":"1316081463","msgId":62894,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwNkVCNzBDLUI4MTMtNDZFRC04OEVDLURCRTVDREY1REJGN0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":62900,"prevInTime":62893,"nextInTime":62895,"topicId":62894,"numMessagesInTopic":0,"msgSnippet":"I was working on editing this week s chat, and found a story that people didn t respond to, but it s a good one, and important.  This list is a better place","messageBody":"<div id=\"ygrps-yiv-825076362\">I was working on editing this week&#39;s chat, and found a story that people didn&#39;t respond to, but it&#39;s a good one, and important.  This list is a better place for it anyway.  <br/>\n<br/>\nJill Parmer: I have a story about another piece of school thought falling off of me.<br/>\n <br/>\nJill Parmer: When Steve and I were getting our outer brick wall redone, we did all the hard demo work. And at one point I was digging dirt away from the foundation, and a strong thought crossed my mind.  That I can do this work even though I didn&#39;t go to school for construction. And it felt so good to be competent, and just keep working bit by bit.<br/>\n<br/>\n========================<br/>\n<br/>\nThink of things like that in your own life that weren&#39;t about interactions with your children, but times when something you were doing as an adult strengthened your confidence in natural learning, or shed light on an aspect you hadn&#39;t considered, maybe.<br/>\n<br/>\nIf you share it with the discussion list, that&#39;s even better, but just thinking through your own recent thoughts and actions might help with your deschooling or confidence.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":62962,"nextTopicId":62905}}