{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":1509055,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: I am beginning to think we need  to take more of an unschooling approach.","postDate":"1009475556","msgId":30291,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMC4yLjEuMC4yMDAxMTIyNzA5NDYxMC4wMjM0ZDE4MEBwb3AuaXNsYW5kbmV0LmNvbT4=","inReplyToHeader":"PEYxNTg2NDE0LUZBNEUtMTFENS05QkRELTAwMDM5MzQ5RDRBRUBob3VzdG9uLnJyLmNvbT4=","referencesHeader":"PGEwZDAxZCtqYjZ0QGVHcm91cHMuY29tPg=="},"prevInTopic":30289,"nextInTopic":0,"prevInTime":30290,"nextInTime":30292,"topicId":30227,"numMessagesInTopic":0,"msgSnippet":"... Great post, Mimi.  I ve saved it in case my son starts talking about school again.  He still hadn t made up his mind by the end of summer this year.  We","messageBody":"<div id=\"ygrps-yiv-1656172520\"><blockquote><span title=\"ireply\">&gt;  Also, do the ps<br/>\n&gt;do anything to accommodate ADD students?<br/>\n&gt;<br/>\n&gt;++++++++++++++++++++++++++++++<br/>\n&gt;<br/>\n&gt;I would like to respond to your last question.<br/>\n<br/>\n </span></blockquote>Great post, Mimi.  I&#39;ve saved it in case my son starts talking about school <br/>\nagain.  He still hadn&#39;t made up his mind by the end of summer this <br/>\nyear.  We went to visit a cousin I hadn&#39;t seen since 1985.  At that time, I <br/>\nwas unschooling my older boy, and my cousin was quite negative about <br/>\nit.  This time was different.  She&#39;s been a special ed teacher for many <br/>\nyears now.  Through dinner she was going on about all the kids that she <br/>\nhasn&#39;t been able to help because of the system and because of various <br/>\npower-tripping principals, etc.  At the end of dinner, she leaned over to <br/>\nmy son and said, &quot;I can&#39;t remember what your mother told me.  Are you going <br/>\nto school this year?&quot;  He thought for a second and then mumbled, &quot;no&quot;.  I <br/>\nthanked her later.  I&#39;d let him go if he really wanted to, but I think it <br/>\nwould be a disaster.  And now the teachers are on strike, which in this <br/>\nprovince means they have to teach but they don&#39;t have to do any of the <br/>\nvolunteer things they usually do, like coaching teams, putting on concerts <br/>\nand plays, supervising clubs, etc.  All the stuff that makes school <br/>\nbearable for a lot of kids.  That pretty well takes away all the reasons he <br/>\nwanted to go.<br/>\nTia<br/>\n<br/>\nNo one can make you feel inferior without your consent.<br/>\nEleanor Roosevelt<br/>\n*********************************************<br/>\nTia Leschke<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a><br/>\nOn Vancouver Island</div>","specialLinks":[]},{"userId":1509055,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: I am beginning to think we need  to take more of an unschooling approach.","postDate":"1009475162","msgId":30289,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMC4yLjEuMC4yMDAxMTIyNzA5NDUwMi4wMjM1MzU4MEBwb3AuaXNsYW5kbmV0LmNvbT4=","inReplyToHeader":"PDIwMDExMjI3MDEyMjU1LjYyNDE0LnFtYWlsQHdlYjExNjA4Lm1haWwueWFob28uY29tPg==","referencesHeader":"PEYxNTg2NDE0LUZBNEUtMTFENS05QkRELTAwMDM5MzQ5RDRBRUBob3VzdG9uLnJyLmNvbT4="},"prevInTopic":30272,"nextInTopic":30291,"prevInTime":30288,"nextInTime":30290,"topicId":30227,"numMessagesInTopic":0,"msgSnippet":"... I had a very few excellent teachers in my schooling life.  Most of them quit to do something else.  They couldn t handle the system. Tia No one can make","messageBody":"<div id=\"ygrps-yiv-887605354\"><blockquote><span title=\"ireply\">&gt;  Thank you for voicing your opinion first-hand. I have a neighbor who is <br/>\n&gt; a teacher and she expresses some of the same complaints, so I know it <br/>\n&gt; must be true. It really is a shame that some people start out wanting to <br/>\n&gt; give so much to teaching and leave frustrated because the system doesn&#39;t <br/>\n&gt; allow it. I have enjoyed some very nice friendships over the years with <br/>\n&gt; some of my childrens&#39; teachers. I even considered going into teaching <br/>\n&gt; myself. I would have had a lot of the same frustrations.<br/>\n<br/>\n </span></blockquote>I had a very few excellent teachers in my schooling life.  Most of them <br/>\nquit to do something else.  They couldn&#39;t handle the system.<br/>\nTia<br/>\n<br/>\nNo one can make you feel inferior without your consent.<br/>\nEleanor Roosevelt<br/>\n*********************************************<br/>\nTia Leschke<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a><br/>\nOn Vancouver Island</div>","specialLinks":[]},{"userId":89240901,"authorName":"Mimi Moorehead","from":"Mimi Moorehead &lt;groundhoggirl@...&gt;","profile":"groundhoggirl2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] I am beginning to think we need to take more of an unschooling approach.","postDate":"1009418806","msgId":30272,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYxQTVENEZBLUZBNkUtMTFENS05QkRELTAwMDM5MzQ5RDRBRUBob3VzdG9uLnJyLmNvbT4=","inReplyToHeader":"PDIwMDExMjI2MTY1Ni5mQlFHdWhYUjAxMDgzMUBueWNzbXRwMW91dC5yZGMtbnljLnJyLmNvbT4="},"prevInTopic":30271,"nextInTopic":30289,"prevInTime":30271,"nextInTime":30273,"topicId":30227,"numMessagesInTopic":0,"msgSnippet":"... I totally agree with your advice here, Kolleen.  He should be allowed to make the decision of whether to go back or not.  I would make it absolutely clear,","messageBody":"<div id=\"ygrps-yiv-1835864949\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt;<br/>\n&gt;&gt; Maybe I should let him decide<br/>\n&gt;&gt; for himself and maybe he&#39;ll decide to hs again.<br/>\n&gt;<br/>\n&gt; An unschooling parent would adhere to this, in spite of how hard it <br/>\n&gt; would<br/>\n&gt; be to watch a decision that you may know is inherently wrong.<br/>\n&gt;<br/>\n&gt;&gt; But I also know that<br/>\n&gt;&gt; if he does, he will feel very bad about himself if he finds returning<br/>\n&gt;&gt; was a mistake.<br/>\n&gt;<br/>\n&gt; And then he can leave again. Sometimes one needs a few times to figure<br/>\n&gt; out if their decision is the best one.<br/>\n&gt;<br/>\n&gt;&gt; I have considered waiting to see how the rest of this<br/>\n&gt;&gt; year goes and if he is not doing better at home, there is no way he<br/>\n&gt;&gt; could cut it in ps and maybe I should make that decision (although I<br/>\n&gt;&gt; hesitate to).<br/>\n&gt; ============<br/>\n&gt; If he wants to go back. Let him. Also let him know that he has other<br/>\n&gt; decisions. Such as unschooling. Its hard for a parent to step back, but<br/>\n&gt; you need to at this point. Offer him his choices, you may even want to<br/>\n&gt; sit down and write them out with him. Then support his decison and let<br/>\n&gt; him know he can change at any point he wants and you will support that<br/>\n&gt; too.<br/>\n&gt; ==============<br/>\n </span></blockquote>I totally agree with your advice here, Kolleen.  He should be allowed to <br/>\nmake the decision of whether to go back or not.  I would make it <br/>\nabsolutely clear, however, that he can leave and come back home to <br/>\nunschooling at any time.  I think your suggestion of writing down the <br/>\nchoices, is a very good one.<br/>\n<blockquote><span title=\"ireply\"> &gt; =============<br/>\n&gt;&gt; I want him happy and to get back his self-esteem. Maybe<br/>\n&gt;&gt; we need to take more of an unschooling approach and let him make his<br/>\n&gt;&gt; own decisions about learning. Eventually he may pick up a book again.<br/>\n&gt;&gt; He&#39;s very bright and loves computer programming.<br/>\n&gt; =============<br/>\n&gt; If you are waivering, then hopefully someone on this list can  help you<br/>\n&gt; push you over the proverbial edge towards unschooling.<br/>\n&gt;<br/>\n&gt; If he loves programming, then make that one of his choices, he can stay<br/>\n&gt; home and program all day if he wishes.<br/>\n&gt; ================<br/>\n </span></blockquote>I think it&#39;s wonderful he&#39;s into computer programming.  If that&#39;s all he <br/>\ndoes all day long, that is very productive.  If you think about it, it&#39;s <br/>\nmuch more active than reading a book.  I would be thrilled if my boys <br/>\ntook to programming in the future.  I believe there is a very high <br/>\ndemand for computer programmers in the market place also.  Perhaps he <br/>\ncould get some kind of a job in that field - eventually?<br/>\n<br/>\nMimi<br/>\n===================<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":64314002,"authorName":"debbie jones","from":"debbie jones &lt;dljones0@...&gt;","profile":"dljones0","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: I am beginning to think we need to take more of an unschooling approach.","postDate":"1009416175","msgId":30271,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDExMjI3MDEyMjU1LjYyNDE0LnFtYWlsQHdlYjExNjA4Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PEYxNTg2NDE0LUZBNEUtMTFENS05QkRELTAwMDM5MzQ5RDRBRUBob3VzdG9uLnJyLmNvbT4="},"prevInTopic":30265,"nextInTopic":30272,"prevInTime":30270,"nextInTime":30272,"topicId":30227,"numMessagesInTopic":0,"msgSnippet":"Thank you for voicing your opinion first-hand. I have a neighbor who is a teacher and she expresses some of the same complaints, so I know it must be true. It","messageBody":"<div id=\"ygrps-yiv-2480288\">Thank you for voicing your opinion first-hand. I have a neighbor who is a teacher and she expresses some of the same complaints, so I know it must be true. It really is a shame that some people start out wanting to give so much to teaching and leave frustrated because the system doesn&#39;t allow it. I have enjoyed some very nice friendships over the years with some of my childrens&#39; teachers. I even considered going into teaching myself. I would have had a lot of the same frustrations.<br/>\nDebbie<br/>\n  Mimi Moorehead &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:groundhoggirl@...\">groundhoggirl@...</a>&gt; wrote: In a message dated 12/26/2001 8:29:18 AM Eastern Standard Time,<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dljones0@...\">dljones0@...</a> writes:<br/>\n<br/>\n<br/>\nIt&#39;s frustrating for him and for me. Once we deal with these<br/>\nissues, I think he&#39;ll be much happier.<br/>\n<br/>\nIt was recommended by his dr. that he get one-on-one counseling and<br/>\nalso group counseling but I&#39;m not sure where to go. Also, do the ps<br/>\ndo anything to accommodate ADD students?<br/>\n<br/>\n++++++++++++++++++++++++++++++<br/>\n<br/>\nI would like to respond to your last question.<br/>\n<br/>\nFirst, I just want to say that I believe that unschooling is, by far, <br/>\nthe best way to let your children grow.  I am the mother of 7-year-old <br/>\nunschooling twin boys.  I am also a former public high school geography <br/>\nteacher.   I have seen and experienced first-hand, the damage that years <br/>\nof schooling does to children, including myself.<br/>\n<br/>\nPublic schools &quot;say&quot; they accommodate ADD children, but let me tell you <br/>\nit is impossible for them to do so.  I don&#39;t think it&#39;s possible for <br/>\nthem to accommodate *anyone* when teachers such as I are assigned a <br/>\nstudent load of between 150 - 190 students!  Even an elementary school <br/>\nteacher with a ratio of 1:15 can not accommodate all his/her students, <br/>\nADD or no ADD.<br/>\n<br/>\nAt my high school I was what was called an Inclusion Teacher.  This <br/>\nmeans that 2 or 3 of the 6 geography classes I taught were Inclusion <br/>\nclasses.  Inclusion classes are those with between 5-15 special <br/>\neducation students (these include ADD students) learning side by side <br/>\nwith the so-called &quot;regular&quot; students.  There was usually a total of <br/>\n30-35+ students in the class.  Inclusion classes also have an extra <br/>\nteacher (special-ed certified) present in the classroom.<br/>\n<br/>\nI was very outspoken about my ideas on inclusion.  I was the only <br/>\nteacher in the whole school who was for it. I found it very offensive to <br/>\nsee special ed kids separated from the regular-ed kids.  Inclusion <br/>\nreceives a lot of resistance from the teachers because it makes them <br/>\nwork so much harder.  Unfortunately, this work I am talking about <br/>\nincludes lots and lots of documentation that has to be made to prove <br/>\nthat you have made the modifications for the special ed students.<br/>\n<br/>\nThese are some of the modifications I used to accommodate my special-ed <br/>\nstudents:<br/>\n<br/>\n      1.  Allowed them to have more time to complete their homework or <br/>\nclasswork, if they needed it (this meant I had to make a note to myself <br/>\nto remember to ask for this work at a future date - remember, I&#39;ve got <br/>\n150+ students, I can&#39;t keep this in my head!)<br/>\n<br/>\n      2. Shorter and easier assignments (This must be noted in my grade-book)<br/>\n<br/>\n      3. Use an easier-to-read atlas. (This is noted in their IEP <br/>\n(Individual Education Plan))<br/>\n<br/>\n      4. Allow them to have their own book to take home if the regular-ed <br/>\nkids must use the class-room set.<br/>\n<br/>\n      5.  Easier and shorter versions of my quizzes/tests, etc.  (this <br/>\nmeans I have to type up 2 versions of everything.  I was also an ESL <br/>\nteacher, teaching 5 different levels of ESL(English as a  Second <br/>\nLanguage) students, so I actually had 6 different versions of all my <br/>\nquizzes, tests, Classroom/Homework assignments so I could accommodate <br/>\nevery one, supposedly!)<br/>\n<br/>\n      6. Special ed kids usually get preferential seating, usually at the <br/>\nfront of the classroom.<br/>\n<br/>\n      7.  More contact with the parents.  I made it a point to call 3 <br/>\nparents every day of the week.  On weekdays, I did this from home in the <br/>\nevening, after school.  I would go down my long list of students <br/>\n(special ed students were always at the top, so they got more calls) and <br/>\ntelephone the parents of students that needed extra attention.  Both <br/>\nnegative and positive calls were made.<br/>\n<br/>\n      8.  All of my students were given my home telephone number and <br/>\nemail address, in case they ever had an questions or concerns and they <br/>\nwanted to communicate with me in the evenings or on weekends.  I made an <br/>\nextra effort with my special ed kids and their parents to assure them <br/>\nthat I was always available.  I would also work in my classroom until <br/>\n5PM every afternoon.  My door would be open to anyone who needed any <br/>\nextra help in any subject, not just geography.  I also made myself <br/>\navailable during my lunch time since I usually ate in my classroom.  I <br/>\nwould allow them to eat with me.<br/>\n<br/>\n<br/>\nI loved and cared for my students very much and, in a way, I miss being <br/>\na teacher.  But, let me tell you, I worked very, very hard and tried my <br/>\nbest to accommodate every one, especially my special-ed students, and I <br/>\nknow, with all certainty, that in NO WAY did I come close to <br/>\naccommodating ANY of my students the way that I know a loving, caring <br/>\nparent can!!!<br/>\n<br/>\nSorry this is so long but I want to say one more thing.  If your son <br/>\ndecides to return to public school and he has been labeled as ADD, he <br/>\nmay be classified as a Special Ed student.  From my experience with many <br/>\nother teachers (but, not all) here in Houston, Texas, the term &quot;Special <br/>\nEd.&quot; has a negative connotation.  It is unfortunate that with many (but <br/>\nnot all) teachers, when they see that star next to a student&#39;s name <br/>\nsignifying him/her as special-ed, their reaction is immediately <br/>\nnegative.  Thoughts of disruptive behiavior and extra work for the <br/>\nteacher immediately come to mind.<br/>\n<br/>\n  Like in any other profession, there are some very caring and good <br/>\nteachers and then there are some bad teachers.  Even though those who <br/>\ntry their very best to give everything they can to as many of their <br/>\nstudents as possible, they can not give to those children what their <br/>\nparents can give them for those 8+ hours of every day.  This is how I <br/>\nfeel about things and these have been some of my experiences.<br/>\n<br/>\nMimi<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\nYahoo! Groups SponsorADVERTISEMENT<br/>\n<br/>\nMessage boards, timely articles, a free newsletter and more!<br/>\nCheck it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n<br/>\nTo unsubscribe, set preferences, or read archives:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/Unschooling-dotcom\">http://groups.yahoo.com/group/Unschooling-dotcom</a><br/>\n<br/>\nAnother great list sponsored by Home Education Magazine!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com\">http://www.home-ed-magazine.com</a> <br/>\n<br/>\n<br/>\n<br/>\nYour use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nDo You Yahoo!?<br/>\nSend your FREE holiday greetings online at Yahoo! Greetings.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":89240901,"authorName":"Mimi Moorehead","from":"Mimi Moorehead &lt;groundhoggirl@...&gt;","profile":"groundhoggirl2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: I am beginning to think we need to take more of an unschooling approach.","postDate":"1009405303","msgId":30265,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxNTg2NDE0LUZBNEUtMTFENS05QkRELTAwMDM5MzQ5RDRBRUBob3VzdG9uLnJyLmNvbT4=","inReplyToHeader":"PGEwZDAxZCtqYjZ0QGVHcm91cHMuY29tPg=="},"prevInTopic":30237,"nextInTopic":30271,"prevInTime":30264,"nextInTime":30266,"topicId":30227,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/26/2001 8:29:18 AM Eastern Standard Time, dljones0@yahoo.com writes: It s frustrating for him and for me. Once we deal with these issues,","messageBody":"<div id=\"ygrps-yiv-735843576\">In a message dated 12/26/2001 8:29:18 AM Eastern Standard Time,<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dljones0@...\">dljones0@...</a> writes:<br/>\n<br/>\n<br/>\nIt&#39;s frustrating for him and for me. Once we deal with these<br/>\nissues, I think he&#39;ll be much happier.<br/>\n<br/>\nIt was recommended by his dr. that he get one-on-one counseling and<br/>\nalso group counseling but I&#39;m not sure where to go. Also, do the ps<br/>\ndo anything to accommodate ADD students?<br/>\n<br/>\n++++++++++++++++++++++++++++++<br/>\n<br/>\nI would like to respond to your last question.<br/>\n<br/>\nFirst, I just want to say that I believe that unschooling is, by far, <br/>\nthe best way to let your children grow.  I am the mother of 7-year-old <br/>\nunschooling twin boys.  I am also a former public high school geography <br/>\nteacher.   I have seen and experienced first-hand, the damage that years <br/>\nof schooling does to children, including myself.<br/>\n<br/>\nPublic schools &quot;say&quot; they accommodate ADD children, but let me tell you <br/>\nit is impossible for them to do so.  I don&#39;t think it&#39;s possible for <br/>\nthem to accommodate *anyone* when teachers such as I are assigned a <br/>\nstudent load of between 150 - 190 students!  Even an elementary school <br/>\nteacher with a ratio of 1:15 can not accommodate all his/her students, <br/>\nADD or no ADD.<br/>\n<br/>\nAt my high school I was what was called an Inclusion Teacher.  This <br/>\nmeans that 2 or 3 of the 6 geography classes I taught were Inclusion <br/>\nclasses.  Inclusion classes are those with between 5-15 special <br/>\neducation students (these include ADD students) learning side by side <br/>\nwith the so-called &quot;regular&quot; students.  There was usually a total of <br/>\n30-35+ students in the class.  Inclusion classes also have an extra <br/>\nteacher (special-ed certified) present in the classroom.<br/>\n<br/>\nI was very outspoken about my ideas on inclusion.  I was the only <br/>\nteacher in the whole school who was for it. I found it very offensive to <br/>\nsee special ed kids separated from the regular-ed kids.  Inclusion <br/>\nreceives a lot of resistance from the teachers because it makes them <br/>\nwork so much harder.  Unfortunately, this work I am talking about <br/>\nincludes lots and lots of documentation that has to be made to prove <br/>\nthat you have made the modifications for the special ed students.<br/>\n<br/>\nThese are some of the modifications I used to accommodate my special-ed <br/>\nstudents:<br/>\n<br/>\n\t1.  Allowed them to have more time to complete their homework or <br/>\nclasswork, if they needed it (this meant I had to make a note to myself <br/>\nto remember to ask for this work at a future date - remember, I&#39;ve got <br/>\n150+ students, I can&#39;t keep this in my head!)<br/>\n<br/>\n\t2. Shorter and easier assignments (This must be noted in my grade-book)<br/>\n<br/>\n\t3. Use an easier-to-read atlas. (This is noted in their IEP <br/>\n(Individual Education Plan))<br/>\n<br/>\n\t4. Allow them to have their own book to take home if the regular-ed <br/>\nkids must use the class-room set.<br/>\n<br/>\n\t5.  Easier and shorter versions of my quizzes/tests, etc.  (this <br/>\nmeans I have to type up 2 versions of everything.  I was also an ESL <br/>\nteacher, teaching 5 different levels of ESL(English as a  Second <br/>\nLanguage) students, so I actually had 6 different versions of all my <br/>\nquizzes, tests, Classroom/Homework assignments so I could accommodate <br/>\nevery one, supposedly!)<br/>\n<br/>\n\t6. Special ed kids usually get preferential seating, usually at the <br/>\nfront of the classroom.<br/>\n<br/>\n\t7.  More contact with the parents.  I made it a point to call 3 <br/>\nparents every day of the week.  On weekdays, I did this from home in the <br/>\nevening, after school.  I would go down my long list of students <br/>\n(special ed students were always at the top, so they got more calls) and <br/>\ntelephone the parents of students that needed extra attention.  Both <br/>\nnegative and positive calls were made.<br/>\n<br/>\n\t8.  All of my students were given my home telephone number and <br/>\nemail address, in case they ever had an questions or concerns and they <br/>\nwanted to communicate with me in the evenings or on weekends.  I made an <br/>\nextra effort with my special ed kids and their parents to assure them <br/>\nthat I was always available.  I would also work in my classroom until <br/>\n5PM every afternoon.  My door would be open to anyone who needed any <br/>\nextra help in any subject, not just geography.  I also made myself <br/>\navailable during my lunch time since I usually ate in my classroom.  I <br/>\nwould allow them to eat with me.<br/>\n<br/>\n<br/>\nI loved and cared for my students very much and, in a way, I miss being <br/>\na teacher.  But, let me tell you, I worked very, very hard and tried my <br/>\nbest to accommodate every one, especially my special-ed students, and I <br/>\nknow, with all certainty, that in NO WAY did I come close to <br/>\naccommodating ANY of my students the way that I know a loving, caring <br/>\nparent can!!!<br/>\n<br/>\nSorry this is so long but I want to say one more thing.  If your son <br/>\ndecides to return to public school and he has been labeled as ADD, he <br/>\nmay be classified as a Special Ed student.  From my experience with many <br/>\nother teachers (but, not all) here in Houston, Texas, the term &quot;Special <br/>\nEd.&quot; has a negative connotation.  It is unfortunate that with many (but <br/>\nnot all) teachers, when they see that star next to a student&#39;s name <br/>\nsignifying him/her as special-ed, their reaction is immediately <br/>\nnegative.  Thoughts of disruptive behiavior and extra work for the <br/>\nteacher immediately come to mind.<br/>\n<br/>\n  Like in any other profession, there are some very caring and good <br/>\nteachers and then there are some bad teachers.  Even though those who <br/>\ntry their very best to give everything they can to as many of their <br/>\nstudents as possible, they can not give to those children what their <br/>\nparents can give them for those 8+ hours of every day.  This is how I <br/>\nfeel about things and these have been some of my experiences.<br/>\n<br/>\nMimi<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":55326806,"authorName":"rumpleteasermom","from":"&quot;rumpleteasermom&quot; &lt;rumpleteasermom@...&gt;","profile":"rumpleteasermom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: I am beginning to think we need to take more of an unschooling approach.","postDate":"1009386349","msgId":30237,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGEwZDAxZCtqYjZ0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGEwY2o4dCtkYWRlQGVHcm91cHMuY29tPg=="},"prevInTopic":30236,"nextInTopic":30265,"prevInTime":30236,"nextInTime":30238,"topicId":30227,"numMessagesInTopic":0,"msgSnippet":"... I snipped the rest of your post but am answering all of it. It sounds like you are giving this issue lots of thought and that s good.  Here are my","messageBody":"<div id=\"ygrps-yiv-669077528\">--- In Unschooling-dotcom@y..., &quot;dljones0&quot; &lt;dljones0@y...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; We started hsg this past April because my 14yo ds hated school and <br/>\n&gt; was becoming depressed. <br/>\n<br/>\n </span></blockquote>I snipped the rest of your post but am answering all of it.<br/>\n<br/>\nIt sounds like you are giving this issue lots of thought and that&#39;s <br/>\ngood.  Here are my suggestions.<br/>\n<br/>\n1.  Look for a local support group with kids and parents that you <br/>\nBOTH like.  It took several tried for us but we finally succeeded <br/>\nhere and many of them are on this list too. {HI GUYS ;-)}<br/>\n<br/>\n2.  Don&#39;t be afraid to just let things go for a while.  Tell your son <br/>\nit&#39;s okay to step back and look at the whole picture and take a <br/>\nlittle time to figure out what HE wants.<br/>\n<br/>\n3.  Public Schools by and large handle ADD by medicating them into <br/>\nconformity.  They are not equipped to treat students as individuals.<br/>\n<br/>\n4.  This is not a popular suggestion here but I&#39;m throwing out <br/>\nanyway: If you find he is stuck in a loop of TV watching and video <br/>\ngame playing, see what happens if you limit it.  My son has lots of <br/>\nproblems but his flat out obsession with electronic stimuli is the <br/>\nbiggest one.  Video games, Nintendo 64 particularly, seem to fry his <br/>\nbrain.  TV spirals into constant watching (even stuff he admits he <br/>\nhates to watch) unless we help him keep it in control.  Funny thing <br/>\nis, now that we have recognized the problem and addressed it as a <br/>\nproblem, he is fine with the limitations.  HE, himself, realizes he <br/>\nneeds our help to keep it in control.<br/>\n<br/>\n<br/>\n5.  Help you son find and explore his interests - - i.e. If he likes <br/>\ntrains, let him explore that exclusively if it makes him happy. <br/>\n<br/>\n6.  Tell him for me - - His job right now is to be a 14 year old.  <br/>\nMost of that academic stuff he is worried about is meaningless.  The <br/>\nthings I need, I&#39;ve learned.  The things I &quot;learned&quot; in school that I <br/>\ndidn&#39;t need are gone.  He has his whole life ahead of him to learn <br/>\nthings.  But right now, he needs to learn to be happy!<br/>\n<br/>\nBridget</div>","specialLinks":[]},{"userId":59497572,"authorName":"Sarah Carothers","from":"Sarah Carothers &lt;puddles@...&gt;","profile":"sarahjocarothers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] I am beginning to think we need to take more of an unschooling approach.","postDate":"1009384414","msgId":30229,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBjYmQ3NDczMTE2MWFjMUZFOEBtYWlsOC50cmlhZC5yci5jb20+","referencesHeader":"PGEwY2o4dCtkYWRlQGVHcm91cHMuY29tPg=="},"prevInTopic":30227,"nextInTopic":30236,"prevInTime":30228,"nextInTime":30230,"topicId":30227,"numMessagesInTopic":0,"msgSnippet":"imo I d *immediately* rush out and buy Real Lives: Eleven Teenagers Who Don t Go to School by Grace Lewellyn and I d either read it to him or insist he read","messageBody":"<div id=\"ygrps-yiv-731776487\">imo I&#39;d *immediately* rush out and buy Real Lives: Eleven Teenagers <br/>\nWho Don&#39;t Go to School by Grace Lewellyn and I&#39;d either read it to <br/>\nhim or insist he read it. Period.   I believe that all the other <br/>\nthings you mentioned will fall into place after he gets a better <br/>\ngrasp of what unschooling actually is and yes, he may need your <br/>\nassistance in some ways, but he should also strive to be control of <br/>\nhis own time, schedules (if he likes schedules) and his own <br/>\neducation. If returning to p.s. next year is still paramount, I think <br/>\nyou have to let him try it.... he *is* a teen, ya know and teens can <br/>\nbe so rebellious when a parent tries to control their lives.<br/>\n<br/>\nNo comments about the medications because I&#39;m clueless except to say <br/>\nthat I *do* know dosages have to be adjusted for most any of them and <br/>\nthat might be something you could look into.<br/>\n<br/>\nGood luck,<br/>\nSarah<br/>\n~xx~ ~xx~ ~xx~<br/>\nSarah Carothers<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:puddles@...\">puddles@...</a><br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed, 26 Dec 2001 13:27:57 -0000, dljones0 wrote:<br/>\n&gt;<br/>\n&gt;What can I do to make him feel better about himself the rest of<br/>\n&gt;this<br/>\n&gt;year? He feels like he is failing academically at home and not<br/>\n&gt;learning enough but he can&#39;t handle anymore than he is doing now,<br/>\n&gt;which is very little.<br/>\n&gt;<br/>\n&gt;I need to help him organize his time and structure his days<br/>\n&gt;better.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":64314002,"authorName":"dljones0","from":"&quot;dljones0&quot; &lt;dljones0@...&gt;","profile":"dljones0","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"I am beginning to think we need to take more of an unschooling approach.","postDate":"1009373277","msgId":30227,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGEwY2o4dCtkYWRlQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":30229,"prevInTime":30226,"nextInTime":30228,"topicId":30227,"numMessagesInTopic":0,"msgSnippet":"We started hsg this past April because my 14yo ds hated school and was becoming depressed. I thought it was due to not being challenged, as he was always a","messageBody":"<div id=\"ygrps-yiv-10082895\">We started hsg this past April because my 14yo ds hated school and <br/>\nwas becoming depressed. I thought it was due to not being challenged, <br/>\nas he was always a very good student - always saw the big picture. It <br/>\nwas the small things he sometimes missed. After a few months of <br/>\nschooling to some degree at home, I decided we had to have him tested <br/>\nfor ADD, as I had wondered for quite some time if there could be <br/>\nsomething else going on with him other than being underchallenged. <br/>\n<br/>\nHe was just diagnosed with ADD - the inattentive type. He is easily <br/>\ndistracted and can&#39;t stay focused. He once loved to read but won&#39;t <br/>\npick up a book anymore. <br/>\n<br/>\nHe has been given Adderall and since starting about 3 days ago, I&#39;ve <br/>\nseen a difference. He hasn&#39;t said &quot;Huh?&quot; and made me repeat myself at <br/>\nall, as I&#39;m accustomed to doing all these years. I have even tested <br/>\nhim by talking to him from another room and still he hears me the <br/>\nfirst time. I&#39;m very happy about that. We found this past week while <br/>\non vacation that he is staying up until 3 a.m. and I wonder if the <br/>\n2nd pill given to him later in the day could be contributing, so we <br/>\ngave him only one pill yesterday. The test will come when we start in <br/>\nagain on academics next week, but I have a feeling that we can&#39;t <br/>\nexpect a great change. I don&#39;t know. Good and bad days still I&#39;m <br/>\nsure. <br/>\n<br/>\nMy concerns now are in the way that we hs. We wants to return to ps <br/>\nnext year due to missing friends, even though he participates in <br/>\nsports. He says it&#39;s not the same, but he also says that he would be <br/>\ngetting F&#39;s if he were in ps now. I want to support him but I <br/>\nhonestly believe that hsg is right for him and I don&#39;t want him to go <br/>\nthrough another depressing time in ps. Maybe I should let him decide <br/>\nfor himself and maybe he&#39;ll decide to hs again. But I also know that <br/>\nif he does, he will feel very bad about himself if he finds returning <br/>\nwas a mistake. I have considered waiting to see how the rest of this <br/>\nyear goes and if he is not doing better at home, there is no way he <br/>\ncould cut it in ps and maybe I should make that decision (although I <br/>\nhesitate to). I want him happy and to get back his self-esteem. Maybe <br/>\nwe need to take more of an unschooling approach and let him make his <br/>\nown decisions about learning. Eventually he may pick up a book again. <br/>\nHe&#39;s very bright and loves computer programming. <br/>\n<br/>\nWhat can I do to make him feel better about himself the rest of this <br/>\nyear? He feels like he is failing academically at home and not <br/>\nlearning enough but he can&#39;t handle anymore than he is doing now, <br/>\nwhich is very little. <br/>\n<br/>\nI need to help him organize his time and structure his days better. <br/>\nHe wanted flexibility, but we saw what happened with that - nothing. <br/>\nHe can&#39;t remember the simplest of things and to carry out everyday <br/>\ntasks and he hates it when I remind him. I don&#39;t like reminding him <br/>\neither. I&#39;ve basically told him it is up to him to make things <br/>\nhappen. I will help him organize things, but I can&#39;t make him do it <br/>\nif he refuses to. <br/>\n<br/>\nIt&#39;s frustrating for him and for me. Once we deal with these <br/>\nissues, I think he&#39;ll be much happier.<br/>\n<br/>\nIt was recommended by his dr. that he get one-on-one counseling and <br/>\nalso group counseling but I&#39;m not sure where to go. Also, do the ps <br/>\ndo anything to accommodate ADD students? <br/>\n<br/>\nSorry for all the questions and rambling.</div>","specialLinks":[]},{"userId":85994576,"authorName":"Kolleen","from":"Kolleen &lt;Kolleen@...&gt;","profile":"kaydeecross","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] I am beginning to think we need to take more of an unschooling approach.","postDate":"1009298778","msgId":30236,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDExMjI2MTY1Ni5mQlFHdWhYUjAxMDgzMUBueWNzbXRwMW91dC5yZGMtbnljLnJyLmNvbT4="},"prevInTopic":30229,"nextInTopic":30237,"prevInTime":30235,"nextInTime":30237,"topicId":30227,"numMessagesInTopic":0,"msgSnippet":"... If you want to support him then you need to stop thinking that you know that hsg is right for him. If it is, he needs to figure that out for himeself. ... ","messageBody":"<div id=\"ygrps-yiv-1433533183\"><blockquote><span title=\"ireply\">&gt;dljones0 writes:<br/>\n&gt;I want to support him but I <br/>\n&gt;honestly believe that hsg is right for him and I don&#39;t want him to go <br/>\n&gt;through another depressing time in ps. <br/>\n<br/>\n </span></blockquote>If you want to support him then you need to stop thinking that you know <br/>\nthat hsg is right for him. If it is, he needs to figure that out for <br/>\nhimeself.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Maybe I should let him decide <br/>\n&gt;for himself and maybe he&#39;ll decide to hs again. <br/>\n<br/>\n </span></blockquote>An unschooling parent would adhere to this, in spite of how hard it would <br/>\nbe to watch a decision that you may know is inherently wrong.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;But I also know that <br/>\n&gt;if he does, he will feel very bad about himself if he finds returning <br/>\n&gt;was a mistake. <br/>\n<br/>\n </span></blockquote>And then he can leave again. Sometimes one needs a few times to figure <br/>\nout if their decision is the best one.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I have considered waiting to see how the rest of this <br/>\n&gt;year goes and if he is not doing better at home, there is no way he <br/>\n&gt;could cut it in ps and maybe I should make that decision (although I <br/>\n&gt;hesitate to). <br/>\n<br/>\n </span></blockquote>If he wants to go back. Let him. Also let him know that he has other <br/>\ndecisions. Such as unschooling. Its hard for a parent to step back, but <br/>\nyou need to at this point. Offer him his choices, you may even want to <br/>\nsit down and write them out with him. Then support his decison and let <br/>\nhim know he can change at any point he wants and you will support that <br/>\ntoo.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I want him happy and to get back his self-esteem. Maybe <br/>\n&gt;we need to take more of an unschooling approach and let him make his <br/>\n&gt;own decisions about learning. Eventually he may pick up a book again. <br/>\n&gt;He&#39;s very bright and loves computer programming. <br/>\n<br/>\n </span></blockquote>If you are waivering, then hopefully someone on this list can  help you <br/>\npush you over the proverbial edge towards unschooling.<br/>\n<br/>\nIf he loves programming, then make that one of his choices, he can stay <br/>\nhome and program all day if he wishes.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;What can I do to make him feel better about himself the rest of this <br/>\n&gt;year? He feels like he is failing academically at home and not <br/>\n&gt;learning enough but he can&#39;t handle anymore than he is doing now, <br/>\n&gt;which is very little. <br/>\n<br/>\n </span></blockquote>Offer the choices and be prepared to take a leap of trust in him and in <br/>\nyourself. And come running here when life gets overwhelming and get your <br/>\nsupport from other parents that share your experiences.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;I need to help him organize his time and structure his days better. <br/>\n<br/>\n </span></blockquote>He needs to figure it out for himself. He&#39;s been &#39;damaged&#39; by control in <br/>\nthe ps system and needs to &#39;repair&#39; before he can put it all together. It <br/>\ntakes time.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;He wanted flexibility, but we saw what happened with that - nothing. <br/>\n<br/>\n </span></blockquote>How so? Did you know that it takes about a year to undo the damage done <br/>\nin ps and other oppressive schooling? Did you allow time for you and for <br/>\nhim to adjust?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;He can&#39;t remember the simplest of things and to carry out everyday <br/>\n&gt;tasks and he hates it when I remind him. I don&#39;t like reminding him <br/>\n&gt;either. <br/>\n<br/>\n </span></blockquote>If he hates it and you hate it, then stop it. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I&#39;ve basically told him it is up to him to make things <br/>\n&gt;happen. I will help him organize things, but I can&#39;t make him do it <br/>\n&gt;if he refuses to.<br/>\n<br/>\n </span></blockquote>Again, its time to adjust. You sound like a very concerned and loving <br/>\nparent. When the worrying stops, the best part of life will happen.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;It&#39;s frustrating for him and for me. Once we deal with these <br/>\n&gt;issues, I think he&#39;ll be much happier.<br/>\n<br/>\n </span></blockquote>Again, this takes a leap of trust and TIME to de-school both of <br/>\nyourselves.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;It was recommended by his dr. that he get one-on-one counseling and <br/>\n&gt;also group counseling but I&#39;m not sure where to go. Also, do the ps <br/>\n&gt;do anything to accommodate ADD students?<br/>\n<br/>\n </span></blockquote>This is an issue I&#39;d best refrain from talking about. I don&#39;t like labels <br/>\nand although I don&#39;t agree with neurological altering medications, I know <br/>\nthat some parents don&#39;t have a choice because of the way our system is <br/>\nset up. My heart goes out to all of them. I wish Western science would <br/>\nlose its ego and begin to heal.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;Sorry for all the questions and rambling.<br/>\n<br/>\n </span></blockquote>Don&#39;t be sorry. You came here as an option, or in desperation in trying <br/>\nto do the best thing for your child.<br/>\n<br/>\nHopefully, some of the responses will help and you both make a choice <br/>\nthat you are comfortable with.<br/>\n<br/>\nregards,<br/>\nkolleen</div>","specialLinks":[]}],"prevTopicId":30279,"nextTopicId":30295}}