{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Covert","from":"Covert &lt;covert@...&gt;","replyTo":"LIST","senderId":"bNIpHTuknDL25JJDrRXibXf8yfDK-hZWyuZmGa1jJn15xGfG4RaVvouJBBOLR_hW-nADI99r-sYY3Vqu8GeLf10f9_FaGw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"KnoK NEWS for 20 February 2001","postDate":"982669586","msgId":16619,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDEwMjIwMTE0My5VQUEyMzY2NEBzbXRwMy5kdGkubmUuanA+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":16618,"nextInTime":16620,"topicId":16619,"numMessagesInTopic":0,"msgSnippet":"* * * *  KnoK NEWS  * * * * -- Views from the world of learning in Japan -- Welcome to the 20 February 2001 edition of KnoK (pronounced knock ) NEWS, an","messageBody":"<div id=\"ygrps-yiv-1744328367\">* * * *  KnoK NEWS  * * * *<br/>\n           -- Views from the world of learning in Japan --<br/>\n<br/>\n<br/>\nWelcome to the 20 February 2001 edition of KnoK (pronounced &quot;knock&quot;) <br/>\nNEWS, an informal and periodic bulletin concerning issues of learning in <br/>\nJapan. It is brought to you by the Covert family -- Kazumi, Kenya and <br/>\nBrian -- a multicultural, homelearning family in Osaka, Japan.<br/>\n<br/>\nKnoK stands for *Kodomo no Kokoro*, meaning &quot;Heart of a Child&quot; in <br/>\nJapanese. It is our belief that the heart of any child is indeed at the <br/>\ncenter of true learning, wherever and however such learning may take <br/>\nplace. <br/>\n<br/>\n<br/>\n              &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;  &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\nEDITOR&#39;S WELCOME:  We&#39;re back!! After a few months&#39; hiatus, KnoK NEWS is <br/>\non the beat in February and ready to run again with this first edition of <br/>\nthe new century.<br/>\n<br/>\nThe year 2001 is the &quot;Year of the Snake&quot; according to the Japanese <br/>\ncalendar, and as the snake is the symbol in many cultures of change and <br/>\ntransformation (&quot;shedding one&#39;s skin&quot;), we can only hope that the coming <br/>\nmonths of this year will be one of positive transition for the <br/>\nhomelearning movement in Japan.<br/>\n<br/>\n2000 saw us off to a good start: The news media here covered home <br/>\neducation in Japan more extensively than ever last year, and the coverage <br/>\nwas mostly respectful and accepting in tone. Alternative forms of <br/>\neducation in Japan such as free schools and community-based learning <br/>\ncenters have been getting fairly positive press as well, and that is <br/>\nindeed something to be thankful for.<br/>\n<br/>\nJapan is seeing a slow but steady rise in the numbers of homelearning <br/>\nfamilies nationwide who are turning away from school and embracing <br/>\neducation at home (2,000 to 3,000 homelearners nationwide by &quot;unofficial&quot; <br/>\ncounts, possibly more). We are even starting to hear firsthand of cases <br/>\nin which Japanese school officials are cooperating fully with Japanese <br/>\nfamilies who declare their intention to homelearn -- a good sign. Perhaps <br/>\nthe educrats in Japan, like other countries, have merely run out of ideas <br/>\non how to regulate the spirit of learning to death. But whatever the <br/>\nreason, there is no denying that Japanese homelearners are moving in a <br/>\nforward direction in society. <br/>\n<br/>\nThe more we at KnoK NEWS look around at the barren state of mainstream <br/>\neducation in Japan, in fact, the more we find a new, budding &quot;oasis&quot; in <br/>\nthe form of yet another homelearning family here, another alternative <br/>\nschool there, and on and on. So it seems only fitting that we devote this <br/>\nedition of KnoK NEWS to these oases of sanity -- small and scattered, but <br/>\nstrong in spirit -- that are, in their own ways, changing the face of <br/>\neducation in Japan for the better.<br/>\n<br/>\nFinally, we want to thank KnoK NEWS readers for your continued interest <br/>\nin what we are doing, and ask for your understanding in the future as we <br/>\ntry to more effectively work our newsletter schedule in with our <br/>\nhomelearning activities. (Or is that a contradiction in terms?  &lt;g&gt; )<br/>\n <br/>\nAs always, feel free to pass this newsletter around and share it with <br/>\nothers.<br/>\n<br/>\nEnjoy,<br/>\n<br/>\nBrian Covert<br/>\nOsaka, Japan<br/>\n<br/>\n<br/>\n                              *   *   *   *<br/>\n<br/>\n<br/>\nBOOK REVIEWS:<br/>\n<br/>\n(1)<br/>\n*Kodomo ga Gakko ni Ikitaku-naku natta Toki Yomu Hon*<br/>\n[The Book to Read When Your Child No Longer Wants to Go to School]<br/>\nKeiko Itoh, et al, translators<br/>\nMarunouchi Shuppan/Atmark Learning Inc., 2000<br/>\n287 pp., 1,500 yen<br/>\n<br/>\nDespite its eye-catching title, this newest book on home-based learning <br/>\nto hit the bookstore shelves here in Japan is not an original piece of <br/>\nwork. Rather, it is a Japanese translation of the book &quot;Homeschooling <br/>\nAlmanac 2000-2001,&quot; published in 1999 by Mary Leppert and Michael <br/>\nLeppert, the well-known US homelearners. While the Japanese version of <br/>\nthe Lepperts&#39; excellent book is abridged (only Part 1 of the original is <br/>\ntranslated), it does manage to cover many of the important questions and <br/>\nanswers that slowly increasing numbers of families in Japan are facing as <br/>\nthey turn away from conventional schooling.<br/>\n<br/>\nThis new book stands in good company with various other <br/>\nJapanese-translated versions of English-language homelearning books, such <br/>\nas John Holt&#39;s &quot;Teach Your Own,&quot; &quot;School is Not Compulsory&quot; by Education <br/>\nOtherwise, &quot;The Homeschooling Book of Answers&quot; by Linda Dobson, and &quot;Home <br/>\nSchooling: Parents as Educators&quot; by Maralee Maybery, et al.   <br/>\n<br/>\nWe welcome this newly translated book as the latest addition to the <br/>\nJapanese homelearning community, and we hope it fosters an even greater <br/>\nawareness of homelearning throughout Japan in the coming years.<br/>\n<br/>\nIf there is any drawback at all to this book, though, it would be the <br/>\nlack of transparency concerning the background of its promoters/supporters.<br/>\n<br/>\nOn the front-cover promotional overleaf of this book, an organization <br/>\ncalled the Homeschool Support Association of Japan (HoSA) <br/>\n(http://www.homeschool.ne.jp/) heartily endorses this new book as being <br/>\n&quot;necessary reading for those who are confronted by the various study <br/>\nneeds of children&quot; (translation from Japanese). What is not revealed <br/>\nanywhere in this book is that promoter HoSA, a nonprofit organization, is <br/>\nitself essentially a creation of the co-publisher of this book, Atmark <br/>\nLearning Inc. (http://www.inter-highschool.ne.jp/)<br/>\n<br/>\nAtmark, a Tokyo-based for-profit corporation that suddenly appeared on <br/>\nthe Japanese homeschooling scene early in 2000, specializes in offering <br/>\n&quot;American-style&quot; high school studies to Japanese students on the Internet <br/>\nthrough a tie-up with the Alger Learning Center & Independence High <br/>\nSchool, an academic institution in Washington state, USA.<br/>\n<br/>\nHoSA bills itself as an independent home-ed support association, yet <br/>\nHoSA&#39;s official list of supporters is overwhelmingly from the twin fields <br/>\nof industry and academia in Japan: heads of corporations (such as <br/>\nMicrosoft Japan) and some Japanese university-level academics with clout. <br/>\nOnly one genuine homelearner from Japan&#39;s grassroots homelearning <br/>\ncommunity is listed as a HoSA official supporter. <br/>\n<br/>\nAtmark and HoSA also have a common founder and leader: Mr. Kozo Hino, a <br/>\nJapanese businessman with a background in education-related enterprises. <br/>\nIt is he who writes the inspiring afterword of the Japanese version of <br/>\nthis book. Yet these connections are never revealed to the reader. <br/>\n<br/>\nWe certainly applaud the presence of this new book on Japanese bookstore <br/>\nshelves and would recommend that people read it. But at the same time, we <br/>\nwould like to see the direct connections between HoSA, as an &quot;official&quot; <br/>\nsupport group, and Atmark, as its corporate parent, made more transparent <br/>\nin future editions of this book. <br/>\n<br/>\n(2)<br/>\n*Creating Learning Communities*<br/>\nRon Miller, editor<br/>\nThe Foundation for Educational Renewal, Inc., 2000<br/>\n380 pp., $29.95<br/>\n<br/>\nIf you want to change the world around you, then you must first dare to <br/>\nenvision how that world would look.<br/>\n<br/>\nThis, in a nutshell, is the inspiring message that &quot;Creating Learning <br/>\nCommunities&quot; offers its readers. And it is no exaggeration to call the <br/>\ncontributors to this book &quot;visionaries&quot; in their own right: Patrick <br/>\nFarenga, Wendy Priesnitz, Linda Dobson and Ann Lahrson Fisher are among <br/>\nthose names who will be easily recognizable in the international <br/>\nhomelearning community, and likewise for Jerry Mintz, Ray Ison, Kathia <br/>\nLaszlo and Ron Miller (editor of this collection) in the global <br/>\nalternative-education community.<br/>\n<br/>\nOf particular interest to those of us here in Japan are the essays <br/>\ncontributed to this book by Dayle Bethel (founder and dean of The <br/>\nInternational University&#39;s Asia-Pacific Learning Centers in Kyoto, Japan <br/>\nand Honolulu, Hawaii) and by Motoshi Suzuki (a graduate student at the <br/>\nTIU Kyoto Learning Center who also helps coordinate its programs).<br/>\n<br/>\nBethel&#39;s essay on &quot;Work, Community, and the Development of Moral <br/>\nCharacter&quot; focuses on how work can serve as a positive factor in human <br/>\ngrowth and learning. Most enlightening is Bethel&#39;s recognition of the <br/>\nwork of Tsunesaburo Makiguchi, a Japanese teacher and author in the early <br/>\n1900s who was far ahead of his time in his commitment to community-based <br/>\neducation in Japan.<br/>\n<br/>\nSuzuki&#39;s essay, in turn, covers the background of the TIU Kyoto Learning <br/>\nCenter, its programs, and how his continuing studies in holistic <br/>\neducation at TIU Kyoto have transformed his life -- a rare experience <br/>\nindeed, when you consider that contemporary Japanese universities do <br/>\nlittle more than prep their students to become efficient &quot;company <br/>\nsoldiers&quot; out in the battlefields of the business world.<br/>\n<br/>\nThis book has been talked about in other online forums and KnoK NEWS <br/>\nreaders have probably heard something about this collection elsewhere in <br/>\nthe cyber-community. But we just couldn&#39;t let another edition of KnoK <br/>\nNEWS go by without *highly* recommending this book. If you want to catch <br/>\na glimpse of how the visions of community-based learning are sure to <br/>\nchange the world in the years to come, this book provides a most reliable <br/>\nblueprint.<br/>\n<br/>\nAnybody in Japan who is interested in ordering a copy of &quot;Creating <br/>\nLearning Communities&quot; can do so through the TIU Kyoto Learning Center at: <br/>\n motoshi@...-inet.or.jp  [Disclaimer: KnoK NEWS has no affiliation <br/>\nor connection whatsoever with either TIU Kyoto or this book, other than <br/>\noffering our full moral support for the educational missions of each.]<br/>\n<br/>\nFor more information about the book, including viewing an online version <br/>\nof it, check out the CLC website at:  <br/>\nhttp://www.CreatingLearningCommunities.org<br/>\n<br/>\n<br/>\n                            *   *   *   *<br/>\n<br/>\n<br/>\n              ON THE WEB WITH HOMELEARNING FAMILIES<br/>\n                 & ALTERNATIVE EDUCATION IN JAPAN<br/>\n<br/>\n<br/>\n(1) CHRISTIAN AND HOMESCHOOL RESOURCE CENTER (english)<br/>\n--&gt; http://www.christianhomeschoolers.com/<br/>\nHomepage of a Christian homelearning family living in Japan in <br/>\nconjunction with the U.S. military. Chock full of links and resource <br/>\nguides for the homelearning Christian family.  [Note: You may encounter, <br/>\nas we did, some errors in accessing this website.] <br/>\n<br/>\n(2) G.H.B. CENTER (japanese)<br/>\n--&gt; http://www2u.biglobe.ne.jp/~ghb/<br/>\nAn alternative learning center based in Takasago, Hyogo Prefecture. &quot;GHB&quot; <br/>\nstands for &quot;Global Human Bridge,&quot; and this is one group that lives up to <br/>\nits name -- with lots of fun thrown in for good measure. As we speak, in <br/>\nfact, GHB students and staff are visiting in Thailand to take part in <br/>\nactivities of Moo Baan Dek, a pioneering &quot;children&#39;s village school&quot; that <br/>\nis to Thailand what the Summerhill school is to the UK.  [Note: There may <br/>\nbe some temporary difficulty in accessing this website, as it is <br/>\nreportedly under construction by a new provider. We will be sure to let <br/>\nyou know of any changes to this website&#39;s URL.]<br/>\n<br/>\n(3) HOMESCHOOLING IN JAPAN (english)<br/>\n--&gt; http://www2.gol.com/users/milkat/index.html<br/>\nFor those who have not yet seen it, we introduce the only comprehensive <br/>\nnationwide network of its kind in Japan set up *by* grassroots <br/>\nhomelearning families *for* homelearning families. This one-stop website <br/>\nincludes info on home education contacts, resources, field trips and news <br/>\narticles -- not to mention an online newsletter and an e-mail discussion <br/>\nlist. By way of proper disclosure, we are also happy to call <br/>\n&quot;Homeschooling in Japan&quot; the new Web-based home of KnoK NEWS. <br/>\n<br/>\n(4) HOME SHURE (japanese)<br/>\n--&gt; http://www.shure.or.jp/homeshure/<br/>\nWebpage of a home-education program established by the Tokyo Shure &quot;free <br/>\nschool&quot; (http://www.shure.or.jp/), reportedly the largest of the <br/>\nalternative schools in Japan. Tokyo Shure was the host of last year&#39;s <br/>\nInternational Democratic Education Conference (IDEC), a major annual <br/>\nevent in the worldwide alternative- education community. <br/>\n<br/>\n(5) INTERNATIONAL COMMUNITY LEARNING CENTER NETWORK (english)<br/>\n--&gt; http://www2.kanazawa-it.ac.jp/englishd/reber/clc1.htm<br/>\nWebsite focusing on community-based learning centers, and featuring a <br/>\nnetwork of citizens who are advancing the cause of such centers at a <br/>\nglobal level. This site includes a listserve and links to other community <br/>\nlearning center activities in various countries. The website is set up <br/>\nand facilitated by Michael Reber, assistant professor of English at the <br/>\nIshikawa Prefecture-based Kanazawa Institute of Technology, Japan. Reber <br/>\nis also now completing his doctorate in education and institutional <br/>\ntransformation at The International University&#39;s Kyoto Learning Center <br/>\n(mentioned in the book review above). <br/>\n<br/>\n(6) LEARNNET GLOBAL SCHOOL (japanese)<br/>\n--&gt; http://www.L-Net.com/<br/>\nA newly opened, alternative &quot;international school for Japanese people&quot; <br/>\nlocated on Mount Rokko in the city of Kobe, Hyogo Prefecture. This school <br/>\nseems to be getting a lot of attention in the Japanese mass media these <br/>\ndays. A few homelearning children are reportedly enrolled in LearnNet <br/>\nprograms, which include Montessori-based methods and afterschool <br/>\nactivities. This website includes homelearning and alternative education <br/>\nlinks, as well as its own online discussion list. <br/>\n<br/>\n(7) MOORE JAPAN (japanese)<br/>\n--&gt; http://www.geocities.co.jp/Milkyway/5262<br/>\nYes, the US homelearning pioneers Dr. Raymond and Dorothy Moore are <br/>\nmaking inroads into the Land of the Rising Sun! Moore Japan is based in <br/>\nGunma Prefecture, and for some time now has been publishing a print <br/>\nnewsletter in Japanese on home education. Moore Japan does not have its <br/>\nown website up yet, unfortunately, but it does offer an extensive set of <br/>\nessays on childraising through this website of the SDA Osaka Center, a <br/>\nProtestant Christian organization based in Osaka, Japan. Click on number <br/>\n8 on the left-hand side of this website&#39;s main page to see the Moore <br/>\nJapan essays in Japanese.  [The organization can be contacted directly by <br/>\nwriting to: &quot;Moore Japan,&quot; c/o Nihon Kensei Kyokai, 3964 Oaza <br/>\nMinami-gawa, Oni Ishi-machi, Taki-gun, Gunma-ken 370-1405, Japan.]   <br/>\n<br/>\n(8) POWELL FAMILY WEBPAGES (english)<br/>\n--&gt; http://odin.prohosting.com/powellcl/<br/>\nand<br/>\n--&gt; http://fly.to/PowellPage<br/>\nFantastic photos of life in Japan, music, artwork -- it&#39;s ALL here! The <br/>\nseven members of the Powell homelearning clan recently celebrated the <br/>\none-year anniversary of their stay in Japan. They live in the city of <br/>\nYonezawa, Yamagata Prefecture, and have lots to show and tell about their <br/>\nexperiences in this country. We are delighted to feature the Powell <br/>\nfamily webpages here on our list. Please take some time and check this <br/>\none out!  <br/>\n<br/>\n(9) T.I.U. KYOTO LEARNING CENTER (english)<br/>\n--&gt; http://www.tiu-asiapacific.org<br/>\nWebsite of an independent-study program in Japan that has been offering <br/>\nalternative education to university students for more than *two decades* <br/>\n-- since way back in 1975, that is, when the concept of holistic, <br/>\ncommunity-based learning was a much crazier idea in Japanese society than <br/>\nit is today. The Kyoto Learning Center is a branch of The International <br/>\nUniversity (http://www.tiu.com) in Independence, Missouri, USA. Dayle <br/>\nBethel (noted in the book review above) established the Japan program <br/>\nfirst in Osaka, then in Kyoto, where it remains today.<br/>\n<br/>\n(10) TOKYO HOMESCHOOLING NETWORK - &quot;HINATA BOKKO&quot; (japanese)<br/>\n--&gt; http://www.alpha-net.ne.jp/users2/gratias/bokko.html<br/>\nA new homelearning support group in Japan! This is the webpage to apply <br/>\nfor membership in the recently formed Tokyo Homeschooling Network, a <br/>\nlocal Japanese group. The Japanese phrase *Hinata Bokko* in the group&#39;s <br/>\nname means to &quot;bask in the sun&quot; -- an appropriate description indeed for <br/>\nJapanese parents and children who have decided to step out of the shadows <br/>\nof the collapsing public-school system and embrace homelearning as a <br/>\nviable alternative in Japan.<br/>\n<br/>\n<br/>\n                            *   *   *   *<br/>\n<br/>\n<br/>\n               WISH I&#39;D SAID THAT  (Quote of the Day):<br/>\n<br/>\nOne century ago this year....<br/>\n<br/>\n&quot;Learn to do uncommon things in an uncommon manner. Learn to do a thing <br/>\nso thoroughly that no one can improve upon what has been done.&quot;   <br/>\n<br/>\n   --Booker T. Washington, in *Up From Slavery*, 1901</div>","specialLinks":[]}],"prevTopicId":16600,"nextTopicId":16615}}