{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":25,"messages":[{"userId":165350390,"authorName":"Aimee","from":"Aimee &lt;aimeel73@...&gt;","profile":"aimeel73","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] TV content","postDate":"1092753808","msgId":98224,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwODE3MTQ0MzI4LjM0MzMyLnFtYWlsQHdlYjgxNDA5Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDAwMWQwMWM0ODQwOCQ5MzkzYWM3MCQwMjAxYThjMEBrcmlzdGVuc2NvbXB1dGU+"},"prevInTopic":98181,"nextInTopic":0,"prevInTime":98223,"nextInTime":98225,"topicId":92160,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-824582778\">&lt;&lt;Sometimes its a hard balance to walk.  I *think*<br/>\nI&#39;ve done ok but I <br/>\nknow in erring on the side of freedom, that there have<br/>\nbeen times the kids <br/>\nhave seen things I wished they hadn&#39;t  because they<br/>\nare up later than I <br/>\nam and they have the tv on and I&#39;m not there.  On the<br/>\nother hand, we do <br/>\ndiscuss those things.  They tell me about their<br/>\nfeelings, and we talk <br/>\nabout it.  And thats when I can give them information,<br/>\nreassure them <br/>\nthat they are safe, and help them empower themselves<br/>\nto stay safe in my <br/>\nabsence.<br/>\n<br/>\nKristen&gt;&gt;<br/>\n<br/>\nI have erred on the side of freedom too. ;-) <br/>\n<br/>\nThere have been a few things that Alex has seen that<br/>\nhe really would rather not have. <br/>\n<br/>\nA couple of years ago he clicked on a link in a joke<br/>\ntype website that had you look at a innocent looking<br/>\npicture of a kitchen, and then the Linda Blair image<br/>\nfrom Exorcist flashes on the screen. <br/>\n<br/>\n It really scared him, he started screaming. He hates<br/>\nhorror movies, shock value type stuff.  I still wonder<br/>\nwhat he thought was going to happen, I guess he didn&#39;t<br/>\nthink it through. <br/>\n<br/>\nI spent quite some time talking to him about his<br/>\nexperience, how people LIKE that feeling of being<br/>\nscared, how there was no warning because then it<br/>\nwouldn&#39;t have the same effect, how it&#39;s an image that<br/>\nwas crafted in order to scare, but that it wasn&#39;t real<br/>\n(it helped that I found pictures on the net of her in<br/>\nthe bed having makeup applied, with the camera<br/>\nvisible, and pictures of her without makeup, etc.)<br/>\n<br/>\nI also gently reminded him that he chose to click on<br/>\nthat link, that we can&#39;t always be sure we&#39;ll be safe<br/>\nfrom things that scare us, or worry us, online.  <br/>\n<br/>\nHe is much more careful on the net.  I remind him that<br/>\nI can always check stuff out for him first, but he has<br/>\nto take me up on that. He does put Yahoo! search on<br/>\nsafe mode cause he doesn&#39;t like anything sexual<br/>\neither, and that&#39;s *rampant* on the net. <br/>\n<br/>\nSometimes I wish I could take that one moment back,<br/>\nthat was so traumatic, but I see, also, so much that<br/>\nhe learned from that experience. <br/>\n<br/>\n It is definitely a balancing act.  Even tho it is our<br/>\njob to protect our children, we can&#39;t always do so. <br/>\nThen our job is to help them heal and recover and<br/>\nprocess the experience as best they can, and to help<br/>\nthem move on.  I hope I did that.  <br/>\n<br/>\nHe still remembers it tho, and will talk about it<br/>\nevery once in a while. <br/>\n<br/>\nHe will occasionally watch a very bad horror movie<br/>\nwith obviously bad special effects, with me, and we<br/>\nlaugh together about how stupid it is. lol Progress? <br/>\n<br/>\nHe still doesn&#39;t like scary movies, tho.  He says he<br/>\ndoesn&#39;t like that feeling.  But roller coasters are an<br/>\nok scary, sometimes.  ;-) <br/>\n<br/>\n~Aimee</div>","specialLinks":[]},{"userId":166495566,"authorName":"Have a Nice Day!","from":"&quot;Have a Nice Day!&quot; &lt;litlrooh@...&gt;","profile":"litlrooh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] TV content","postDate":"1092712583","msgId":98181,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMWQwMWM0ODQwOCQ5MzkzYWM3MCQwMjAxYThjMEBrcmlzdGVuc2NvbXB1dGU+","referencesHeader":"PDFkMy4yOGQ0MGI0OC4yZTUyOWU2YkBhb2wuY29tPg=="},"prevInTopic":98176,"nextInTopic":98224,"prevInTime":98180,"nextInTime":98182,"topicId":92160,"numMessagesInTopic":0,"msgSnippet":"There are some stages of life that little kids don t need to know anything about. Innocence is as natural as any other progression in live and learning. ","messageBody":"<div id=\"ygrps-yiv-1568825403\">There are some stages of life that little kids don&#39;t need to know anything <br/>\nabout.  <br/>\n<br/>\nInnocence is as natural as any other progression in live and learning.<br/>\n<br/>\n*********************************<br/>\n<br/>\nI agree with this too.  I think it really depends on the individual child, and what their level of interest is and where they are developmentally.<br/>\n<br/>\nThere was a movie on one of the Encore channels once that had some very violent scenes in it.  I didn&#39;t know that when I had it on.  I was just watching it one afternoon out of boredom.  Honestly, the scenes are still disturbing to me as I recall them.  JUST when one of the first of these scenes was on my youngest daughter walked in, before I had a chance to turn it off.  To this day I regret that either of us had seen it.  It just wasn&#39;t necessary and it was total overexposure.  And I felt awful that this was an image she would have in her mind for a long time, if not the rest of her life.<br/>\n<br/>\n&quot;Imposed&quot; innocence to me is when we try to extend their innocent ignorance beyond what they want by not discussing things they want to discuss, and not exposing them to information (or tv programming if thats what they want) because *we* don&#39;t want to consider the possibility that they really might be ok with some of it, albeit with guidance and in a safe environment.  <br/>\n<br/>\nBut I think that happens more when kids are thinking on a more conscious level than a 2 or 3 year old who happens to wander in while we are watching a disturbing movie.<br/>\n<br/>\nSometimes its a hard balance to walk.  I *think* I&#39;ve done ok but I know in erring on the side of freedom, that there have been times the kids have seen things I wished they hadn&#39;t  because they are up later than I am and they have the tv on and I&#39;m not there.  On the other hand, we do discuss those things.  They tell me about their feelings, and we talk about it.  And thats when I can give them information, reassure them that they are safe, and help them empower themselves to stay safe in my absence.<br/>\n<br/>\nKristen<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":166495566,"authorName":"Have a Nice Day!","from":"&quot;Have a Nice Day!&quot; &lt;litlrooh@...&gt;","profile":"litlrooh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] TV content","postDate":"1092701411","msgId":98159,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGMwMWM0ODNlZSQ5MGRmMTI5MCQwMjAxYThjMEBrcmlzdGVuc2NvbXB1dGU+","referencesHeader":"PDFlYS4yN2UzYTI1ZC4yZTUyNWQzMkBhb2wuY29tPiA8MDA2YjAxYzQ4M2NhJDRjN2NkYjYwJDcyNGNkZTE4QGFvbGRzbC5uZXQ+"},"prevInTopic":98148,"nextInTopic":98176,"prevInTime":98158,"nextInTime":98160,"topicId":92160,"numMessagesInTopic":0,"msgSnippet":"Innocence is something we impose on kids to keep them in their place and keep them cute for our viewing pleasure. Innocence is ignorance in a frilly dress in","messageBody":"<div id=\"ygrps-yiv-448118990\">Innocence is something we impose on kids to keep them in their place and keep them cute for our viewing pleasure. Innocence is ignorance in a frilly dress in my opinion. <br/>\n<br/>\n******************<br/>\n<br/>\nOh THANK YOU for saying this.  And might I add that ignorance in *any* form is *dangerous*.<br/>\n<br/>\nI have held off telling this story, but I will now.<br/>\n<br/>\nNot long ago, while my 9 year old daughter and her cousins were sleeping in our cabin, a man snuck into their room and starting touching one of my nieces.  My husband was asleep on the living room couch and I was at home sleeping in my own bed.<br/>\n<br/>\nMy daughter saw what was going on, had enough presence of mind to scare the guy off, then took herself and the girls out to the truck where she could lock the doors, and when she couldn&#39;t get hold of me, she used the cell phone to call the police and had the guy arrested.  At the age of *nine*.  <br/>\n<br/>\n(She didn&#39;t see her dad sleeping on the sofa or she would have woke him up first :o)).<br/>\n<br/>\nAmazing.<br/>\n<br/>\nI didn&#39;t go out of my way to expose her to these possibilites in real life.  I also didn&#39;t go out of my way to &quot;protect her innocence&quot;.  I *did* give her a lot of information as things came up in movies, tv programs, etc, and because she has friends who live in rough families.<br/>\n<br/>\nAs scared as she was, she knew what to do and *that* is what is most important to me.<br/>\n<br/>\nLater we discovered this same guy had also approached my older daughter earlier in the evening and offered her alcohol and cigarettes if she would come with him in a dark corner in the woods behind the cabin. <br/>\n<br/>\nAlthough she had been sneaking Mike&#39;s lemonaides that evening, she dumped the one out that *this* guy gave her because she thought it was odd that a grown man was offering her alcohol.  Not only that, but she *kept* the bottle, and the police have it now. She also did NOT go with him to smoke that cigarette she wanted because she recognized the &quot;weird feeling&quot; she got and paid attention to it.<br/>\n<br/>\nI think this demonstrates a few important things.  First, my kids can talk to me because they aren&#39;t punished.  I knew it was possible they were sneaking the alcohol and when I asked them about it, they were honest.  I knew they snuck cigarettes too, because they told me.  So they had nothing to hide in what they told me and no reason to embellish either.<br/>\n<br/>\nSecond, they were not overexposed or overprotected and they had as much information as they needed whenever they asked.<br/>\n<br/>\nBut most importantly, because they are allowed to say &quot;no&quot;,  they were able to recognize, acknowledge, and ACT on the strange feelings they got from an adult, and as a result they kept themselves and others safer from harm than they might otherwise have been.<br/>\n<br/>\nKristen<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Dawn Adams <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a> <br/>\n  Sent: Monday, August 16, 2004 12:50 PM<br/>\n  Subject: Re: [UnschoolingDiscussion] TV content<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    &gt;If your young children wanted to watch an adult-rated movie that was really <br/>\n    &gt;violent, would you let them watch it?  Isn&#39;t it the role of a parent to make <br/>\n    &gt;sure that children are not exposed to this at too young of an age?  What <br/>\n    &gt;about protecting their innocence while they are young?&lt;&lt;&lt;&lt;&lt;<br/>\n    &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n    Innocence is something we impose on kids to keep them in their place and keep them cute for our viewing pleasure. Innocence is ignorance in a frilly dress in my opinion. <br/>\n    Kids experience violence (my daughter throwing a shoe at my son). Kids explore their sexuality (my toddler playing with his penis). They aren&#39;t innocent of sex and violence at all and if we pretend they are by censoring things we&#39;re just...pretending. My two year old loves Lord of the Rings and does emulate the violence in it but always in the context of play and not anger. He bashes me with his foam sword when we&#39;re playing together...not when he&#39;s angry. The movies gave him a context for aggressive play but don&#39;t feed his aggression.  So why should I not let him watch it?<br/>\n    You&#39;ve made assumptions. One that TV violence is bad another that a parents role is to protect innocence. I think they&#39;re both wrong.<br/>\n<br/>\n    not sure if that made sense (toddler seemed to wake up every two hours so I&#39;m beat today) but what the hey.<br/>\n<br/>\n    Dawn (in NS)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n  &quot;List Posting Policies&quot; are provided in the files area of this group. <br/>\n<br/>\n  Visit the Unschooling website and message boards: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n              ADVERTISEMENT<br/>\n             <br/>\n       <br/>\n       <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UnschoolingDiscussion/\">http://groups.yahoo.com/group/UnschoolingDiscussion/</a><br/>\n      <br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n      <br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] TV content","postDate":"1092699243","msgId":98176,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkMy4yOGQ0MGI0OC4yZTUyOWU2YkBhb2wuY29tPg=="},"prevInTopic":98159,"nextInTopic":98181,"prevInTime":98175,"nextInTime":98177,"topicId":92160,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/16/04 2:05:36 PM, Wishbone@supercity.ca writes: ","messageBody":"<div id=\"ygrps-yiv-63922034\">In a message dated 8/16/04 2:05:36 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Wishbone@...\">Wishbone@...</a> writes:<br/>\n<br/>\n&lt;&lt;  Innocence is something we impose on kids to keep them in their place and <br/>\nkeep them cute for our viewing pleasure. Innocence is ignorance in a frilly <br/>\ndress in my opinion.  &gt;&gt;<br/>\n<br/>\n<br/>\nThere are some stages of life that little kids don&#39;t need to know anything <br/>\nabout.  <br/>\n<br/>\nInnocence is as natural as any other progression in live and learning.<br/>\n<br/>\n<br/>\n-=-Kids explore their sexuality (my toddler playing with his penis). They <br/>\naren&#39;t innocent of sex and violence at all and if we pretend they are by <br/>\ncensoring things we&#39;re just...pretending.-=-<br/>\n<br/>\nA two year old playing with his penis isn&#39;t having sex.  He&#39;s playing with <br/>\nhis penis.<br/>\n<br/>\n-=-You&#39;ve made assumptions. One that TV violence is bad another that a <br/>\nparents role is to protect innocence. I think they&#39;re both wrong.-=-<br/>\n<br/>\nThere are levels of violence that are not fun for some people.  Some people <br/>\nhave a very low violence threshhold and will claim a headache if they watch too <br/>\nmuch Tweetie and Sylvester.  Others are okay with Vietnam movies or horror <br/>\nextravaganzas.   Most fall somewhere in between.<br/>\n<br/>\nI don&#39;t think all TV violence is to be avoided, or that it&#39;s evil, but I <br/>\ndon&#39;t think it&#39;s all equally hunky dory.<br/>\n<br/>\nSheltering people is okay.   Someone was shot so close to my house that if I <br/>\nhad known it had happened I could have seen the body from the back gate.  <br/>\nKeith saw the police cars all out there the next morning.   I was told the details <br/>\nby someone who had to witness the scene for the DA&#39;s office.<br/>\n<br/>\nI don&#39;t think telling my kids would have been cool.  I don&#39;t think running up <br/>\nthere and looking would have been nice.  I&#39;m glad they didn&#39;t show 90 seconds <br/>\nof close-up, scanning video on the news.  That kind of sheltering is fine.<br/>\n<br/>\nI think parents protecting innocence is fine, but too many people harm their <br/>\nkids in the name of protection.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":162967824,"authorName":"Dawn Adams","from":"&quot;Dawn Adams&quot; &lt;Wishbone@...&gt;","profile":"bluenosegoddess","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] TV content","postDate":"1092685834","msgId":98148,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNmIwMWM0ODNjYSQ0YzdjZGI2MCQ3MjRjZGUxOEBhb2xkc2wubmV0Pg==","referencesHeader":"PDFlYS4yN2UzYTI1ZC4yZTUyNWQzMkBhb2wuY29tPg=="},"prevInTopic":98139,"nextInTopic":98159,"prevInTime":98147,"nextInTime":98149,"topicId":92160,"numMessagesInTopic":0,"msgSnippet":"... Innocence is something we impose on kids to keep them in their place and keep them cute for our viewing pleasure. Innocence is ignorance in a frilly dress","messageBody":"<div id=\"ygrps-yiv-703279464\"><blockquote><span title=\"ireply\">&gt;If your young children wanted to watch an adult-rated movie that was really <br/>\n  &gt;violent, would you let them watch it?  Isn&#39;t it the role of a parent to make <br/>\n  &gt;sure that children are not exposed to this at too young of an age?  What <br/>\n  &gt;about protecting their innocence while they are young?&lt;&lt;&lt;&lt;&lt;<br/>\n  &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>  Innocence is something we impose on kids to keep them in their place and keep them cute for our viewing pleasure. Innocence is ignorance in a frilly dress in my opinion. <br/>\n  Kids experience violence (my daughter throwing a shoe at my son). Kids explore their sexuality (my toddler playing with his penis). They aren&#39;t innocent of sex and violence at all and if we pretend they are by censoring things we&#39;re just...pretending. My two year old loves Lord of the Rings and does emulate the violence in it but always in the context of play and not anger. He bashes me with his foam sword when we&#39;re playing together...not when he&#39;s angry. The movies gave him a context for aggressive play but don&#39;t feed his aggression.  So why should I not let him watch it?<br/>\n  You&#39;ve made assumptions. One that TV violence is bad another that a parents role is to protect innocence. I think they&#39;re both wrong.<br/>\n<br/>\n  not sure if that made sense (toddler seemed to wake up every two hours so I&#39;m beat today) but what the hey.<br/>\n<br/>\n  Dawn (in NS)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] TV content","postDate":"1092682546","msgId":98139,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlYS4yN2UzYTI1ZC4yZTUyNWQzMkBhb2wuY29tPg=="},"prevInTopic":92283,"nextInTopic":98148,"prevInTime":98138,"nextInTime":98140,"topicId":92160,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/22/2004 1:23:20 PM Eastern Standard Time, erikanunn@hotmail.com writes: If your young children wanted to watch an adult-rated movie that","messageBody":"<div id=\"ygrps-yiv-1807849914\">In a message dated 3/22/2004 1:23:20 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:erikanunn@...\">erikanunn@...</a> writes:<br/>\n<br/>\nIf your young children wanted to watch an adult-rated movie that was really <br/>\nviolent, would you let them watch it?  Isn&#39;t it the role of a parent to make <br/>\nsure that children are not exposed to this at too young of an age?  What <br/>\nabout protecting their innocence while they are young?&lt;&lt;&lt;&lt;&lt;<br/>\n <br/>\n <br/>\nMy eight year old and I were watching Jesus Christ Superstar the other day. <br/>\nWe had listened to the CD a few days before, and I got the movie because he <br/>\nasked me to. He knew that there were 39 lashes----he&#39;d counted with Pilate on the <br/>\nCD. But when the flogging was coming up, he asked to leave the room. Instead, <br/>\nI just fast-forwarded through the flogging. HE KNEW he wasn&#39;t ready to watch <br/>\nthat! <br/>\n <br/>\nWe later discussed how they wouldn&#39;t actually whip an actor---that it was <br/>\njust a special effect (in fact, during the overture, thre&#39;s a guy flogging the <br/>\nplexiglass prop and making it bleed). <br/>\n <br/>\nI *could* have made him sit and watch. I *could* have made him cover his <br/>\neyes. I *could * have never even brought the movie home. I *could* have done a lot <br/>\nof things. But because he knew what he could handle, we did it *his* way. <br/>\n <br/>\nMost children don&#39;t want to see people or animals hurt. Nor do they care to <br/>\nwatch sex scenes. They naturally shy away from both those things. Young <br/>\nchildren who actively seek out those things may have other problems. <br/>\n <br/>\n~Kelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] female characters WAS Re: TV content","postDate":"1080417404","msgId":92283,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU2LjRhZDk0ZDhiLjJkOTczNjdjQGFvbC5jb20+"},"prevInTopic":92279,"nextInTopic":98139,"prevInTime":92282,"nextInTime":92284,"topicId":92160,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/26/2004 10:04:27 PM Mountain Standard Time, SpinFrog@yahoo.com writes: Yes, we live in a world filled with such stereotypes. And there is","messageBody":"<div id=\"ygrps-yiv-1900076842\">In a message dated 3/26/2004 10:04:27 PM Mountain Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SpinFrog@...\">SpinFrog@...</a> writes:<br/>\nYes, we live in a world filled with such stereotypes. And there is no<br/>\nway to &#39;protect&#39; our kids - and no reason for doing so - but we don&#39;t<br/>\nhave to partake in the stereotyping. <br/>\n=======<br/>\n<br/>\nKirby and Marty are big and strong and male.  They just are.<br/>\n<br/>\nTheyhave one big strong female friend.  She&#39;s also really feminine.  When <br/>\ntrucks need to be loaded, Sadie&#39;s likely to be asked to help.  Sadie is stronger <br/>\nthan some of the males in that group.  The group of kids they hang out with <br/>\nwould nevver say &quot;Let us males go and oad the truk while the females make us <br/>\nlunch.&quot;  None of them are that way.  Two of the best cooks we know are men, and <br/>\nthe kids have known them since they were born.<br/>\n<br/>\nStereotyping is not as much a problem as it was when some of us were kids.  <br/>\nGoing extremely reactionary doesn&#39;t help.  It&#39;s just another irritation which <br/>\ndoesn&#39;t respect boys and men.<br/>\n<br/>\nDestroying the self image of big strong boys and men doesn&#39;t help the image <br/>\nof girls and women.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":31740294,"authorName":"Inna Manni","from":"Inna Manni &lt;SpinFrog@...&gt;","profile":"spinfrog","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] female characters WAS Re: TV content","postDate":"1080351682","msgId":92279,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwMzI3MDE0MTIyLjYzMjk1LnFtYWlsQHdlYjQwOTEzLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDFjYi4xZDE2N2I2Yy4yZDk1ZDM0NkBhb2wuY29tPg=="},"prevInTopic":92270,"nextInTopic":92283,"prevInTime":92278,"nextInTime":92280,"topicId":92160,"numMessagesInTopic":0,"msgSnippet":"Hi Sandra, It s interesting that you chose to use genders. Big strong man and smaller, less able female - and not big strong PERSON and smaller, less","messageBody":"<div id=\"ygrps-yiv-604179144\">Hi Sandra,<br/>\n<br/>\nIt&#39;s interesting that you chose to use genders. &quot;Big strong man&quot; and<br/>\n&quot;smaller, less able female&quot; - and not &quot;big strong PERSON&quot; and<br/>\n&quot;smaller, less able PERSON&quot;. Because isn&#39;t that the real problem here<br/>\n- that we are characterizing each gender as able and strong, or not?<br/>\nI&#39;m sure there are lots of big strong WOMEN out there, as well as<br/>\nsmaller, less able MEN. As a shorter, smaller (but NOT less able)<br/>\nperson, I have learned to find ways to get whatever I need done. But<br/>\nI am completely at ease with accepting help, when it is available,<br/>\nfrom someone bigger, stronger and taller than myself, whatever may<br/>\nthat person&#39;s gender happen to be. <br/>\n<br/>\nI have also worked as a rape councelor when I was younger. And I have<br/>\nread stories where men where raped by women. And it was precisely the<br/>\nstereotype of &quot;bigger, stronger, more virile, more able&quot;, that made<br/>\nthem ashamed and unable to deal with the fact that someone has hurt<br/>\nthem. <br/>\n<br/>\nYes, we live in a world filled with such stereotypes. And there is no<br/>\nway to &#39;protect&#39; our kids - and no reason for doing so - but we don&#39;t<br/>\nhave to partake in the stereotyping. <br/>\n<br/>\n--Inna<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--- <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Yet I&#39;m grateful to that same sexist grew-up-without-sisters guy<br/>\n&gt; for many <br/>\n&gt; services that only a big strong man can so easily provide for a<br/>\n&gt; smaller, less <br/>\n&gt; able female.  It&#39;s not unnatural.  It&#39;s not evil.  It&#39;s not<br/>\n&gt; something to shame <br/>\n&gt; our sons out of, being strong and capable.  Too many boys are being<br/>\n&gt; robbed of <br/>\n&gt; their heritage and their birthright and their instincts.  <br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>__________________________________<br/>\nDo you Yahoo!?<br/>\nYahoo! Finance Tax Center - File online. File on time.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://taxes.yahoo.com/filing.html\">http://taxes.yahoo.com/filing.html</a></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] female characters WAS Re: TV content","postDate":"1080326470","msgId":92270,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjYi4xZDE2N2I2Yy4yZDk1ZDM0NkBhb2wuY29tPg=="},"prevInTopic":92267,"nextInTopic":92279,"prevInTime":92269,"nextInTime":92271,"topicId":92160,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/25/2004 6:19:43 PM Mountain Standard Time, ummhjm@yahoo.com writes: Likewise, I don t want my sons to expect that women are like that and","messageBody":"<div id=\"ygrps-yiv-1825963396\">In a message dated 3/25/2004 6:19:43 PM Mountain Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ummhjm@...\">ummhjm@...</a> writes:<br/>\nLikewise, I don&#39;t want my sons to expect that women are like that and that my <br/>\nsons&#39; role is to come in and rescue/save them so women should be nothing but <br/>\ngrateful because where would women be without them?!  <br/>\nSo do you avoid exposing them to real history, and go more toward <br/>\nhand-selected non-sexist fantasy-history and revisionist versions of things?  <br/>\n<br/>\nI think that&#39;s MORE dangerous (no matter who&#39;s doing it or why) than just <br/>\nletting them see plain accounts and real fairy tales, but telling them how things <br/>\nhave changed and why.<br/>\n<br/>\nPretending the world is quite other than it is is a dishonesty children can&#39;t <br/>\nreally benefit from.  The advantage is temporary, I think, and could be <br/>\nultimately more frustrating.<br/>\n<br/>\nIn the early 70&#39;s when Ms. Magazine was new I was quite into the women&#39;s <br/>\nmovement.  I volunteered in the first rape crisis center in my state.  I had a <br/>\nWoman Power t-shirt which Holly wears now (and to those who know me and Holly <br/>\npersonally: yes, I DID wear t-shirts &quot;size S&quot; in college).  I nearly refused to <br/>\nhave anything to do with one young obnoxious Mr. Keith Dodd until he finished <br/>\nreading Susan Brownmiller&#39;s book on Men, Women and Rape and discussed it with <br/>\nme to my satisfaction.<br/>\n<br/>\nYet I&#39;m grateful to that same sexist grew-up-without-sisters guy for many <br/>\nservices that only a big strong man can so easily provide for a smaller, less <br/>\nable female.  It&#39;s not unnatural.  It&#39;s not evil.  It&#39;s not something to shame <br/>\nour sons out of, being strong and capable.  Too many boys are being robbed of <br/>\ntheir heritage and their birthright and their instincts.  Isn&#39;t that one <br/>\ncomplaint about the mistreatment of women?  Their natural gifts were belittled <br/>\ninstead of glorified?  Don&#39;t do that to your sons.<br/>\n<br/>\nAnyone who is feeding children a revisionist line of culture, please <br/>\nreconsider.  Reality is more powerful than the fantasy of any mom.  Children will live <br/>\nin the world, not in mom&#39;s little world.  Let them grow up respecting mom&#39;s <br/>\nopinion and perspective, not having to recover from it.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":73238415,"authorName":"J. Stauffer","from":"&quot;J. Stauffer&quot; &lt;jnjstau@...&gt;","profile":"jnjstau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] female characters WAS Re: TV content","postDate":"1080317542","msgId":92267,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTAwMWM0MTM0ZCQxZjVmMzgwMCQ4ZWJkYjFkOEB5b3VybzBrd2t3OWp3Yz4=","referencesHeader":"PDIwMDQwMzI1MTcyOTQ2LjM1Ny5xbWFpbEB3ZWIyMDIwNC5tYWlsLnlhaG9vLmNvbT4="},"prevInTopic":92259,"nextInTopic":92270,"prevInTime":92266,"nextInTime":92268,"topicId":92160,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-154829145\">&lt;&lt;&lt; I have one daughter and three sons and refuse to allow my daughter to be<br/>\ntaught, if only subconsciously (which is arguably the most dangerous!), that<br/>\nshe needs to be rescued/saved because she&#39;s a helpless girl. &gt;&gt;&gt;&gt;<br/>\n<br/>\n&lt;&lt;&lt;And I guess it goes without saying that the historical women we study<br/>\nalso were strong and played critical roles in history -- &gt;&gt;&gt;&gt;<br/>\n<br/>\nI&#39;m sorry....I haven&#39;t been reading closely the last few days due to company<br/>\nvisiting.....but do you unschool?  Just seemed like unusual wording for an<br/>\nunschooling list so thought I would check.<br/>\n<br/>\nJulie S.</div>","specialLinks":[]},{"userId":7143857,"authorName":"jrossedd@aol.com","from":"jrossedd@...","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] female characters WAS Re: TV content","postDate":"1080264722","msgId":92259,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjZi4xZDAzZTY5Ny4yZDk0ZTIxMkBhb2wuY29tPg=="},"prevInTopic":92258,"nextInTopic":92267,"prevInTime":92258,"nextInTime":92260,"topicId":92160,"numMessagesInTopic":0,"msgSnippet":"It s just the same in our house, except both sexes know and love ALL the stories, including all the princesses and damsels, and it hasn t hurt a thing! :) Just","messageBody":"<div id=\"ygrps-yiv-165121101\">It&#39;s just the same in our house, except both sexes know and love ALL <br/>\nthe stories, including all the princesses and damsels, and it hasn&#39;t hurt a <br/>\nthing! :) <br/>\n<br/>\n       Just today, DD14 came breezing through the room rhapsodizing over the <br/>\ncourtroom scene in Adam&#39;s Rib (Tracy/Hepburn) where Katharine Hepburn calls <br/>\nvarious accomplished women to the stand. When she asks a particular witness to <br/>\nstart by listing her degrees, the woman replies, &quot;The domestic ones, or did you <br/>\nalso want the European ones?&quot; &lt;g&gt;<br/>\n<br/>\n       Did you and your daughters happen to catch the HBO dramatization of <br/>\nAmerican suffrage, &quot;Iron Jawed Angels?&quot;<br/>\nJJ<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ummhjm@...\">ummhjm@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; That&#39;s the reason, with few exceptions, my kids really don&#39;t know the <br/>\n&gt; characters and stories most of us grew up with.  As more examples, although I&#39;m <br/>\n&gt; sure the list doesn&#39;t end here -- &quot;The Little Mermaid,&quot; &quot;Pocahontas,&quot; &quot;Sleeping <br/>\n&gt; Beauty,&quot; &quot;Snow White and the Seven Dwarfs,&quot; to name a few.<br/>\n&gt; <br/>\n&gt; I have one daughter and three sons and refuse to allow my daughter to be <br/>\n&gt; taught, if only subconsciously (which is arguably the most dangerous!), that she <br/>\n&gt; needs to be rescued/saved because she&#39;s a helpless girl.  Likewise, I don&#39;t <br/>\n&gt; want my sons to expect that women are like that and that my sons&#39; role is to <br/>\n&gt; come in and rescue/save them so women should be nothing but grateful because <br/>\n&gt; where would women be without them?!  Then there&#39;s the whole issue with how <br/>\n&gt; parents are portrayed, as you mentioned . . .<br/>\n&gt; <br/>\n&gt; So I try to model strong, female leadership in myself and in the women in my <br/>\n&gt; children&#39;s lives.  And I guess it goes without saying that the historical <br/>\n&gt; women we study also were strong and played critical roles in history -- <br/>\n&gt; otherwise they probably wouldn&#39;t have survived history, right?!  But when we talk <br/>\n&gt; about them, I make it a point to stress the challenges they faced, the inner <br/>\n&gt; strength they found to get through them, etc.  Of course, I do the same with <br/>\n&gt; male role models, but they generally don&#39;t get short-changed by society!<br/>\n&gt; <br/>\n&gt; Yeah, big sigh . . .<br/>\n&gt; <br/>\n&gt; Priscilla<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":87734814,"authorName":"Priscilla Martinez","from":"Priscilla Martinez &lt;ummhjm@...&gt;","profile":"ummhjm","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"female characters WAS Re: TV content","postDate":"1080235786","msgId":92258,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwMzI1MTcyOTQ2LjM1Ny5xbWFpbEB3ZWIyMDIwNC5tYWlsLnlhaG9vLmNvbT4=","inReplyToHeader":"PDIwMDQwMzI0MjIyMTA3LjUwMjM1LnFtYWlsQHdlYjQwOTEyLm1haWwueWFob28uY29tPg=="},"prevInTopic":92233,"nextInTopic":92259,"prevInTime":92257,"nextInTime":92259,"topicId":92160,"numMessagesInTopic":0,"msgSnippet":"Hi Inna! I agree with your summary of typical female characters.  That s the reason, with few exceptions, my kids really don t know the characters and stories","messageBody":"<div id=\"ygrps-yiv-1915985364\">Hi Inna!<br/>\n <br/>\nI agree with your summary of typical female characters.  That&#39;s the reason, with few exceptions, my kids really don&#39;t know the characters and stories most of us grew up with.  As more examples, although I&#39;m sure the list doesn&#39;t end here -- &quot;The Little Mermaid,&quot; &quot;Pocahontas,&quot; &quot;Sleeping Beauty,&quot; &quot;Snow White and the Seven Dwarfs,&quot; to name a few.<br/>\n <br/>\nI have one daughter and three sons and refuse to allow my daughter to be taught, if only subconsciously (which is arguably the most dangerous!), that she needs to be rescued/saved because she&#39;s a helpless girl.  Likewise, I don&#39;t want my sons to expect that women are like that and that my sons&#39; role is to come in and rescue/save them so women should be nothing but grateful because where would women be without them?!  Then there&#39;s the whole issue with how parents are portrayed, as you mentioned . . .<br/>\n <br/>\nSo I try to model strong, female leadership in myself and in the women in my children&#39;s lives.  And I guess it goes without saying that the historical women we study also were strong and played critical roles in history -- otherwise they probably wouldn&#39;t have survived history, right?!  But when we talk about them, I make it a point to stress the challenges they faced, the inner strength they found to get through them, etc.  Of course, I do the same with male role models, but they generally don&#39;t get short-changed by society!<br/>\n <br/>\nYeah, big sigh . . .<br/>\n <br/>\nPriscilla<br/>\n<br/>\n<br/>\n&quot;If there must be trouble, let it be in my day,<br/>\nthat my child may have peace.&quot; <br/>\nThomas Paine<br/>\n(1737-1809, Anglo-American political theorist and writer)<br/>\n<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nYahoo! Finance Tax Center - File online. File on time.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":31740294,"authorName":"Inna Manni","from":"Inna Manni &lt;SpinFrog@...&gt;","profile":"spinfrog","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] TV content","postDate":"1080166867","msgId":92233,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwMzI0MjIyMTA3LjUwMjM1LnFtYWlsQHdlYjQwOTEyLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDFlNC4xYmUzMzE3NC4yZDkwOTVkY0Bhb2wuY29tPg=="},"prevInTopic":92217,"nextInTopic":92258,"prevInTime":92232,"nextInTime":92234,"topicId":92160,"numMessagesInTopic":0,"msgSnippet":"Hi Erika, It s funny that you are worried about violence of GI Joe and Ninja Turtles, because those are very PC and super low on bloodshed & such. They are","messageBody":"<div id=\"ygrps-yiv-1681783928\">Hi Erika,<br/>\n<br/>\nIt&#39;s funny that you are worried about &quot;violence&quot; of GI Joe and Ninja<br/>\nTurtles, because those are very PC and super low on bloodshed & such.<br/>\nThey are really about friendship and loyalty and such. Princess<br/>\nMononoke has way more blood, death and sadness. Btw, my 2 yr old<br/>\ndaughter loves P.M.<br/>\n<br/>\nWhat worries me in most TV programs is the way parents are portayed.<br/>\nAs clueless, prudish, set in their boring, dumb ways. The parents in<br/>\nAmerican made-for-children shows/movies Just Don&#39;t Get It. And the<br/>\nmothers especially get the raw end of the deal. <br/>\n<br/>\nAnd the shows/moves are generally about a male main character. And<br/>\nthen of course there are movies like Cinderella. About a pretty girl<br/>\nwho is just so sweet, kind and innocent, and completely unselfish.<br/>\nAnd the poor thing is Forced To Do Chores! Of course she deserves for<br/>\na nice wealthy young prince to come and save her! And all the other<br/>\nfemale characters are ugly, evil, selfish... I have to say,<br/>\nCinderella bothers me a lot more than Ninja Turtles or Princess<br/>\nMononoke, because of the values it teaches. <br/>\n<br/>\nAnd, of course, when watching straight TV, one gets the commercials.<br/>\nMore portayals of dumb, boring, controlling mothers, and their<br/>\nsugar-loving witty & cool kids... *sigh*<br/>\n<br/>\n--Inna<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n__________________________________<br/>\nDo you Yahoo!?<br/>\nYahoo! Finance Tax Center - File online. File on time.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://taxes.yahoo.com/filing.html\">http://taxes.yahoo.com/filing.html</a></div>","specialLinks":[]},{"userId":140408439,"authorName":"Erika Nunn","from":"&quot;Erika Nunn&quot; &lt;erikanunn@...&gt;","profile":"soupythesnail","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] TV content","postDate":"1080082766","msgId":92217,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTctRjExOGxaNGtjbHRBMDUwMDAwM2ZhYkBob3RtYWlsLmNvbT4="},"prevInTopic":92186,"nextInTopic":92233,"prevInTime":92216,"nextInTime":92218,"topicId":92160,"numMessagesInTopic":0,"msgSnippet":"In response to... ","messageBody":"<div id=\"ygrps-yiv-371614420\">In response to...<br/>\n<br/>\n&quot;&lt;&lt;Also, I want to express all of my worries ...I guess . . . I am worried . <br/>\n.<br/>\n. I worry<br/>\n<br/>\nThat just seems really strange  . . . I am worried ....&gt;&gt;<br/>\n<br/>\nThat was your long paragraph with the unimportant parts taken out.<br/>\n<br/>\nYou&#39;re worrying too much.  Really.  -Sandra&quot;<br/>\n<br/>\nLOL....So you think I worry too much?  You&#39;re right.  I do.  Thank you for <br/>\never-so-gently pointing that out to me.  :)<br/>\n<br/>\nI told my husband that I had asked &quot;that unschooling group&quot; about the <br/>\nsituation.  He said, &quot;Well, I am sure I won&#39;t agree with all of their <br/>\nresponses.&quot;  I told him that you all agreed with him.  He was deliriously <br/>\nhappy.  You all made my husband deliriously happy for a day.<br/>\n<br/>\nAnyway, I have taken in all of your points and understand where you are <br/>\ncoming from.  I was doing really well relaxing with the television until GI <br/>\nJoe came out, and then I regressed for awhile.  I was making it all about GI <br/>\nJoe when it really wasn&#39;t.  And you are correct about little kids not <br/>\nwanting to watch stuff that is too scary for them.  My kids always tell me <br/>\nthat they don&#39;t want to watch Daddy&#39;s &quot;scary&quot; movies from judging the <br/>\npictures on the cases.  Also, the person that wrote in about how much they <br/>\nused to love gory movies helped a lot.  I have never understood people <br/>\nwatching them or anything violent for that matter, but her insight led me to <br/>\nlook deeper.<br/>\n<br/>\nThe other day my friend came over and told me that from now on her son was <br/>\nnot allowed to play in any sort of &quot;violent&quot; way.  Like my son&#39;s toy Turtles <br/>\npunching each other, etc.  As soon as he heard his mother tell me that he <br/>\nstarted playing in that way in a really obvious manner and watching for his <br/>\nmother&#39;s reaction while she got more and more fed up trying to control the <br/>\ntoys he could play with (he is almost 5).  Later that day the boy got more <br/>\nand more out of control and ended up throwing something at our cat and <br/>\nkicking over his food bowl (all the while watching his mother).  She stated <br/>\nthat he &quot;gets that way&quot; after he has played with these &quot;violent&quot; toys.  To <br/>\nme it was plainly obvious that he &quot;gets that way&quot; from being overly <br/>\ncontrolled.<br/>\n<br/>\nThanks,<br/>\nErika  :)<br/>\n<br/>\n_________________________________________________________________<br/>\nGet tax tips, tools and access to IRS forms � all in one place at MSN Money! <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://moneycentral.msn.com/tax/home.asp\">http://moneycentral.msn.com/tax/home.asp</a></div>","specialLinks":[]},{"userId":73238415,"authorName":"J. Stauffer","from":"&quot;J. Stauffer&quot; &lt;jnjstau@...&gt;","profile":"jnjstau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] TV content","postDate":"1079990878","msgId":92186,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGIwMWM0MTA1NCQ4YzY4OWQyMCQ0NGJkYjFkOEB5b3VybzBrd2t3OWp3Yz4=","referencesHeader":"PEJBWTctRjI4S0lZczVDUlRZQkswMDAwMWQ1MEBob3RtYWlsLmNvbT4gPDAwMGIwMWM0MTAyNyRjOTk1NzI0MCQ3NjRjZGUxOEBhb2xkc2wubmV0Pg=="},"prevInTopic":92181,"nextInTopic":92217,"prevInTime":92185,"nextInTime":92187,"topicId":92160,"numMessagesInTopic":0,"msgSnippet":"... I agree.  I think the concept of innocence of childhood is quite a new one, historically speaking.  I don t think it was a concept in say....Victorian","messageBody":"<div id=\"ygrps-yiv-2032547020\">&lt;&lt;&lt;&lt;&lt;I don&#39;t really believe in that and think &#39;innocence&#39;<br/>\n<blockquote><span title=\"ireply\"> &gt; is usually code for not talking to children about things that make adults<br/>\n&gt; squeamish. It always assume childhood is some blessed state of happiness<br/>\n&gt; free from worry and stress. &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>I agree.  I think the concept of &quot;innocence of childhood&quot; is quite a new<br/>\none, historically speaking.  I don&#39;t think it was a concept in<br/>\nsay....Victorian England.....I can&#39;t imagine little Oliver Twist having his<br/>\neyes shielded from things.<br/>\n<br/>\nI think part of it is the society we live in.  In the not so distant past,<br/>\nif you wanted to eat something, you killed it, butchered it, used the<br/>\nintestines to stuff sausage, etc..  Your family all slept in the same room<br/>\nand you had seen lots of animals having sex and probably your parents.<br/>\nAnimals died, people died....you might have a dead body lying in state in<br/>\nyour living room for a few days.<br/>\n<br/>\nThe world we live in now is quite different.<br/>\n<br/>\nJulie S.<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;Dawn Adams&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Wishbone@...\">Wishbone@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>&gt;<br/>\nSent: Monday, March 22, 2004 10:07 AM<br/>\nSubject: Re: [UnschoolingDiscussion] TV content<br/>\n<br/>\n<br/>\n&gt; Erika writes:<br/>\n&gt; &gt; &quot;Don&#39;t set up a situation where they will be tempted to watch a program<br/>\n&gt; &gt; precisely because you don&#39;t like it.&quot;<br/>\n&gt; &gt;<br/>\n&gt; &gt; Sandra - I am not getting what you meant by this statement.  And I<br/>\nreally<br/>\n&gt; &gt; want to!  :)<br/>\n&gt; &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n&gt;<br/>\n&gt; I think she meant that as soon as you put a show offlimits, that&#39;s all<br/>\n&gt; they&#39;ll want to watch. I did that with the Simpsons and my 5 year old.<br/>\nGuess<br/>\n&gt; what was the only show she talked about during that short time? Now she&#39;s<br/>\n&gt; free to watch it and rarely does.<br/>\n&gt;<br/>\n&gt; &gt; It is not that my husband forces my kids to watch the shows, but he<br/>\n&gt; presents<br/>\n&gt; &gt; the shows to them.  I guess I am speculating that if he didn&#39;t present<br/>\n&gt; those<br/>\n&gt; &gt; shows that they wouldn&#39;t have the option.<br/>\n&gt; &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n&gt;<br/>\n&gt; I think your husband probably wants to introduce shwos that he remembers<br/>\n&gt; fondly from childhood. I spent hours upon hours playing GIJoe with my<br/>\n&gt; brothers and thought the show was great.<br/>\n&gt;<br/>\n&gt; &gt; Also, I want to express all of my worries about these types of shows and<br/>\n&gt; &gt; perhaps you (the group) could provide some feedback...I guess GI Joe to<br/>\nme<br/>\n&gt; &gt; is a show with army guys who fight a lot.  I am worried that if my kids<br/>\n&gt; &gt; watch that show that they will grow up to be desensitized to that.  I<br/>\n&gt; worry<br/>\n&gt; &gt; that when they are adults and see violence on the news that it won&#39;t<br/>\n&gt; affect<br/>\n&gt; &gt; them - they wouldn&#39;t see the reality of it.  My husband says that in GI<br/>\n&gt; Joe<br/>\n&gt; &gt; nobody ever dies.<br/>\n&gt; &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n&gt;<br/>\n&gt; Have you watched this show yet?<br/>\n&gt;<br/>\n&gt;   That just seems really strange too - what is that<br/>\n&gt; &gt; teaching my kids?  I am worried of what that show would do to my kid&#39;s<br/>\n&gt; &gt; psyches....it just can&#39;t be good for them to sit and watch people<br/>\nshooting<br/>\n&gt; &gt; each other for hours.<br/>\n&gt; &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n&gt;<br/>\n&gt; The show is only a half hour. And there&#39;s not that much shooting. And it&#39;s<br/>\na<br/>\n&gt; cartoon. If they get desensitzed to cartoon violence, oh well. Honestly,<br/>\nyou<br/>\n&gt; have more influence over your kids then any TV show ever will.<br/>\n&gt;<br/>\n&gt; &gt; Honestly, I have always had a distaste for violence in movies and TV.  I<br/>\n&gt; &gt; don&#39;t understand how people can watch other people being hurt.  That<br/>\nisn&#39;t<br/>\n&gt; &gt; entertainment to me.<br/>\n&gt; &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n&gt;<br/>\n&gt; I used to gobble up horror flicks. The more gore the better. And no, it<br/>\n&gt; wasn&#39;t because I liked seeing people get hurt. I was enamoured with the<br/>\n&gt; special effects. At one point in my teenage years I could name off all the<br/>\n&gt; important FX studios and artists (and I collected comic books and I was a<br/>\n&gt; girl. Definate geek.). I understood that it was a movie and nobody was<br/>\n&gt; getting hurt. So if I hissed, &#39;cooooool&#39;, after a head was parted from its<br/>\n&gt; shoulders it was in admiration of someone&#39;s skill with model heads.<br/>\nAnyhow,<br/>\n&gt; I can&#39;t watch it like I used too. All the movies I used to watch didn&#39;t do<br/>\n&gt; diddly to desensitize me in the long run and the last horror flick I<br/>\nwatched<br/>\n&gt; had me covering my eyes.<br/>\n&gt; That isn&#39;t entertaiment for you, but it is for others...and not for the<br/>\n&gt; reasons you assume.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt; If your young children wanted to watch an adult-rated movie that was<br/>\n&gt; really<br/>\n&gt; &gt; violent, would you let them watch it?  Isn&#39;t it the role of a parent to<br/>\n&gt; make<br/>\n&gt; &gt; sure that children are not exposed to this at too young of an age?  What<br/>\n&gt; &gt; about protecting their innocence while they are young?<br/>\n&gt; &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n&gt;<br/>\n&gt; My daugher has watched Lord of the Rings (at her begging). Her favourite<br/>\n&gt; part is the darkest, the Mines of Moria. It&#39;s a pretty violent film but<br/>\n&gt; she&#39;s watched the making of documentries on the DVD so she knows what goes<br/>\n&gt; into making a Balrog or a good decapitation scene. How has it affected<br/>\nher?<br/>\n&gt; Legolas is married to her apparently and we&#39;ve had marathon discussions<br/>\n&gt; about good and evil. Has it harmed her innocence? I&#39;m not the right one to<br/>\n&gt; answer that I think...I don&#39;t really believe in that and think &#39;innocence&#39;<br/>\n&gt; is usually code for not talking to children about things that make adults<br/>\n&gt; squeamish. It always assume childhood is some blessed state of happiness<br/>\n&gt; free from worry and stress. Anyhow, off on a tangent. She&#39;s still the<br/>\nsweet,<br/>\n&gt; caring girl we&#39;ve always had. I haven&#39;t noticed her running about the<br/>\n&gt; neighbourhood slashing at the neighbours with a kitchen knife. :)<br/>\n&gt;  I don&#39;t see my role as keeping my kids away from certain things, I see it<br/>\n&gt; as making sure they&#39;re equipped to deal with and make choices about those<br/>\n&gt; things.<br/>\n&gt;<br/>\n&gt; Dawn (in NS)<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n&gt;<br/>\n&gt; Visit the Unschooling website and message boards:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"dezignarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] TV content","postDate":"1079986768","msgId":92181,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PEJBWTctRjc4d3ptRmJjbVlkR3YwMDA2MmY3ZUBob3RtYWlsLmNvbT4="},"prevInTopic":92179,"nextInTopic":92186,"prevInTime":92180,"nextInTime":92182,"topicId":92160,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-300304962\">&lt;&lt;Do you guys think I am being overly controlling?  Would you suggest that I<br/>\n<br/>\nsit down with my son and daugher while they watch the GI Joe cartoons?  From<br/>\n<br/>\nreading previous posts, it seemed to me that many of you don&#39;t censor what <br/>\nyour children watch (but I got the impression you were talking about your <br/>\nolder children, too).&gt;&gt;<br/>\n<br/>\nJayn (4) self-censors, as is the only person in the house likely to say, &quot;I<br/>\ndon&#39;t want the TV on&quot; for any reason. If something is scary she says so, and<br/>\nleaves (dvd&#39;s we jump ahead) or covers her head until the scene is over. The<br/>\nonly show we switch off if she happens to come in while we are watching it<br/>\nis &quot;Real Sex&quot; (HBO) mostly because I don&#39;t think I&#39;m ready to answer any<br/>\nquestions she might have. Some of that stuff is pretty..um.. unusual. <br/>\n<br/>\nJayn&#39;s favorites shows are mostly cartoons like &quot;Scooby Doo&quot; (all<br/>\npermutations), &quot;Max & Ruby&quot;, &quot;Dora&quot;, &quot;Brum&quot;, &quot;Hi-5&quot; (TLC and Discovery),<br/>\n&quot;Kim Possible&quot;, &quot;Book of Pooh&quot; (puppets), &quot;Mary Kate and Ashley In Action&quot;<br/>\nand &quot;Toad Patrol&quot;. For live action she is starting to like &quot;That&#39;s So Raven&quot;<br/>\n(Disney), &quot;Sister,Sister&quot;, and &quot;So Little Time&quot; (Olsen twins on DVD). She<br/>\nwatches &quot;Survivor&quot;, &quot;ER&quot; and &quot;CSI&quot; with us, and really enjoyed &quot;Sex and the<br/>\nCity&quot; (pretty ladies in pretty dresses was the attraction). She doesn&#39;t like<br/>\n&quot;Stargate SG-1&quot; much, and will play off to the side when I am watching it.<br/>\nHer DVD choices are all the princess stories from Disney, Angelina<br/>\nBallerina, assorted other Disney stuff (Mary Poppins, Studio Ghibli,<br/>\nAtlantis), &quot;Sailor Moon&quot;, and the three Barbie computer animated movies in a<br/>\nrotating order of preference. The best thing is hearing her sing the theme<br/>\nsongs.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.567 / Virus Database: 358 - Release Date: 1/24/2004</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] TV content","postDate":"1079983068","msgId":92177,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlNC4xYmUzMzE3NC4yZDkwOTVkY0Bhb2wuY29tPg=="},"prevInTopic":92176,"nextInTopic":92179,"prevInTime":92176,"nextInTime":92178,"topicId":92160,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/22/04 11:23:22 AM, erikanunn@hotmail.com writes: ","messageBody":"<div id=\"ygrps-yiv-2055932043\">In a message dated 3/22/04 11:23:22 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:erikanunn@...\">erikanunn@...</a> writes:<br/>\n<br/>\n&lt;&lt; &quot;Don&#39;t set up a situation where they will be tempted to watch a program<br/>\n<br/>\nprecisely because you don&#39;t like it.&quot;<br/>\n<br/>\n<br/>\nSandra - I am not getting what you meant by this statement.  And I really <br/>\n<br/>\nwant to!  :) &gt;&gt;<br/>\n<br/>\nSometimes (often?) a child (especially older children who have a pent up <br/>\nstore of parental judgment and limitation) will do something for no other reason <br/>\nthan that the parents have advised against it.  Either out of spite or <br/>\ncuriosity, he will see what could be so totally wrong about rock&#39;n&#39;roll or smoking or <br/>\nstaying out after midnight or eating ice cream for breakfast.  Sometimes, if <br/>\nit&#39;s spite, he will KEEP doing the thing, hoping subconsciously to do damage to <br/>\nhis parents by doing it.   Some people get a tattoo not so much because they <br/>\ncan&#39;t imagine life without one, but because they KNOW it will burn their mom&#39;s <br/>\nass.  For life.<br/>\n<br/>\nSo the first step in not getting to that point (even a little bit) with your <br/>\nown children is to respect their decisions when they&#39;re small.  When the <br/>\nchildren are small and when the decisions are small.   Marty wore a tiger costume <br/>\n(just the stripey body-suit, not the hood or make-up) for most of a year.  With <br/>\ncowboy boots.  Now years later Marty likes his head shaved.  I wish he&#39;d have <br/>\nhair.   But I let him make his own decisions about tiger suits and shaved <br/>\nhead, and when he&#39;s grown and out, he will not feel the urge to wear something <br/>\nbecause it was forbidden (nothing was forbidden) or to express himself with hair <br/>\nor lack thereof *FINALLY.*  There won&#39;t be any relief of &quot;finally I can make <br/>\nmy own decisions,&quot; which has resulted throughout history in TONS of profoundly <br/>\nbad &quot;decisions&quot; made not consciously, but in plain reaction to what was <br/>\npreviously forbidden.<br/>\n<br/>\n&lt;&lt;It is not that my husband forces my kids to watch the shows, but he <br/>\npresents <br/>\n<br/>\nthe shows to them.  I guess I am speculating that if he didn&#39;t present those <br/>\n<br/>\nshows that they wouldn&#39;t have the option.&gt;&gt;<br/>\n<br/>\nYour use of &quot;has them,&quot; &quot;presents&quot; and &quot;option&quot; don&#39;t match my uses of them.  <br/>\nWhat options DO your children have with TV?  Do they have to wait for an <br/>\nadult to turn it on and &quot;present&quot; something?<br/>\n<br/>\n&lt;&lt;Also, I want to express all of my worries about these types of shows and <br/>\n<br/>\nperhaps you (the group) could provide some feedback...I guess GI Joe to me <br/>\n<br/>\nis a show with army guys who fight a lot. &gt;&gt;<br/>\n<br/>\nDon&#39;t guess.  Either watch it or not.  No fair guessing. &lt;g&gt;<br/>\n<br/>\n&lt;&lt;I am worried that if my kids <br/>\n<br/>\nwatch that show that they will grow up to be desensitized to that. &gt;&gt;<br/>\n<br/>\nMost new moms worry about that.  Then they figure out it wasn&#39;t something to <br/>\nworry about.<br/>\n<br/>\n&lt;&lt;I worry <br/>\n<br/>\nthat when they are adults and see violence on the news that it won&#39;t affect <br/>\n<br/>\nthem - they wouldn&#39;t see the reality of it. &gt;&gt;<br/>\n<br/>\nIt&#39;s NOT reality.  It&#39;s a story shown with drawings.  There have been <br/>\ndrawings since cavemen.  Do you think the cavement who drew hunts should have shown <br/>\nmore blood so younger hunters or children who saw that wouldn&#39;t become <br/>\ndesensetized to the reality of those chalk drawings?<br/>\n<br/>\n&lt;&lt; My husband says that in GI Joe <br/>\n<br/>\nnobody ever dies.  That just seems really strange too - what is that <br/>\n<br/>\nteaching my kids? &gt;&gt;<br/>\n<br/>\nSo you&#39;re set to be equally unhappy if people don&#39;t die as if they do?<br/>\n<br/>\n&lt;&lt;Also, I want to express all of my worries ...I guess . . . I am worried . . <br/>\n. I worry <br/>\n<br/>\n That just seems really strange  . . . I am worried ....&gt;&gt;<br/>\n<br/>\nThat was your long paragraph with the unimportant parts taken out.<br/>\n<br/>\nYou&#39;re worrying too much.  Really.<br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;it just can&#39;t be good for them to sit and watch people shooting <br/>\n<br/>\neach other for hours.&gt;&gt;   <br/>\n<br/>\nG.I. Joe lasts less than half an hour. People on Ninja Turtles rarely get <br/>\nshot unless it&#39;s with some fantasy raygun that does something weird to them.   <br/>\nOn second thought, there are hardly any &quot;people&quot; on Ninja Turtles in the <br/>\nfirst place.<br/>\n<br/>\n&lt;&lt;Honestly, I have always had a distaste for violence in movies and TV.  I <br/>\n<br/>\ndon&#39;t understand how people can watch other people being hurt.  That isn&#39;t <br/>\n<br/>\nentertainment to me.<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n<br/>\n </span></blockquote>AHA.<br/>\nTry not to impose your own prejudices on your children.  If you can interest <br/>\nthem in what you think is fun, great!  That&#39;s honest.  But to try to forbid <br/>\nwhat you don&#39;t like is not as honest.<br/>\n<br/>\nMaybe watching TV isn&#39;t &quot;entertainment&quot; for them in the way you&#39;re thinking <br/>\nof it.  If you went to school when you were little, TV was probably escape from <br/>\nthat.   They don&#39;t go to school.  TV is part of life, part of learning, part <br/>\nof new vocabulary and situations they can observe to wonder what they would <br/>\nhave done.<br/>\n<br/>\nThis weekend I watched two violent movies, The Art of War and The Recruit.  <br/>\nMy husband had rented them.  He watched them alone and then recommended that he <br/>\nthought I would like them both, for unexpected plot twists.  He was right.  I <br/>\nliked them.  I didn&#39;t like the violence, but I liked the plots.  And the <br/>\nacting was good in The Recruit.<br/>\n<br/>\n&lt;&lt;If your young children wanted to watch an adult-rated movie that was really <br/>\n<br/>\nviolent, would you let them watch it? &gt;&gt;<br/>\n<br/>\nYes, but in my experience young children didn&#39;t want to watch them.  Or they <br/>\nwould watch a bit and then take off, or watch some and then snuggle with me <br/>\nand ignore the movie. I didn&#39;t &quot;have them watch&quot; movies or &quot;expose&quot; them to <br/>\nmovies.  Because values weren&#39;t put on movies they never watched what they didn&#39;t <br/>\nwant to watch.  They watched what they wanted to do in such large part that <br/>\nthe idea of watching something they did NOT want to do was foreign.<br/>\n<br/>\n&lt;&lt;Isn&#39;t it the role of a parent to make <br/>\n<br/>\nsure that children are not exposed to this at too young of an age?  What <br/>\n<br/>\nabout protecting their innocence while they are young?&gt;&gt;<br/>\n<br/>\nWe had TONS of happy, musical, sweet videos.  Get more videos or DVDs to <br/>\nwatch with your kids if you want to preserve sweet innocence.   We &#39;bout wore out <br/>\nRaffi in Concert, and Barney&#39;s Birthday and Sesame Street specials of various <br/>\nsorts.  But Holly loved the movie Stand By Me when she was really little.  <br/>\nThree.  <br/>\n<br/>\nYounger kids don&#39;t get the extended innocence that firstborns can have.  It&#39;s <br/>\njust the way it works.<br/>\n<br/>\nI was watching The Art of War and Holly came in and I paused it.  She&#39;s 12.  <br/>\nShe likes Fight Club; it&#39;s not that she has never seen violent movies.   She <br/>\nasked if it was a movie I thought she&#39;d like and I said probably not.  She said <br/>\nshe was going to go in the den and watch another movie.    <br/>\n<br/>\nAfter half an hour she came back, kinda bored, because she&#39;d seen her movie <br/>\nand she likes to be with other people.  I paused it again.  She asked about it <br/>\nagain.  She said Maybe she should come and watch with me or maybe I should go <br/>\nand watch with her.  I said it had Wesley Snipes, the guy who was in To Wong <br/>\nFoo.  She laughed and said that&#39;s what she had paused downstairs--To Wong Foo.  <br/>\nPretty funny.   That one has some violence too.  Not as much.  <br/>\n<br/>\nHave you looked at this TV collection?   There will be more added, so if you <br/>\nlook today look back in six months or a year and there might be more.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/tv\">http://sandradodd.com/tv</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] TV content","postDate":"1079982891","msgId":92176,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZkLjI1MDgxNmI2LjJkOTA5NTJiQGFvbC5jb20+"},"prevInTopic":92174,"nextInTopic":92177,"prevInTime":92175,"nextInTime":92177,"topicId":92160,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/22/2004 1:23:20 PM Eastern Standard Time, erikanunn@hotmail.com writes: If your young children wanted to watch an adult-rated movie that","messageBody":"<div id=\"ygrps-yiv-587759926\">In a message dated 3/22/2004 1:23:20 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:erikanunn@...\">erikanunn@...</a> writes:<br/>\nIf your young children wanted to watch an adult-rated movie that was really <br/>\nviolent, would you let them watch it?  Isn&#39;t it the role of a parent to make <br/>\nsure that children are not exposed to this at too young of an age?  What <br/>\nabout protecting their innocence while they are young?&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n<br/>\nMy eight year old and I were watching Jesus Christ Superstar the other day. <br/>\nWe had listened to the CD a few days before, and I got the movie because he <br/>\nasked me to. He knew that there were 39 lashes----he&#39;d counted with Pilate on the <br/>\nCD. But when the flogging was coming up, he asked to leave the room. Instead, <br/>\nI just fast-forwarded through the flogging. HE KNEW he wasn&#39;t ready to watch <br/>\nthat! <br/>\n<br/>\nWe later discussed how they wouldn&#39;t actually whip an actor---that it was <br/>\njust a special effect (in fact, during the overture, thre&#39;s a guy flogging the <br/>\nplexiglass prop and making it bleed). <br/>\n<br/>\nI *could* have made him sit and watch. I *could* have made him cover his <br/>\neyes. I *could * have never even brought the movie home. I *could* have done a lot <br/>\nof things. But because he knew what he could handle, we did it *his* way. <br/>\n<br/>\nMost children don&#39;t want to see people or animals hurt. Nor do they care to <br/>\nwatch sex scenes. They naturally shy away from both those things. Young <br/>\nchildren who actively seek out those things may have other problems. <br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":73238415,"authorName":"J. Stauffer","from":"&quot;J. Stauffer&quot; &lt;jnjstau@...&gt;","profile":"jnjstau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] TV content","postDate":"1079982062","msgId":92174,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYzYwMWM0MTA0MCQwNjA0ZGQ3MCRlYWJkYjFkOEB5b3VybzBrd2t3OWp3Yz4=","referencesHeader":"PEJBWTctRjI4S0lZczVDUlRZQkswMDAwMWQ1MEBob3RtYWlsLmNvbT4="},"prevInTopic":92173,"nextInTopic":92176,"prevInTime":92173,"nextInTime":92175,"topicId":92160,"numMessagesInTopic":0,"msgSnippet":"... My kids have complete and free access to ove 500 channels of television. They can watch whatever they want.  Occassionally, they choose somewhat violent","messageBody":"<div id=\"ygrps-yiv-1234712170\">&lt;&lt;&lt;&lt;Isn&#39;t it the role of a parent to make<br/>\n<blockquote><span title=\"ireply\"> &gt; sure that children are not exposed to this at too young of an age?  What<br/>\n&gt; about protecting their innocence while they are young?&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>My kids have complete and free access to ove 500 channels of television.<br/>\nThey can watch whatever they want.  Occassionally, they choose somewhat<br/>\nviolent movies or off-color humor (My kids are 13, 10, 7, 5 and 4).  The<br/>\nvast majority of the time my kids choose to watch Nickolodean or Fox Family.<br/>\nCurrently the tv isn&#39;t even on.<br/>\n<br/>\nSometimes, my kids have chosen to watch something that has bothered them (a<br/>\nscary movie or something).  It made a big impression and now they are much<br/>\nmore selective.<br/>\n<br/>\nIf a kid is choosing to sit and watch hour after hour of grossly violent,<br/>\nsadistic stuff.  The problem isn&#39;t that the stuff is on tv.  The problem is<br/>\nthat out of everything there is to do in the world, the kid is choosing that<br/>\nstuff over and over.  Why?<br/>\n<br/>\nJulie S.</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] TV content","postDate":"1079981700","msgId":92173,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNlLjQ4ZDFiYzliLjJkOTA5MDg0QGFvbC5jb20+"},"prevInTopic":92169,"nextInTopic":92174,"prevInTime":92172,"nextInTime":92174,"topicId":92160,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/22/2004 1:23:20 PM Eastern Standard Time, erikanunn@hotmail.com writes: If your young children wanted to watch an adult-rated movie that","messageBody":"<div id=\"ygrps-yiv-1587401389\">In a message dated 3/22/2004 1:23:20 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:erikanunn@...\">erikanunn@...</a> writes:<br/>\nIf your young children wanted to watch an adult-rated movie that was really <br/>\nviolent, would you let them watch it?  Isn&#39;t it the role of a parent to make <br/>\nsure that children are not exposed to this at too young of an age?  What <br/>\nabout protecting their innocence while they are young?&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n<br/>\nMy eight year old and I were watching Jesus Christ Superstar the other day. <br/>\nWe had listened to the CD a few days before, and I got the movie because he <br/>\nasked me to. He knew that there were 39 lashes----he&#39;d counted with Pilate on the <br/>\nCD. But when the flogging was coming up, he asked to leave the room. Instead, <br/>\nI just fast-forwarded through the flogging. HE KNEW he wasn&#39;t ready to watch <br/>\nthat! <br/>\n<br/>\nWe later discussed how they wouldn&#39;t actually whip an actor---that it was <br/>\njust a special effect (in fact, during the overture, thre&#39;s a guy flogging the <br/>\nplexiglass prop and making it bleed). <br/>\n<br/>\nI *could* have made him sit and watch. I *could* have made him cover his <br/>\neyes. I *could * have never even brought the movie home. I *could* have done a lot <br/>\nof things. But because he knew what he could handle, we did it *his* way. <br/>\n<br/>\nMost children don&#39;t want to see people or animals hurt. Nor do they care to <br/>\nwatch sex scenes. They naturally shy away from both those things. Young <br/>\nchildren who actively seek out those things may have other problems. <br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":140408439,"authorName":"Erika Nunn","from":"&quot;Erika Nunn&quot; &lt;erikanunn@...&gt;","profile":"soupythesnail","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] TV content","postDate":"1079978725","msgId":92169,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTctRjI4S0lZczVDUlRZQkswMDAwMWQ1MEBob3RtYWlsLmNvbT4="},"prevInTopic":92166,"nextInTopic":92173,"prevInTime":92168,"nextInTime":92170,"topicId":92160,"numMessagesInTopic":0,"msgSnippet":"Sandra wrote... Don t set up a situation where they will be tempted to watch a program precisely because you don t like it. Sandra - I am not getting what","messageBody":"<div id=\"ygrps-yiv-1553654432\">Sandra wrote...<br/>\n<br/>\n&quot;Don&#39;t set up a situation where they will be tempted to watch a program<br/>\nprecisely because you don&#39;t like it.&quot;<br/>\n<br/>\nSandra - I am not getting what you meant by this statement.  And I really <br/>\nwant to!  :)<br/>\n<br/>\nIt is not that my husband forces my kids to watch the shows, but he presents <br/>\nthe shows to them.  I guess I am speculating that if he didn&#39;t present those <br/>\nshows that they wouldn&#39;t have the option.<br/>\n<br/>\nAlso, I want to express all of my worries about these types of shows and <br/>\nperhaps you (the group) could provide some feedback...I guess GI Joe to me <br/>\nis a show with army guys who fight a lot.  I am worried that if my kids <br/>\nwatch that show that they will grow up to be desensitized to that.  I worry <br/>\nthat when they are adults and see violence on the news that it won&#39;t affect <br/>\nthem - they wouldn&#39;t see the reality of it.  My husband says that in GI Joe <br/>\nnobody ever dies.  That just seems really strange too - what is that <br/>\nteaching my kids?  I am worried of what that show would do to my kid&#39;s <br/>\npsyches....it just can&#39;t be good for them to sit and watch people shooting <br/>\neach other for hours.<br/>\n<br/>\nHonestly, I have always had a distaste for violence in movies and TV.  I <br/>\ndon&#39;t understand how people can watch other people being hurt.  That isn&#39;t <br/>\nentertainment to me.<br/>\n<br/>\nIf your young children wanted to watch an adult-rated movie that was really <br/>\nviolent, would you let them watch it?  Isn&#39;t it the role of a parent to make <br/>\nsure that children are not exposed to this at too young of an age?  What <br/>\nabout protecting their innocence while they are young?<br/>\n<br/>\nThanks,<br/>\nErika (trying really hard to get it)   :)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a><br/>\n&gt;Reply-To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a><br/>\n&gt;To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a><br/>\n&gt;Subject: Re: [UnschoolingDiscussion] TV content<br/>\n&gt;Date: Mon, 22 Mar 2004 11:55:42 EST<br/>\n&gt;<br/>\n&gt;&lt;&lt; However, ever<br/>\n&gt;since I have started relaxing my husband has gone from<br/>\n&gt;having them watch PBS to GI Joe cartoons (this is when I am<br/>\n&gt;at work in the evening). &gt;&gt;<br/>\n&gt;<br/>\n&gt;&quot;Having them watch&quot;?  He tells them what to watch?<br/>\n&gt;If they&#39;re choosing on their own, you shouldn&#39;t worry.  If your husband is<br/>\n&gt;choosing for them, that&#39;s different.  The way you worded it sounded <br/>\n&gt;chore-like.<br/>\n&gt;Like someone &quot;has you take out the trash.&quot;<br/>\n&gt;<br/>\n&gt;&lt;&lt; I just don&#39;t see the point of<br/>\n&gt;letting them watch that.&gt;&gt;<br/>\n&gt;<br/>\n&gt;The point of letting children watch what they want to watch is to practice<br/>\n&gt;genuine respect for their interests and decision making abilities.  If <br/>\n&gt;they&#39;re<br/>\n&gt;not choosing that&#39;s a different thing, but if they ARE choosing, then the <br/>\n&gt;point<br/>\n&gt;of letting them is respect.<br/>\n&gt;<br/>\n&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/respect\">http://sandradodd.com/respect</a><br/>\n&gt;<br/>\n&gt;That might encourage you.<br/>\n&gt;<br/>\n&gt;&lt;&lt;Do you guys think I am being overly controlling?&gt;&gt;<br/>\n&gt;<br/>\n&gt;Yes.<br/>\n&gt;<br/>\n&gt;&lt;&lt;Would you suggest that I<br/>\n&gt;sit down with my son and daugher while they watch the GI Joe cartoons?&gt;&gt;<br/>\n&gt;<br/>\n&gt;No, especially not if you&#39;re going to sit there and critique it as an evil,<br/>\n&gt;bad thing that would only be watched by evil, bad people without good <br/>\n&gt;judgment.<br/>\n&gt;<br/>\n&gt;&lt;&lt; From<br/>\n&gt;reading previous posts, it seemed to me that many of you don&#39;t censor what<br/>\n&gt;your children watch (but I got the impression you were talking about your<br/>\n&gt;older children, too).&gt;&gt;<br/>\n&gt;<br/>\n&gt;The sooner you start, the better result you will have when they&#39;re older.<br/>\n&gt;<br/>\n&gt;Don&#39;t set up a situation where they will be tempted to watch a program<br/>\n&gt;precisely because you don&#39;t like it.  That&#39;s the kind of parent/child <br/>\n&gt;dynamic you<br/>\n&gt;want to avoid by letting them choose freely without coercion.<br/>\n&gt;<br/>\n&gt;Sandra<br/>\n<br/>\n </span></blockquote>_________________________________________________________________<br/>\nFREE pop-up blocking with the new MSN Toolbar � get it now! <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://clk.atdmt.com/AVE/go/onm00200415ave/direct/01/\">http://clk.atdmt.com/AVE/go/onm00200415ave/direct/01/</a></div>","specialLinks":[]},{"userId":73238415,"authorName":"J. Stauffer","from":"&quot;J. Stauffer&quot; &lt;jnjstau@...&gt;","profile":"jnjstau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] TV content","postDate":"1079977648","msgId":92166,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwODQwMWM0MTAzNSRiZTk3ZDg3MCRlYWJkYjFkOEB5b3VybzBrd2t3OWp3Yz4=","referencesHeader":"PEJBWTctRjc4d3ptRmJjbVlkR3YwMDA2MmY3ZUBob3RtYWlsLmNvbT4="},"prevInTopic":92162,"nextInTopic":92169,"prevInTime":92165,"nextInTime":92167,"topicId":92160,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1737522473\">&lt;&lt;&lt;Do you guys think I am being overly controlling?  Would you suggest that<br/>\nI<br/>\n<blockquote><span title=\"ireply\"> &gt; sit down with my son and daugher while they watch the GI Joe cartoons? &gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>A resounding &quot;yes&quot; to both questions.<br/>\n<br/>\nYou might also then sit down the dh and talk about your &quot;tv values&quot;.  Your<br/>\nkids are likely to sit and watch whatever your dh is watching just to spend<br/>\ntime cuddled up with him.  There are things that I only watch after the<br/>\nyounger kids are in bed.   But if the kids found the shows on their own and<br/>\nwanted to watch them, I wouldn&#39;t forbid it....would just want to watch it<br/>\nwith them, be available for questions, etc..<br/>\n<br/>\nJulie S.</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] TV content","postDate":"1079974542","msgId":92162,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkNC4xZDExNGQ4YS4yZDkwNzQ4ZUBhb2wuY29tPg=="},"prevInTopic":92160,"nextInTopic":92166,"prevInTime":92161,"nextInTime":92163,"topicId":92160,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-668931623\">&lt;&lt; However, ever <br/>\nsince I have started relaxing my husband has gone from <br/>\nhaving them watch PBS to GI Joe cartoons (this is when I am <br/>\nat work in the evening). &gt;&gt;<br/>\n<br/>\n&quot;Having them watch&quot;?  He tells them what to watch?<br/>\nIf they&#39;re choosing on their own, you shouldn&#39;t worry.  If your husband is <br/>\nchoosing for them, that&#39;s different.  The way you worded it sounded chore-like.  <br/>\nLike someone &quot;has you take out the trash.&quot;<br/>\n<br/>\n&lt;&lt; I just don&#39;t see the point of <br/>\nletting them watch that.&gt;&gt;<br/>\n<br/>\nThe point of letting children watch what they want to watch is to practice <br/>\ngenuine respect for their interests and decision making abilities.  If they&#39;re <br/>\nnot choosing that&#39;s a different thing, but if they ARE choosing, then the point <br/>\nof letting them is respect.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/respect\">http://sandradodd.com/respect</a><br/>\n<br/>\nThat might encourage you.<br/>\n<br/>\n&lt;&lt;Do you guys think I am being overly controlling?&gt;&gt;<br/>\n<br/>\nYes.<br/>\n<br/>\n&lt;&lt;Would you suggest that I <br/>\nsit down with my son and daugher while they watch the GI Joe cartoons?&gt;&gt;<br/>\n<br/>\nNo, especially not if you&#39;re going to sit there and critique it as an evil, <br/>\nbad thing that would only be watched by evil, bad people without good judgment.<br/>\n<br/>\n&lt;&lt; From <br/>\nreading previous posts, it seemed to me that many of you don&#39;t censor what <br/>\nyour children watch (but I got the impression you were talking about your <br/>\nolder children, too).&gt;&gt;<br/>\n<br/>\nThe sooner you start, the better result you will have when they&#39;re older.<br/>\n<br/>\nDon&#39;t set up a situation where they will be tempted to watch a program <br/>\nprecisely because you don&#39;t like it.  That&#39;s the kind of parent/child dynamic you <br/>\nwant to avoid by letting them choose freely without coercion.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":140408439,"authorName":"Erika Nunn","from":"&quot;Erika Nunn&quot; &lt;erikanunn@...&gt;","profile":"soupythesnail","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"TV content","postDate":"1079972344","msgId":92160,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTctRjc4d3ptRmJjbVlkR3YwMDA2MmY3ZUBob3RtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":92162,"prevInTime":92159,"nextInTime":92161,"topicId":92160,"numMessagesInTopic":0,"msgSnippet":"Hello, I have a question about televisilon and my children, who are ages 3 and 4. I have relaxed a lot when it comes to television/videos and my kids watching ","messageBody":"<div id=\"ygrps-yiv-1932781989\">Hello,<br/>\n<br/>\nI have a question about televisilon and my children, who are ages 3 and 4.  <br/>\nI have relaxed a lot when it comes to television/videos and my kids watching <br/>\nthem.  However, ever since I have started relaxing my husband has gone from <br/>\nhaving them watch PBS to GI Joe cartoons (this is when I am at work in the <br/>\nevening).  It started out with PBS kid&#39;s shows, which I was very fine with.  <br/>\nThen it went to Teenage Mutant Ninja Turtles which I didn&#39;t really think was <br/>\nage appropriate, but I let it go because my son loves it so much.  Then they <br/>\nstarted watching Fox Box which I have never seen, but I didn&#39;t say anything <br/>\nabout that either.  But then he showed them GI Joe cartoons which for me <br/>\njust seemed like too much for their age.  I just don&#39;t see the point of <br/>\nletting them watch that.<br/>\n<br/>\nMy husband believes that he is making sound judgement and that GI Joe is not <br/>\nthat bad (my son has the toys which I am okay with).  He doesn&#39;t let them <br/>\nwatch adult violent shows, but to me GI Joe is pretty violent.<br/>\n<br/>\nDo you guys think I am being overly controlling?  Would you suggest that I <br/>\nsit down with my son and daugher while they watch the GI Joe cartoons?  From <br/>\nreading previous posts, it seemed to me that many of you don&#39;t censor what <br/>\nyour children watch (but I got the impression you were talking about your <br/>\nolder children, too).<br/>\n<br/>\nAny advice is appreciated.<br/>\n<br/>\nErika  :)<br/>\n<br/>\n_________________________________________________________________<br/>\nFind a broadband plan that fits. Great local deals on high-speed Internet <br/>\naccess. <a rel=\"nofollow\" target=\"_blank\" href=\"http://click.atdmt.com/AVE/go/onm00200360ave/direct/01/\">http://click.atdmt.com/AVE/go/onm00200360ave/direct/01/</a></div>","specialLinks":[]},{"userId":162967824,"authorName":"Dawn Adams","from":"&quot;Dawn Adams&quot; &lt;Wishbone@...&gt;","profile":"bluenosegoddess","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] TV content","postDate":"1079971653","msgId":92179,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGIwMWM0MTAyNyRjOTk1NzI0MCQ3NjRjZGUxOEBhb2xkc2wubmV0Pg==","referencesHeader":"PEJBWTctRjI4S0lZczVDUlRZQkswMDAwMWQ1MEBob3RtYWlsLmNvbT4="},"prevInTopic":92177,"nextInTopic":92181,"prevInTime":92178,"nextInTime":92180,"topicId":92160,"numMessagesInTopic":0,"msgSnippet":"... I think she meant that as soon as you put a show offlimits, that s all they ll want to watch. I did that with the Simpsons and my 5 year old. Guess what","messageBody":"<div id=\"ygrps-yiv-720336460\">Erika writes:<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;Don&#39;t set up a situation where they will be tempted to watch a program<br/>\n&gt; precisely because you don&#39;t like it.&quot;<br/>\n&gt;<br/>\n&gt; Sandra - I am not getting what you meant by this statement.  And I really<br/>\n&gt; want to!  :)<br/>\n&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>I think she meant that as soon as you put a show offlimits, that&#39;s all<br/>\nthey&#39;ll want to watch. I did that with the Simpsons and my 5 year old. Guess<br/>\nwhat was the only show she talked about during that short time? Now she&#39;s<br/>\nfree to watch it and rarely does.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It is not that my husband forces my kids to watch the shows, but he<br/>\n </span></blockquote>presents<br/>\n<blockquote><span title=\"ireply\"> &gt; the shows to them.  I guess I am speculating that if he didn&#39;t present<br/>\n </span></blockquote>those<br/>\n<blockquote><span title=\"ireply\"> &gt; shows that they wouldn&#39;t have the option.<br/>\n&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>I think your husband probably wants to introduce shwos that he remembers<br/>\nfondly from childhood. I spent hours upon hours playing GIJoe with my<br/>\nbrothers and thought the show was great.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Also, I want to express all of my worries about these types of shows and<br/>\n&gt; perhaps you (the group) could provide some feedback...I guess GI Joe to me<br/>\n&gt; is a show with army guys who fight a lot.  I am worried that if my kids<br/>\n&gt; watch that show that they will grow up to be desensitized to that.  I<br/>\n </span></blockquote>worry<br/>\n<blockquote><span title=\"ireply\"> &gt; that when they are adults and see violence on the news that it won&#39;t<br/>\n </span></blockquote>affect<br/>\n<blockquote><span title=\"ireply\"> &gt; them - they wouldn&#39;t see the reality of it.  My husband says that in GI<br/>\n </span></blockquote>Joe<br/>\n<blockquote><span title=\"ireply\"> &gt; nobody ever dies.<br/>\n&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>Have you watched this show yet?<br/>\n<br/>\n  That just seems really strange too - what is that<br/>\n<blockquote><span title=\"ireply\"> &gt; teaching my kids?  I am worried of what that show would do to my kid&#39;s<br/>\n&gt; psyches....it just can&#39;t be good for them to sit and watch people shooting<br/>\n&gt; each other for hours.<br/>\n&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>The show is only a half hour. And there&#39;s not that much shooting. And it&#39;s a<br/>\ncartoon. If they get desensitzed to cartoon violence, oh well. Honestly, you<br/>\nhave more influence over your kids then any TV show ever will.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Honestly, I have always had a distaste for violence in movies and TV.  I<br/>\n&gt; don&#39;t understand how people can watch other people being hurt.  That isn&#39;t<br/>\n&gt; entertainment to me.<br/>\n&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>I used to gobble up horror flicks. The more gore the better. And no, it<br/>\nwasn&#39;t because I liked seeing people get hurt. I was enamoured with the<br/>\nspecial effects. At one point in my teenage years I could name off all the<br/>\nimportant FX studios and artists (and I collected comic books and I was a<br/>\ngirl. Definate geek.). I understood that it was a movie and nobody was<br/>\ngetting hurt. So if I hissed, &#39;cooooool&#39;, after a head was parted from its<br/>\nshoulders it was in admiration of someone&#39;s skill with model heads. Anyhow,<br/>\nI can&#39;t watch it like I used too. All the movies I used to watch didn&#39;t do<br/>\ndiddly to desensitize me in the long run and the last horror flick I watched<br/>\nhad me covering my eyes.<br/>\nThat isn&#39;t entertaiment for you, but it is for others...and not for the<br/>\nreasons you assume.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If your young children wanted to watch an adult-rated movie that was<br/>\n </span></blockquote>really<br/>\n<blockquote><span title=\"ireply\"> &gt; violent, would you let them watch it?  Isn&#39;t it the role of a parent to<br/>\n </span></blockquote>make<br/>\n<blockquote><span title=\"ireply\"> &gt; sure that children are not exposed to this at too young of an age?  What<br/>\n&gt; about protecting their innocence while they are young?<br/>\n&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>My daugher has watched Lord of the Rings (at her begging). Her favourite<br/>\npart is the darkest, the Mines of Moria. It&#39;s a pretty violent film but<br/>\nshe&#39;s watched the making of documentries on the DVD so she knows what goes<br/>\ninto making a Balrog or a good decapitation scene. How has it affected her?<br/>\nLegolas is married to her apparently and we&#39;ve had marathon discussions<br/>\nabout good and evil. Has it harmed her innocence? I&#39;m not the right one to<br/>\nanswer that I think...I don&#39;t really believe in that and think &#39;innocence&#39;<br/>\nis usually code for not talking to children about things that make adults<br/>\nsqueamish. It always assume childhood is some blessed state of happiness<br/>\nfree from worry and stress. Anyhow, off on a tangent. She&#39;s still the sweet,<br/>\ncaring girl we&#39;ve always had. I haven&#39;t noticed her running about the<br/>\nneighbourhood slashing at the neighbours with a kitchen knife. :)<br/>\n I don&#39;t see my role as keeping my kids away from certain things, I see it<br/>\nas making sure they&#39;re equipped to deal with and make choices about those<br/>\nthings.<br/>\n<br/>\nDawn (in NS)</div>","specialLinks":[]}],"prevTopicId":98223,"nextTopicId":98007}}