{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":242367849,"authorName":"Karen","from":"&quot;Karen&quot; &lt;kb@...&gt;","profile":"busy_karen","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"www.quackwatch.org was Re: List problem and dishonesty","postDate":"1220076821","msgId":37661,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZGIwMWM5MGE2NyQ4ZDFkMzJhMCRhNzU3OTdlMCRAY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":37660,"nextInTime":37662,"topicId":37661,"numMessagesInTopic":0,"msgSnippet":"... for any medical concern in my life, the first thing I do is go over to www.quackwatch.org and do a search on the treatment or the person promulgating it. I","messageBody":"<div id=\"ygrps-yiv-1457718194\"><blockquote><span title=\"ireply\">&gt; Whenever I hear of an new (alternative or mainstream) treatment <br/>\n </span></blockquote>for any medical concern in my life, the first thing I do is go over <br/>\nto www.quackwatch.org and do a search on the treatment or the person <br/>\npromulgating it.<br/>\n<br/>\n<br/>\nI have done much research about Quackwatch and the people behind it.  It<br/>\nbreaks my heart and infuriates me that they are misleading so many.  They<br/>\nalmost kept my mother from receiving the care that has turned around a<br/>\nserious health issue where the mainstream had failed.  Below are excerpts<br/>\nfrom emails I sent to her regarding Quackwatch and Stephen Barrett.  (Long)<br/>\n<br/>\n----------<br/>\nA website named quackwatch sounds pretty authoritative, doesnt it?  Im<br/>\nsure you realize that anyone can buy a domain and name it quackwatch.  <br/>\nYou may find this interesting also:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.raysahelian.com/quackwatch.html.\">http://www.raysahelian.com/quackwatch.html.</a><br/>\n<br/>\n--------<br/>\nOpinion by Consumer Advocate Tim Bolen<br/>\n<br/>\nApril 23, 2003<br/>\n<br/>\nA California Appeals Court, yesterday, April 22, 2003, bludgeoned the<br/>\nNational Council Against Health Fraud (NCAHF), and their whole argument<br/>\nabout what constitutes good and bad health care. The quackbuster&#39;s operating<br/>\ntheme, the argument they use against alternative proponents, came under a<br/>\nmajor American Court&#39;s scrutiny. The Court, basically, in their decision,<br/>\nsaid the the quackbuster&#39;s arguments were hogwash, and they had no business<br/>\nmeddling in California&#39;s system.<br/>\n<br/>\nThe Court also declared that top quackbusters Stephen Barrett<br/>\n(quackwatch.com), and Wallace Sampson MD (Scientific Review of Alternative<br/>\nand Aberrant Medicine) &quot;were found to be biased and unworthy of<br/>\ncredibility.&quot;<br/>\n<br/>\nThe quackbusters lost in a PUBLISHED case. The quackbuster premise failed.<br/>\nNot some of it, not most of it - but ALL of it. The &quot;quackbuster&quot; measuring<br/>\nstick for how to evaluate health care has been completely discredited.<br/>\nOfficial quackbuster credibility is now ZERO.<br/>\n<br/>\nIn a minute I&#39;m going to give you a link to the Appeals Court decision. But<br/>\nfirst let me give you a road map.<br/>\n<br/>\nHere&#39;s what happened...<br/>\n<br/>\nThe quackbuster&#39;s flagship, the self-proclaimed National Council Against<br/>\nHealth Fraud (NCAHF) decided, one day, to sue about 43 &quot;Alternative Medicine<br/>\nproponents&quot; in California, basically claiming that all of them were engaging<br/>\nin health fraud &quot;because what they were doing wasn&#39;t scientifically proven.&quot;<br/>\n<br/>\nTheir argument was that &quot;the defendant has to PROVE their products work, or<br/>\nit&#39;s health fraud.&quot;<br/>\n<br/>\nCalifornia was the wrong place for them to try this stunt. Here, health<br/>\nfreedom bills tend to pass through the legislature UNANIMOUSLY. We like to<br/>\nbe healthy. It&#39;s our life style.<br/>\n<br/>\nThe very first case that came to trial was called NCAHF vs, King Bio (a<br/>\nmanufacturer of about 50 homeopathic products). The NCAHF lost badly. Los<br/>\nAngeles Superior Court Judge Haley Fromholz wrote a long decision, virtually<br/>\nbattering the quackbusters for wasting the court&#39;s time with their silly<br/>\ncase. The quackbusters had accused King Bio of false advertising. At issue<br/>\nwas the credibility of the NCAHF&#39;s witnesses, Stephen Barrett, and Wallace<br/>\nSampson MD. The Judge thrashed their arguments. You can read the Judge&#39;s<br/>\nwords in this original case decision by clicking<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.quackpotwatch.org/quackpots/california_superior_court_judge_.htm=\">http://www.quackpotwatch.org/quackpots/california_superior_court_judge_.htm=</a><br/>\n<br/>\nYou can find out who King Bio is by going to their website<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.kingbio.com\">http://www.kingbio.com</a><br/>\n<br/>\nThe NCAHF appealed. And, boy did it cost them. You need to read the<br/>\ndecision. It is written in plain language, not legalese, and is clearly<br/>\nunderstandable. Read the footnotes also. Pass this around to anyone under<br/>\nattack by the quackbusters. Their attorneys will love this precedent setting<br/>\ncase.<br/>\n<br/>\nTo me one of the more important statements is the last footnote in the<br/>\nAppeal Court&#39;s decision, for it attacks the whole quackbuster operation It<br/>\nsays, &quot;The trial court concluded NCAHF failed to prove a false or misleading<br/>\nstatement. King Bioâ??s expert testified the products were safe and<br/>\neffective. The products were included in the Homeopathic Pharmacopoeia and<br/>\ncomplied with FDA guidelines. NCAHF presented no evidence that King Bioâ??s<br/>\nproducts were not safe and effective, relying instead on a general attack on<br/>\nhomeopathy, made by witnesses who had no knowledge of, or experience with,<br/>\nKing Bioâ??s products, and who were found to be biased and unworthy of<br/>\ncredibility.&quot;<br/>\n<br/>\nBut more occurred. &quot;At trial, NCAHF proceeded on the theory that there is no<br/>\nscientific basis for the advertised efficacy of King Bioâ??s products. NCAHF<br/>\nperformed no tests to determine the efficacy of King Bioâ??s products and<br/>\npresented no anecdotal evidence. NCAHF instead argued that King Bioâ??s<br/>\nproducts were drugs, and the scientific community required representations<br/>\nregarding the efficacy of drugs to be supported by acceptable scientific<br/>\nevidence. NCAHF asserted that the burden of proof should be shifted to King<br/>\nBio to prove its productsâ?? efficacy.<br/>\nOn<br/>\nappeal, NCAHF acknowledges that, under current California law, a false<br/>\nadvertising plaintiff bears the burden of proving the defendantâ??s<br/>\nadvertising claim is false or misleading. NCAHF contends, however, that we<br/>\nshould shift the burden of proof to the defendant to facilitate the campaign<br/>\nagainst health fraud. NCAHF argues that federal law shifts the burden to the<br/>\ndefendant in false advertising actions.&quot;<br/>\n<br/>\nIn response to the NCAHF&#39;s demands, the Court said: &quot;We conclude there is no<br/>\nbasis in California law to shift the burden of proof to a defendant in a<br/>\nrepresentative false advertising and unlawful competition action. We<br/>\nconclude further that the Legislature has indicated an intent to place the<br/>\nburden of proof on the plaintiff in such cases. Finally, we conclude federal<br/>\nauthority is not apposite.&quot; What this means to the North American Health<br/>\nFreedom Movement...<br/>\n<br/>\nThis is a PUBLISHED case. It is PRECEDENT setting. It can (and should) be<br/>\nused in any case in the US where quackbusters are involved. The quackbusters<br/>\nhave been court tested - and they lost. Their whole argument against<br/>\nalternative medicine has been thrown in the trash. Their credibility is<br/>\nzero.<br/>\n<br/>\nThe case was handled, on our side, by famous California litigator, Carlos<br/>\nNegrete. You can read his comments on the case at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.healtfreedomlaw.com\">http://www.healtfreedomlaw.com</a><br/>\n<br/>\nYou can read the whole case decision by clicking<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.quackpotwatch.org/quackpots/kingbioappeal.htm\">http://www.quackpotwatch.org/quackpots/kingbioappeal.htm</a><br/>\n<br/>\nWhat I want to know is &quot;Who funded the quackbuster&#39;s lawsuits?&quot;<br/>\n<br/>\nMy advice to you: If you are the subject of derogatory remarks on top<br/>\nquackbuster Stephen Barrett&#39;s website <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.quackwatch.com\">http://www.quackwatch.com</a> or Robert<br/>\nBaratz&#39;s website <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nachf.org\">http://www.nachf.org</a> you might want to consider showing<br/>\nthis newsletter, and the court decision papers, to your attorney. This might<br/>\nbe a good time for your attorney to send them a letter pointing out their<br/>\nnew legal problems - and demanding removal of the information from their<br/>\nwebsite within 24 hours... Your attorney might want to ask for<br/>\ncompensation...<br/>\n<br/>\nStay tuned...<br/>\n<br/>\nTim Bolen - Consumer Advocate<br/>\n<br/>\nThis &quot;Millions of Health Freedom Fighters - Newsletter&quot; is about the battle<br/>\nbetween &quot;Health and Medicine&quot; on Planet Earth. Tim Bolen is an op/ed writer<br/>\nwith extensive knowledge of the activities of a subversive organization<br/>\ncalling itself the &quot;quackbusters,&quot; and that organization&#39;s attempts to<br/>\nsuppress, and discredit, any, and all health modalities that compete with<br/>\nthe allopathic (MD) paradigm for consumer health dollars.<br/>\nThe<br/>\nfocus of the newsletter is on the ongoing activities, battles, politics, and<br/>\nthe victories won by members of the &quot;Health Freedom Movement&quot;<br/>\nagainst<br/>\nthe &quot;quackbusters&quot; It details &quot;who the quackbusters are, what they are,<br/>\nwhere they are operating, when they appear, and how they operate - and how<br/>\neasy it is to beat them...&quot;<br/>\n<br/>\nA copy of THIS newsletter, and older ones, are viewable at the website<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.quackpotwatch.org/default.htm\">http://www.quackpotwatch.org/default.htm</a><br/>\n<br/>\n---------------------------<br/>\nThe most damning testimony before the jury, under the intense<br/>\ncross-examination by Negrete, was that Barrett had filed similar defamation<br/>\nlawsuits against almost 40 people across the country within the past few<br/>\nyears and had not won one single one at trial.  During the course of his<br/>\nexamination, Barrett also had to concede his ties to the AMA, Federal Trade<br/>\nCommission (FTC) and Food & Drug Administration (FDA).<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.healthfreedomlaw.com/\">http://www.healthfreedomlaw.com/</a><br/>\n<br/>\nThis NCAHF represents the kind of danger that Ron Paul is fighting against.<br/>\nIt is believed that Dr. Whittaker&#39;s letter, and the actions of the<br/>\nCalifornia Health Freedom Movement team, were responsible for the REMOVAL of<br/>\nthe NCAHF from the Loma Linda University campus.For years the NCAHF had<br/>\nused Loma Linda University&#39;s address in a manner designed to make it appear<br/>\nthat the University endorsed their bizarre health positions.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ghchealth.com/classic-battle.html\">http://www.ghchealth.com/classic-battle.html</a><br/>\n<br/>\nInternational Advocates for Health Freedom:<br/>\n   Main website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.iahf.com/.\">http://www.iahf.com/.</a>  Their opinion of NCAHF:  Bolen<br/>\nholds the view that Baratz is about to be massacred in the courtroom and<br/>\nthat NCAHF will go down in flames around him. All I can say is it&#39;s about<br/>\nTIME!!!<br/>\n<br/>\n--------------------<br/>\nRead the whole thing, but I have provided a quote below:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.foundationforhealthchoice.com/barrett_release.htm.\">http://www.foundationforhealthchoice.com/barrett_release.htm.</a><br/>\n<br/>\nQuackbusters run over 70 websites. Millions of people go to them every<br/>\nyear. Look up chiropractic, acupuncture, homeopathy or even vitamin C, as<br/>\nwell as almost every other natural health topic, on the Internet and you<br/>\n(and the public) will be led to Quackbuster sites advising you of natural<br/>\nhealth dangers. In all these forums Barrett and the Quackbusters<br/>\nrelentlessly attack the consumer right to informed choice. These activities<br/>\ncontinue the AMAs anti-quackery committees activities that were struck<br/>\ndown by federal courts as an illegal restraint of trade in a landmark<br/>\nlawsuit brought by Illinois chiropractor Chester Wilk. They also help<br/>\ninsurance companies deny consumer reimbursement claims.<br/>\nAt the same time, Barrett flacks for products like aspartame (NutraSweet),<br/>\nwhich is the subject of tens of thousands of consumer complaints. Question<br/>\n(asked on Barretts web site): An email message is being circulated with<br/>\nmany statements to the effect that aspartame is dangerous. How worried<br/>\nshould I be? Answer (from Barrett): Not at all. The message is pure<br/>\nrubbish.<br/>\n<br/>\n-------------------------<br/>\nBush To Impose Psychiatric Drug Regime:<br/>\nThe petrochemical model is in a de facto monopoly position, maintained<br/>\nthrough AMA and similar licensing schemes, persecution of alternatives by<br/>\nso-called quackbusters, and now this monopoly is being reinforced through<br/>\nrestrictive legislation designed to relegate the biological sector to a<br/>\nmarginal existence. The increased cost in terms of injury and loss of life<br/>\nas well as the financial expenditure is born by consumers all over the<br/>\nworld, because governments elect to spend our taxes on one and only one of<br/>\nthe two health systems. The petrochemical health model is a commercial<br/>\ncartel, a monopoly that has become so pervasive as to compromise both our<br/>\nhealth and our financial ability to pay for it. According to the State of<br/>\nNevada&#39;s attorneys it uses what amounts to racketeering practices in<br/>\nsecuring its profits.<br/>\nVigorous action against this Great Medical Monopoly on all levels is<br/>\nprobably the only way left to protect our health.<br/>\nIn closing, let me give you here the postscript of the Allen Jones<br/>\nwhistleblower report, a document which I highly recommend for study. Jones<br/>\nappeals to all of us when he says:<br/>\n&quot;The pharmaceutical industry has methodically compromised our political<br/>\nsystem at all levels and has systematically infiltrated the mental health<br/>\nservice delivery system of this nation. They are poised to consolidate their<br/>\ngrip via the New Freedom Commission and the Texas Medication Algorithm<br/>\nProject. The pervasive manipulation of clinical trials, the nonreporting of<br/>\nnegative trials and the cover-up of debilitating and deadly side effects<br/>\nrender meaningful informed consent impossible by persons being treated with<br/>\nthese drugs. Doctors and patients alike have been betrayed by the<br/>\ngovernmental entities and officials who are supposed to protect them. To the<br/>\nmillions of doctors, parents and patients who are affected: PLEASE: suspend<br/>\ndisbelief and realize you are on your own. Educate yourselves. The Internet<br/>\nhas many sites that will help you. The Alliance for Human Research<br/>\nProtection, www.ahrp.org would be a good place to start.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.newmediaexplorer.org/sepp/2004/06/23/bush_to_impose_psychiatric_d\">http://www.newmediaexplorer.org/sepp/2004/06/23/bush_to_impose_psychiatric_d</a><br/>\nrug_regime.htm<br/>\n<br/>\n-------------------------<br/>\nQuackbuster Overview (and how they manipulate):<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.thenhf.com/newsflash_02.htm.\">http://www.thenhf.com/newsflash_02.htm.</a><br/>\n<br/>\n-----------------------<br/>\nTim Bolen in good company:<br/>\nThis is the organization that published the last Tim-Bolen opinion that I<br/>\nsent to you.  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.thenhf.com/about_us.html.\">http://www.thenhf.com/about_us.html.</a>  At the bottom of this<br/>\nlink is a list of the Board of Governors along with the details of their<br/>\nprofessional backgrounds.</div>","specialLinks":[]}],"prevTopicId":37613,"nextTopicId":37657}}