{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":160104044,"authorName":"Shay Seaborne","from":"&quot;Shay Seaborne&quot; &lt;shaysea@...&gt;","profile":"shaysea","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Fw: Update on the &quot;More Information About HSLDA&quot; Pages, (once known as HSLDA.US)","postDate":"1085431805","msgId":94634,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDcwMWM0NDFkMCRiNTkzZWNiMCQ2ODA0ZWI0MUBza29ycGE+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":94633,"nextInTime":94635,"topicId":94634,"numMessagesInTopic":0,"msgSnippet":"... wrote: Recently, several homeschoolers have asked why HSLDA.US was closed down.  The web site contained a great deal of educational information - not","messageBody":"<div id=\"ygrps-yiv-1347429845\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Networking@yahoogroups.com\">HEM-Networking@yahoogroups.com</a>, &quot;hsferret&quot; &lt;HSLRAwa@s...&gt;<br/>\nwrote:<br/>\nRecently, several homeschoolers have asked why HSLDA.US was closed<br/>\ndown.  The web site contained a great deal of educational<br/>\ninformation - not available anywhere else - which enabled<br/>\nhomeschoolers to make an informed choice about whether membership in<br/>\nHSLDA (Home School Legal Defense Association) would be a choice for<br/>\ntheir family.<br/>\n<br/>\nHSLDA sent the registered owner of the domain name a letter ordering<br/>\nthat the site be shut down because of trademark infringement<br/>\n(&quot;HSLDA&quot;) and accusations of Cybersquatting.  Because the owner had<br/>\ngraciously offered web space for the authors of HSLDA.US and because<br/>\nthe authors believed it was improper to place that owner in legal<br/>\njeopardy, the site was taken down.   The authors also believe this<br/>\naction by HSLDA was an attempt to silence their critics and prohibit<br/>\npotential members from being fully informed about HSLDA. HSLDA has<br/>\npurchased the domain HSLDA.US.<br/>\n<br/>\nThe authors of the More Information About HSLDA pages maintain that<br/>\nthe content of HSLDA.US was accurate to the best of our knowledge<br/>\nand note that Home School Legal Defense Association did not challenge<br/>\nthe accuracy of that content.<br/>\n<br/>\nWe do not believe the use of the word-mark HSLDA is a copyright<br/>\ninfringement for several reasons:  trademark laws indicate there is<br/>\na problem if you are profiting from using someone else&#39;s `word-mark&#39;.<br/>\nObviously, HSLDA.US was using &quot;HSLDA&quot; in a non-commercial, non-<br/>\nprofit  manner and was not diverting business from HSLDA, but rather serving<br/>\nas an educational venue for information about Home School Legal<br/>\nDefense Association.  Using a `word-mark&#39; is permissible in an<br/>\neducational manner, criticism or as an identifier of the owner of<br/>\nthe mark, all of which HSLDA.US felt was an appropriate - and legal -<br/>\nuse.  Indeed, HSLDA gave up the use of the word-mark `HSLDA&#39; with<br/>\nregard to printed materials in 1990.<br/>\n<br/>\nThe intent of the Anticybersquatting Consumer Protection Act is to<br/>\nprevent Cyberpiracy and offer remedies to businesses and individuals<br/>\nwho&#39;s domain or personal names have been stolen for profit, are<br/>\nintentionally confusing to consumers, are used to divert business or<br/>\ncould harm the goodwill of a trademark in addition to other<br/>\nprovisions.<br/>\n<br/>\nWe don&#39;t believe we committed any crime under the Anticybersquatting<br/>\nAct because HSLDA.US did not divert consumers from Home School Legal<br/>\nDefense Association. HSLDA.US had no members and did not sell any<br/>\nproducts.  In fact HSLDA.US provided both a disclaimer that it was<br/>\nnot Home School Legal Defense Association and a link to HSLDA.org.<br/>\n<br/>\nHome School Legal Defense Association is responsible for the<br/>\ngoodwill - or lack of it - they have cultivated within the<br/>\nhomeschool community.<br/>\n<br/>\nBut perhaps the most important clause in the Anticybersquatting<br/>\nConsumer Protection Act is Sec. 3008, the Savings Clause.  It<br/>\nclearly states, &quot;Nothing in this title shall affect...a person&#39;s right to<br/>\nfree speech or expression under the first amendment of the United<br/>\nStates Constitution&quot;.<br/>\n<br/>\nSo the bottom line is we took the site down out of respect for the<br/>\nowner of the domain name, not because the information was<br/>\ninaccurate, not because using the word mark &quot;HSLDA&quot; is prohibited and not<br/>\nbecause there was any violation of the Cybersquatting Act.  We still believe<br/>\nwe have a 1st Amendment right to speak freely about HSLDA and will<br/>\ncontinue to do so.  Thanks for all the questions - it was nice to be<br/>\nmissed &lt;G&gt;<br/>\n<br/>\noh, and by the way, drop by the new web site:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.homeschoolingislegal.info\">http://www.homeschoolingislegal.info</a><br/>\n<br/>\nFor several of the owners,<br/>\n<br/>\nMary<br/>\n--- End forwarded message ---</div>","specialLinks":[]}],"prevTopicId":94629,"nextTopicId":94640}}