{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":209676473,"authorName":"joanne","from":"&quot;joanne&quot; &lt;oh.kneel@...&gt;","profile":"kc2ark","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] leaving and being safe","postDate":"1129908176","msgId":23267,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZGQwMWM1ZDY1MyQ1MGI2NDdjMCQ2NDAxYThjMEBKb2FubmU+","referencesHeader":"PHAwNjExMDQwZmJmN2RmNWMyMmJjMUBbMjE2LjE1MC4yNDkuM10+"},"prevInTopic":23265,"nextInTopic":0,"prevInTime":23266,"nextInTime":23268,"topicId":23264,"numMessagesInTopic":0,"msgSnippet":"Hi Barbara,  I continue to be delighted with the way people take the time to reach out.  Explaining things to new people (who really have so much to learn) can","messageBody":"<div id=\"ygrps-yiv-1101962465\">Hi Barbara,  I continue to be delighted with the way people take the time to reach out.  Explaining things to new people (who really have so much to learn) can take a bit of time.  Thank you for that gift.  I think you may have provided me some insight. .  He feels ready.  Now I am just the one who needs to let go with love.  Briefing and debriefing is so foreign to me.  I am used to talking about it as it comes up.  As I read I quickly reflect back and realize that it never worked that way.  Why did I not stop sooner and try something else?  I think I was stuck in the way that was familiar.  But now I want to stretch to find the way that allows me to remain the most connected :)  Thanks again, Joanne<br/>\n  I&#39;ve been wondering, because of his matter of fact nature that you sensed,<br/>\n  if he is trying to be a bit more autonomous and wanting very much to know<br/>\n  that he can make decisions about safety.  <br/>\n  Well, when it comes to communication I usually try to do it before and/or<br/>\n  after.  I&#39;ve also seen it referred to as briefing/debriefing.  In<br/>\n  situations where right now I have needs and the communication isn&#39;t<br/>\n  happening then I take a deep breath, I think about my most important need<br/>\n  in that moment and I put that need into the context of my being in<br/>\n  relationship w/ Nicole, and I hold it all in my heart.  Then, I take into<br/>\n  account Nicole&#39;s needs and I hold them in my heart.<br/>\n<br/>\n  These are just the types of moments where I could easily slip back into the<br/>\n  old paradigm and just *make* it happen (whatever it might be, like leaving<br/>\n  the park or whatever).  But I&#39;d prefer not to damage my relationship.  I&#39;d<br/>\n  prefer not to wound my daughter&#39;s spirit, or mine for that matter.  I&#39;ve<br/>\n  noticed that when I do slip and I get upset I&#39;m starting to feel the wound<br/>\n  of it myself.  Not the guilty feeling... just that a bit of my connected<br/>\n  wholeness has been slighted.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":157270430,"authorName":"Barbara Chase","from":"Barbara Chase &lt;barb@...&gt;","profile":"bc_avn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"7"},"subject":"Re: [AlwaysLearning] leaving and being safe","postDate":"1129858687","msgId":23265,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNjExMDQxM2JmN2RmNmUxNmYwMkBbMjE2LjE1MC4yNDkuM10+","inReplyToHeader":"PHAwNjExMDQwZmJmN2RmNWMyMmJjMUBbMjE2LjE1MC4yNDkuM10+","referencesHeader":"PHAwNjExMDQwZmJmN2RmNWMyMmJjMUBbMjE2LjE1MC4yNDkuM10+"},"prevInTopic":23264,"nextInTopic":23267,"prevInTime":23264,"nextInTime":23266,"topicId":23264,"numMessagesInTopic":0,"msgSnippet":"oops... sorry, this was sent to the wrong list.","messageBody":"<div id=\"ygrps-yiv-376576653\">oops... sorry, this was sent to the wrong list.</div>","specialLinks":[]},{"userId":157270430,"authorName":"Barbara Chase","from":"Barbara Chase &lt;barb@...&gt;","profile":"bc_avn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"leaving and being safe","postDate":"1129858376","msgId":23264,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNjExMDQwZmJmN2RmNWMyMmJjMUBbMjE2LjE1MC4yNDkuM10+"},"prevInTopic":0,"nextInTopic":23265,"prevInTime":23263,"nextInTime":23265,"topicId":23264,"numMessagesInTopic":0,"msgSnippet":"Hi Joanne, ... First I d just like to say that this has become almost a non-issue for me as Nicole has gotten older.  I do remember that when she was 5 I had ","messageBody":"<div id=\"ygrps-yiv-1749304899\">Hi Joanne,<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;What was a problem is that he continued to run away from me so that I was<br/>\n&gt;unable to talk with him about how it was getting dark, it was almost<br/>\n&gt;seven o&#39;clock and I needed to eat, that my ds had no idea where we<br/>\n&gt;were and I didn&#39;t want him to worry).<br/>\n<br/>\n </span></blockquote>First I&#39;d just like to say that this has become almost a non-issue for me<br/>\nas Nicole has gotten older.  I do remember that when she was 5 I had<br/>\nseveral heart thumping moments when she would run away from me and then I<br/>\ncouldn&#39;t see her.  Once was in a crowded unfamiliar store.  I know that she<br/>\nloved (and still does) to play hiding games and running away games.  She<br/>\ndoesn&#39;t feel that comfortable playing these games in groups of other kids,<br/>\nbut she wants to do it.  When it happened in the unfamiliar store I<br/>\nexplained my concern about not being able to find her (and indeed she had<br/>\ngotten lost and scared a few times up to that point), and we worked out a<br/>\ndeal where she would tell me in advance where she was going to run away to.<br/>\nIt didn&#39;t seem to be a big issue that I not know, just that she got to do<br/>\nit.  Kind of like how she used to talk in the back seat w/ her friends<br/>\nabout what to say to me as if I couldn&#39;t hear because they weren&#39;t talking<br/>\n*to* me.  I expect that when she gets older (and is able to be very<br/>\ndiscerning about safety) it will be important to be *really* hidden.<br/>\n<br/>\nAnother tool that really helped empower her at the music festivals that we<br/>\ngo to is a walkie-talkie.  She loves being able to go ahead of me and still<br/>\nbe connected and to be using a cool gadget all at the same time.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;But then he disappeared and did not answer.  He finally did show up.  I was<br/>\n&gt;headed up the hill by then.  When I told him I was worried.  He just<br/>\n&gt;matter of fact tells me he was fine. I consider this a safety thing.<br/>\n<br/>\n </span></blockquote>I&#39;ve been wondering, because of his matter of fact nature that you sensed,<br/>\nif he is trying to be a bit more autonomous and wanting very much to know<br/>\nthat he can make decisions about safety.  I also remember at the 5yo point<br/>\na marked difference in how Nicole started to cross the street and inform me<br/>\nof all the various car movements.  She chose to do it in a way that was<br/>\nstill right next to me rather than on her own, but it was clear that I was<br/>\nto follow her lead for knowing when to cross the street.  I also feel that<br/>\nif I hadn&#39;t honored that I might have set myself up for a power struggle.<br/>\nMind you, I wasn&#39;t going to walk in front of a car!  But I did let her<br/>\nlead, knowing that I was still going to jump in if needed.<br/>\n<br/>\nI understand how important it is for you to know that your son is safe.  So<br/>\nI&#39;m not suggesting that you go ahead and let him explore beyond the hill on<br/>\nhis own if it really isn&#39;t safe to do.  But are there other areas where he<br/>\nreally can explore and express his autonomy wrt to safety?  Maybe having<br/>\nhim lead you would be helpful?  Anyway, that&#39;s the only idea I&#39;ve had so<br/>\nfar.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Any suggestions to what I do when I have a need, would like to communicate<br/>\n&gt;it and he just won&#39;t get close enough to me to be willing to work things<br/>\n&gt;out...<br/>\n<br/>\n </span></blockquote>Well, when it comes to communication I usually try to do it before and/or<br/>\nafter.  I&#39;ve also seen it referred to as briefing/debriefing.  In<br/>\nsituations where right now I have needs and the communication isn&#39;t<br/>\nhappening then I take a deep breath, I think about my most important need<br/>\nin that moment and I put that need into the context of my being in<br/>\nrelationship w/ Nicole, and I hold it all in my heart.  Then, I take into<br/>\naccount Nicole&#39;s needs and I hold them in my heart.<br/>\n<br/>\nThese are just the types of moments where I could easily slip back into the<br/>\nold paradigm and just *make* it happen (whatever it might be, like leaving<br/>\nthe park or whatever).  But I&#39;d prefer not to damage my relationship.  I&#39;d<br/>\nprefer not to wound my daughter&#39;s spirit, or mine for that matter.  I&#39;ve<br/>\nnoticed that when I do slip and I get upset I&#39;m starting to feel the wound<br/>\nof it myself.  Not the guilty feeling... just that a bit of my connected<br/>\nwholeness has been slighted.<br/>\n<br/>\nThis is all another way of me saying what I often try to say, which is that<br/>\nI hold the seemingly opposite needs, the paradoxical needs, together.  I<br/>\nconnect them.  I allow them to exist with love and as much space as they<br/>\nneed.  To use your park story as an example... I don&#39;t drop my need to<br/>\nleave, but I don&#39;t *insist* that it happen right now.  At the same time I<br/>\nopen up to my dd&#39;s need which she is choosing to manifest by running away.<br/>\nI allow that to be... to exist with love.  That doesn&#39;t mean we&#39;ll be<br/>\nstaying at the park, but it does mean it has some space.  All together, I<br/>\nsoften and I become more present while still holding on to the issues that<br/>\nare imposing themselves from the future.  I think when I make that<br/>\nphysical, mental, and emotional shift Nicole notices it and she can make<br/>\nthe shift very quickly thereafter.  In a way, it&#39;s about setting time aside<br/>\nfor a little while...<br/>\n<br/>\nOthers have suggested that you make a game out of it, chase him.  I know<br/>\nyou can&#39;t run after your son.  But how about if you make the game w/ your<br/>\nwords.  Take the idea that yes, you&#39;d like to go and yes, he&#39;d like to stay<br/>\ninto a word game, chasing him with your words.  Be the sports commentator,<br/>\nwatching his every move away from you, no closer, no further, off to the<br/>\nleft, ooo close to that tree...  Maybe even turn it into a chase/commenting<br/>\ngame w/ the car being the goal.  Allow both realities to exist, that&#39;s the<br/>\ntrick and the key.<br/>\n<br/>\n<br/>\n<br/>\nBarbara<br/>\n<br/>\nMahalo - May you be in Divine Breath<br/>\n<br/>\nBarbara<br/>\n<br/>\nMahalo - May you be in Divine Breath<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":23030,"nextTopicId":4734}}