{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":12,"messages":[{"userId":109856460,"authorName":"nellebelle","from":"&quot;nellebelle&quot; &lt;nellebelle@...&gt;","profile":"lamaribelle","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: cats, teeth, and feline leukemia","postDate":"1043953270","msgId":12065,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZjEwMWMyYzg5MiQ2ZTZmZGI0MCQ2NTAxYThjMEBvZW1jb21wdXRlcj4=","referencesHeader":"PDEwNDI5MDI3NTAuNDA0Ljg2MTk3Lm0xMkB5YWhvb2dyb3Vwcy5jb20+IDwwMDc1MDFjMmJmNTQkMWU3NTdmMTAkZjRkOGZlYTlAYWxsZW52NmJpaWYxNTk+"},"prevInTopic":11795,"nextInTopic":0,"prevInTime":12064,"nextInTime":12066,"topicId":11744,"numMessagesInTopic":0,"msgSnippet":"We took the cat back for a recheck.  The vet said it looked like the antibiotics helped, but she could still see some inflamation.  Her only option for payment","messageBody":"<div id=\"ygrps-yiv-159625048\">We took the cat back for a recheck.  The vet said it looked like the antibiotics helped, but she could still see some inflamation.  Her only option for payment plans is 3-months no interest, then 22% on the remaining balance.<br/>\n<br/>\nAs far as the tests for FeLV and FIV, she didn&#39;t act as if it is so urgent, now that she knows I can&#39;t pay to have it done right now.  The only symptom my cat is showing is gingivitis, otherwise he seems healthy.  She said cats can have the virus yet not actually become ill for years.<br/>\n<br/>\nThanks to all who sent me ideas on this.<br/>\n<br/>\nMary Ellen<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":120262857,"authorName":"Janet Hamlin","from":"&quot;Janet Hamlin&quot; &lt;jefhdvm@...&gt;","profile":"jefhdvm","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: cats, teeth, and feline leukemia","postDate":"1043192341","msgId":11795,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTEwMWMyYzFhNiQ1Y2QzYzZmMCRmNGQ4ZmVhOUBhbGxlbnY2YmlpZjE1OT4=","referencesHeader":"PDEwNDMxMzcxMzQuMjcyLjUyOTYwLm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":11776,"nextInTopic":12065,"prevInTime":11794,"nextInTime":11796,"topicId":11744,"numMessagesInTopic":0,"msgSnippet":" Higher downtown than out in the country, often. Maybe the","messageBody":"<div id=\"ygrps-yiv-1205410671\">&lt;&lt;&lt;&lt; The overhead to run a veterinary clinic is quite high, as is the cost<br/>\nof a great staff.  &gt;&gt;<br/>\nHigher downtown than out in the country, often.&gt;&gt;<br/>\n<br/>\nMaybe the rent, but the drugs, supplies, & equipment are the same.  And<br/>\noften the solo doc will pay more because they aren&#39;t buying in bulk (lots of<br/>\ncompanies will throw in cheaper or free product with bulk purchases, but if<br/>\nit goes out of date because the smaller clinic can&#39;t use it all up, it&#39;s not<br/>\na bargain).  So I pay more for my vaccines, meds, test kits, etc.  And lab<br/>\nfees are more as well.<br/>\n<br/>\n&lt;&lt;But it is also true that a farm vet might be willing to look at a cat with<br/>\nless formality and expense than a downtown doctor with a fancy building.&gt;&gt;<br/>\n<br/>\nMight is the operative word here.  Even the country vets also have bills to<br/>\npay.  Farm vets on large animal calls charge by the head, as they treat the<br/>\nherd as a whole in lots of cases.  Much different than a small animal<br/>\npractice, where the individual animal gets a complete exam.<br/>\n<br/>\n&lt;&lt;We wanted our male cat checked for a bladder infection.  They wanted to<br/>\nkeep him overnight at great expense, to collect urine on their schedule.  I<br/>\nasked<br/>\nif they could just assume infection and give me antibiotics.  NO, that<br/>\nwouldn&#39;t be good medical practice.&gt;&gt;<br/>\n<br/>\nAnd rightly so.  Most cats with cystitis are sterile, and antibiotics won&#39;t<br/>\nreally help (not to mention contribute to antibacterial resistance).  A<br/>\nurine sample at minimum is needed to check urine pH, check for the presence<br/>\nof crystals, cells, blood, etc. before determining which course of treatment<br/>\nis necessary. Bladder stones need to be ruled out as well (not to mention a<br/>\nton of other things.  We once had a kidney worm; very rare, but there.)  A<br/>\ncat I saw recently had intersticial cystitis, which cleared up on the meds,<br/>\nthen a few weeks later started again with symptoms.  A repeat urinalysis now<br/>\nshowed a high pH and crystals, necessitating a completely different course<br/>\nof treatment.  So, a recurrence is not necessarily the same as before,<br/>\neither, even in the same cat!<br/>\n<br/>\n&lt;&lt;Small-town vets (in my northern-New-Mexico experience) don&#39;t have<br/>\nuniformed staff or fancy plants or walls of literature, they have a building<br/>\nout back of their house. &gt;&gt;<br/>\n<br/>\nLots of small town vets in Connecticut and Massachusetts don&#39;t either,<br/>\nincluding me.  My practice was in my basement, but that didn&#39;t negate the<br/>\nbills, and I wasn&#39;t cheaper than the other clinic in town, even when I had<br/>\nno staff.  When a thing as simple as a scale costs $750 and a cage $1000,<br/>\nthat&#39;s a lot of money.  My practice is now in a small strip mall that&#39;s in<br/>\nneed of a paint job, but the location is good and the rent is cheap.  Still<br/>\ncan&#39;t charge less.  And I have worked in country practices in Texas and<br/>\nTennessee, too.<br/>\n<br/>\n&lt;&lt;I don&#39;t see the suggestion as having been an insult to the veterinary<br/>\ntrade, nor the idea that someone who charges less isn&#39;t as competent as<br/>\nbeing a fair one.&gt;&gt;<br/>\n<br/>\nI take that back.  One of the worst vets I worked for was also one of the<br/>\nmost expensive.  He was a great charlatan and the clients bought it hook,<br/>\nline, & sinker.<br/>\n<br/>\nIn general, those practices that practice good medicine will cost more.  It<br/>\ncosts more to keep updated equipment, attend conferences to keep up with<br/>\nadvances, have a decent and well-trained staff that also attend continuing<br/>\ned conferences (turnover is high as the pay is notoriously low), and newer<br/>\nand safer drugs cost more.<br/>\n<br/>\nTake the cat spay.  Why does is cost so much?  How much is too much?  If you<br/>\nactually factor in the real costs, including equipment use and maintenance,<br/>\nstaff time, drug costs, surgery suite, IV caths, fluids, pain meds, heart<br/>\nmonitors, etc., the cost is well over $300.  But I know of no vets that<br/>\ncharge that much.  In fact, if the spay costs less than $100 I can almost<br/>\nguarantee that there is little or no pain meds used (butorphanol, the drug<br/>\nmost commonly used, if any, lasts a whopping 30 minutes and is not redosed),<br/>\nno catheter or fluids (maintains hydration and blood pressure, as anesthesia<br/>\ncauses profound hypotension), minimal monitoring.  I have seen many lower<br/>\ncost places (yes, I have worked in them) use no cap/mask/gown for a spay,<br/>\nwhich is major abdominal surgery.  I have seen more than one cat spayed with<br/>\nthe same instruments and not sterilized in between.<br/>\n<br/>\nMany times I have seen cases from Old Doc So&So who does the cheap work when<br/>\nthey come to me because the pet still has the problem.  The cat with<br/>\ndiarrhea actually had pancreatic insufficiency, not worms.  The dog with bad<br/>\nbreath didn&#39;t have dirty teeth (the cleaning didn&#39;t help) he had a severe<br/>\nperiodontal infection requiring long term antibiotics.  The wart that was<br/>\nreally a mast cell tumor.  Establishing a diagnosis before treatment can be<br/>\ncritical.  I have seen it time and time again, as have most vets.<br/>\n<br/>\nI understand that not everyone can afford to do everything.  But I am a firm<br/>\nbeliever that the BEST option should be presented to the owner and that the<br/>\nowner should decide if they want to pursue that option.  The lesser options<br/>\nare also available, but sometimes are not the best route to go, but if one<br/>\nunderstands that symptomatic treatment may not work, then fine.<br/>\n<br/>\n&lt;&lt;And here is all this absolutely free unschooling advice.<br/>\nYou COULD pay someone $60 an hour for phone consult, but it wouldn&#39;t be as<br/>\ngood as what you could get online with a couple of mailing lists and<br/>\nunschooling.com by reading for the same amount of time, or leaving a<br/>\nquestion and getting free answers.<br/>\nI&#39;m serious about the phone consults.  More people are charging to advise<br/>\nhomeschoolers by phone.&gt;&gt;<br/>\n<br/>\nAnd most veterinarians give free phone advice as well.   There are pet care<br/>\nforums staffed by vets also, for free.<br/>\n<br/>\n&lt;&lt;Old adages don&#39;t always apply.&gt;&gt;<br/>\n<br/>\nTrue.  But lots of times there is a nugget of truth in there somewhere.<br/>\n<br/>\nJanet</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deborah Lewis","from":"Deborah Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: cats, teeth, and feline leukemia","postDate":"1043084813","msgId":11776,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwMTIwLjEwNDY1NC4xODI0LjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":11775,"nextInTopic":11795,"prevInTime":11775,"nextInTime":11777,"topicId":11744,"numMessagesInTopic":0,"msgSnippet":"On Mon, 20 Jan 2003 11:55:27 -0500 Janet Hamlin  writes: ***As the old adage goes, good veterinary care isn t cheap, and cheap ","messageBody":"<div id=\"ygrps-yiv-900186851\">On Mon, 20 Jan 2003 11:55:27 -0500 &quot;Janet Hamlin&quot;<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jefhdvm@...\">jefhdvm@...</a>&gt; writes:<br/>\n***As the old adage goes, good veterinary care isn&#39;t cheap, and cheap<br/>\nveterinary care isn&#39;t good. ***<br/>\n<br/>\nWe are fortunate in our little community to have two vets in practice<br/>\ntogether who are really amazing.<br/>\nOne has been a vet for fifty years,  and has literally seen everything.  <br/>\nEven the modern, well trained vet at the high tech vet clinic forty miles<br/>\naway calls old Doc. Bissonnette for advice.   Folks around here trust his<br/>\nadvice more than their physician&#39;s. &lt;g&gt;   With good reason.   He&#39;s a<br/>\nbrilliant, caring man and a wealth of knowledge. <br/>\n<br/>\n ***Humane<br/>\nsocieties are subsidized by private donations; most other vet hospitals<br/>\nare<br/>\nprivately owned businesses.  It&#39;s not fair to expect the vets to<br/>\nsubsidize<br/>\nlow cost care to the strays and ferals.  Pet overpopulation and strays is<br/>\na<br/>\nCOMMUNITY problem, not a veterinary problem.***<br/>\n<br/>\nTrue, but here we have vets who are part of the community and twice a<br/>\nyear they organize a spay and neuter clinic for stray and feral cats and<br/>\nlow income pet owners.   In the fall our old countrified inexpensive vets<br/>\nspayed 122 cats for the community of Deer Lodge,  at a reduced rate for<br/>\nthose who couldn&#39;t pay the full price and free for the captured feral<br/>\ncats brought in by the local animal shelter.  They notch their ears so<br/>\nfolks can tell which cats have been spayed and in the spring volunteers<br/>\nwill get together again to round up feral cats (without notches) and get<br/>\nthem spayed and neutered.    Our vets were the voices at the city council<br/>\nmeeting where the fate of feral cats was being decided and spoke their<br/>\nunwillingness to kill a couple hundred cats a year just because they are<br/>\nan inconvenience.   These old guys have been a huge part of the solution<br/>\nof a community problem.    <br/>\n<br/>\nI&#39;m in great admiration for vets of all varieties and it&#39;s true, these<br/>\nold guys wouldn&#39;t have the equipment to do kidney transplants or<br/>\nchemotherapy, but for what they can do, and certainly teeth cleaning,<br/>\nextraction, blood tests, etc,  fall into that category, they&#39;re quite<br/>\nremarkable and cheap.  <br/>\n<br/>\nThis clinic is where Dylan got to help X-ray a bird and learned to wrap<br/>\nbroken wings and got to see how stitches are placed and where he gets<br/>\nfree disgusting posters about anthrax and tapeworms.   They show him<br/>\ninteresting X-ray and talk to him about interesting patients and let him<br/>\nwalk some of them and answer his questions.   Doc Bissonnette called<br/>\nDylan one afternoon and invited him out to see a herd of antelope that<br/>\nhad wandered close to his place and he always tells us where he spotted a<br/>\nrattlesnake.   <br/>\n<br/>\nCheap veterinary care can be astoundingly good!<br/>\n<br/>\nDeb L</div>","specialLinks":[]},{"userId":120262857,"authorName":"Janet Hamlin","from":"&quot;Janet Hamlin&quot; &lt;jefhdvm@...&gt;","profile":"jefhdvm","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: cats, teeth, and feline leukemia","postDate":"1043081727","msgId":11774,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGMwMWMyYzBhNCRlNDEyYzRjMCRhMmE0ZmVhOUBwYXdwcmluMT4=","referencesHeader":"PDEwNDMwNzQ3MjkuMzQ1LjY1NjQ1Lm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":11771,"nextInTopic":11775,"prevInTime":11773,"nextInTime":11775,"topicId":11744,"numMessagesInTopic":0,"msgSnippet":"... live where you might travel to a more countrified place and find some nice old country vet who doesn t have to charge high tech prices?","messageBody":"<div id=\"ygrps-yiv-1116443640\"><blockquote><span title=\"ireply\">&gt;&gt;Do you<br/>\n </span></blockquote>live where you might travel to a more countrified place and find some<br/>\nnice old country vet who doesn&#39;t have to charge high tech prices?&lt;&lt;<br/>\n<br/>\nAs the old adage goes, good veterinary care isn&#39;t cheap, and cheap<br/>\nveterinary care isn&#39;t good.  You get what you pay for.  The overhead to run<br/>\na veterinary clinic is quite high, as is the cost of a great staff.  Humane<br/>\nsocieties are subsidized by private donations; most other vet hospitals are<br/>\nprivately owned businesses.  It&#39;s not fair to expect the vets to subsidize<br/>\nlow cost care to the strays and ferals.  Pet overpopulation and strays is a<br/>\nCOMMUNITY problem, not a veterinary problem.<br/>\n<br/>\nOff my soapbox.....<br/>\n<br/>\nJanet<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://jefhdvm.pledgepage.org\">http://jefhdvm.pledgepage.org</a><br/>\nChanging lives......one mile at a time.</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: cats, teeth, and feline leukemia","postDate":"1043081669","msgId":11775,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0Zi4xYTg0Yjg1ZC4yYjVkODNjNUBhb2wuY29tPg=="},"prevInTopic":11774,"nextInTopic":11776,"prevInTime":11774,"nextInTime":11776,"topicId":11744,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/20/03 9:42:21 AM, jefhdvm@worldnet.att.net writes: ","messageBody":"<div id=\"ygrps-yiv-980364805\">In a message dated 1/20/03 9:42:21 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jefhdvm@...\">jefhdvm@...</a> writes:<br/>\n<br/>\n&lt;&lt; The overhead to run<br/>\na veterinary clinic is quite high, as is the cost of a great staff.  &gt;&gt;<br/>\n<br/>\nHigher downtown than out in the country, often.<br/>\n<br/>\n&lt;&lt; It&#39;s not fair to expect the vets to subsidize<br/>\nlow cost care to the strays and ferals.  Pet overpopulation and strays is a<br/>\nCOMMUNITY problem, not a veterinary problem.&gt;&gt;<br/>\n<br/>\nTrue, and there&#39;s the pound (in some communities, not all).<br/>\n<br/>\nBut it is also true that a farm vet might be willing to look at a cat with <br/>\nless formality and expense than a downtown doctor with a fancy building.<br/>\n<br/>\nWe wanted our male cat checked for a bladder infection.  They wanted to keep <br/>\nhim overnight at great expense, to collect urine on their schedule.  I asked <br/>\nif they could just assume infection and give me antibiotics.  NO, that <br/>\nwouldn&#39;t be good medical practice.<br/>\n<br/>\nSmall-town vets (in my northern-New-Mexico experience) don&#39;t have uniformed <br/>\nstaff or fancy plants or walls of literature, they have a building out back <br/>\nof their house.   <br/>\n<br/>\nI don&#39;t see the suggestion as having been an insult to the veterinary trade, <br/>\nnor the idea that someone who charges less isn&#39;t as competent as being a fair <br/>\none.<br/>\n<br/>\n&lt;&lt; You get what you pay for. &gt;&gt;<br/>\n<br/>\nAnd here is all this absolutely free unschooling advice.<br/>\nYou COULD pay someone $60 an hour for phone consult, but it wouldn&#39;t be as <br/>\ngood as what you could get online with a couple of mailing lists and <br/>\nunschooling.com by reading for the same amount of time, or leaving a question <br/>\nand getting free answers.<br/>\n<br/>\nI&#39;m serious about the phone consults.  More people are charging to advise <br/>\nhomeschoolers by phone.<br/>\n<br/>\nOld adages don&#39;t always apply.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deborah Lewis","from":"Deborah Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] cats, teeth, and feline leukemia","postDate":"1043064701","msgId":11771,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwMTIwLjA1MTE0MS4xNTc2LjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":11770,"nextInTopic":11774,"prevInTime":11770,"nextInTime":11772,"topicId":11744,"numMessagesInTopic":0,"msgSnippet":"Several years ago we adopted a stray cat who turned out to be fe leuk positive. When we found him he had been injured and that was when we did the blood test.","messageBody":"<div id=\"ygrps-yiv-183359935\">Several years ago we adopted a stray cat who turned out to be fe leuk<br/>\npositive. <br/>\nWhen we found him he had been injured and that was when we did the blood<br/>\ntest.   Since all my other cats at the time were vaccinated, we decided<br/>\nto see what we could do for him.    He recovered from his initial<br/>\ninjuries (broken shoulder, fractured skull)  and was a really nice cat. <br/>\nWe named him Kirby because he sucked up every morsel of food he could<br/>\nfind.   He did have problems with his teeth, but after a cleaning and<br/>\nexam it turned out that only one needed to be pulled.   Once or twice he<br/>\nwent on antibiotics for his mouth, and that worked fine.   We had him<br/>\nfour years and he had a happy and good life, if too short.   He staked<br/>\nout his area near the heater and wouldn&#39;t budge.  He never once asked to<br/>\ngo outside, apparently having had his fill of cold, miserable weather. <br/>\nHe was sweet and happy and we still miss him. <br/>\n<br/>\nI live in a pretty rural area so that price you mentioned for teeth<br/>\ncleaning and a fe leuk test seems wildly high. <br/>\nIs that for a complete blood work up or just a fe leuk test?   Do you<br/>\nlive where you might travel to a more countrified place and find some<br/>\nnice old country vet who doesn&#39;t have to charge high tech prices?<br/>\n<br/>\nYou might find, after the infection is cleared up that it&#39;s only one or<br/>\ntwo teeth bad enough to be extracted.  That&#39;d be worth it,  if he could<br/>\nhave some quality of life for however long he has.  <br/>\n<br/>\nWe had an old cat who needed a lot of vet attention ( at a higher tech<br/>\nclinic where they treated renal failure ) and they let me make payments<br/>\non it.  <br/>\n <br/>\nI hope it&#39;s not fe leuk.   I&#39;m sorry if it is.  Poor little critter.<br/>\n<br/>\nDeb L</div>","specialLinks":[]},{"userId":50009731,"authorName":"Heidi Wordhouse-Dykema","from":"Heidi Wordhouse-Dykema &lt;heidi@...&gt;","profile":"heidi_wd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: cats, teeth, and feline leukemia","postDate":"1043042334","msgId":11770,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMS4wLjE0LjAuMjAwMzAxMTkyMTU3MzUuMDFmMzdhZTBAbWFpbC5keWtlbWEubmV0Pg==","inReplyToHeader":"PGIwOXU0Yyt0c2NiQGVHcm91cHMuY29tPg==","referencesHeader":"PDNFMjg2RkUyLjcwNjA2MDlAZWFydGhsaW5rLm5ldD4="},"prevInTopic":11759,"nextInTopic":11771,"prevInTime":11769,"nextInTime":11771,"topicId":11744,"numMessagesInTopic":0,"msgSnippet":"You also might want to check out the Humane society or local veterinarian school to see if they have a less expensive option, especially as this is rather a","messageBody":"<div id=\"ygrps-yiv-800705047\">You also might want to check out the Humane society or local veterinarian <br/>\nschool to see if they have a less expensive option, especially as this is <br/>\nrather a bit of a rescue/stray situation.<br/>\nGood luck!<br/>\nHeidi</div>","specialLinks":[]},{"userId":120262857,"authorName":"Janet Hamlin","from":"&quot;Janet Hamlin&quot; &lt;jefhdvm@...&gt;","profile":"jefhdvm","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: cats, teeth, and feline leukemia","postDate":"1042933952","msgId":11759,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNzUwMWMyYmY1NCQxZTc1N2YxMCRmNGQ4ZmVhOUBhbGxlbnY2YmlpZjE1OT4=","referencesHeader":"PDEwNDI5MDI3NTAuNDA0Ljg2MTk3Lm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":11755,"nextInTopic":11770,"prevInTime":11758,"nextInTime":11760,"topicId":11744,"numMessagesInTopic":0,"msgSnippet":"Get the leukemia test first; actually get the combo test that tests for leukemia and feline immunodeficiency virus.  If they are negative, then proceed.","messageBody":"<div id=\"ygrps-yiv-473901906\">Get the leukemia test first; actually get the combo test that tests for<br/>\nleukemia and feline immunodeficiency virus.  If they are negative, then<br/>\nproceed.  Sometimes these cats will respond to medication, and tooth<br/>\nextraction is the last treatment option.  It is okay to proceed step by step<br/>\nif $$ is a concern.<br/>\n<br/>\nJanet</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: cats, teeth, and feline leukemia","postDate":"1042841578","msgId":11755,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExLjc5NzJmMTQuMmI1OWQ5ZWFAYW9sLmNvbT4="},"prevInTopic":11749,"nextInTopic":11759,"prevInTime":11754,"nextInTime":11756,"topicId":11744,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/17/03 2:55:58 PM, angiehewerdine@msn.com writes: ","messageBody":"<div id=\"ygrps-yiv-2025523066\">In a message dated 1/17/03 2:55:58 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:angiehewerdine@...\">angiehewerdine@...</a> writes:<br/>\n<br/>\n&lt;&lt; I&#39;m no vet, but I thought that feline lukemia was not only <br/>\ncontagious, but also fatal...I once knew a cat that had it  &gt;&gt;<br/>\n<br/>\nWe had two male cats just die kind of listless deaths from it, years ago.  <br/>\nAll the cats in our neighborhood who fought (all the males) got it kind of at <br/>\nonce.<br/>\n<br/>\nI wouldn&#39;t put money into it if you find out it&#39;s lukemia.  Just keep the cat <br/>\ncomfortable, get soft food for it, pet it, and let it live a while.<br/>\n<br/>\nAntibiotics for infection might not be a bad idea, though.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":89346128,"authorName":"zenrubyangel &lt;angiehewerdine@msn.com&gt;","from":"&quot;zenrubyangel &lt;angiehewerdine@...&gt;&quot; &lt;angiehewerdine@...&gt;","profile":"zenrubyangel","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: cats, teeth, and feline leukemia","postDate":"1042840524","msgId":11749,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGIwOXU0Yyt0c2NiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNFMjg2RkUyLjcwNjA2MDlAZWFydGhsaW5rLm5ldD4="},"prevInTopic":11747,"nextInTopic":11755,"prevInTime":11748,"nextInTime":11750,"topicId":11744,"numMessagesInTopic":0,"msgSnippet":"I m no vet, but I thought that feline lukemia was not only contagious, but also fatal...I once knew a cat that had it , Mewles, and he had a most awful ending","messageBody":"<div id=\"ygrps-yiv-505546490\">I&#39;m no vet, but I thought that feline lukemia was not only <br/>\ncontagious, but also fatal...I once knew a cat that had it , Mewles, <br/>\nand he had a most awful ending to what had been a very happy life.  I <br/>\nhope that your kitty is not infected with such an awful thing.  But I <br/>\nwould definitely wait on the teeth pulling, until you find out for <br/>\nsure whether or not the Feline lukemia is an issue.  I wish you the <br/>\nbest...-<br/>\n<br/>\n<br/>\n<br/>\n-- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Joylyn &lt;joylyn@e...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m sorry you are facing this.  I would ask the vet about payments <br/>\n </span></blockquote>and <br/>\n<blockquote><span title=\"ireply\"> &gt; options.  <br/>\n&gt; <br/>\n&gt; Joylyn<br/>\n&gt; <br/>\n&gt; nellebelle wrote:<br/>\n&gt; <br/>\n&gt; &gt; We were adopted by a neighbor&#39;s cat a couple of years ago.  Took <br/>\n&gt; &gt; Cougar to the vet yesterday for a check-up.  Turns out he has <br/>\n </span></blockquote>severe <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; gingivitis.  Based on his age (3 or 4 years), the vet thinks the <br/>\n&gt; &gt; condition of his gums indicates something else going on, likely <br/>\n </span></blockquote>feline <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; leukemia.  She prescribed antibiotic for the immediate <br/>\n </span></blockquote>inflamation, <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; and would like to anesthetize him to do a complete dental <br/>\n </span></blockquote>cleaning and <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; exam.  She also wants to do the blood test for leukemia.  All <br/>\n </span></blockquote>this <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; would amount to at least $500.  I told her I really can&#39;t afford <br/>\n </span></blockquote>that, <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; but we would discuss her suggestions as a family and decide what <br/>\n </span></blockquote>to do.<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;<br/>\n&gt; &gt; I did some research on-line this am.  According to what I&#39;ve <br/>\n </span></blockquote>read, if <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; the cat does have FeLV, then we need to do what we can so that he <br/>\n&gt; &gt; doesn&#39;t infect other cats.  Also, it is clear that his mouth <br/>\n </span></blockquote>bothers <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; him.  I would like to do what I can to alleviate the pain, but <br/>\n&gt; &gt; everything I read indicates that extracting teeth is about the <br/>\n </span></blockquote>only <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; thing that can be done.  I have thought of asking the vet if she <br/>\n </span></blockquote>will <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; accept small monthly payments over the next year.  Any ideas?<br/>\n&gt; &gt;<br/>\n&gt; &gt; Mary Ellen<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; [Non-text portions of this message have been removed]<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; Yahoo! Groups Sponsor<br/>\n&gt; &gt; ADVERTISEMENT<br/>\n&gt; &gt; HGTV Dream Home Giveaway <br/>\n&gt; &gt; <br/>\n </span></blockquote>&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://rd.yahoo.com/M=241773.2861422.4212389.1925585/D=egroupweb/S=17\">http://rd.yahoo.com/M=241773.2861422.4212389.1925585/D=egroupweb/S=17</a><br/>\n05542111:HM/A=1394045/R=0/*<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.hgtv.com/hgtv/pac_ctnt/text/0,,H\">http://www.hgtv.com/hgtv/pac_ctnt/text/0,,H</a><br/>\nGTV_3936_5802,FF.html&gt; <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; To unsubscribe from this group, send an email to:<br/>\n&gt; &gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a><br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; Your use of Yahoo! Groups is subject to the Yahoo! Terms of <br/>\n </span></blockquote>Service <br/>\n<blockquote><span title=\"qreply\"> &gt; &gt; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a>&gt;.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":118406848,"authorName":"Joylyn","from":"Joylyn &lt;joylyn@...&gt;","profile":"joylynrsf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] cats, teeth, and feline leukemia","postDate":"1042837474","msgId":11747,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFMjg2RkUyLjcwNjA2MDlAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PGYzLjI2Y2VhMjBkLjJiNTJjMmNkQGFvbC5jb20+IDwwMTY3MDFjMmJlNTgkYjdhNWVmYTAkNjUwMWE4YzBAb2VtY29tcHV0ZXI+"},"prevInTopic":11744,"nextInTopic":11749,"prevInTime":11746,"nextInTime":11748,"topicId":11744,"numMessagesInTopic":0,"msgSnippet":"I m sorry you are facing this.  I would ask the vet about payments and options. Joylyn ... [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-2105933620\">I&#39;m sorry you are facing this.  I would ask the vet about payments and <br/>\noptions.  <br/>\n<br/>\nJoylyn<br/>\n<br/>\nnellebelle wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We were adopted by a neighbor&#39;s cat a couple of years ago.  Took <br/>\n&gt; Cougar to the vet yesterday for a check-up.  Turns out he has severe <br/>\n&gt; gingivitis.  Based on his age (3 or 4 years), the vet thinks the <br/>\n&gt; condition of his gums indicates something else going on, likely feline <br/>\n&gt; leukemia.  She prescribed antibiotic for the immediate inflamation, <br/>\n&gt; and would like to anesthetize him to do a complete dental cleaning and <br/>\n&gt; exam.  She also wants to do the blood test for leukemia.  All this <br/>\n&gt; would amount to at least $500.  I told her I really can&#39;t afford that, <br/>\n&gt; but we would discuss her suggestions as a family and decide what to do.<br/>\n&gt;<br/>\n&gt; I did some research on-line this am.  According to what I&#39;ve read, if <br/>\n&gt; the cat does have FeLV, then we need to do what we can so that he <br/>\n&gt; doesn&#39;t infect other cats.  Also, it is clear that his mouth bothers <br/>\n&gt; him.  I would like to do what I can to alleviate the pain, but <br/>\n&gt; everything I read indicates that extracting teeth is about the only <br/>\n&gt; thing that can be done.  I have thought of asking the vet if she will <br/>\n&gt; accept small monthly payments over the next year.  Any ideas?<br/>\n&gt;<br/>\n&gt; Mary Ellen<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Sponsor<br/>\n&gt; ADVERTISEMENT<br/>\n&gt; HGTV Dream Home Giveaway <br/>\n&gt; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://rd.yahoo.com/M=241773.2861422.4212389.1925585/D=egroupweb/S=1705542111:HM/A=1394045/R=0/*http://www.hgtv.com/hgtv/pac_ctnt/text/0,,HGTV_3936_5802,FF.html\">http://rd.yahoo.com/M=241773.2861422.4212389.1925585/D=egroupweb/S=1705542111:HM/A=1394045/R=0/*http://www.hgtv.com/hgtv/pac_ctnt/text/0,,HGTV_3936_5802,FF.html</a>&gt; <br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; To unsubscribe from this group, send an email to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service <br/>\n&gt; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a>&gt;.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":109856460,"authorName":"nellebelle","from":"&quot;nellebelle&quot; &lt;nellebelle@...&gt;","profile":"lamaribelle","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"cats, teeth, and feline leukemia","postDate":"1042829153","msgId":11744,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNjcwMWMyYmU1OCRiN2E1ZWZhMCQ2NTAxYThjMEBvZW1jb21wdXRlcj4=","referencesHeader":"PGYzLjI2Y2VhMjBkLjJiNTJjMmNkQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":11747,"prevInTime":11743,"nextInTime":11745,"topicId":11744,"numMessagesInTopic":0,"msgSnippet":"We were adopted by a neighbor s cat a couple of years ago.  Took Cougar to the vet yesterday for a check-up.  Turns out he has severe gingivitis.  Based on his","messageBody":"<div id=\"ygrps-yiv-471172664\">We were adopted by a neighbor&#39;s cat a couple of years ago.  Took Cougar to the vet yesterday for a check-up.  Turns out he has severe gingivitis.  Based on his age (3 or 4 years), the vet thinks the condition of his gums indicates something else going on, likely feline leukemia.  She prescribed antibiotic for the immediate inflamation, and would like to anesthetize him to do a complete dental cleaning and exam.  She also wants to do the blood test for leukemia.  All this would amount to at least $500.  I told her I really can&#39;t afford that, but we would discuss her suggestions as a family and decide what to do.<br/>\n<br/>\nI did some research on-line this am.  According to what I&#39;ve read, if the cat does have FeLV, then we need to do what we can so that he doesn&#39;t infect other cats.  Also, it is clear that his mouth bothers him.  I would like to do what I can to alleviate the pain, but everything I read indicates that extracting teeth is about the only thing that can be done.  I have thought of asking the vet if she will accept small monthly payments over the next year.  Any ideas?<br/>\n<br/>\nMary Ellen<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":11967,"nextTopicId":12068}}