{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":5325456,"authorName":"megates@juno.com","from":"megates@...","profile":"lamaribelle","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: singing was: Activities Question","postDate":"1013185693","msgId":4466,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwMjA4LjA5MDMyNi4tMTk3NTE0My4xLm1lZ2F0ZXNAanVuby5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":4465,"nextInTime":4467,"topicId":4466,"numMessagesInTopic":0,"msgSnippet":"Katie, I signed Lisa up for Sunshine Generation when we first moved here and she was 4, bc she loved to sing.  I don t know if it s the nature of the program","messageBody":"<div id=\"ygrps-yiv-266666786\">Katie,<br/>\n<br/>\nI signed Lisa up for Sunshine Generation when we first moved here and she<br/>\nwas 4, bc she loved to sing.  I don&#39;t know if it&#39;s the nature of the<br/>\nprogram or the woman running it, but it was terrible!  She made a big<br/>\ndeal out of kids following her every order and if a kid didn&#39;t they<br/>\nwouldn&#39;t get a sticker at the end and &quot;don&#39;t you want to get a sticker bc<br/>\neveryone else is going to, but you won&#39;t if you don&#39;t stand on that<br/>\nspot&quot;.  When we quit after a few sessions, dh had a problem bc he was<br/>\nworried that she would become a quitter if not made to &quot;finish things&quot;. <br/>\nAlso, she was (and still is) my Velcro kid.  We tried a few other classes<br/>\n(gym, etc) and I would literally have to peel her off my leg to go into<br/>\nthe &quot;mom&#39;s waiting area&quot;, before it occurred to me that she wasn&#39;t ready<br/>\nfor such activities and stopped signing her up.<br/>\n<br/>\nOf course this was all before I was unschooling or even homeschooling. <br/>\nLisa still loves to sing and dreams of being a performer (Britney Spears<br/>\nis her current idol and she is on pins and needles for her movie to open<br/>\nnext week).  So we just sing.  It&#39;s normal in our house to push the<br/>\nreplay button and play the same song over and over.  The girls use<br/>\nvarious kitchen utensils as &quot;microphones&quot;.  I would LOVE to have a karoke<br/>\nmachine!  We sing along in the car.  We have several of the Wee Sing<br/>\ncassettes and song books and they like those.  We borrow music CD&#39;s from<br/>\nthe library.  We also love a lot of sound tracks from movies to listen<br/>\nand sing along too.  When listening to the radio I will talk about the<br/>\nartists and things I know about them.  We have a small collection of<br/>\nmusical instruments including a drum, piano, lap harp, banjos, and<br/>\nrecorders.  This all helps to fulfill Washington State&#39;s homeschool<br/>\nrequirement of &quot;development of an appreciation for art and music&quot;, by the<br/>\nway.<br/>\n<br/>\nIf you do want to try a music class for her, I would suggest Linnea<br/>\nHiljestrand&#39;s music classes.  She is very gentle and just loves music<br/>\nherself and loves bringing it to little children.  There is lots of<br/>\nmoving around in the class.  But I would not say that a class is<br/>\nnecessary by a certain age.  I think if children are allowed and<br/>\nencouraged to express themselves musically and truly do have a talent,<br/>\nthat classes will be more beneficial when they are ready to commit to<br/>\nserious practice and direction, when they recognize themselves that they<br/>\ncan utilize professional help to improve their skills.<br/>\n<br/>\nMary Ellen</div>","specialLinks":[]}],"prevTopicId":4454,"nextTopicId":4333}}