{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":56051484,"authorName":"grlynbl@aol.com","from":"grlynbl@...","profile":"jaeschool","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Abortion","postDate":"1042467032","msgId":54700,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjMS4zNTZhNDc2LjJiNTQyMmQ4QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":54699,"nextInTime":54701,"topicId":54700,"numMessagesInTopic":0,"msgSnippet":"Within the context of unschooling, which encompasses granting children equal rights with adults,  non coercive parenting, and allowing children the freedom to","messageBody":"<div id=\"ygrps-yiv-260755672\">Within the context of unschooling, which encompasses granting children equal <br/>\nrights with adults,  non coercive parenting, and allowing children the <br/>\n&quot;freedom to chose&quot;, abortion is a reasonable issue open for discussion.   <br/>\nBut, the abortion issue can never be &quot;settled&quot;, nor a standard &quot;unschooling&quot; <br/>\nstance in abortion offered.  The reason being, aside from the arguement of <br/>\nwhen life actually starts, which will vary from conception to full term live <br/>\nbirth, is that abortion affects the rights of more than one &quot;person&quot; .  <br/>\nWhether folks believe that person comes into existance at conception or at <br/>\nsome magical moment during pregnancy, there are two (or three, including the <br/>\nfather) peoples rights to consider.   The conflict will always be which of <br/>\nthose peoples rights are more important.   Some will feel that ultimately, <br/>\nthe rights and choices belong to the person who is carrying the baby, the <br/>\nwoman whose body will be provide the vehicle for gestation and delivery of <br/>\nthe baby.  Some will feel that the rights belong to the unborn child, the one <br/>\nwho had no choice at all in the matter of being conceived.  Some will argue <br/>\nthat the father has rights as well, that the baby belongs to him as much as <br/>\nthe mother.   These arguements can go round and round and never be resolved.  <br/>\n  We can all offer our opinions, our convictions, our beliefs on this issue, <br/>\nand ultimately, the conflict will still exist.   Discussion or debate will <br/>\nnever  solve the issue, but it can offer insight into how others view <br/>\nabortion and open up an exchange of ideas and opinions.   I don&#39;t see why <br/>\nthere needs to be restriction placed on the discussion of abortion, as long <br/>\nas everyone understands that there will never be any united agreement on the <br/>\nissue.<br/>\n<br/>\nTeresa  <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":54698,"nextTopicId":54718}}