{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":8226888,"authorName":"the_clevengers","from":"&quot;the_clevengers&quot; &lt;diamondair@...&gt;","profile":"the_clevengers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"African Ice Caps Disappearing (was Re: Healthy )","postDate":"1035065476","msgId":46907,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFvc2xhNCticGhmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNEQjFEMjZCLkM4NDBFMzM0QGxpbm1heC5zYW8uYXJpem9uYS5lZHU+"},"prevInTopic":46902,"nextInTopic":0,"prevInTime":46906,"nextInTime":46908,"topicId":46902,"numMessagesInTopic":0,"msgSnippet":"... across this ... and vital. ... Wow, isn t that sad? We could definitely see evidence when we were up in the crater of the previous extent of the glaciers.","messageBody":"<div id=\"ygrps-yiv-209225245\">--- In Unschooling-dotcom@y..., Peggy &lt;peggy@l...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Robin, was thinking about you climbing Kilimanjaro when I came <br/>\n </span></blockquote>across this<br/>\n<blockquote><span title=\"ireply\"> &gt; today. We need to wake up and smell the melting snow...<br/>\n&gt; <br/>\n&gt; And, sluggard that I am, I understand what you mean about healthy <br/>\n </span></blockquote>and vital.<br/>\n<blockquote><span title=\"ireply\"> &gt; :)<br/>\n&gt; <br/>\n&gt; Peggy<br/>\n<br/>\n<br/>\n </span></blockquote>Wow, isn&#39;t that sad? We could definitely see evidence when we were up <br/>\nin the crater of the previous extent of the glaciers. It was like <br/>\nlooking at the ghost of it&#39;s former presence. <br/>\n<br/>\nOur Unitarian church did a very moving service solely on global <br/>\nwarming last month. Eye-opening and inspiring and kind-of scary. Wake <br/>\nup and smell the melting snow indeed!<br/>\n<br/>\nBlue Skies,<br/>\n<br/>\n-Robin-</div>","specialLinks":[]},{"userId":1512150,"authorName":"Peggy","from":"Peggy &lt;peggy@...&gt;","profile":"margotapple","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"African Ice Caps Disappearing (was Re: Healthy )","postDate":"1035063915","msgId":46902,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNEQjFEMjZCLkM4NDBFMzM0QGxpbm1heC5zYW8uYXJpem9uYS5lZHU+"},"prevInTopic":0,"nextInTopic":46907,"prevInTime":46901,"nextInTime":46903,"topicId":46902,"numMessagesInTopic":0,"msgSnippet":"Robin, was thinking about you climbing Kilimanjaro when I came across this today. We need to wake up and smell the melting snow... And, sluggard that I am, I","messageBody":"<div id=\"ygrps-yiv-1608634155\">Robin, was thinking about you climbing Kilimanjaro when I came across this<br/>\ntoday. We need to wake up and smell the melting snow...<br/>\n<br/>\nAnd, sluggard that I am, I understand what you mean about healthy and vital.<br/>\n:)<br/>\n<br/>\nPeggy<br/>\n<br/>\nAfrican Ice Caps Disappearing <br/>\n<br/>\nallAfrica.com <br/>\n<br/>\nFrom:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://allafrica.com/stories/printable/200210180680.html\">http://allafrica.com/stories/printable/200210180680.html</a><br/>\n<br/>\nNEWS<br/>\nOctober 18, 2002 <br/>\nPosted to the web October 18, 2002 <br/>\n<br/>\nBy Tamela Hultman<br/>\nWashington, DC <br/>\n<br/>\nLike canaries in coalmines, which once signaled the existence of<br/>\nlife-threatening gases before human miners could perceive them, tropical<br/>\nglaciers are a warning for our civilization. That is the message of a growing<br/>\nbody of research on climate change that has focused on melting glaciers and<br/>\nice caps on mountains in Africa and South America. <br/>\n<br/>\nLonnie G. Thompson, a prize-winning researcher at Ohio State University, has<br/>\nbeen leading ice cap studies for two decades. His research offers a response<br/>\nto climate-change skeptics, who argue that the earth has experienced vast<br/>\nfluctuations in climate in the past and that there is no proof that human<br/>\nactions are responsible for the current increase in global temperatures. <br/>\n<br/>\nIn a paper presented at the 2001 annual meeting of the American Association<br/>\nfor the Advancement of Science, Thompson revealed that some 82 percent of the<br/>\nmassive ice field on Tanzania&#39;s fabled Mount Kilimanjaro has disappeared since<br/>\nit was first mapped in 1912. <br/>\n<br/>\nThis week, in the October 18 issue of the journal Science, Thompson and 10<br/>\ncolleagues have published the results of a study of six ice corps from<br/>\nKilimanjaro, which document climate and environmental variability over nearly<br/>\n12,000 years. The period of the greatest historically recorded drought in<br/>\ntropical Africa, some 4,000 years ago, was so severe that it has been<br/>\nconsidered instrumental in the collapse of a number of civilizations,<br/>\nincluding the Old Kingdom of Egypt. That drought was known to extend into the<br/>\nMiddle East and western Asia, and Thompson&#39;s research in the Andes of northern<br/>\nPeru indicates that it may have been much more extensive. <br/>\n<br/>\nNevertheless, the findings of Thompson&#39;s team suggest that the current pace of<br/>\nclimate change in eastern equatorial Africa is without precedent in its<br/>\nimplications for human civilization. The melting of tropical glaciers is,<br/>\naccording to Thompson, &quot;an indicator of massive changes taking place and a<br/>\nresponse to the changes in climate.&quot; The evidence of the retreat and loss of<br/>\nthese large bodies of ice are part of the evidence that has convinced him that<br/>\nglobal warming has begun to make an irreversible mark on the planet. <br/>\n<br/>\nThe ice of high-altitude glaciers is likely to be severely damaging to the<br/>\nareas above which they tower. &quot;The loss of these frozen reservoirs threaten<br/>\nwater resources for hydroelectric power production in the region, and for crop<br/>\nirrigation and municipal water supplies,&quot; Thompson says. <br/>\n<br/>\nWhat the governments of those countries are doing, he says, &quot;is cashing in on<br/>\na bank account that was built over thousands of years but isn&#39;t being<br/>\nreplenished. Once it&#39;s gone, it will be difficult to re-form.&quot; Loss of those<br/>\nwater sources will likely result in a substantial increase in the use of<br/>\nfossil fuels, resulting in the addition to the atmosphere of the greenhouse<br/>\ngases that intensify global warming. <br/>\n<br/>\nOther recently published research has documented a 40-percent shrinkage of the<br/>\nice cap on Mount Kenya since 1963. In September the government of Kenya issued<br/>\nwhat the Nation newspaper in Nairobi called a &quot;red alert&quot;, warning that<br/>\nstreams from the mountain&#39;s slopes were drying up. The paper reported that<br/>\nKenya&#39;s Central Provincial Water Engineer Tom Ogola revoked all water<br/>\n&quot;abstraction&quot; permits, warning of a severe shortage of water everywhere. &quot;Most<br/>\nwater is being consumed on the slopes by farmers,&quot; Ogola said. &quot;Conflicts<br/>\ncould occur if water does not reach the downstream communities.&quot; <br/>\n<br/>\nThompson sees the potential impact on local communities as broader than the<br/>\ncrisis of water supplies. He points to African concerns that the loss of<br/>\nKilimanjaro&#39;s ice cap will be devastating to the tourist trade that brings<br/>\nthousands of people to the region each year and fuels Tanzania&#39;s economy. <br/>\n<br/>\nBut he also sees the problem as an urgent challenge to scientists and policy<br/>\nmakers globally to tackle the issue of global warming. &quot;We need to take the<br/>\nfirst steps to reduce carbon dioxide emissions,&quot; he says. &quot;We are currently<br/>\ndoing nothing.&quot;</div>","specialLinks":[]}],"prevTopicId":46904,"nextTopicId":46914}}