{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":94797851,"authorName":"Karin","from":"&quot;Karin&quot; &lt;curtkar@...&gt;","profile":"kc85022","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] different children","postDate":"1031696279","msgId":43645,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNjMwMWMyNTkxNyRlYzZiYzFjMCQ2NDAwYThjMEBnb2R6aWxsYT4=","referencesHeader":"PEYxNXRJSVpTMlRScWY2OWFaYkwwMDAwMDEwYUBob3RtYWlsLmNvbT4="},"prevInTopic":43642,"nextInTopic":0,"prevInTime":43644,"nextInTime":43646,"topicId":43642,"numMessagesInTopic":0,"msgSnippet":"... or ... Hi Mary - This does sound like an awkward situation. I might say something like so, did your daughter have a good time at our house the other day","messageBody":"<div id=\"ygrps-yiv-598392380\"><blockquote><span title=\"ireply\">&gt; Do I say something to this mother? She frequently calls me for advice and<br/>\n&gt; marvles at how I do it with 4 kids and thanks me greatly for suggestions I<br/>\n&gt; have made that help her. Now I see things differently and realize why she<br/>\n&gt; seems to need help with things. Not usre if it&#39;s for me to say something<br/>\n </span></blockquote>or<br/>\n<blockquote><span title=\"ireply\"> &gt; what I would exactly say.<br/>\n&gt;<br/>\n&gt; Mary B<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Hi Mary -<br/>\nThis does sound like an awkward situation.<br/>\nI might say something like &quot;so, did your daughter have a good time at our<br/>\nhouse the other day when you visited? My kids mentioned that she didn&#39;t<br/>\nreally want to play with them and they were wondering why. Did she say<br/>\nanything to you about it? Does she act that way to most other children, too?<br/>\nDoes she have any close friends? etc..&quot;<br/>\n<br/>\nThis line of questioning might sound a bit intrusive depending on the type<br/>\nof relationship you have with her. But you mentioned that she calls you for<br/>\nadvice so you may be able to delve into deeper questions. Who knows? Maybe<br/>\nshe&#39;d really like to break down and talk to someone about her daughter, or<br/>\nmaybe she really is ignoring the subtle ways her daughter is acting<br/>\ninappropriately in social situations. If she&#39;s the one pursuing your<br/>\nfriendship and advice, I would press for more information about her daughter<br/>\nand how she feels about her. JMO.<br/>\nHope it all works out.<br/>\n<br/>\nKarin</div>","specialLinks":[]},{"userId":99826381,"authorName":"Mary Bianco","from":"&quot;Mary Bianco&quot; &lt;mummyone24@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"different children","postDate":"1031694481","msgId":43642,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxNXRJSVpTMlRScWY2OWFaYkwwMDAwMDEwYUBob3RtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":43645,"prevInTime":43641,"nextInTime":43643,"topicId":43642,"numMessagesInTopic":0,"msgSnippet":"... the your seven year old books, but because my kids were aware that there are some things younger kids are still not good at and they were able to treat","messageBody":"<div id=\"ygrps-yiv-158676848\"><blockquote><span title=\"ireply\">&gt;From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a><br/>\n<br/>\n&gt;&gt;The autistic child wouldn&#39;t have been in the normal range for his age in<br/>\n </span></blockquote>the &quot;your seven year old&quot; books, but because my kids were aware that there<br/>\nare some things younger kids are still not good at and they were able to<br/>\ntreat him as being at an earlier developmental stage, it worked out.&gt;&gt;<br/>\n<br/>\n<br/>\n<br/>\nNow that this has been brought up, I have another question. What a <br/>\nshocker!!!<br/>\nMy kids also have no problem with children that are different in so far any <br/>\nkind of way they have encounterd. Autistic, special needs or CP. I had a <br/>\nfellow homeschooler come over to our house for a day of play and swimming. <br/>\nShe has a 6year old daughter that my daughter was thrilled to meet. Most her <br/>\nage are boys in our group. I hadn&#39;t remembered this child but for once at a <br/>\npark when she was 4. At that time I did notice she was happier to be alone <br/>\nbut when the mother said she was immature for age, I never thought twice <br/>\nabout it. She just seemed like she wasn&#39;t into playing with other kids at <br/>\nthat time.<br/>\n<br/>\nWell as soon as the mother and daughter walked into my house, I knew there <br/>\nwas something different. At the end of our play day, the mother and daughter <br/>\nhad fun, I was uncomfortable and my kids really didn&#39;t seem different aside <br/>\nfrom the fact that they had no one to play with when they thought they were <br/>\ngoing to. The child to me, as far as the info I have which isn&#39;t much, seems <br/>\nslightly autistic. She doesn&#39;t interact at all with anyone. She talks but <br/>\nnot to anyone, not the kids or me or even her mom. She never makes eye <br/>\ncontact and just goes very quickly from one thing to another like no one <br/>\nelse is around. It was a bit uncomfortable for me because her mother doesn&#39;t <br/>\nreally watch her as if there is a problem. (my mother has a connecting MIL <br/>\nquarters to our house and this little girl just walked right in never saying <br/>\na word and went into my mother&#39;s bedroom for awhile and then just left) I <br/>\nfound this out later. I&#39;ve never had any child, whether schoooled or not go <br/>\nthrough my house like that. So I had to watch her and make comments when she <br/>\ndid what we don&#39;t do here in the house. Like push people and grab things <br/>\nfrom others and so on.<br/>\n<br/>\nMy kids tried to play with her but it just wasn&#39;t possible. They had nothing <br/>\nto say other than she seemed to not like them. The mother gives no <br/>\nindication at all that she sees a problem. She just says being an only <br/>\nchild, that the girl is immature. Now the only autistic children I know go <br/>\nto special classes daily. I&#39;m not sure if that&#39;s the best thing or not but I <br/>\ncan&#39;t help but wonder that maybe this child could benefit from some other <br/>\ntype of help the mother isn&#39;t giving. The mother unschools in as far as I <br/>\nknow of, only not having work to do. I know nothing else of how she is with <br/>\nthe child.<br/>\n<br/>\nDo I say something to this mother? She frequently calls me for advice and <br/>\nmarvles at how I do it with 4 kids and thanks me greatly for suggestions I <br/>\nhave made that help her. Now I see things differently and realize why she <br/>\nseems to need help with things. Not usre if it&#39;s for me to say something or <br/>\nwhat I would exactly say.<br/>\n<br/>\nMary B<br/>\n<br/>\n<br/>\n_________________________________________________________________<br/>\nChat with friends online, try MSN Messenger: <a rel=\"nofollow\" target=\"_blank\" href=\"http://messenger.msn.com\">http://messenger.msn.com</a></div>","specialLinks":[]}],"prevTopicId":43476,"nextTopicId":43495}}