{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":62981027,"authorName":"lelie@mindspring.com","from":"&lt;lelie@...&gt;","profile":"momlelie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"&quot;junk&quot; food/tv & limits","postDate":"1045183216","msgId":58636,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGEwMWMyZDNjMSRhNWRiZjVjMCQ2YjFlZjdhNUBlbGllPg=="},"prevInTopic":0,"nextInTopic":58642,"prevInTime":58635,"nextInTime":58637,"topicId":58636,"numMessagesInTopic":0,"msgSnippet":"Hello to all who commented on my “junk” food/tv limits email:  and thank you to those who said hello before their response; it made me feel welcomed.  Let","messageBody":"<div id=\"ygrps-yiv-785918850\">Hello to all who commented on my “junk” food/tv limits email:  and thank you to those who said hello before their response; it made me feel welcomed.  Let me try to explain:  I was trying to use food as an analogy for television watching/electronic game playing, not as the subject of concern.  You can easily have a refrigerator and provide a healthy diet, but you cannot so easily have cable or satellite, or a computer, and provide a healthy “diet.”  We have unlimited access to all kinds of food, including “junk” food, in a more than reasonable quantity, and the kids choose wisely -- most of the time. And we had unlimited access to television/other electronic entertainment (excluding violent or overly sexual stuff), until, for one of our children, our 10-year-old son, it became so seductive of his time, that he was missing out on too much else.  We discussed our concerns with him, and mutually decided that he would watch no more than two hours per day of “junk” television (okay, I defined what was to be considered junk, but I was pretty liberal with what qualified as other than junk), all other programs were still unlimited.  I have a different child now, one who wants to go skiing when I propose it, who plays with his siblings, who practices piano spontaneously, … I could go on and on!  My point is this: electronic forms of entertainment are so fun and addictive, to all of us-- here I sit writing on an email loop, rather than playing with my kids (I did take a break from writing to go outside and break off an icicle for my son to eat :-) ) – that my explanations to my children of how important it is to move your body, cannot match the draw of  these electronic marvels.  I think limits, as controlling an action as it is, might actually be advisable, if only for a short time, to point out the “other side” of the picture, not only to the kids, but to ourselves.  It has opened my eyes, and I think my son is realizing another side of his personality as well.  I’ll let you know how it continues to go.  He has been without excessive television time (we didn’t touch computer or electronic game time, although I think we might have benefited from including them) for a month now, and I have a happier child, who is reconnecting with his siblings, his parents, his pets, and his other interests in life.  Just sharing my own family’s experiences and observations for others to consider or reject.  In peace -- Lynda<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":106031689,"authorName":"Jon and Rue Kream","from":"&quot;Jon and Rue Kream&quot; &lt;skreams@...&gt;","profile":"jonkream","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] &quot;junk&quot; food/tv & limits","postDate":"1045182589","msgId":58642,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PCF+IVVFTkVSa1ZDTURrQUFRQUNBQUFBQUFBQUFBQUFBQUFBQUJnQUFBQUFBQUFBb3RjOXlYdVBJRXV3MzdFd2ZJRzhMTUtBQUFBUUFBQUF6S1RSUHU2NlVrT1RhUVY5dTh3Vkp3RUFBQUFBQGF0dGJpLmNvbT4=","inReplyToHeader":"PDAwMGEwMWMyZDNjMSRhNWRiZjVjMCQ2YjFlZjdhNUBlbGllPg=="},"prevInTopic":58636,"nextInTopic":0,"prevInTime":58641,"nextInTime":58643,"topicId":58636,"numMessagesInTopic":0,"msgSnippet":"We discussed our concerns with him, and mutually decided that he would watch no more than two hours per day of junk television (okay, I defined what was to","messageBody":"<div id=\"ygrps-yiv-1320678207\">&quot;We discussed our concerns with him, and mutually decided that he would<br/>\nwatch no more than two hours per day of &quot;junk&quot; television (okay, I<br/>\ndefined what was to be considered junk, but I was pretty liberal with<br/>\nwhat qualified&quot;<br/>\n <br/>\nHi Lynda - How did you determine what was junk for your child?  ~Rue<br/>\n<br/>\n&quot;Pay no attention to the man behind the curtain.&quot; <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":58639,"nextTopicId":58643}}