{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":154575365,"authorName":"Laura Johnson","from":"&quot;Laura Johnson&quot; &lt;lauraj2@...&gt;","profile":"imakebelieve2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Geography query and newbie intro","postDate":"1092750715","msgId":98223,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjMwMWM0ODQ2MSQ1YmNlMmZmMCQ2ZjYzMDgwNEB5b3VybzBrd2t3OWp3Yz4=","referencesHeader":"PEJENDc1QTM4LjJBMjEyJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":98222,"nextInTime":98224,"topicId":98223,"numMessagesInTopic":0,"msgSnippet":"Joyce wrote: I d like to have a map -- maybe a computer program -- that I could import pictures and type text into. It might be important in school for a map","messageBody":"<div id=\"ygrps-yiv-1596620752\">Joyce wrote:<br/>\n<br/>\n  I&#39;d like to have a map -- maybe a computer program -- that I could import<br/>\n  pictures and type text into. It might be important in school for a map to<br/>\n  show what the major exports and imports of Peru are (so kids can forget them<br/>\n  after the test ;-), but it would be more interesting to note that this<br/>\n  week&#39;s potatoes came from Peru. And to see pictures of cousins and sports<br/>\n  team emblems in various parts of the US.<br/>\n<br/>\n  Hi,<br/>\n  I&#39;m new and haven&#39;t posted an intro yet, but this made me think of an idea I&#39;m working on.  You can use Hyperstudio to import a map.  Then each place on the map could be a button that links to another card that has anything you want it to show about that place.  It could even include video clips, sound, music, pictures, hyperlinks, photos or text.  This a great program for so many things.  I purchased it to make an electronic portfolio and as a authoring tool for my son if he&#39;s interested.  I used it in my classroom extensively, the kids loved it.  It is one of the most versatile tools I&#39;ve seen.  (no I don&#39;t sell it honest!)I got mine on ebay for $8, though it&#39;s an older version.<br/>\n<br/>\n  Another geography type thing we do is geocaching.  This is a great family activity.  A feature of it is the travel bugs that travel from cache to cache (check out the site for full explanation on geocaching, warning geocaching is addicting, www.geocaching.com )  we will release one soon and track it as it moves around the country.  We also track the travel bugs that our friends have released. There are caches all over the world.  Ben&#39;s interest is limited at this time, but I think it will grow as his ability to hike does.  <br/>\n<br/>\n  BTW, I&#39;m Laura and my ds Ben is 5.  We are exploring unschooling though it&#39;s hard with my teacher background to let go of some of those ways of thinking.  Mostly we are relaxed homeschoolers at this point with some loosely structured learning time a few times a week.  I find the whole idea of unschooling intriguing, yet it makes me a little nervous.  The uncertainty of it all.  That&#39;s why I joined this list, to learn from those who believe in it and live it.  We parent very similar to many of you i.e., no bedtimes, relaxed about food, media etc...  I&#39;ve enjoyed reading through the archives and following the posts in the last few days.  Definitely thought provoking and has already sparked many discussion with my dh.  Anyhow, glad to be here learning from all of you.  <br/>\n  Laura J<br/>\n  Tampa<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":98162,"nextTopicId":92160}}