{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"HellElena@xxx.xxx","from":"HellElena@...","replyTo":"LIST","senderId":"BMw2iSh5EQ8xy9LV5p7wn905GvNIYHL_NU_wLeqXo4GkqIU7_dDd2QvbOVjoorB6ugwjgBDS_HU","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Re: school/home/school/home & quiters","postDate":"941686445","msgId":4207,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4yODAuNDIwNy45NTkyNjk3NDNAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":4206,"nextInTime":4208,"topicId":4207,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/3/99 8:10:47 AM Pacific Standard Time, ... I have this image of myself too.  I would ask to be in girl scouts and found out shortly after","messageBody":"<div id=\"ygrps-yiv-345689411\">In a message dated 11/3/99 8:10:47 AM Pacific Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tn-k4of5@...\">tn-k4of5@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Incidentally, I have always had an image of myself as a quitter, not least<br/>\n&gt;  because me parents were always telling me what a failure I was.  They often<br/>\n&gt;  tried to force me to do things, either initiating activities or trying to<br/>\n&gt;  force me to finish.  <br/>\n<br/>\n </span></blockquote>I have this image of myself too.  I would ask to be in girl scouts and found <br/>\nout shortly after joining that this was not me at all (I was a tomboy) and <br/>\nwanted out.  Well, the made me go for awhile and I was finally able to quit.  <br/>\nI wanted a horse so they got me a horse and had me do 4-H.    I stuck with <br/>\n4-h because that was the only way I knew to do my favorite part, pole bending <br/>\nand barrels.  It amazes me sometimes that they didn&#39;t put me where I most <br/>\nbelonged like rodeo.  Of course I eventually quit because I grew bored and <br/>\nthe horse was basically a runaway and gave me fits.  Again I was the quiter, <br/>\ncapricious, never finished anything.  Then I decided on the swim team.  No <br/>\nway, uh-uh, I would only quit again so they were going to waste their time <br/>\ntaking me.  So I gave up on it until I got my drivers license and then <br/>\njoined.  I stuck with it until I was too old at 18 yrs.  They never knew I&#39;d <br/>\nlike it so much... blah blah blah.  I always said that I would pay attention <br/>\nto the wants of my kids.<br/>\n  So here I am with 3 kids of my own (only one of them is homeschooling right <br/>\nnow).  My kids dabble in this and that.  Recently it was flag football for <br/>\nthe one I am homeschooling.  It turns out he hates it.  He was in tears half <br/>\nthe practices and every game.  His dad, my ex, made light of it and saying <br/>\nbasically he should tough it out.  Other people were telling me he should at <br/>\nleast finish out the season.  I was torn for a bit but I stopped worrying <br/>\nabout making the practices on time or taking him home early.  Then I just <br/>\nasked him one day, do you want to quit?  He said yes so we haven&#39;t gone back. <br/>\n It was torture for him and I hated to see him hurt (emotionally, there were <br/>\nsome mean kids on that team and an oblivious coach).  My youngest at 6 tried <br/>\nflag football two practices and got out.  He knew it was not for him.  My <br/>\nolder son only wanted to stick it out I think because it was his dad&#39;s <br/>\nfavorite playing sport.  <br/>\n  Kids have feelings too.  I guess because as an adult I&#39;ve followed my heart <br/>\nand I want that for my kids as they grow up.  I still try a little of <br/>\neverything.  I get into things enough to learn the basics and I move on.  I&#39;m <br/>\nhappy this way.  Maybe my kids will be happy that way too.  <br/>\nChelle the desert dweller</div>","specialLinks":[]}],"prevTopicId":4180,"nextTopicId":4208}}