{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":177721839,"authorName":"Angela S.","from":"&quot;Angela S.&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"7"},"subject":"RE: [UnschoolingDiscussion] Kirby&#39;s last day at work (long)","postDate":"1113130850","msgId":105249,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwNDEwMTEwMDQ2LkhQT0E3Mjc3Lm10YTEwLmFkZWxwaGlhLm5ldEBTdWdhcj4=","inReplyToHeader":"PDc3LjQzMjYxOGQ5LjJmODlmMjE5QGFvbC5jb20+"},"prevInTopic":105247,"nextInTopic":0,"prevInTime":105248,"nextInTime":105250,"topicId":105246,"numMessagesInTopic":0,"msgSnippet":"(((Sandra))) Sounds like it was time for him to move on.  Greater opportunities might just be waiting for him to knock on their door.  :-) Angela ","messageBody":"<div id=\"ygrps-yiv-616543667\">(((Sandra)))<br/>\n<br/>\nSounds like it was time for him to move on.  Greater opportunities might<br/>\njust be waiting for him to knock on their door.  :-)<br/>\n<br/>\n <br/>\n<br/>\nAngela<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a> <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Kirby&#39;s last day at work (long)","postDate":"1113106629","msgId":105247,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhOS4zNTkxZGNkMy4yZjhhMDJjNUBhb2wuY29tPg=="},"prevInTopic":105246,"nextInTopic":105249,"prevInTime":105246,"nextInTime":105248,"topicId":105246,"numMessagesInTopic":0,"msgSnippet":"I drove Holly there and asked her if she wanted to go in alone.   Yes.  I told her she didn t need to hurry out, and she stayed maybe 8 or 10  minutes.  I sat","messageBody":"<div id=\"ygrps-yiv-346189504\">I drove Holly there and asked her if she wanted to go in alone.   Yes.  I <br/>\ntold her she didn&#39;t need to hurry out, and she stayed maybe 8 or 10  minutes.  I <br/>\nsat outside and watched Kirby up behind the counter, in the  little raised <br/>\nisland, with the two computer-inventory cash registers, all the  cards, the store <br/>\nfull of gamers...  He was all lit up and I was sitting  watching it like I <br/>\nwas at a drive in.  <br/>\n <br/>\nHolly chatted with people, and when she came out she said, &quot;I had to have  <br/>\nsome of the cake.&quot;<br/>\n <br/>\n&quot;Cake?  They had a cake?&quot;<br/>\n <br/>\n&quot;Yeah, this big [and measured out a full sheetcake size with her hands],  but <br/>\nI couldn&#39;t tell what it said because there were only two piece left.&quot;<br/>\n <br/>\nWe came home and I told Keith about the cake, and he said sweet things  about <br/>\nhow well our kids have worked out (mush about unschooling!  VERY  COOL!) and <br/>\nthen I went and asked Marty if there had been a cake there earlier  when he <br/>\nwas there for an afternoon tournament.  Yes, he said.  What  did it say?  Don&#39;t <br/>\nthink it said anything. Did they make a speech?   Yeah, Glen (boss&#39;s husband) <br/>\nsaid it was Kirby&#39;s last day.<br/>\n <br/>\n <br/>\nI&#39;ll ask Kirby tomorrow what Glen said.  On Sunday Kirby paints  miniatures <br/>\nwith another couple of friends he only sees on Sundays, and he&#39;ll  probably do <br/>\nthat tomorrow. At the shop where he will no longer work.<br/>\n <br/>\nOh yeah...<br/>\nForgot to say that Glen said they might want to hire him for special events  <br/>\nsometimes.  (Magic Tournaments and such, usually run at hotels.)<br/>\n <br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Kirby&#39;s last day at work (long)","postDate":"1113102361","msgId":105246,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc3LjQzMjYxOGQ5LjJmODlmMjE5QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":105247,"prevInTime":105245,"nextInTime":105247,"topicId":105246,"numMessagesInTopic":0,"msgSnippet":"My feelings will not be hurt if people don t read this.  It has an interesting part (applying for the next job) and after that is just  mom-angst/droning, ","messageBody":"<div id=\"ygrps-yiv-1224673558\">My feelings will not be hurt if people don&#39;t read this.  It has an  <br/>\ninteresting part (applying for the next job) and after that is just  mom-angst/droning, <br/>\nmaybe.<br/>\n <br/>\n <br/>\nTonight is Kirby&#39;s last night working at Active Imagination.  He  started <br/>\nthere at the beginning of August 2000, when he had just turned 14.   He&#39;s 18 and <br/>\na half and some now.<br/>\n<br/>\nThe last Saturday of March, he failed to  lock the back door.  (3/26)<br/>\n <br/>\nIt was discovered by the woman who opened at 11:30 a.m. on Sunday and she  <br/>\ncalled Kirby.  He went in to help make sure nothing was missing, and it was  all <br/>\nfine, except that he had violated security and it was his second  offense.  <br/>\n<br/>\nHis bosses came in to talk about it, and told him they  weren&#39;t going to fire <br/>\nhim, that they would think about it &quot;until Monday&quot; and  maybe ask him to <br/>\nresign.  He was not stressed about it in the least.   Very calm.  Slept like a <br/>\nhappy baby.<br/>\n<br/>\nHe went in Monday  afternoon.  The owner doesn&#39;t do the talking, her husband <br/>\ndoes.  He  asked Kirby if he wanted to continue to work there, or if he <br/>\nthought he might  want to try something different.  Kirby said he&#39;d like to move on <br/>\nand try  something new. [It was a serious offer, though; had he said &quot;I want <br/>\nto  stay,&quot; they&#39;d&#39;ve kept him.] He was told they&#39;d give him six weeks to find  <br/>\nanother job, and the owner said &quot;and then he&#39;ll give us two weeks notice,  <br/>\nright?&quot; and Kirby and her husband shrugged and vaguely agreed.  Kirby  turned in <br/>\nhis keys. He was told that after he&#39;d worked elsewhere for a  year, they would <br/>\nbe glad to hire him back.  The reason given was that he  would appreciate <br/>\nwhat great bosses they were after he worked somewhere  else.  <br/>\n <br/>\nKirby was entirely calm and quite cheerful about it all. He  was more <br/>\nrelieved than disappointed, and told me the whole story in excited  detail.  I said <br/>\nforget that two weeks thing--they knew he was on the  way out and didn&#39;t need <br/>\nany notice.   So that was Monday afternoon. We  talked about factors and <br/>\npossibilities and all for quite a while.  I  admitted to him that I was kinda <br/>\ngrieving because I had been so proud of him  having that job so long, and had <br/>\nsecretly been hoping he&#39;d have that job longer  than five or six years, and admitted <br/>\nit was stupid for me to make it about  me.  We laughed about it, and he was <br/>\n*so* together and matter of  fact about everything.<br/>\n <br/>\n<br/>\nTuesday early afternoon, Kirby went out to apply for jobs nearby.   His first <br/>\nstop was at Game-Something (-Stop or -Proz or something, a video  game <br/>\nstore).  The manager plays Magic at Active Imagination sometimes  so knows Kirby and <br/>\nthe other employees and owners there.  Kirby said the  application was filled <br/>\nin as they talked, and when it said education, he said he  was homeschooled <br/>\nand was going to TVI.  The guy asked what classes he was  taking at TVI and <br/>\nmade note of it, and the back of the form asked Kirby to list  the game systems <br/>\nhe owned.  That list was long, and took a while, and the  guy was impressed.  <br/>\nHe told Kirby they had two part-time positions opening  in a couple of weeks, <br/>\nand he should call back on Friday, the 8th.  We wrote  it on the calendar.<br/>\n <br/>\nBouyed by that happy interview and needing to go to karate, Kirby didn&#39;t  <br/>\napply for other jobs that day.  He told his sensei about the situation, and  was <br/>\noffered the opportunity to man sales tables at regional karate tournaments  at <br/>\nleast four times a year (their dojo is a martial arts supply store, too, for  <br/>\nmany styles).  The first weekend offered was one when Kirby is  scheduled to <br/>\ngo to Las Vegas NV for a game tournament, but &quot;next time!&quot; was  assured.<br/>\n<br/>\nLater Tuesday night he talked to several of his friends about what  kinds of <br/>\njobs they thought he should apply for and they were recommending phone  tech <br/>\nfor cell phone companies or computer users.  There are several such  places in <br/>\nand around Albuquerque.<br/>\n <br/>\nWednesday after his class he went and registered to take a GED  the two days <br/>\nafter he gets back from Las Vegas (the 20somethingth of April), so  he&#39;ll have <br/>\nthat if he needs it for any of the places he might want to try to  work.<br/>\n <br/>\nThursday afternoon he went in to work for a few hours, and the only  other <br/>\nperson there was the owner.  He said she kept looking at him oddly,  <br/>\nsuspiciously.  I called him on the phone about something that  afternoon,  and he told me <br/>\nhe was having the most uncomfortable shift  he&#39;d had for years, and he was <br/>\njust going to phase out sooner than six  weeks.   The owner went home (as <br/>\nscheduled) an hour before  Kirby left.  He was unable to close (no keys) and had <br/>\nbeen told someone  else would come to close.  It was half an hour after he was <br/>\nready to leave  before anyone showed up to close.  Their loss; he charged for <br/>\nthe hour and  someone else was inconvenienced.<br/>\n <br/>\nThere was a staff meeting 9:00 a.m. Friday April 1,  and Kirby was  told to <br/>\nbe there, even though his shift on Friday was 5:00 to 1:00  a.m.    He had told <br/>\nus already that he was going to ask them  not to schedule him anymore after <br/>\nthe two week schedule that was set.  They  said okay.  <br/>\n <br/>\nHe came back home very happy, saying his last day would be the 9th.<br/>\n <br/>\nThat weekend he started thinking maybe he should just wait and not get a  job <br/>\nright away.  Keith supported it.  I expressed concern that if he  waited <br/>\nuntil after Memorial Day (he wants to go to the Grand Outlandish  Tournament, a <br/>\nbig SCA campout near here at the end of May) that all the high  school seniors <br/>\nwould be out applying for the same kinds of jobs.  Keith  acknowledged my <br/>\npoint, but said it was fine if Kirby wanted to wait a  while.  Kirby reminded us <br/>\nhe&#39;s never had a vacation from working, and was  denied time off for the big <br/>\nFebruary event in Arizona.  <br/>\n<br/>\nMonday the 4th, he got a call from the video game store (the guy who&#39;d  said <br/>\nto call him on the 8th) asking if he wanted the job.  Kirby said he&#39;d  been <br/>\nthinking about it, and knew they didn&#39;t want someone short term, and felt  he <br/>\nneeded to get something with more hours than they were offering him.  <br/>\n <br/>\nI was listening.  I was sad, because it seemed it would be a fun job,  it&#39;s <br/>\neven closer than the other shop is to our house, and he was saying  no.  But <br/>\ny&#39;know, it was a mature and honest thing to do.  And the guy  said he understood <br/>\nbut that if Kirby ever changed his mind, he would hire  him.  <br/>\n <br/>\nSo my emotions are agitation and embarrassment and the urge to tell his  boss <br/>\nand her husband that they&#39;re NOT such great bosses as they think and that  <br/>\nthe Mr. Boss has been one of the LEAST respectful adults in  Kirby&#39;s life so <br/>\nfar.  My motherly instincts are stirred.  I&#39;m  afraid Kirby will want a job and <br/>\nnot have one later in the summer, rather than  having the luxury to turn one <br/>\ndown.<br/>\n <br/>\nBut... in the next few weeks he has a math final,  the trip to Las  Vegas, a <br/>\nGED, and he&#39;s judging a set of karate belt tests on his own.   There will be a <br/>\nsecond judge, but Kirby&#39;s never been the primary judge and  director of the <br/>\nsession before.  Also, those tests are always videotaped so  he&#39;s also in <br/>\ncharge of making sure the taping goes right (another senior student  will run the <br/>\ncamera).  And he&#39;s getting a tax refund which will cover the  trip to Las Vegas <br/>\n(he&#39;s driving with another guy or two) and he&#39;ll have some to  tide him over <br/>\na while.<br/>\n <br/>\nI just told Holly this is Kirby&#39;s last night.  She&#39;s been playing Halo  II a <br/>\nLOT and has missed a lot of family business and news.  She said we  should go <br/>\nand visit him at work, then.  I said nah, let him work.  She  said she really <br/>\nwanted to, so I said she could call and see if he wanted a tuna  sandwich.  <br/>\nShe did.  He does.  She&#39;s very happy.  Gotta go,  then.<br/>\n <br/>\nSorry this was so long, but as soap operas go it&#39;s the exciting conclusion  <br/>\nof a plotline here.<br/>\n <br/>\nSandra<br/>\n <br/>\n(P.S.  While I was proofreading prior to hitting &quot;send,&quot; Holly went to  make <br/>\nKirby&#39;s sandwich.  I would&#39;ve done it, but she really wants to.)<br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":105212,"nextTopicId":105250}}