{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":7143857,"authorName":"jrossedd@aol.com","from":"jrossedd@...","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Temporary Insanity was: Kids &quot;going insane&quot;","postDate":"1073851274","msgId":88442,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVhLjI2NGI2YzU0LjJkMzMwNThhQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":88441,"nextInTime":88443,"topicId":88442,"numMessagesInTopic":0,"msgSnippet":"... Not parenting at all would have been even tidier though -- did you think of that before having children? I ask sincerely, because I actually DID think of","messageBody":"<div id=\"ygrps-yiv-1656143236\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cottagevt@...\">cottagevt@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I am unwilling to accept the mess of liquids and stains in my car or <br/>\n&gt; anywhere in my house outside of my kitchen or dining room, so we have rules in <br/>\n&gt; place to avoid the problem entirely. This is what works for us, period. As for <br/>\n&gt; other folks who advocate more freedom, to each their own.  I unschool; I don&#39;t <br/>\n&gt; unparent.<br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>      Not parenting at all would have been even tidier though -- did you <br/>\nthink of that before having children?<br/>\n<br/>\n       I ask sincerely, because I actually DID think of that, and was an <br/>\navowed non-parent all through my 20s for such reasons. <br/>\n<br/>\n       There was a book out then called The Baby Trap, by Ellen Peck. It&#39;s <br/>\nboth embarassing and amusing to me now to recall how much that book influenced <br/>\nme at the time. The book said I deserved a lifestyle that wasn&#39;t &quot;childless&quot; <br/>\nbut child-FREE, and that sounded pretty good to me. I had a career and money, my <br/>\nown place, my own car, and complete control over how their daily use and <br/>\nmaintenance.<br/>\n<br/>\n       I particularly remember the book&#39;s interview with a young mom of one <br/>\nbaby. The author presented her as having gone from being a sexy, bright, <br/>\ncarefree wife and equal partner living an adult lifestyle with brunch and ski <br/>\nvacations, to this hysterical shrew stuck at home with spit-up on her clothes and <br/>\nbaby stuff all over the house. Hubby arrives home one night with a single friend <br/>\nand the friend can&#39;t even sit down because there are unfolded diapers <br/>\neverywhere. The husband sheepishly apologizes for the mess and the wife loses her <br/>\nmind and begins shrieking how dare he apologize for his BABY??<br/>\n<br/>\n       (Like I said, it made quite an impression on me then. This is part of <br/>\nwhy I&#39;m certain that I&#39;m a very different parent now from the one I would have <br/>\nbeen in my 20s.)<br/>\n<br/>\n       This isn&#39;t to say I don&#39;t try to prevent car messes, of course. My <br/>\nyounger child had terrible motion sickness and threw up all the time in the car, <br/>\neven on short jaunts. Probably because Florida is so hot? But we drive all the <br/>\ntime, to take Dd to dance and the theatre, to the grocery store, et cetera, <br/>\nand so I needed a solution beyond rules. For me, it was Dum-Dum lollipops. I <br/>\nkeep a bag of them in my car and for about three years he sucked on a series of <br/>\nlollipops everywhere he went. Still does when the car is stuffy or the trip is <br/>\nlonger.<br/>\n<br/>\n       Yes, this meant sticky sticks and wrappers to be disposed of, and my <br/>\ncar is still usually a mess. <br/>\n<br/>\n       But it smells fruity instead of sour, and I don&#39;t often have to scrub <br/>\nthe upholstery, and I never have that desperate feeling in traffic anymore <br/>\nthat I can&#39;t stop to help him until I find an empty parking lot. <br/>\n<br/>\n       It&#39;s an acceptable and even cheerful kind of compromise for me now, <br/>\nbut it wouldn&#39;t have been for that woman I used to be with my sporty little car <br/>\nin the 70s. That woman would read this and think I was the one who had gone <br/>\ninsane. &lt;g&gt;  JJ<br/>\n<br/>\n       <br/>\n<br/>\n       <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":88345,"nextTopicId":88403}}