{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":117956499,"authorName":"maryfhickman@jps.net","from":"maryfhickman@...","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"re: She wants to go to school","postDate":"1084208657","msgId":19551,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg4Nzk0MjEuMTA4NDIwODY2MjQzNi5KYXZhTWFpbC5yb290QHdhbGRvcmYucHNwLnBhcy5lYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":19550,"nextInTime":19552,"topicId":19551,"numMessagesInTopic":0,"msgSnippet":"Hi Joanne, We have been unschooling since the kids were little little. My oldest. now going on 10 was interested in going to school. I think alot of it came","messageBody":"<div id=\"ygrps-yiv-629500052\">Hi Joanne,<br/>\n<br/>\nWe have been unschooling since the kids were little little. My oldest. now going on 10 was interested in going to school. I think alot of it came from hanging out with kids in school. For her playing school was completely imaginary, while her friends had experienced real school and had much more concrete ideas to add to the game, like who can sit where during lunch... She asked alot to go, and I always had a reason to say not now, I&#39;ll think about it. She did ask at the end of the year in 2002, she seemed mature enough to me, and I enrolled her in a 3rd grade class.<br/>\n<br/>\nI had lots of feelings of failing her, not being there, spending too much time with litttle ones. Then it dawned on me that this was her path. I would have enrolled her in ballet, karate, or art had she asked. She had picked something from our community to explore, and she did fantastic. And her choose was good for her at the time. She was craving more time with kids her age. She made some good friends, who we still hang out with. She saw alot of the garbage too, and had a great perspective on it. She saw kids bully others and she saw kids make peer based choices and she talked to me about it all. <br/>\n<br/>\nShe is home again this year. We still have some of the boredom, lack of enthusiasm, complaining going on that we did before she went to school. This year has been a reconnecting to her younger siblings and a year of exploring who she is, what makes her tick. She rediscovered her love of piano and her joy of reading is being satiated. She has the time to do things again that school time took from her.<br/>\n<br/>\nShe does waver sometimes and asks to go back, usually after a meltdown kind of day. She does see the freedom of unschooling compared to school and as she matures I see her realize how much control she has for herself and how little control schooled children have. Still on our block all the kids come home from school and we are out in our swim suits. The other kids are hot and sweaty, but they can&#39;t play until they have read for 20 minutes, or practiced their instrument or completed more math. We smile, say we will still be playing when they are through. Sometime around 3:30 or 4pm the kids come out and we have a few hours of unstructured play until it&#39;s bedtime for them, because they have to go to school.<br/>\n<br/>\nThis is our story, longer than I had intended. My main point is that I support your daughters choice to check out school, even highschool. Her years of unschooling will help her stand tall and be herself. She is exploring a new territory and will most likely thrive like she has done in other new experiences. She will have a lot to talk about . She may not know how to do specific math problems, but she does know how to learn. Much of the first month of school is reminding kids how to do what they need to do and I wonder if she really needs to study now. Community colleges have basic textbooks which she might find interesting to browse. I&#39;m hopng your family adjusts well to her going off into the world and you find peace of mind in being there for her. <br/>\n<br/>\nMary H.</div>","specialLinks":[]}],"prevTopicId":19549,"nextTopicId":19538}}