{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"dezignarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] V.Long Rant about Jayn&#39;s friend was Attitudes in kids","postDate":"1062539076","msgId":79772,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWMzNzE5YiQ2YmZkNTU2MCQzNDAwYThjMEByb2J5bm1hY2hpbmU+","inReplyToHeader":"PDk3LjNkNzg4YTU3LjJjODVmZWJlQGFvbC5jb20+"},"prevInTopic":79720,"nextInTopic":0,"prevInTime":79771,"nextInTime":79773,"topicId":79720,"numMessagesInTopic":0,"msgSnippet":" You know I have thought about this, since Jayn asked for and received both, plus some other","messageBody":"<div id=\"ygrps-yiv-809208301\">&lt;&lt;Can you just buy her the Mary-Kate doll as a gift?  Poor thing.&gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nYou know I have thought about this, since Jayn asked for and received<br/>\nboth, plus some other little ones as well. I feel awkward because for<br/>\nall I know they may have purchased it and are hiding it for her birthday<br/>\nin October, and if I ask if they have it, or would they mind if I got<br/>\nit, (or indeed if I just bought it) they might feel it as a judgment of<br/>\nthem. (Let&#39;s face it - it would be!) I thought I would phrase it as<br/>\nasking for advice on what I could get her for her birthday, because I<br/>\ndon&#39;t want to duplicate anything.<br/>\n<br/>\n&lt;&lt;We have a kid who comes here to play video games.  I&#39;m the only person<br/>\nit <br/>\nseems to bother, so I really try to just breathe through it and let it<br/>\ngo. He <br/>\nDOES do other things with the kids, but mostly he&#39;s here to wait his<br/>\nturn to play the newest games Kirby has bought.&gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nI know what you mean about trying to breathe through it. However Jayn<br/>\nhas been very willing to let Renee use anything. There are some special<br/>\nthings with many tiny parts or that are no longer available, that I put<br/>\nup before they come, just because I don&#39;t want the distress of anything<br/>\nlost or broken. Jayn is remarkably careful, and I am assiduous in<br/>\nkeeping stuff together - God bless the inventor of Ziploc baggies. Renee<br/>\nhas asked for them repeatedly, but I tell her they are not available, by<br/>\nmy decision. <br/>\n<br/>\n&lt;&lt;But your focus should be your OWN child&#39;s freedom, and her own comfort<br/>\nin her <br/>\nown home.&gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nThank you for this validation, and to all to have responded.    <br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;You could say casually, or in a comforting moment, &quot;I bet Tania&#39;s<br/>\nparents <br/>\nwere really mean to her when she was little.  That&#39;s too bad, because it<br/>\nmakes <br/>\nher kind of a mean mom.  We&#39;re trying to be really nice to you so it<br/>\nwill make <br/>\nit easier for you to be a nice mom someday.  Tania&#39;a probably nicer than<br/>\nher <br/>\nparents were, and Renee will probably be nicer to her kids than Tania<br/>\nis, but <br/>\nit&#39;s too bad they can&#39;t hurry and be nicer now.&quot;&gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nI don&#39;t think Jayn sees her as being a mean mom. I don&#39;t think she<br/>\nrealizes Renee is manipulating her. I  believe that Tania likes Jayn,<br/>\nand feels sorry for her for having a mother who wants to limit her<br/>\nplaytime (for any other reason than being punished that is). Renee<br/>\nstarted saying in my hearing how sorry she felt for Jayn, an idea I<br/>\nthink it is unlikely she developed for herself. People sometimes use the<br/>\nexpression of pity to feel better about themselves. Tania jumped on her<br/>\nquickly to stop saying that.<br/>\n<br/>\n<br/>\n&lt;&lt;I hope she comes to realize how cool your house is and starts to act<br/>\nthe way <br/>\nyou want her to!&gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nI&#39;m not sure my house is cool, although of course we have free access to<br/>\nany snacks they like. I suspect that Renee knows she is being closely<br/>\nwatched, even if I am reading a magazine or doing e-mail. My husband<br/>\ncan&#39;t stand the way a mess is left, but I am perfectly happy to clean up<br/>\nafter them myself, rather than feel in any way obligated to &quot;force&quot; Jayn<br/>\nto reciprocate tidying up at their house. Of course there is much less<br/>\nmess there, because there are way fewer toys. The one time I tried to<br/>\nplease him by making Jayn put some tea set things away before she and<br/>\nRenee were going over to her place, was a disaster of crying. I was<br/>\nashamed that I had allowed a feeling of being insufficient, of wanting<br/>\nJayn to be viewed as fantastic by this other parent, to overcome my<br/>\nbetter judgment of what Jayn should be asked to do. It is not only<br/>\nJayn&#39;s behavior that is being negatively effected, it is mine and my<br/>\nthinking!! This was before the shot in the arm of the Conference.<br/>\n<br/>\nRenee returned and helped me put the stuff away after Tania told her to<br/>\nand sent her back. Actually Renee is very good about putting her trash<br/>\ninto the bin, and I always thank her. I figure Jayn will get that<br/>\neventually. This is one of the issues that some of the conference<br/>\nspeakers got me thinking about - the difference between the appearance<br/>\nof being well-behaved, and the truth of feeling free and honest in one&#39;s<br/>\nbehavior and actions. <br/>\n<br/>\n <br/>\n<br/>\nRobyn Coburn<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] V.Long Rant about Jayn&#39;s friend was Attitudes in kids","postDate":"1062511806","msgId":79720,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk3LjNkNzg4YTU3LjJjODVmZWJlQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":79772,"prevInTime":79719,"nextInTime":79721,"topicId":79720,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/2/03 3:26:06 AM, dezigna@comcast.net writes: ","messageBody":"<div id=\"ygrps-yiv-668809919\">In a message dated 9/2/03 3:26:06 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dezigna@...\">dezigna@...</a> writes:<br/>\n<br/>\n&lt;&lt; . Renee must have mentioned it to Jayn every time<br/>\nshe saw her, because Jayn kept on telling me, &quot;The Mary-Kate is for<br/>\nAngel&quot;. Renee has repeatedly said that Jayn has all the toys she, ie<br/>\nRenee, wants. I am convinced that she was only coming here in order to<br/>\nuse Jayn&#39;s toys. &gt;&gt;<br/>\n<br/>\nCan you just buy her the Mary-Kate doll as a gift?  Poor thing.<br/>\n<br/>\nWe have a kid who comes here to play video games.  I&#39;m the only person it <br/>\nseems to bother, so I really try to just breathe through it and let it go. He <br/>\nDOES do other things with the kids, but mostly he&#39;s here to wait his turn to play <br/>\nthe newest games Kirby has bought.<br/>\n<br/>\n&lt;&lt;I felt like I was somehow letting down the philosophy of freedom if I<br/>\nintervened. &gt;&gt;<br/>\n<br/>\nBut your focus should be your OWN child&#39;s freedom, and her own comfort in her <br/>\nown home.   That&#39;s the problem with any discussions of &quot;freedom&quot; or &quot;liberty <br/>\nand justice,&quot; even.   21st century: Free to have a job one&#39;s not qualified <br/>\nfor?  Free to bug the heck out of other people?  Free to be a telemarketer?    <br/>\n20th century:  Free to discriminate?  Free to have a segregated neighborhood?  <br/>\n19th century:   Free to own slaves or lynch the neighbors?<br/>\n<br/>\n&lt;&lt;Sandra&#39;s posts from the past had<br/>\naccounts of things she has said to other children, and there were<br/>\nexamples of Holly and others who seemed so clear eyed about the toxic<br/>\nbehaviors they encounter in non-unschoolers. &gt;&gt;<br/>\n<br/>\nThat was often with Holly saying, &quot;I know, mom, but I want to go over there <br/>\nanyway&quot; in response to me saying &quot;Well if they&#39;re being tacky, you don&#39;t have <br/>\nto go!<br/>\n<br/>\nI had words again with Marty&#39;s friend Logan Sunday night who was <br/>\npontificating on his hatred of lesbians.  I wanted Marty to say sofriends of a lesbian <br/>\ncouple most of us know.  Logan knows them too, but probably didn&#39;t know they&#39;re a <br/>\ncouple because he&#39;s been around them separately at different times.  So I <br/>\nslammed him with that news and told him to keep his bullshit at his own house.<br/>\n<br/>\nHe said &quot;Yes ma&#39;am&quot; and left (legitimately, to go on a Ticketmaster&#39;s run <br/>\nwith others) soon after.  I asked Marty the next day whether Logan survived.  He <br/>\nsaid &quot;I was a conversation killer,&quot; but that Logan would be back.   I asked <br/>\nHolly that night whether Logan would badmouth me behind my back, and she said he <br/>\nnever has before.  She said he did say to her one time that he was scared to <br/>\ndeath of me, that if he said the wrong thing I would stab him in the face.  <br/>\n&quot;In the back!&quot; I told Holly.<br/>\n<br/>\nMy first goal is to change his thinking.<br/>\nSecond acceptable goal is to make him afraid enough that he&#39;ll be more <br/>\nsocially acceptable in my house.<br/>\nThird Plan:  He won&#39;t come over.<br/>\n<br/>\nBut Marty likes him, so if Marty suffers some embarrassment or killed <br/>\nconversations for the &quot;freedom&quot; to keep having Logan in a house he shares with <br/>\nothers, I don&#39;t feel too bad about it.<br/>\n<br/>\n&lt;&lt; I wonder what she thinks<br/>\nwhen she sees someone whom she admires using violent repressive<br/>\nparenting - name calling, shaming, punishments, removal of &quot;privileges&quot;,<br/>\nand control. Yet how can I ask Jayn about it without being leading or<br/>\nseeming to be criticizing.&gt;&gt;<br/>\n<br/>\nI know! I know!<br/>\nWell maybe I have an idea.<br/>\n<br/>\nYou could say casually, or in a comforting moment, &quot;I bet Tania&#39;s parents <br/>\nwere really mean to her when she was little.  That&#39;s too bad, because it makes <br/>\nher kind of a mean mom.  We&#39;re trying to be really nice to you so it will make <br/>\nit easier for you to be a nice mom someday.  Tania&#39;a probably nicer than her <br/>\nparents were, and Renee will probably be nicer to her kids than Tania is, but <br/>\nit&#39;s too bad they can&#39;t hurry and be nicer now.&quot;<br/>\n<br/>\n&lt;&lt;I wish the behavior influence could work the other way, as some<br/>\nof you have witnessed in your dealings with other kids, but I just don&#39;t<br/>\nthink it will right now.&gt;&gt;<br/>\n<br/>\nSometimes I think it does, depending on the personality of the kids.  I&#39;ve <br/>\nseen Kirby and Holly both just SAY things to other kids about loosening up and <br/>\nnot being so controlling, or about learning things for fun, or about not being <br/>\ncritical (whatever the little situation was at the time), but Marty lets Logan <br/>\nrun his runny-mouth course.<br/>\n<br/>\nThere was another friend Marty had from ice hockey years ago, and he kept <br/>\ninviting Marty over, but the boy was mean to his younger brother and Marty didn&#39;t <br/>\nlike that at all.  Marty would try to include the younger boy, or just leave <br/>\nand go play with him, because he didn&#39;t want to be an agent or the excuse for <br/>\nthat boy being sad or hurt or crying.  But the older brother was truly a <br/>\nbully, so Marty said no to a couple of invitations, and then asked me to tell the <br/>\ngrandmother (GREAT grandmother, actually, who was raising them in a really <br/>\nfancy house, well provided for, and she seemed really nice and bright, but <br/>\nsomewhere down the line things hadn&#39;t gone well) exactly what he didn&#39;t like, that he <br/>\nwould only go back if the older boy would be nice to the brother while he was <br/>\nthere.<br/>\n<br/>\nHe did visit at least one more time.<br/>\n<br/>\n&lt;&lt;My husband kept saying that I should ask the group for advice, as I<br/>\nfrantically searched the archives and cried every night - this was weeks<br/>\nago before I made my fateful decision to try to control my child&#39;s<br/>\nrelationship with this other. &gt;&gt;<br/>\n<br/>\nYou were trying to maintain her peace and safety.  That&#39;s good.<br/>\n<br/>\n&lt;&lt; Most shameful of all, I am glad that this child is going<br/>\nto school. She will be away for hours every day, and then they will need<br/>\ntheir family time.&gt;&gt;<br/>\n<br/>\nIt might be fun for her.  OR it might not, and that other mom might be coming <br/>\nto you for homeschooling advice.  Then you won&#39;t be intruding if you give her <br/>\nmothering advice.<br/>\n<br/>\n&lt;&lt;I hope she makes a ton of other friends and drops<br/>\nJayn like a hot potato.&gt;&gt;<br/>\n<br/>\nI hope she comes to realize how cool your house is and starts to act the way <br/>\nyou want her to!<br/>\n<br/>\nKids get older, and many just drop their little-kid defenses in favor of more <br/>\nmature interactions.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":79602,"nextTopicId":79776}}