{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: new webpages","postDate":"1119973959","msgId":22632,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5ZS4zNjU2MmYyNi4yZmYyY2M0N0Bhb2wuY29tPg=="},"prevInTopic":22628,"nextInTopic":0,"prevInTime":22631,"nextInTime":22633,"topicId":22608,"numMessagesInTopic":0,"msgSnippet":"... OH HUH, I would say YOU stop acting like I m two if you want to have a relationship at all. [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-1338803536\">In a message dated 6/28/05 7:30:39 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tuckervill2@...\">tuckervill2@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Be careful when you remind your mother of your age.  In an argument  I <br/>\n&gt; said,<br/>\n&gt; &quot;Mother, I&#39;m 43 years old!&quot; and her reply was, &quot;Then quit  acting like <br/>\n&gt; you&#39;re<br/>\n&gt; 2!&quot; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>OH HUH, I would say &quot;YOU stop acting like I&#39;m two if you want to have a <br/>\nrelationship at all.&quot;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":163750020,"authorName":"tuckervill2@aol.com","from":"tuckervill2@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: new webpages","postDate":"1119965379","msgId":22628,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg3LjJhNzM5Y2VjLjJmZjJhYWMzQGFvbC5jb20+"},"prevInTopic":22616,"nextInTopic":22632,"prevInTime":22627,"nextInTime":22629,"topicId":22608,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/27/2005 8:19:58 AM Central Standard Time, SandraDodd@aol.com writes: I m 30  years old (however old) and it s no longer okay for you to","messageBody":"<div id=\"ygrps-yiv-1334176340\">In a message dated 6/27/2005 8:19:58 AM Central Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\n&quot;I&#39;m 30  years old&quot; (however <br/>\nold) and it&#39;s no longer okay for you to  say   (whatever they said), and if <br/>\nyou <br/>\nintend to treat me this  way in the future, you&#39;ll have to do it from a <br/>\ndistance, because I don&#39;t  want to (drive/fly however long/far) just to be <br/>\nabused.   <br/>\nI say  &quot;it&#39;s no longer okay&quot; but really it was never  okay.<br/>\n<br/>\n<br/>\n<br/>\n~~~<br/>\n <br/>\nBe careful when you remind your mother of your age.  In an argument  I said, <br/>\n&quot;Mother, I&#39;m 43 years old!&quot; and her reply was, &quot;Then quit  acting like you&#39;re <br/>\n2!&quot;  <br/>\n <br/>\nIt was an open door straight through to the old ways.  :P<br/>\n <br/>\nKaren<br/>\n <br/>\nwww.badchair.net<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":152462241,"authorName":"katherand2003","from":"&quot;katherand2003&quot; &lt;katherand2003@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: new webpages","postDate":"1119910688","msgId":22616,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ5cHR2MCtsMTNrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzZC4xNjAzYTczYS4yZmYxNTZlMEBhb2wuY29tPg=="},"prevInTopic":22613,"nextInTopic":22628,"prevInTime":22615,"nextInTime":22617,"topicId":22608,"numMessagesInTopic":0,"msgSnippet":"... think, even if your parenting is the very same.  Maybe in the future you could plan to try to get together in public places  designed for kids to have fun","messageBody":"<div id=\"ygrps-yiv-892328597\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, SandraDodd@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Staying at ANYone&#39;s house can be stressful after a few days, I <br/>\n </span></blockquote>think, even if your parenting is the very same.  Maybe in the future <br/>\nyou could plan to try to get together in public places  designed for <br/>\nkids to have fun and be loud.   Those have been the best times with <br/>\nmy husband&#39;s parents, when we&#39;re at the children&#39;s museum or <br/>\nminiature golf places.   In our house they&#39;re critical and <br/>\nuncomfortable, and at their house we&#39;re stifled.<br/>\n<br/>\n<br/>\nHey Sandra.  I had this nice point by point reply going and the <br/>\ninternet gulped it... isn&#39;t that typical?  <br/>\n<br/>\nI guess it was a bit disingenious to say it&#39;s a &quot;visit&quot;  to my sil <br/>\nconsidering that me and dh temporarily separated.  We had a lot of <br/>\nnew experiences on top of old hurts and anger to sift though, and so <br/>\nhere I&#39;ve been for over 2 months *pant, pant, gasp, augh* ... a very <br/>\nlong visit indeed.  (Did I tell you I&#39;m going home July 4th <br/>\nweekend... yeah!!!  We&#39;re thrilled.)  <br/>\n<br/>\nThere has been conflict in sil&#39;s mind over my lack of schedule, our <br/>\nparenting differences [which emphasizes the unfairness to the <br/>\ncousins who get spanked, corrected, disrespected, talked to, NOT <br/>\nlistened to, monitored at bedtimes (dusk) and mealtimes (everything <br/>\non their plates gone) ... none which I would ever do with Chenzo, <br/>\nwho&#39;s not quite 2 years old yet anyway].  I&#39;m a very bad example to <br/>\nher children who are well routinized.  We sleep downstairs in the <br/>\nbasement, another floor entirely but the cousins can&#39;t help but <br/>\nnotice we wake up late some days and early other days.  I guess it <br/>\nis disrespectful of me not to protect her children from seeing that <br/>\nthere is a different way-- brainwashing gone awry.  This is not <br/>\nintentional on my part --just the way I am-- but I have wished many <br/>\na time that I had somewhere else to go, for ALL our sakes.<br/>\n<br/>\nWe&#39;re stifled, yes, but -needless to say- this is the last time I&#39;ll <br/>\nbe staying here for this type of &quot;visit.&quot;  I have a friend who has <br/>\nan old dog (15 years old) she doesn&#39;t want to put down even though <br/>\nshe would love to have me there.  I almost went.  She and I are of <br/>\nsimilar minds about most things&gt;  But her dog is old and sick and <br/>\nhates to be left out, and it would be a very unpleasant extremely <br/>\nstressful life not to mention cruel to listen to a crying dog shut <br/>\noff from us in another room during his indefinite last days.  This <br/>\npoor dog is a biter and I couldn&#39;t guarantee Chenzo wouldn&#39;t get <br/>\nhurt since he&#39;s not even 2 years old yet.</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: new webpages","postDate":"1119878368","msgId":22613,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzZC4xNjAzYTczYS4yZmYxNTZlMEBhb2wuY29tPg=="},"prevInTopic":22612,"nextInTopic":22616,"prevInTime":22612,"nextInTime":22614,"topicId":22608,"numMessagesInTopic":0,"msgSnippet":"... Maybe consider writing a follow-up letter saying I m 30 years old (however old) and it s no longer okay for you to say   (whatever they said), and if you","messageBody":"<div id=\"ygrps-yiv-1806077129\">In a message dated 6/27/05 3:06:46 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:katherand2003@...\">katherand2003@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We showed up for<br/>\n&gt; Christmas, Thanksgiving and occasional Mother/Father&#39;s Day and<br/>\n&gt; assorted birthday celebrations.  And we often came home stung by<br/>\n&gt; words we did nothing to invite. <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Maybe consider writing a follow-up letter saying &quot;I&#39;m 30 years old&quot; (however <br/>\nold) and it&#39;s no longer okay for you to say   (whatever they said), and if you <br/>\nintend to treat me this way in the future, you&#39;ll have to do it from a <br/>\ndistance, because I don&#39;t want to (drive/fly however long/far) just to be abused.   <br/>\nI say &quot;it&#39;s no longer okay&quot; but really it was never okay.<br/>\n<br/>\n<br/>\nThat&#39;s what might be worth saying, but *in writing* and keep a copy, so they <br/>\ncan&#39;t claim you said anything different.<br/>\n<br/>\n-=-those who speak against... won&#39;t hear of... my so<br/>\ncalled vain philosophies. -=-<br/>\n<br/>\nThey still don&#39;t want you to think.   They still think they can keep you from <br/>\nthinking by pressure, words, attitude.   What real benefit will there be to <br/>\nyour son if you accept their attempted thought-control?   What will break the <br/>\ncycle if he learns to smile and lie and say &quot;I love you&quot; to people who turn <br/>\naround and smack him (verbally or emotionally, if not physically)?<br/>\n<br/>\n-=-It&#39;s exciting in a way, that we are where<br/>\nwe are, cleaving to one another and forsaking all others-- isn&#39;t<br/>\nthat idea the most romanticalest-=-<br/>\n<br/>\nPretty romantisational.&lt;g&gt;<br/>\n<br/>\nArm yourself gradually with research and articles and experiences.   Don&#39;t <br/>\nargue with them, give them books to read.   Say &quot;If you want to discuss this <br/>\nafter you&#39;ve read this, let me know.&quot;    That means &quot;READ IT OR SHUT UP,&quot; but it <br/>\ndoesn&#39;t quite *sound* that way.    It means &quot;Until you&#39;ve read this, you&#39;re <br/>\nunqualified to have an opinion on it,&quot; but don&#39;t say it that way.<br/>\n<br/>\nIf they ask how long you&#39;re going to coddle him, say &quot;while he needs it,&quot; and <br/>\nif they ask how long you&#39;re going to homeschool, say &quot;as long as it&#39;s working <br/>\nout well for us.&quot;   US.   Not them.<br/>\n<br/>\n-=-I am torn between being without<br/>\nextended family support altogether or being lectured at about the<br/>\nnonexistent dangers of NOT spanking, not formally &quot;schooly&quot; training<br/>\nour children up. -=-<br/>\n<br/>\nAre you going to get the lectures either way?<br/>\nCould you turn it around and start mock-lecturing them about what they should <br/>\nbe doing with their lives until they tell you to stop it, and then say &quot;Oh.   <br/>\nI learned from your behavior that adults are supposed to tell other adults to <br/>\nlive their lives differently.   I&#39;ll stop if you&#39;ll stop.&quot;   (I guess that <br/>\none&#39;s just a fantasy, but the others aren&#39;t.)<br/>\n<br/>\n-=-I now see ultimately that golden quiet (be it 180 from peaceful) is<br/>\nbetter than having discussions or loud flaming disagreements. <br/>\nNobody can tell anybody anything anyway.  For each person and at<br/>\nevery moment, yes, there is potential for epiphany.-=-<br/>\n<br/>\nWhen my mother-in-law (who was a nurse) was irritatingly critical about our <br/>\ndecision not to circumcise, I loaned her three books with sticky-notes on the <br/>\nappropriate passages.   She took them to read, brought them back the next day <br/>\n(they had been RV-camping nearby), set them very NICELY on a table, and said <br/>\nthat things had changed since she went to nursing school.<br/>\n<br/>\nWhen it came to homeschooling, I offered to lend her the books we read before <br/>\nwe made our decision, and she declined. &lt;g&gt;<br/>\n<br/>\n-=- Cenzo is not obedient.  I&#39;m very happy about that. -=-<br/>\n<br/>\nIf he&#39;s not being ordered around, though, how would you know?<br/>\nIf you say &quot;Stop!&quot; a the side of a road or a river, would he stop?<br/>\nIf your mom says &quot;Don&#39;t climb up on my coffeetable, does he do it anyway?   I <br/>\nwouldn&#39;t think that would be something to be happy about.<br/>\n<br/>\n-=- Cenzo is actively<br/>\ntrying to make sense of his spanked cousins behavior.  Of course it<br/>\nmakes no sense.  They hit and loudly say &quot;NO!&quot;  Cenzo does the<br/>\nsame. -=-<br/>\n<br/>\nI&#39;ve broken off friendships with others just because they spanked.   I told a <br/>\nfamily once they could NOT spank their child in my house, when they <br/>\nthreatened.   I don&#39;t want my kids to have to see it; it&#39;s just too disturbing. <br/>\n<br/>\n-=-I am leaving my sil&#39;s house 4th of July weekend when dh comes to<br/>\ntake me home.  Whew.  Can hardly wait to get out of here.  Our visit<br/>\nhas been quite an eye-opener: ie., spanking is contagious and I need<br/>\nto get away from it.  I have swatted Cenzo on about 3 or 4 occasions<br/>\nand been impatient in my dealings with him several times since being<br/>\nhere.  I forgive myself but now that I know the danger of<br/>\nassociating with spankers, I can more easily guard against it.  I&#39;m<br/>\nnot strong enough yet.-=-<br/>\n<br/>\nI used to get hyper vigilant about my kids&#39; behavior when I was in a place <br/>\nwhere the others were over-controlling their own kids and being irritated that <br/>\nmine were there.   I really wanted mine to just not make waves, don&#39;t rock the <br/>\nboat, and I&#39;d be sharp and impatient in those instances, but they always <br/>\nunderstood during the debrief in the car afterward (or wherever) why I was nervous <br/>\nin such situations.   <br/>\n<br/>\nWhen you let Cenzo do something the other kids aren&#39;t allowed to do, you <br/>\nreally mess that family&#39;s dynamics up.   You make them more skittish and nervous <br/>\ntoo.<br/>\n<br/>\nStaying at ANYone&#39;s house can be stressful after a few days, I think, even if <br/>\nyour parenting is the very same.<br/>\n<br/>\nMaybe in the future you could plan to try to get together in public places <br/>\ndesigned for kids to have fun and be loud.   Those have been the best times with <br/>\nmy husband&#39;s parents, when we&#39;re at the children&#39;s museum or miniature golf <br/>\nplaces.   In our house they&#39;re critical and uncomfortable, and at their house <br/>\nwe&#39;re stifled.<br/>\n<br/>\n-=- There<br/>\nis no test, of course, but we want to learn as much as possible<br/>\nabout... well anything we like and to have a happy life.  So<br/>\nthe &quot;rabbi&quot; we&#39;re consulting and conspiring with is the internet,<br/>\nand that will have to do for support and family at the moment.-=-<br/>\n<br/>\nIt&#39;s been very helpful for me to have others to bounce ideas off of, to share <br/>\nnews and to admit frustrations.<br/>\n<br/>\nSandra<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":152462241,"authorName":"katherand2003","from":"&quot;katherand2003&quot; &lt;katherand2003@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: new webpages","postDate":"1119857517","msgId":22612,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ5b2ExZCs2cnY5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE5Yy4zNjFhYmYyNi4yZmVlZDlmZEBhb2wuY29tPg=="},"prevInTopic":22611,"nextInTopic":22613,"prevInTime":22611,"nextInTime":22613,"topicId":22608,"numMessagesInTopic":0,"msgSnippet":"Warning: This is LONG..... And anyway, everyone on this list has probably heard this a million times.  I am just journaling this out, so if you find yourself","messageBody":"<div id=\"ygrps-yiv-1031825326\">Warning: This is LONG..... And anyway, everyone on this list has <br/>\nprobably heard this a million times.  I am just journaling this out, <br/>\nso if you find yourself getting weary, there&#39;s always that delete <br/>\nbutton.  <br/>\n<br/>\nIn a nutshell -- it&#39;s on the no-spank issue.<br/>\n<br/>\nI have not posted much at all, have lurked on this list for several <br/>\nmonths gathering info for dh and me about unschooling among other <br/>\nthings.  It&#39;s the only thing I want to do for my children&#39;s <br/>\nschooling, and as long as they&#39;re happy with it, that&#39;s great.  My <br/>\npersonality fits it to a T.  In the meantime, we (me & dh) strive to <br/>\nunload our baggage.  Ds is not quite 2 and I have one on the way.  <br/>\nAs far as formal whatevers with the so called powersthatbe, we have <br/>\nsome time to play with.  As far as anything else goes... well we <br/>\nhave some time to play with as comes with the territory, but as you <br/>\nhave said, Sandra ... on your huge fun site ... as fast as we can <br/>\nprocess our baggage is as fast as we should go.  I agree.  I hope <br/>\nthat Chenzo (short for Vincenzo) will benefit.<br/>\n<br/>\nSo here I am reading the new links you announced for your website, <br/>\nand getting caught up in your no spank pages ....emailing dh (poor <br/>\nguy) repeatedly with commentaries on your articles.  This is not the <br/>\nfirst time I&#39;ve been on your site.  I&#39;ve visited and lurked there <br/>\nfor 2 or 3 years now, ever since I found I was going to have <br/>\nChenzo.  <br/>\n<br/>\nThere&#39;s a story about talking back, a painful reminder of my own <br/>\nchildhood, in an article on Lying (<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/s/lying)\">http://sandradodd.com/s/lying)</a> -- <br/>\nand the punishment a child may expect as a result.  I concur with <br/>\nthe author&#39;s comment.  I, too, didn&#39;t understand what was meant <br/>\nby &quot;talking back.&quot;  For me this was a double whammy because I have <br/>\nprofound hearing loss.  Naturally I misunderstand LOTS of things.  I <br/>\nlearned to keep my mouth shut so as not to rake up hellfires.  I <br/>\nALWAYS lied when my parents insisted on explanations for my <br/>\nbehavior.  I learned I was ALWAYS wrong (insert sarcasm from me <br/>\nthere) because for one thing the comment often came my way that <br/>\nnobody asked me to &quot;think&quot; (sarcasm I got from a parent).  In hopes <br/>\nof dodging the tongue lashing often followed by other punishments, I <br/>\nhedged and tried not to commit to anything.  Last but not least, I <br/>\ntried to avoid losing family affection.  But this is a permanent <br/>\nfixture of the strained &quot;I love you&#39;s,&quot; mostly referring to times of <br/>\nrelative peace (with my relatives of course).  I learned that in <br/>\nsuch a family I couldn&#39;t win and often wondered what I was doing <br/>\nthere.  This is all very bitter of course.  What else?<br/>\n<br/>\nI say relative peace, because as a no-spank parent, well ... I am <br/>\nfar from being at peace.  I know that love is real even in such <br/>\ncircumstances.  That&#39;s good information to have and a relief to my <br/>\nsoul.  But now I also know love loses it&#39;s flavor when it&#39;s based on <br/>\nconformity and self-protection.  What there is to bridge such a gap <br/>\nwith is a mystery to me.  Once again, I am compelled to keep my <br/>\nmouth shut, love being a curse to conformity.  <br/>\n<br/>\nWe (me and dh) find ourselves unceremoniously and quietly putting on <br/>\nthe shelf family members we can&#39;t leave ds with.  This is an ongoing <br/>\ndiplomatic process that is resulting in a silent stalemate.  And it <br/>\nleaves our burgeoning family out of the context of a larger extended <br/>\nfamily, Chenzo included.  We had hoped to keep the channels open <br/>\nwithout finding ourselves in open &quot;war.&quot;  If only we could stave it <br/>\noff long enough, maybe somebody would come around.  We showed up for <br/>\nChristmas, Thanksgiving and occasional Mother/Father&#39;s Day and <br/>\nassorted birthday celebrations.  And we often came home stung by <br/>\nwords we did nothing to invite.  <br/>\n<br/>\nSo dh has sworn off the loyalty parade.  I can&#39;t say I blame him.  <br/>\nOf course I would dearly love to discuss these issues calmly within <br/>\nand outside family circles but I know better.  There are those who <br/>\nadamantly disagree with no-spank and other of my views, and there <br/>\nare others who only half disagree but want for the sake of family <br/>\npeace to defend those who speak against... won&#39;t hear of... my so <br/>\ncalled vain philosophies.  So there we sit outside the &quot;circle of <br/>\ntrust&quot; and like the Fockers, can&#39;t decide if we&#39;re f**ck&#39;d or if we <br/>\nshould get some &quot;Fockerization&quot; going on (watch &quot;Meet the Focker&#39;s&quot; <br/>\nif you don&#39;t know what I mean-- it&#39;s hiLARious).  Anyway, it looks <br/>\nlike open &quot;war&quot; is upon us, at least from that quarter --my side of <br/>\nthe family.<br/>\n<br/>\nWe (me and dh) have found ourselves at the same fork in the road <br/>\nover and over and over.  It&#39;s exciting in a way, that we are where <br/>\nwe are, cleaving to one another and forsaking all others-- isn&#39;t <br/>\nthat idea the most romanticalest (sorry, another word merge)?  We&#39;re <br/>\nlike Alice in Wonderland in surreality (probably not a real word <br/>\neither but that&#39;s where we&#39;re at).  I am torn between being without <br/>\nextended family support altogether or being lectured at about the <br/>\nnonexistent dangers of NOT spanking, not formally &quot;schooly&quot; training <br/>\nour children up.  <br/>\n<br/>\nI now see ultimately that golden quiet (be it 180 from peaceful) is <br/>\nbetter than having discussions or loud flaming disagreements.  <br/>\nNobody can tell anybody anything anyway.  For each person and at <br/>\nevery moment, yes, there is potential for epiphany.  And so we <br/>\nstruggle with personal baggage and that&#39;s certainly work enough.  <br/>\nGolden quiet means relief from the need to convince others of my no-<br/>\nspank or other points of view.  After all, I&#39;m every bit <br/>\nas &quot;enculturated&quot; as the next person though I diligently wrestle <br/>\nfree of it.  I did not coin that word -enculturated- but it <br/>\ndescribes perfectly what we are going through.  <br/>\n<br/>\nSpeaking of culture, as I ramble onward to dh&#39;s side of the family: <br/>\nwhat culture this is that we&#39;re making, I don&#39;t know, but it looks <br/>\nto be pretty interesting.  Cenzo is not obedient.  I&#39;m very happy <br/>\nabout that.  He&#39;s quite independent in more and more ways than ever <br/>\nbefore.  I actually welcome this.  (Bravo me!)  Cenzo is actively <br/>\ntrying to make sense of his spanked cousins behavior.  Of course it <br/>\nmakes no sense.  They hit and loudly say &quot;NO!&quot;  Cenzo does the <br/>\nsame.  Haha.....  yeah, that&#39;s a no-brainer.  I can&#39;t help but see <br/>\nthat there&#39;s no need to hit any child but the oldest, since spanking <br/>\nworks it&#39;s way to the youngest in unbroken chain from child to child <br/>\n(and from child to pet or object when no person is available), a <br/>\ntransfer of violence downward through the ages.  I am ambivalent for <br/>\nChenzo because though he loves his cousins, he rightly does not <br/>\ntrust them.  <br/>\n<br/>\nI am leaving my sil&#39;s house 4th of July weekend when dh comes to <br/>\ntake me home.  Whew.  Can hardly wait to get out of here.  Our visit <br/>\nhas been quite an eye-opener: ie., spanking is contagious and I need <br/>\nto get away from it.  I have swatted Cenzo on about 3 or 4 occasions <br/>\nand been impatient in my dealings with him several times since being <br/>\nhere.  I forgive myself but now that I know the danger of <br/>\nassociating with spankers, I can more easily guard against it.  I&#39;m <br/>\nnot strong enough yet.  I am sad for the people we leave because <br/>\nthere is NOTHING to be done for them from my standpoint without <br/>\nbrooking interference in my own affairs ... no thank you of course.  <br/>\nThat&#39;s the family on dh&#39;s side.  And yes.  I am writing this on <br/>\nTHEIR computer.  :-/<br/>\n<br/>\nSo here we are without support from extended family.  What to do, <br/>\nwhat to do?  As a telecourse professor said &quot;Get you a rabbi!&quot;  He <br/>\nwas referring to getting a &quot;study buddy&quot; to cram for tests.  There <br/>\nis no test, of course, but we want to learn as much as possible <br/>\nabout... well anything we like and to have a happy life.  So <br/>\nthe &quot;rabbi&quot; we&#39;re consulting and conspiring with is the internet, <br/>\nand that will have to do for support and family at the moment.<br/>\n<br/>\nKathe<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, SandraDodd@a... wrote:<br/>\n&gt; There&#39;s a full list with links of several new webpages here:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/announcements\">http://sandradodd.com/announcements</a><br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] re: new webpages","postDate":"1119802917","msgId":22610,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyQkVENjI1LjgwOTA0MDdAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDExMTk3OTUwMDIuMjEwLjIyMDM3Lm0xOEB5YWhvb2dyb3Vwcy5jb20+","referencesHeader":"PDExMTk3OTUwMDIuMjEwLjIyMDM3Lm0xOEB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":22608,"nextInTopic":22611,"prevInTime":22609,"nextInTime":22611,"topicId":22608,"numMessagesInTopic":0,"msgSnippet":"**cake movies how myths yes we eels** Is eels about really slippery and shocking ideas, or is it actually about eels? (Did your mil serve them for dinner?) ","messageBody":"<div id=\"ygrps-yiv-166616182\">**cake<br/>\nmovies<br/>\nhow<br/>\nmyths<br/>\nyes<br/>\nwe<br/>\neels**<br/>\n<br/>\nIs &quot;eels&quot; about really slippery and shocking ideas, or is it actually <br/>\nabout eels?<br/>\n<br/>\n(Did your mil serve them for dinner?)<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] re: new webpages","postDate":"1119802597","msgId":22611,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ1LjJhZWFhZjFjLjJmZjAyZWU1QGFvbC5jb20+"},"prevInTopic":22610,"nextInTopic":22612,"prevInTime":22610,"nextInTime":22612,"topicId":22608,"numMessagesInTopic":0,"msgSnippet":"... Well I thought it was about fish, but it s kind of about geography, Holly, international fishing, Omaha Beach in Normandy and the internet. [Non-text","messageBody":"<div id=\"ygrps-yiv-383746678\">In a message dated 6/26/05 10:14:23 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ecsamhill@...\">ecsamhill@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Is &quot;eels&quot; about really slippery and shocking ideas, or is it actually<br/>\n&gt; about eels?<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Well I thought it was about fish, but it&#39;s kind of about geography, Holly, <br/>\ninternational fishing, Omaha Beach in Normandy and the internet.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"new webpages","postDate":"1119715325","msgId":22608,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5Yy4zNjFhYmYyNi4yZmVlZDlmZEBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":22610,"prevInTime":22607,"nextInTime":22609,"topicId":22608,"numMessagesInTopic":0,"msgSnippet":"There s a full list with links of several new webpages here: http://sandradodd.com/announcements And I m working on really short, easy to remember names for","messageBody":"<div id=\"ygrps-yiv-897973739\">There&#39;s a full list with links of several new webpages here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/announcements\">http://sandradodd.com/announcements</a><br/>\n<br/>\nAnd I&#39;m working on really short, easy to remember names for pages, and <br/>\nnoticed that the names of this batch sound like a party.   After the SandraDodd.com <br/>\npart they are<br/>\nsex<br/>\ncake<br/>\nmovies<br/>\nhow<br/>\nmyths<br/>\nyes<br/>\nwe<br/>\neels<br/>\n<br/>\nand holt/quotes (not as party-like, but really good for unschoolers!)<br/>\n<br/>\nThe &quot;sex&quot; page is about how I handled boys and internet porn at my house, a <br/>\nquestion that&#39;s come up several times over the years.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":22623,"nextTopicId":22643}}