{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":36888606,"authorName":"Luz Shosie and Ned Vare","from":"Luz Shosie and Ned Vare &lt;nedvare@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:Teaching vs Learning","postDate":"1026146460","msgId":39105,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI5NEYzOEEwLkRFNyVuZWR2YXJlQG50cGx4Lm5ldD4=","inReplyToHeader":"PDEwMjYwNjM2NTcuMTM3Ni4yMzE1MC5tMTFAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":39104,"nextInTime":39106,"topicId":39105,"numMessagesInTopic":0,"msgSnippet":"Group, First Stacy: No, you don t correct spelling for your child, any more than we would correct yours. Writing is what s important. If you correct her","messageBody":"<div id=\"ygrps-yiv-305434908\">Group, <br/>\n<br/>\nFirst Stacy:     <br/>\nNo, you don&#39;t correct spelling for your child, any more than we would<br/>\ncorrect yours. Writing is what&#39;s important. If you correct her spelling, you<br/>\nrisk spoiling it for her, and turning yourself into a &quot;teacher&quot;...heaven<br/>\nforbid. She&#39;ll learn spelling in other ways.<br/>\n<br/>\nOn TEACHING MYSELF:<br/>\n<br/>\nWhen we say, &quot;He&#39;s teaching,&quot; we imply that the person already knows<br/>\nsomething. When we say, &quot;He&#39;s teaching himself,&quot; we describe a situation in<br/>\nwhich the person already knows something, but is also learning it (again?)<br/>\nfrom himself. We create a conundrum -- a riddle inside an enigma. &quot;Is he<br/>\nlearning from himself?&quot; and &quot;Will he give himself a test?&quot;  etc., etc...<br/>\n<br/>\nJohn Holt, in his usual desdain for school teaching, wrote something like,<br/>\n&quot;Just because someone is &quot;teaching&quot; doesn&#39;t mean anyone else is learning.&quot;<br/>\nCould that apply to teaching one&#39;s self?  What fun !<br/>\n<br/>\nFor Josie:    <br/>\nYours is a common problem. You are seeing the results of being in public<br/>\nschool...it takes time to overcome the damage done. From your post, it&#39;s<br/>\nhard to tell how long you&#39;ve been with this list, but if you stick around,<br/>\nI&#39;m sure you will find reasons to continue to trust your kids to be<br/>\nlearning. The key just might be to increase their freedom instead of<br/>\nthinking of ways to regiment them into familiar (but dumb) ways of<br/>\n&quot;learning&quot; such as doing schoolwork.<br/>\n<br/>\nIf one of them wants a curriculum, make him/her BEG for it. Luz adds, &quot;and<br/>\nmake &#39;em pay for it, too.&quot; (long ago, I sent for one for a ten year old. On<br/>\nthe second day, the kid looked up and said, &quot;Dad, this is stupid.&quot; I<br/>\nreplied, &quot;Right. Let&#39;s send it back.&quot; We did. He went out to play --<br/>\npermanently. Today, he&#39;s a thirty-two year old who makes sound tracks for TV<br/>\ncommercials. <br/>\n<br/>\nYou need new ideas. With the money and time you are considering spending on<br/>\na curriculum, why not buy magazine subscriptions or go to museums or<br/>\nfactories or the newspaper office (talk to reporters and editors) or city<br/>\nhall (see how it works/doesn&#39;t) or all learn to sail or ride horses (like<br/>\nroyalty all do -- it&#39;s great survival training). If all else fails, browse<br/>\nthe yellow pages to see what people in the real world are doing.<br/>\n<br/>\nAs the cartoon character Pogo once said, &quot;We are confronted with<br/>\ninsurmountable opportunity.&quot;<br/>\n<br/>\nTo Melissa: <br/>\nYou end with this: &gt;&gt; I cannot imagine bringing myself to<br/>\ntake him there ever again.&lt;&lt;<br/>\n<br/>\nThat&#39;s your bottom line...your conclusion.  It&#39;s risky for anyone to advise<br/>\nyou about raising your child, but that usually doesn&#39;t stop me...<br/>\nYou are the one who&#39;s in charge since your dh is at MIT learning, of all<br/>\nthings, that there is a science to politics. Well, there is a science to<br/>\nbeing a mother, too, and it doesn&#39;t have anything to do with sending the<br/>\nkids to schools for babysitting and being told to sit down and be quiet and<br/>\ncut this and paste that. I also don&#39;t believe that the goal in life is to be<br/>\na  &quot;well informed voter&quot; especially when most schools prepare children<br/>\nmostly for Socialism, not independence. It gets me crazy just thinking about<br/>\nit when your child needs to be climbing trees and playing with one or two<br/>\nfriends.  Keep in touch.<br/>\nLuz and I have a website/page for more...<br/>\nwww.borntoexplore.org/unschool<br/>\n<br/>\nTo Joyce: <br/>\nGreat stuff!<br/>\n<br/>\nTo Liza:<br/>\nThanks, and about READING SIGNS, when my youngest son was very small and I<br/>\ncarried him around town on my shoulders, talking to him, he learned to read<br/>\nthe signs -- all kinds -- from my reading them and, of course, saying them<br/>\nto him. The first I remember was STOP  and GO on the light signals at<br/>\ncrossings. Then BANK and MARKET and, and...  We went into stores and talked<br/>\nto many people. I know it was why he became so verbal at a young age. He now<br/>\nspeaks four languages and is off in Europe (as a graduation from college<br/>\npresent) practicing them every day.<br/>\n<br/>\nTo all: <br/>\nOne more crack: Stay away from anything that calls itself &quot;progressive.&quot;<br/>\n<br/>\nCheers,<br/>\nNed Vare</div>","specialLinks":[]}],"prevTopicId":39100,"nextTopicId":39088}}