{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":11828597,"authorName":"Mary Hickman","from":"&quot;Mary Hickman&quot; &lt;mfhick@...&gt;","profile":"mfhickman95616","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Great topics","postDate":"1023123163","msgId":7453,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY1OGVObDBoNzE4aUROVk42QVcwMDAxNmU5YkBob3RtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":7452,"nextInTime":7454,"topicId":7453,"numMessagesInTopic":0,"msgSnippet":"Hi Sue, Wow, what a great talk about Texas. This last weekend at a group campout Debbie Z. and I were talking about visiting ya all in Texas. Tim s not ready ","messageBody":"<div id=\"ygrps-yiv-1439557855\">Hi Sue,<br/>\n<br/>\nWow, what a great talk about Texas. This last weekend at a group campout <br/>\nDebbie Z. and I were talking about visiting ya&#39;all in Texas. Tim&#39;s not ready <br/>\nfor me to go solo all the way with 3 kids. If Debbie and I go together I <br/>\nthink he&#39;s more likely so say go for it.<br/>\n<br/>\nWe have planned a great not-back-to-school week, complete with a first time <br/>\nairplane trip to Disneyland. The kids have asked for many years to go and <br/>\nnow we will. Ashley will be almost 8, Riley 5 , Tessa nearing 3. Seems <br/>\ndoable finally.<br/>\n<br/>\nI&#39;m wondering about this school idea Ashley has proposed. I&#39;m wondering if <br/>\nshe asked for a piano teacher I would jump up and get her one. If she asked <br/>\nto try rockclimbing, we would pursue that. Now she is asking for a chance to <br/>\nsee what school is like from the inside. She knows what unschooling is like <br/>\nfrom the inside. She tries to share with her friends that it is like summer <br/>\nvacation all the time. Or like Saturday and Sunday everyday. Part of me is <br/>\ngame for trying school in that she will then know from experience just what <br/>\nit is like to sit still, raise her hand, be burdened with homework, miss <br/>\ngoing to great places with the rest of us, reduce her other activities to <br/>\naccomodate schooltime.<br/>\n<br/>\nThe other part of me, who knows my daughter really well, feels she may enjoy <br/>\nschool alot. She may not find it a negative place without freedom. She is <br/>\nstructured, enjoys adult role models, thrives in doing her best. She likes <br/>\nto play test and asks for spelling words, or quiz me about my knowledge. She <br/>\nenjoys filling out pages, buys workbooks with her allowance. She may feel I <br/>\nneed to give her more structure here at home. I would rather be her mom than <br/>\ntake on a school at home approach. She has been unschooled since I thought <br/>\nabout her education in utero. I wonder will she come back home? Will she be <br/>\nnegatively affected from the experience? Will she be swallowed up by her <br/>\npeers? Will she increase her dislike for her brother? These are my initial <br/>\nquestions. Will I like dealing with a teacher telling me the strengths and <br/>\nweaknesses of my child. Will I miss her all day?<br/>\n<br/>\nI love the discussion about spirituality and unschooling. Keep writing <br/>\nplease.<br/>\n<br/>\nDeb L. I copied you piece about children and their behavior. I thought hard <br/>\nabout my family. Why do my children get me so frustrated that I have bad <br/>\nbehavior? How can I be more gentle on myself. When I put blinders up to <br/>\nsocieties expectations I do so much better loving my children actively. When <br/>\nI worry about how they appear, I do things that are not in the kids best <br/>\ninterest.<br/>\n<br/>\nAs most of you know already, my kids can be pretty hard on eachother. We <br/>\nhave had a rough 2 years learning about respect and feelings and trying out <br/>\nways to calm down before some one losses it. I am sometimes envious of <br/>\nsingle child families. To be completely one-on-one most of the time, to <br/>\nnever insist on a young child to be quiet while a baby nurses to sleep, <br/>\nevery day for 2 plus years. To be able to be hands on most of the time, <br/>\nenjoying what that one person is into. My first 2 kids are like night and <br/>\nday. What one is into the other is not. I get exhausted trying to meet their <br/>\nunique needs.<br/>\n<br/>\nTalk to you all soon,<br/>\n<br/>\nMary<br/>\n<br/>\n_________________________________________________________________<br/>\nMSN Photos is the easiest way to share and print your photos: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://photos.msn.com/support/worldwide.aspx\">http://photos.msn.com/support/worldwide.aspx</a></div>","specialLinks":[]}],"prevTopicId":7412,"nextTopicId":7454}}