{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":94040812,"authorName":"Lisa H","from":"&quot;Lisa H&quot; &lt;Lmanathome@...&gt;","profile":"lmanathome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Unschooling Camping Trip in NY","postDate":"1154577211","msgId":26532,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTExNS1EQVYzNUI0OUMxQTM5OEZBQTc3QzczRENEMTUzMEBwaHguZ2JsPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":26531,"nextInTime":26533,"topicId":26532,"numMessagesInTopic":0,"msgSnippet":"For those that can t make the Live and Learn Conference (boo hoo) and still want to hang with unschoolers - though it wouldn t be in a formal conference type","messageBody":"<div id=\"ygrps-yiv-303785701\">For those that can&#39;t make the Live and Learn Conference (boo hoo) and still want to hang with unschoolers - though it wouldn&#39;t be in a formal conference type setting and definitely not in a hotel : )<br/>\n<br/>\nUnschooling Gathering - Camping on Long Island<br/>\n<br/>\n <br/>\n<br/>\nSeveral unschooling families will be camping at Heckscher State Park&#39;s camp ground on Long Island, NY, from August 26th through September 4th this summer and would welcome other unschoolers joining the group for all or part of that time.  There are still many sites available.  We&#39;ve done this in past years and it&#39;s always nice to have other families coming and going throughout the week.<br/>\n<br/>\n<br/>\n<br/>\nHeckscher State Park is a short car ride away from Long Island&#39;s barrier island ocean beaches.  The park itself offers great bike trails, a bay beach, fishing, clamming, crabbing, boat ramp into Great South Bay (great for Kayaking and canoeing) and a huge swimming pool along with playground, basketball courts, etc - all within the park.  While the park is huge, the campground itself is shaded and simple as state parks tend to be, however, it does have a decent bathhouse.  The small campground office puts on a family video in the evenings and we&#39;ve sometimes brought our own movie which the park ranger was willing to use.<br/>\n<br/>\n<br/>\n<br/>\nIn the past, while camping at the park, we have done many great day trip adventures to different Fire Island ocean beaches.  It&#39;s a short 20 minute drive to Robert Moses and Fire Island Ferries nearby.  Sunken Forest/Sailors Haven on Fire Island has a nature center, nature trials and kids programs throughout the week.  The Light house at Robert Moses also has a museum tour and boardwalk trail over the dunes.  <br/>\n<br/>\n <br/>\n<br/>\nThere is easy grocery shopping within 10 minutes from the park and a great farm stand and health food store in Sayville less than 20 minutes away.  Also - being on Long Island - you have  all the &#39;benefits&#39; of suburban amenities you can imagine within a 20 minute radius.  We&#39;ve spent rainy days at laundry mats and Barnes & Noble or nearby movie theaters if needed - I think there is a local roller rink - though we&#39;ve never gone.  One year we ventured to the big water park further out on long island.  Our family usually spends one day of the camping trip driving out to Montauk early in the morning and returning to the campground late at night.  <br/>\n<br/>\n <br/>\n<br/>\nIn the past we&#39;ve kept it pretty flexible and loose, not doing too much planning so that families and individuals can follow their own needs while providing a great group experience.  This camping trip is organized in such a fashion that being together doesn&#39;t mean anyone is obligated to follow anyone else&#39;s agenda or schedule, however, there is always a lot of overlap, shared meals, shared bike trips, beach trips, pool trips, etc.  If we&#39;re a large group, we try not to complicate the trip by expecting or planning an entire group to do the same thing each day throughout the week.  Though group outings are great!<br/>\n<br/>\n <br/>\n<br/>\nIf you want more information or details please feel free to contact me directly.  And feel free to spread the word to other unschoolers/unschooling lists.  <br/>\n<br/>\n <br/>\n<br/>\nLisa Heyman<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Lmanathome@...\">Lmanathome@...</a><br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":26507,"nextTopicId":26499}}