{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Passionate Ramblings","postDate":"1074614562","msgId":18204,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM0LjM2ZmFkM2MuMmQzZWFiMjJAYW9sLmNvbT4="},"prevInTopic":18159,"nextInTopic":0,"prevInTime":18203,"nextInTime":18205,"topicId":18142,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/19/04 8:37:56 PM, KAMES97@ADELPHIA.NET writes: ","messageBody":"<div id=\"ygrps-yiv-2061223792\">In a message dated 1/19/04 8:37:56 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:KAMES97@...\">KAMES97@...</a> writes:<br/>\n<br/>\n&lt;&lt;  Since last week, I have had 3 in depth conversations with <br/>\n<br/>\nmy 10 year old that have told me things about him I never knew.  He <br/>\n<br/>\ncan hold conversations like a 30 year old.  I think all children are <br/>\n<br/>\nwise beyond their years so to speak and the only reason most people <br/>\n<br/>\ndon&#39;t know that about their children is that the kids are afraid to <br/>\n<br/>\nlet it out.  &gt;&gt;<br/>\n<br/>\nMaybe you&#39;ve found this already, but one of my favorite ideas and essays is <br/>\n&quot;Leaning on a Truck,&quot; about how easy it is to talk if you&#39;re not making eye <br/>\ncontact and &quot;having a talk.&quot;<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/truck\">http://sandradodd.com/truck</a><br/>\n<br/>\n<br/>\n<br/>\n-=I will take this day by and day and try to just &quot;shut up and <br/>\n<br/>\nlisten&quot;. -=-<br/>\n<br/>\nIt might help for you to tell them stories about when you were their age, or <br/>\nabout things you used to think were true or might be possible, and what you <br/>\nthink about them now.    Those things seem to always turn into good <br/>\nconversations here.<br/>\n<br/>\n&lt;&lt;Thank you all for listening to my passionate ramblings. &gt;&gt;<br/>\n<br/>\nIt was mushy (but sweet &lt;g&gt;) reading.   <br/>\nThank you for writing it and sharing it here!<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":137100818,"authorName":"Jason & Stephanie","from":"&quot;Jason & Stephanie&quot; &lt;thesixofus@...&gt;","profile":"mom_to_kbcj","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Passionate Ramblings","postDate":"1074573065","msgId":18159,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTUwMWMzZGYwZSQzODU3N2RlMCRhMDQ3YTQ0MUBuZXQ+","referencesHeader":"PGJ1aDEwMStiNDNkQGVHcm91cHMuY29tPg=="},"prevInTopic":18142,"nextInTopic":18204,"prevInTime":18158,"nextInTime":18160,"topicId":18142,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1450183124\">&lt;&lt;&lt;&lt;My name is Kathy and I am the mom to James 10, Jacob 5, and Joshua <br/>\n3.  We live in Western NY near Niagara Falls.  We started <br/>\nhomeschooling in November of this past year out of necessity.&gt;&gt;&gt;&gt;<br/>\n<br/>\n********Hi Kathy,<br/>\nMy dh and I are from western NY, Lockport and Wilson, we live in PA now but try to get up there several times a year for holidays and visit with our families.  Congratulations on the decision to keep your kids at home. <br/>\nStephanie<br/>\nKieran(8) Brennan(5 1/2) Cassandra(4) Jared(18months)<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":165774158,"authorName":"kames97","from":"&quot;kames97&quot; &lt;KAMES97@...&gt;","profile":"kames97","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Passionate Ramblings","postDate":"1074530113","msgId":18142,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJ1aDEwMStiNDNkQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":18159,"prevInTime":18141,"nextInTime":18143,"topicId":18142,"numMessagesInTopic":0,"msgSnippet":"My name is Kathy and I am the mom to James 10, Jacob 5, and Joshua 3.  We live in Western NY near Niagara Falls.  We started homeschooling in November of this","messageBody":"<div id=\"ygrps-yiv-1187549725\">My name is Kathy and I am the mom to James 10, Jacob 5, and Joshua <br/>\n3.  We live in Western NY near Niagara Falls.  We started <br/>\nhomeschooling in November of this past year out of necessity.  I <br/>\nquickly bought a curriculum and &quot;did school&quot;  for the first month.  <br/>\nAfter second guessing our decision, I did some poking around into <br/>\nunschooling and viola, I found my home.  After an email to Sandra <br/>\nDodd (thanks Sandra) I decided that this way of life was for us.  I <br/>\nam now at peace with my decision to unschool because it just makes <br/>\nsense.  I immediately bought learning all the time and the day I got <br/>\nit, sat on the couch curled up as if I was in the midst of a great <br/>\nnovel.  I read that book cover to cover and that book lit a fire <br/>\ninside me with such passion that I have never known.  And I am a <br/>\npassionate person... <br/>\n<br/>\nI found this group through Sandra and have been pouring over the <br/>\nthreads to find comfort in my decision.  I dare not tell a soul (or <br/>\nat least that is how I feel) because I do not want to argue my <br/>\ndecision.  Most people can&#39;t even imagine letting go of their <br/>\nchildren and &quot;trusting them&quot;?  Most people I know don&#39;t trust their <br/>\nchildren, they see them as people who do whatever it takes to get <br/>\ntheir way.  I can&#39;t say I ever really distrusted my boys, but I <br/>\nalways felt as if I knew what was best for them.  I now know that <br/>\nwhile I do know some things about &quot;life&quot; that they don&#39;t know, and <br/>\nmy experiences will help to keep them safe, they ultimately know <br/>\nwhat they want and need and I trust that due to their natural <br/>\ncuriosity, they will be poking around for a lifetime.  <br/>\n<br/>\nSince my decision, I have felt the insatiable desire to &quot;get to know <br/>\nmy kids&quot;.  Not to say that I don&#39;t know them already, but a lot of <br/>\ntimes I know they tell me what they think I want to hear.  Just as <br/>\nthey did in school to the teacher.  I have tried to wipe our slate <br/>\nclean and let them feel safe to tell me what they think I don&#39;t want <br/>\nto hear.  Since last week, I have had 3 in depth conversations with <br/>\nmy 10 year old that have told me things about him I never knew.  He <br/>\ncan hold conversations like a 30 year old.  I think all children are <br/>\nwise beyond their years so to speak and the only reason most people <br/>\ndon&#39;t know that about their children is that the kids are afraid to <br/>\nlet it out.  Afraid of the judgment that will meet them.  Children <br/>\nlearn it is easier to say nothing than to constantly be told why <br/>\nthey shouldn&#39;t feel, think, or act a certain way.  <br/>\n<br/>\nI will take this day by and day and try to just &quot;shut up and <br/>\nlisten&quot;.  Shut up and listen to the pitter patter of running, the <br/>\nlaughter, the amazement in their eyes when they accomplish something <br/>\non their own, the joy in their hearts after telling me all about <br/>\nsomething that they feel real passionately about. Just as I would <br/>\nlike that someone would listen to me when I feel passionately about <br/>\nsomething.  Our passion, although different are ultimately the same <br/>\nemotion, not stronger because I am an adult, but the same emotion.  <br/>\nTheirs is not to be undervalued for their age or size.  I will stop <br/>\nmyself from always butting in their sibling disagreements with the <br/>\ntrust that they will somehow figure out how to keep the peace <br/>\nthemselves and when they do, will feel satisfied that they did it on <br/>\ntheir own.  I will work hard every day to not correct them when <br/>\ntheir counting is not in the order I would count in, or when they <br/>\ntell me that it is hot when I know it is cold, or blue when I know <br/>\nit is black.  I will trust that they will figure it out for <br/>\nthemselves eventually.  I will trust that if they are spending all <br/>\nday on a particular game that tomorrow they may or may not do it <br/>\nagain, but they will have a lot to tell me about regardless.  <br/>\n<br/>\nWhile it won&#39;t be an easy task for me, the somewhat controlling, <br/>\nalways involved mother that I have been for the past 10 years <br/>\nbecause that is what I thought I was &quot;supposed&quot; to be doing.  I feel <br/>\nthat it is a worthwhile achievement to work towards everyday so <br/>\nsomeday when my kids are grow up and moved on to families of their <br/>\nown they will look back and say &quot;No, my mom didn&#39;t tell us what to <br/>\ndo, when to do it, where to do it, whom to do it with, she never <br/>\ninterfered with our hopes and dreams, but she was always there.<br/>\nAlways opening the door for us and trusting that we would find on <br/>\nthe other side of the door something amazing or not.  And that was <br/>\nokay with her&quot;!<br/>\n<br/>\nOne of my dear friends who has 14 and 19 year old boys got the best <br/>\nChristmas gift that anyone could have given her this year.  It <br/>\nsomething you can&#39;t buy, because it is priceless.  Each in their own <br/>\nway wrote down why &quot;my mom&quot; is the best.  The 14 year old did the <br/>\ntop 10 reasons why my mom is the best and the 19 year old did the <br/>\nABC&#39;s of my mom.  Both were equally touching and after she finished <br/>\nreading them to me, I admit that I had to reach for the box of <br/>\ntissues.  I believe I was crying because I wasn&#39;t sure up to this <br/>\npoint that my children could possibly say any of those great things <br/>\nabout me.   I decided that someday I hope that my children would <br/>\nhave these feelings about me and their childhood and want me to <br/>\nknow.  So I decided what I wanted them to write about me when they <br/>\nare older and now I am going to work hard to make sure they can.  <br/>\n<br/>\nThank you all for listening to my passionate ramblings.  Have a <br/>\ngreat day!<br/>\n<br/>\nP.S.  I would especially appreciate any contact from anyone in this <br/>\narea that I could do things with.  I belong to the area <br/>\nhomeschoolers but don&#39;t find their are many unschoolers there.  <br/>\nAlthough that may not be the case.</div>","specialLinks":[]}],"prevTopicId":18199,"nextTopicId":15444}}