{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":39372215,"authorName":"cinward2001","from":"&quot;cinward2001&quot; &lt;cward@...&gt;","profile":"cinward2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"transcripts (was Re: Digest Number 4582)","postDate":"1082297930","msgId":92815,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM1dTJvYSs3cGFqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGM1dDQ2YStsOWZwQGVHcm91cHMuY29tPg=="},"prevInTopic":92809,"nextInTopic":0,"prevInTime":92814,"nextInTime":92816,"topicId":92671,"numMessagesInTopic":0,"msgSnippet":"... at ... If it s taking multiple attempts to teach your daughter why she shouldn t touch the stove when you re cooking, something is seriously wrong.  If","messageBody":"<div id=\"ygrps-yiv-2001057429\"><blockquote><span title=\"ireply\">&gt;I am not going to stop trying to teach her <br/>\n&gt; why she should not touch the stove when I am cooking just because <br/>\n </span></blockquote>at <br/>\n<blockquote><span title=\"ireply\"> &gt; that moment she does not want to hear it! <br/>\n<br/>\n </span></blockquote>If it&#39;s taking multiple attempts to &quot;teach&quot; your daughter why she <br/>\nshouldn&#39;t touch the stove when you&#39;re cooking, something is seriously <br/>\nwrong.  If your daughter has no interest in the stove (you say she <br/>\ndoes not want to hear it!), then there&#39;s no need to be &quot;teaching&quot; her <br/>\nanything at that moment in time.  If she HAS shown an interest in <br/>\ntouching the stove, then let her be near enough to feel the heat.  No <br/>\nhealthy child is going to do more than that, so there&#39;s no need <br/>\nto &quot;teach&quot; or lecture.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I am sure there are many more good then bad unschoolers. Again, I <br/>\n&gt; just think extreme is bad. I do not think unschooling in itself is <br/>\n&gt; bad. Just those that say it must be their way or no way. Thus many <br/>\n&gt; have left this group to look for a more eclectic and free thinking <br/>\n&gt; way of unschooling. They do unschool in the sence that they do not <br/>\n&gt; push the classes of schooling and the bad things (Bad things <br/>\n&gt; including those things found in the book dumbing us down and other <br/>\n&gt; anti school books like it) and they still call them selves <br/>\n&gt; unschoolers. And I think they are, but they are doing it in the way <br/>\n&gt; that works best for them and their children. <br/>\n<br/>\n<br/>\n </span></blockquote>Using an example of how something is done poorly is not an excuse to <br/>\nthen do it poorly yourself.  Your friend was not an unschooler.  I&#39;ll <br/>\nagree that there are &quot;degrees&quot; of unschooling in the sense that some <br/>\nfamilies are &quot;further along the journey.&quot; But spanking is not <br/>\nunschooling, forcing learning of any kind is not unschooling.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Yes Stupid. I think any parent not willing to look at their childs <br/>\n&gt; learning and grade them on it for the betterment of the education <br/>\n </span></blockquote>the <br/>\n<blockquote><span title=\"ireply\"> &gt; child wishes to have is being stupid. At 18 I think you and your <br/>\n&gt; child would be ready to get real and take the tests needed. Do you <br/>\n&gt; think you can stop them from having test in college? I do not think <br/>\n&gt; so. And some colleges WILL NOT accept you without transcripts. <br/>\n<br/>\n </span></blockquote>Oy.  So much UN-unschooling thought in one paragraph. :(  The <br/>\nemphasis here is on the parent, isn&#39;t it?  Why should the parent need <br/>\nto grade the child&#39;s education?  If the child chooses to go to <br/>\ncollege, the child will find a way.  She&#39;ll ask her parent to help <br/>\ncreate a transcript, or she&#39;ll decide to go take a test taking <br/>\ncourse, or read books on being a better test-taker.  She&#39;ll take <br/>\ncommunity college courses or find an on-line course.  There are many, <br/>\nmany options.  And the phrase &quot;get real?!&quot;  The implication is that <br/>\nspending 18 yrs unschooling is not &quot;real,&quot; that 18, it&#39;s time to &quot;get <br/>\nreal.&quot; Unschooling is as &quot;real&quot; as it gets.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt;  I do not think grading my child and creating a transcript would be <br/>\n&gt; damaging to my integrity. I am a realist, and my daughter will know <br/>\n&gt; that we are flexable about things we are not able to change. If <br/>\n </span></blockquote>they <br/>\n<blockquote><span title=\"ireply\"> &gt; want transcripts, we will make it happen for her, even if she needs <br/>\n&gt; to be tested and go over all she has learned to grade herself <br/>\n </span></blockquote>fairly. <br/>\n <br/>\nGood grief.  Again, it&#39;s about what YOU will do.  YOU are a realist.  <br/>\nYou&#39;ve already decided what things can be changed and what can&#39;t.  <br/>\nYou state that &quot;We will make it happen.&quot;  There are a LOT of <br/>\nassumptions in that paragraph.  As an unschooler, my thoughts are <br/>\nthat IF my boys decide to go to college one day, THEY will decide on <br/>\nwhat&#39;s necessary, or needed...I&#39;ll be there to help, IF they want it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I am not talking about testing a child, I am talking about testing <br/>\n </span></blockquote>a <br/>\n<blockquote><span title=\"ireply\"> &gt; young adult getting ready to go out into the world. Like age 16ish!<br/>\n<br/>\n </span></blockquote>Then that young adult is old enough to make her own decisions (not to <br/>\nimply that younger children aren&#39;t...my boys make their own decisions <br/>\nnow). Why try to make that decision for her now? <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I am one of those people that can say I shall do something and <br/>\n </span></blockquote>more <br/>\n<blockquote><span title=\"ireply\"> &gt; then likely I will do it. <br/>\n<br/>\n </span></blockquote>The problem here is that you&#39;re planning what YOU SHALL do with and <br/>\nfor your daughter, when it should be what SHE will do.  It&#39;s not YOUR <br/>\nlife...it&#39;s HER life.  Trust her to make her own decisions.  Yes, <br/>\nyou&#39;re there to help her and support her, but it is so unfair of you <br/>\nto plan her life for her.  She may decide to become the lead <br/>\nguitarist in a rock band, or build a small cabin in the woods <br/>\nsomewhere and become a happy hermit, but you&#39;ve already decided that <br/>\nto be happy, she has to be USEFUL, and that to be successful, she has <br/>\nto be a good test taker. :(  Let HER decide what happy and useful <br/>\nwill be in HER life.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; I think some advice should be taken here. <br/>\n&gt; Picture my voice as your best friend and I am telling you I think <br/>\n&gt; your not being smart about this! Picture me saying that I think it <br/>\n </span></blockquote>is <br/>\n<blockquote><span title=\"ireply\"> &gt; better to change when needed a little then to fight the system that <br/>\n&gt; shall not change for you but could very well make your child very <br/>\n&gt; happy. <br/>\n<br/>\n </span></blockquote>Egads.  You have a 4 yr. old and you&#39;re posting to women that have <br/>\nyoung adults and teenagers that have been unschooled...and those <br/>\nyoung adults and teenagers are healthy and HAPPY!  Again, YOU&#39;VE made <br/>\ndecisions about a system that you perceive.  Let your daughter grow <br/>\nup to make her own decisions about &quot;the system.&quot;  It&#39;s not up to THE <br/>\nSYSTEM to make your child happy...or YOU! It&#39;s up to her.  And the <br/>\nbest way to help her on that journey is to give her freedom.  <br/>\n<br/>\nCindy</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] transcripts (was Re: Digest Number\t4582)","postDate":"1082288585","msgId":92809,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJDQTdFMjA5LjI1RkYxJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGM1dDQ2YStsOWZwQGVHcm91cHMuY29tPg=="},"prevInTopic":92808,"nextInTopic":92815,"prevInTime":92808,"nextInTime":92810,"topicId":92671,"numMessagesInTopic":0,"msgSnippet":"... I think it would help for you to read a lot more about what unschoolers actually do before reprimanding a list full of people for what you think they may","messageBody":"<div id=\"ygrps-yiv-394010270\">on 4/18/04 1:37 AM, Kimberly at kontessa_rose@... wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Parents would teach their children what they thought they<br/>\n&gt; needed to know to be a useful.<br/>\n<br/>\n </span></blockquote>I think it would help for you to read a lot more about what unschoolers<br/>\nactually do before reprimanding a list full of people for what you think<br/>\nthey may be doing.<br/>\n<br/>\nIt isn&#39;t fair for you to reprimand 1500 people for how your friend is living<br/>\nher life, what she&#39;s doing with her kids and what she&#39;s calling herself.<br/>\nAnyone can call herself an unschooler.<br/>\n<br/>\nUnschooling children learn by doing, by living, by observation, by asking<br/>\nquestions, by being interested, by being with us and by us being with them.<br/>\nIt&#39;s the way adults learn on their own. It&#39;s the same way children learned<br/>\nto speak. We didn&#39;t need to teach them. We made language available by<br/>\ntalking to them about what interested them and what might interest them and<br/>\nanswering their questions. They used English to get what they wanted and got<br/>\nbetter as a side effect. That&#39;s how learning works.<br/>\n<br/>\nThe best place to start is John Holt. Then the message boards at<br/>\nUnschooling.com (Http://www.unschooling.com) and Sandra&#39;s site<br/>\n(http://sandradodd.com)<br/>\n<br/>\nUnschooling is not unparenting. Unschooling is not neglect. We removed<br/>\nschool and replace it with something else. You need to read more about<br/>\nunschooling to find out what we&#39;ve replaced school with. It isn&#39;t easy for<br/>\nmany people to get. It takes a lot of reading, patience and respectful<br/>\nquestioning.<br/>\n<br/>\nYou will get more helpful answers if you ask how people are doing something<br/>\nthat concerns you rather than reprimanding them for what you think they&#39;re<br/>\ndoing or not doing.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I do not know a culture that did not<br/>\n&gt; ask that children do something to help the family such as chores,<br/>\n&gt; watching the younger one. They needed to told how to do much of it I<br/>\n&gt; think, or maybe showed closer to what I am trying to say.<br/>\n<br/>\n </span></blockquote>My daughter lives with me. She sees me doing things. I ask if she&#39;d like to<br/>\nhelp. She asks if she can help. I don&#39;t need to make her do chores for her<br/>\nto learn. She knows how to do basic tasks around the house and some cooking.<br/>\nI&#39;ve replaced &quot;making&quot; with something else. Please do read, ask questions<br/>\nand find out what that is.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think it is a negative thing for a parent to not present a child<br/>\n&gt; with what they think they should know. Like manners, and morals. At 4<br/>\n&gt; years old I can and feel I should teach my daughter these things.<br/>\n<br/>\n </span></blockquote>Rather than assuming we aren&#39;t passing on social skills, please do ask how<br/>\nunschoolers do it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am not going to stop trying to teach her<br/>\n&gt; why she should not touch the stove when I am cooking just because at<br/>\n&gt; that moment she does not want to hear it!<br/>\n<br/>\n </span></blockquote>And an unschooler would know that her child is learning all the time. I<br/>\ndidn&#39;t need to teach my daughter the stove was hot. At some point I probably<br/>\nstopped her from getting burned or said &quot;Careful, it&#39;s hot.&quot; I may have held<br/>\nmy hand near the stove to show her how to feel how hot it was. It only takes<br/>\na moment to learn a stove is hot!<br/>\n<br/>\nAfter that it would be my responsibility to keep her safe because even<br/>\nthough she had the knowledge that the stove was hot and could burn her, she<br/>\nmight not have the body awareness of how close she was. I don&#39;t remember her<br/>\n*not* being aware, but it would still be my responsibility to be aware for<br/>\nher to move her if she got too close or remind her the stove was hot.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Ok, lets talk about it. I have a friend with three kids.<br/>\n<br/>\n </span></blockquote>It&#39;s more useful to talk unschooling as defined on this list. There are no<br/>\nofficial membership cards that identify someone a certified unschooler. (Or<br/>\nvegetarian. Or Episcopalian. Or environmentalist.) Anyone can call herself<br/>\nan unschooler. That doesn&#39;t mean she knows what it is.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am sure there are many more good then bad unschoolers.<br/>\n<br/>\n </span></blockquote>And there are many people who call themselves unschoolers who don&#39;t<br/>\nunderstand the concept. It&#39;s more than not doing school. Not doing school is<br/>\nthe beginning point. It needs to be replaced with something else, not left<br/>\nas a blank spot in kids lives.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; They do unschool in the sence that they do not<br/>\n&gt; push the classes of schooling and the bad things (Bad things<br/>\n&gt; including those things found in the book dumbing us down and other<br/>\n&gt; anti school books like it) and they still call them selves<br/>\n&gt; unschoolers. And I think they are, but they are doing it in the way<br/>\n&gt; that works best for them and their children.<br/>\n<br/>\n </span></blockquote>You will learn more about unschooling by asking us questions about how we<br/>\nunschool and how we define unschooling than by telling us what unschooling<br/>\nis.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I never said unschooling is extreme,<br/>\n&gt; just that in all groups there are extreme people who take things to<br/>\n&gt; an extreme level.<br/>\n<br/>\n </span></blockquote>Some mothers smack their kids. Some mothers lock their kids in closets.<br/>\n<br/>\nI presume you call yourself a mother.<br/>\n<br/>\nShould the extremes who use a word define what a word means? Should they<br/>\neven be included in the definition?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Yes Stupid. I think any parent not willing to look at their childs<br/>\n&gt; learning and grade them on it for the betterment of the education the<br/>\n&gt; child wishes to have is being stupid.<br/>\n<br/>\n </span></blockquote>*If* the only way to get into college were to create a list of courses with<br/>\nletter grades, it would be foolish not to.<br/>\n<br/>\nMost college understand about homeschooling. Many even understand about<br/>\nunschooling.<br/>\n<br/>\nWhat would be stupid, would be to assume I already know enough about getting<br/>\nan unschooled child into a college from my knowledge of how schooled kids<br/>\nget into college. If my daughter were getting close, I&#39;d start reading<br/>\neverything I could about how homeschoolers and unschoolers get into college.<br/>\n<br/>\nYou&#39;re calling people on this list who *have* read about how unschoolers get<br/>\ninto colleges, who *have8 kids who have gotten into college without standard<br/>\nschool transcripts stupid when apparently you are the one who hasn&#39;t read<br/>\nanything beyond the standard information and don&#39;t know anything beyond what<br/>\nyou think you know.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Do you <br/>\n&gt; think you can stop them from having test in college?<br/>\n<br/>\n </span></blockquote>Have you read anything about how unschoolers have responded to college? Or<br/>\nare you just guessing and then telling us your guesses to &quot;enlighten&quot; us?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And some colleges WILL NOT accept you without transcripts.<br/>\n<br/>\n </span></blockquote>Have you read about unschoolers who have gotten into colleges?<br/>\n<br/>\nHave you read about people changing the system? Schools are really good at<br/>\nteaching people to accept things the way they are. To sit down, shut up and<br/>\ndo what the authorities tell them is best.<br/>\n<br/>\nIf someone is determined to get into a college there are ways. You&#39;ll learn<br/>\nmore by asking people who&#39;ve done it than by telling people what you think<br/>\nis true.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If they <br/>\n&gt; want transcripts, we will make it happen for her, even if she needs<br/>\n&gt; to be tested and go over all she has learned to grade herself fairly.<br/>\n<br/>\n </span></blockquote>This list is about unschooling. If you want to know what unschoolers do, how<br/>\nunschoolers get into college, then please ask.<br/>\n<br/>\nThere are plenty of places for people to find out how to do things the<br/>\nstandard way. There are plenty of places for people to trade ignorances and<br/>\nmake things up to soothe their fears.<br/>\n<br/>\nBut that&#39;s not what people signed onto *this* list for. They signed on to<br/>\nfind out how unschoolers approach life.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Since when is life about being happy?<br/>\n<br/>\n </span></blockquote>Life is what we choose to make it. Is there a law against life being about<br/>\nbeing happy? Will you get arrested? Will you be fined?<br/>\n<br/>\nSo who is stopping you from making life about being happy?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Life is not about being happy,<br/>\n&gt; not that I have ever learned.<br/>\n<br/>\n </span></blockquote>People can learn new things their whole lives. It doesn&#39;t stop when school<br/>\nstops. That would be one of the basic things an unschooling parent should<br/>\nunderstand before starting unschooling.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Life is about being useful, about being<br/>\n&gt; a good person, about makeing life woth something.<br/>\n<br/>\n </span></blockquote>That&#39;s called a philosophy of life. It isn&#39;t everyone&#39;s philosophy.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Happy comes with being useful.<br/>\n<br/>\n </span></blockquote>That&#39;s one path to happiness.<br/>\n<br/>\nThere are many paths to happiness and we can take them all :-) Happiness can<br/>\ncome from doing something useful. It can come from helping people. It can<br/>\ncome from doing something you enjoy. It can come from learning something. It<br/>\ncan come from being in someone&#39;s company. We don&#39;t have to pick just one!<br/>\n<br/>\nIf you&#39;re choosing to make life about being useful, that&#39;s your choice. But<br/>\nit doesn&#39;t make sense to tell people life can&#39;t be about being happy because<br/>\nit can.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My child is so happy to help, she does not see work as<br/>\n&gt; something negative or as something she must do before she can have<br/>\n&gt; fun. Work, learning, playing, are all part of her learning and to<br/>\n&gt; her, all fun! That in itself helps me think we are doing something<br/>\n&gt; right.<br/>\n<br/>\n </span></blockquote>If you were to read the list (and the message board and Sandra&#39;s site) you&#39;d<br/>\nread similar things.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am not talking about testing a child, I am talking about testing a<br/>\n&gt; young adult getting ready to go out into the world. Like age 16ish!<br/>\n<br/>\n </span></blockquote>Have you had a 16 yo ready to go out into the world? There are people on<br/>\nthis list who have had real 16 yos going out into the real world. You could<br/>\nask how they did it and how it turned out for them. You might find out<br/>\nsomething you didn&#39;t know.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am one of those people that can say I shall do something and more<br/>\n&gt; then likely I will do it. Even ten years latter. One of the rare<br/>\n&gt; people who do what they say they shall do.<br/>\n<br/>\n </span></blockquote>Someone promising to do something and doing it is admirable.<br/>\n<br/>\nHaving a dream and working towards it is admirable.<br/>\n<br/>\nBut being certain that you won&#39;t learn anything in the next 10 years that<br/>\ncould change your mind about something is foolish. It isn&#39;t a good thing for<br/>\nlife and especially not a good thing for unschooling!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Goodness, did I say they are stupid?<br/>\n<br/>\n </span></blockquote>Yes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think any parent not willing to look at their childs<br/>\n&gt; learning and grade them on it for the betterment of the education the<br/>\n&gt; child wishes to have is being stupid.<br/>\n<br/>\n&gt; I think some advice should be taken here.<br/>\n<br/>\n </span></blockquote>I think some reading on your part should be taken here. You&#39;re are speaking<br/>\nto people who have done what you&#39;re saying can&#39;t be done and telling us we<br/>\nneed to listen to your convictions about what you believe is true.<br/>\n<br/>\nRead. Ask questions. It&#39;s a lot more useful for learning than repeating what<br/>\nyou think you know.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":165918527,"authorName":"Kimberly","from":"&quot;Kimberly&quot; &lt;kontessa_rose@...&gt;","profile":"kontessa_rose","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"transcripts (was Re: Digest Number 4582)","postDate":"1082266634","msgId":92808,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM1dDQ2YStsOWZwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc3LjI2ZmIyOTFkLjJkYjFjOGVhQGFvbC5jb20+"},"prevInTopic":92671,"nextInTopic":92809,"prevInTime":92807,"nextInTime":92809,"topicId":92671,"numMessagesInTopic":0,"msgSnippet":"... respond ... Thank you for the reminder, I should have remembered that. Being in Digest is something new to me but needed as this group is very active. ... ","messageBody":"<div id=\"ygrps-yiv-1251801324\"><blockquote><span title=\"ireply\">&gt; Please try to remember to transfer the name of the thread when you <br/>\n </span></blockquote>respond <br/>\n<blockquote><span title=\"ireply\"> &gt; from digest.<br/>\n </span></blockquote> Thank you for the reminder, I should have remembered that. Being in <br/>\nDigest is something new to me but needed as this group is very <br/>\nactive. <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; In a message dated 4/16/04 5:08:09 PM, kontessa_rose@y... writes:<br/>\n&gt; <br/>\n&gt; &lt;&lt;  I have noticed that in any group people who are exteme do more <br/>\n </span></blockquote>damage <br/>\n<blockquote><span title=\"ireply\"> &gt; then good. <br/>\n&gt; In this group, unschooling is not the extreme, it&#39;s the topic.<br/>\n<br/>\n </span></blockquote> I am not sure if unschooling in itself is extreme. I think it is a <br/>\nbad idea to not be willing to introduce knowledge to a child, as we <br/>\nhave been doing it for a very long time, far longer then we have had <br/>\nschools. Parents would teach their children what they thought they <br/>\nneeded to know to be a useful. I do not know a culture that did not <br/>\nask that children do something to help the family such as chores, <br/>\nwatching the younger one. They needed to told how to do much of it I <br/>\nthink, or maybe showed closer to what I am trying to say. <br/>\n<br/>\n I think it is a negative thing for a parent to not present a child <br/>\nwith what they think they should know. Like manners, and morals. At 4 <br/>\nyears old I can and feel I should teach my daughter these things. <br/>\nAlong with how to clean her room, not to run in the road and why. I <br/>\ntake the time to teach her things I know. Sometimes she is <br/>\ninterested, sometimes not. I am not going to stop trying to teach her <br/>\nwhy she should not touch the stove when I am cooking just because at <br/>\nthat moment she does not want to hear it! <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; If you&#39;ve met unschooled kids and you think they&#39;re damaged, let&#39;s <br/>\n </span></blockquote>talk about <br/>\n<blockquote><span title=\"ireply\"> &gt; that.<br/>\n<br/>\n </span></blockquote> Ok, lets talk about it. I have a friend with three kids. I thought I <br/>\nknew her well. I knew she homeschooled. I left my child with her to <br/>\nbaby sit. On my way to pick up my child I was pulling into the drive <br/>\nway and almost hit her 18 month old. Alone, playing in the front <br/>\nyard, no mother in sight, infact no one in sight. I go in to find the <br/>\ntow older boys 5 and 7 I believe watching TV with friends. Where is <br/>\nyour mother I ask. Neither one know. Why is the baby out side I ask. <br/>\nAgain neither one know. They do not seem to care either. I search the <br/>\nhouse. No mother, and my daughter can not be found either. I find <br/>\nthem out side in the back yard. back yard has a 6 foot high solid <br/>\nwood fence. They are spray painting something. I run and hug my <br/>\nchild. The mother askes me what it wrong. I hand her, her baby. I <br/>\nasked how long they have been out here. About 20 minutes she says. I <br/>\naks her who was watching her baby. She says the bay was in the high <br/>\nchair and the boys where watching her. I tell her what I found. She <br/>\ndoes not seem bothered. She says the kids will learn what is safe and <br/>\nwhat is not. <br/>\n <br/>\n I was not happy and tried to make a fast exit. She sees me upset and <br/>\ntakers her sons in a room to spank them for not watching thier <br/>\nsister. She gives them lots of freedom but also spanks them for <br/>\nthings like talking back and not responding to a demand right away. <br/>\nConfuses the heck out of me. (I am not one for spanking) <br/>\n<br/>\n Then I learn she unschools. She tells me about it and I find that I <br/>\nmight like it as I do not think schools are healthy and I also do not <br/>\nthink a child should be pushed to learn math and reading so young, I <br/>\nfeel they have other things to be learning. <br/>\n<br/>\n She takes things to the extreme, her sons know little other then <br/>\nphrases from the bible that she does have them learn. And worse, they <br/>\ndo not feel like they have to be responcible for anything. <br/>\n<br/>\n I am sure there are many more good then bad unschoolers. Again, I <br/>\njust think extreme is bad. I do not think unschooling in itself is <br/>\nbad. Just those that say it must be their way or no way. Thus many <br/>\nhave left this group to look for a more eclectic and free thinking <br/>\nway of unschooling. They do unschool in the sence that they do not <br/>\npush the classes of schooling and the bad things (Bad things <br/>\nincluding those things found in the book dumbing us down and other <br/>\nanti school books like it) and they still call them selves <br/>\nunschoolers. And I think they are, but they are doing it in the way <br/>\nthat works best for them and their children. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If you have not met older always-unschooled kids, then maybe your <br/>\n </span></blockquote>general <br/>\n<blockquote><span title=\"ireply\"> &gt; statement will do more damage than good.<br/>\n<br/>\n </span></blockquote> I think you confused something. I never said unschooling is extreme, <br/>\njust that in all groups there are extreme people who take things to <br/>\nan extreme level. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; -=- As I read responces to ideas on transcripts I thought it stupid <br/>\n </span></blockquote>to not be <br/>\n<blockquote><span title=\"ireply\"> &gt; willing to make letter grades so that a child can enter school! -=-<br/>\n&gt; <br/>\n&gt; STUPID?<br/>\n&gt; <br/>\n&gt; You&#39;re calling integrity &quot;stupid&quot;  in the same post in  which you <br/>\n </span></blockquote>talked <br/>\n<blockquote><span title=\"ireply\"> &gt; about &quot;more damage than good&quot;?<br/>\n<br/>\n </span></blockquote>Yes Stupid. I think any parent not willing to look at their childs <br/>\nlearning and grade them on it for the betterment of the education the <br/>\nchild wishes to have is being stupid. At 18 I think you and your <br/>\nchild would be ready to get real and take the tests needed. Do you <br/>\nthink you can stop them from having test in college? I do not think <br/>\nso. And some colleges WILL NOT accept you without transcripts. Maybe <br/>\nthat will change by the time my baby is old enough to go. For now we <br/>\nare dealing with it seeing both hubby and I are trying to get back to <br/>\nschool. It is easier for him as he is in the military, not so easy <br/>\nfor me as I have limited choices as to where I can go and how much I <br/>\ncan pay! <br/>\n<br/>\n I do not think grading my child and creating a transcript would be <br/>\ndamaging to my integrity. I am a realist, and my daughter will know <br/>\nthat we are flexable about things we are not able to change. If they <br/>\nwant transcripts, we will make it happen for her, even if she needs <br/>\nto be tested and go over all she has learned to grade herself fairly. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; My child could have entered school anytime since 1991.  <br/>\n&gt; My children could enter school tomorrow, and get some high school <br/>\n </span></blockquote>transcripts.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; The same principles on which I&#39;ve based my mothering thusfar will <br/>\n </span></blockquote>be <br/>\n<blockquote><span title=\"ireply\"> &gt; shattered if I start to lie about what I&#39;m doing now.<br/>\n&gt; <br/>\n&gt; Children CAN and DO and WILL get into college without a school-<br/>\n </span></blockquote>looking <br/>\n<blockquote><span title=\"ireply\"> &gt; transcript.<br/>\n&gt; That being true (not maybe, but proven), then why would a parent <br/>\n </span></blockquote>model <br/>\n<blockquote><span title=\"ireply\"> &gt; dishonesty?<br/>\n&gt; <br/>\n&gt; -=-My child is unschooling in an eclectic way. At 4 years <br/>\n </span></blockquote>old . . . .-=-<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; She&#39;s not legally bound to &quot;be schooled&quot; so why be schooling her in <br/>\n </span></blockquote>ANY way <br/>\n<blockquote><span title=\"ireply\"> &gt; at this point?<br/>\n<br/>\n </span></blockquote>I do not think that teaching her life lessons that will help her at 4 <br/>\nyears old as schooling. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; She&#39;s four.  Why can&#39;t she just be living a happy &quot;preschool&quot; life?<br/>\n<br/>\n </span></blockquote> Since when is life about being happy? Life is not about being happy, <br/>\nnot that I have ever learned. Life is about being useful, about being <br/>\na good person, about makeing life woth something. Happy comes with <br/>\nbeing useful. My child is so happy to help, she does not see work as <br/>\nsomething negative or as something she must do before she can have <br/>\nfun. Work, learning, playing, are all part of her learning and to <br/>\nher, all fun! That in itself helps me think we are doing something <br/>\nright. <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; -=-some jobs even demading their own testing before an interview-=--<br/>\n&gt; <br/>\n&gt; Practicing could be accomplished with magazine surveys and trivia <br/>\n </span></blockquote>books.<br/>\n<br/>\n Very very true! I had not thought about this. Thank you, I hope in <br/>\nyears to come I remember it. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; -=-I want my child to have good testing skills. College will demand <br/>\n </span></blockquote>it just <br/>\n<blockquote><span title=\"ireply\"> &gt; as jobs she may wish to do might. I would not harm her by not <br/>\n </span></blockquote>helping her <br/>\n<blockquote><span title=\"ireply\"> &gt; devolop those needed skills. -=-<br/>\n&gt; <br/>\n&gt; I have never known one parent to successfully ignore a test skill.  <br/>\n </span></blockquote>Lots have <br/>\n<blockquote><span title=\"ireply\"> &gt; said they would.  All have said &quot;I couldn&#39;t help...&quot; about knowing <br/>\n </span></blockquote>that their <br/>\n<blockquote><span title=\"ireply\"> &gt; child tested low, or average or high.  They treat their children <br/>\n </span></blockquote>differently.<br/>\n<br/>\n I am not talking about testing a child, I am talking about testing a <br/>\nyoung adult getting ready to go out into the world. Like age 16ish!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; You could harm your child by encouraging testing if that testing <br/>\n </span></blockquote>involves <br/>\n<blockquote><span title=\"ireply\"> &gt; having her tested.<br/>\n&gt; <br/>\n&gt; -=-<br/>\n&gt;   When the time comes her and I shall put together a transcript for <br/>\n </span></blockquote>her, we <br/>\n<blockquote><span title=\"ireply\"> &gt; shall grade her on topics she has covered honestly. -=-<br/>\n&gt; <br/>\n&gt; You might want to be careful about using the word &quot;shall&quot; about <br/>\n </span></blockquote>what you <br/>\n<blockquote><span title=\"ireply\"> &gt; think you&#39;ll do twelve years from now.<br/>\n<br/>\n </span></blockquote> I am one of those people that can say I shall do something and more <br/>\nthen likely I will do it. Even ten years latter. One of the rare <br/>\npeople who do what they say they shall do. Point: I was 10 years old <br/>\nand learned about surrogacy, my step mother wanted to have a child <br/>\nwith my father. I told her and everyone some day I would have a baby <br/>\nfor another couple because I knew I could. And I did. twice, 10 years <br/>\nlatter. So I would get to know someone before saying what they can <br/>\nand can not do. Certainly things change, I might not be alive then or <br/>\nwe might not even need to. But that will not keep me from planning!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; -=-Tests shall be nothing more then a tool she can use to gage <br/>\n </span></blockquote>where she is <br/>\n<blockquote><span title=\"ireply\"> &gt; at in topics she is interested in.-=-<br/>\n&gt; <br/>\n&gt; You can brag about what you think YOU &quot;shall&quot; do in advance, but <br/>\n </span></blockquote>you cannot <br/>\n<blockquote><span title=\"ireply\"> &gt; declare what tests shall be.  They already are what they are.<br/>\n&gt; <br/>\n&gt; -=-I do not think that is anti unschooling as I shall not be <br/>\n </span></blockquote>pushing her to <br/>\n<blockquote><span title=\"ireply\"> &gt; take them. I will show her the value of them.-=-<br/>\n<br/>\n&gt; <br/>\n&gt; Before she can make an &quot;informed consent&quot; decision, she needs to <br/>\n </span></blockquote>know both <br/>\n<blockquote><span title=\"ireply\"> &gt; sides.  Otherwise, if you just show her &quot;the value,&quot; there&#39;s not <br/>\n </span></blockquote>much difference <br/>\n<blockquote><span title=\"ireply\"> &gt; between that and pushing her to take them.<br/>\n&gt; <br/>\n&gt; -=-My job is to prepair her for life as an adult, and it does not <br/>\n </span></blockquote>matter if <br/>\n<blockquote><span title=\"ireply\"> &gt; we like it or not, tests are a part of it for now. -=-<br/>\n&gt; <br/>\n&gt; For now, she&#39;s four years old.   If you see your job as helping her <br/>\n </span></blockquote>be the <br/>\n<blockquote><span title=\"ireply\"> &gt; happiest four year old she could possibly be, the learning will <br/>\n </span></blockquote>just flow in.  <br/>\n<blockquote><span title=\"ireply\"> &gt; If you spend her fourth year, and fifth, and sixth, preparing for <br/>\n </span></blockquote>college, <br/>\n<blockquote><span title=\"ireply\"> &gt; you&#39;re not using your time as well as you could.<br/>\n&gt; <br/>\n&gt; -=-JMHO-=-<br/>\n&gt; <br/>\n&gt; Humble opinions don&#39;t usually include telling the other people <br/>\n </span></blockquote>they&#39;re stupid <br/>\n<blockquote><span title=\"ireply\"> &gt; and doing more harm than good, do they?  Maybe I <br/>\n </span></blockquote>misunderstand &quot;humble <br/>\n<blockquote><span title=\"ireply\"> &gt; opinion.&quot;<br/>\n<br/>\n </span></blockquote> Goodness, did I say they are stupid? I do not think so, I think the <br/>\ndesition to not help their child get into a college that demands <br/>\ntranscrips because it would be in thier eyes lieing, mine changing, <br/>\nthat it would be stupid. I think some advice should be taken here. <br/>\nPicture my voice as your best friend and I am telling you I think <br/>\nyour not being smart about this! Picture me saying that I think it is <br/>\nbetter to change when needed a little then to fight the system that <br/>\nshall not change for you but could very well make your child very <br/>\nhappy. <br/>\n<br/>\n Blessings,<br/>\n  Kimmy<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; Sandra </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"transcripts (was Re: Digest Number 4582)","postDate":"1082158826","msgId":92671,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc3LjI2ZmIyOTFkLjJkYjFjOGVhQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":92808,"prevInTime":92670,"nextInTime":92672,"topicId":92671,"numMessagesInTopic":0,"msgSnippet":"-=-Re: [UnschoolingDiscussion] Digest Number 4582-=- Please try to remember to transfer the name of the thread when you respond from digest. In a message dated","messageBody":"<div id=\"ygrps-yiv-450954729\">-=-Re: [UnschoolingDiscussion] Digest Number 4582-=-<br/>\n<br/>\nPlease try to remember to transfer the name of the thread when you respond <br/>\nfrom digest.<br/>\n<br/>\n<br/>\nIn a message dated 4/16/04 5:08:09 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kontessa_rose@...\">kontessa_rose@...</a> writes:<br/>\n<br/>\n&lt;&lt;  I have noticed that in any group people who are exteme do more damage <br/>\nthen good. <br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;<br/>\n<br/>\n </span></blockquote>In this group, unschooling is not the extreme, it&#39;s the topic.<br/>\n<br/>\nIf you&#39;ve met unschooled kids and you think they&#39;re damaged, let&#39;s talk about <br/>\nthat.<br/>\nIf you have not met older always-unschooled kids, then maybe your general <br/>\nstatement will do more damage than good.<br/>\n<br/>\n-=- As I read responces to ideas on transcripts I thought it stupid to not be <br/>\nwilling to make letter grades so that a child can enter school! -=-<br/>\n<br/>\nSTUPID?<br/>\n<br/>\nYou&#39;re calling integrity &quot;stupid&quot;  in the same post in  which you talked <br/>\nabout &quot;more damage than good&quot;?<br/>\n<br/>\nMy child could have entered school anytime since 1991.  <br/>\nMy children could enter school tomorrow, and get some high school transcripts.<br/>\n<br/>\nThe same principles on which I&#39;ve based my mothering thusfar will be <br/>\nshattered if I start to lie about what I&#39;m doing now.<br/>\n<br/>\nChildren CAN and DO and WILL get into college without a school-looking <br/>\ntranscript.<br/>\nThat being true (not maybe, but proven), then why would a parent model <br/>\ndishonesty?<br/>\n<br/>\n-=-My child is unschooling in an eclectic way. At 4 years old . . . .-=-<br/>\n<br/>\nShe&#39;s not legally bound to &quot;be schooled&quot; so why be schooling her in ANY way <br/>\nat this point?<br/>\nShe&#39;s four.  Why can&#39;t she just be living a happy &quot;preschool&quot; life?<br/>\n<br/>\n-=-some jobs even demading their own testing before an interview-=--<br/>\n<br/>\nPracticing could be accomplished with magazine surveys and trivia books.<br/>\n<br/>\n-=-I want my child to have good testing skills. College will demand it just <br/>\nas jobs she may wish to do might. I would not harm her by not helping her <br/>\ndevolop those needed skills. -=-<br/>\n<br/>\nI have never known one parent to successfully ignore a test skill.  Lots have <br/>\nsaid they would.  All have said &quot;I couldn&#39;t help...&quot; about knowing that their <br/>\nchild tested low, or average or high.  They treat their children differently.<br/>\n<br/>\nYou could harm your child by encouraging testing if that testing involves <br/>\nhaving her tested.<br/>\n<br/>\n-=-<br/>\n  When the time comes her and I shall put together a transcript for her, we <br/>\nshall grade her on topics she has covered honestly. -=-<br/>\n<br/>\nYou might want to be careful about using the word &quot;shall&quot; about what you <br/>\nthink you&#39;ll do twelve years from now.<br/>\n<br/>\n-=-Tests shall be nothing more then a tool she can use to gage where she is <br/>\nat in topics she is interested in.-=-<br/>\n<br/>\nYou can brag about what you think YOU &quot;shall&quot; do in advance, but you cannot <br/>\ndeclare what tests shall be.  They already are what they are.<br/>\n<br/>\n-=-I do not think that is anti unschooling as I shall not be pushing her to <br/>\ntake them. I will show her the value of them.-=-<br/>\n<br/>\nBefore she can make an &quot;informed consent&quot; decision, she needs to know both <br/>\nsides.  Otherwise, if you just show her &quot;the value,&quot; there&#39;s not much difference <br/>\nbetween that and pushing her to take them.<br/>\n<br/>\n-=-My job is to prepair her for life as an adult, and it does not matter if <br/>\nwe like it or not, tests are a part of it for now. -=-<br/>\n<br/>\nFor now, she&#39;s four years old.   If you see your job as helping her be the <br/>\nhappiest four year old she could possibly be, the learning will just flow in.  <br/>\nIf you spend her fourth year, and fifth, and sixth, preparing for college, <br/>\nyou&#39;re not using your time as well as you could.<br/>\n<br/>\n-=-JMHO-=-<br/>\n<br/>\nHumble opinions don&#39;t usually include telling the other people they&#39;re stupid <br/>\nand doing more harm than good, do they?  Maybe I misunderstand &quot;humble <br/>\nopinion.&quot;<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":92790,"nextTopicId":92821}}