{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":0,"authorName":"Sharon Rudd","from":"Sharon Rudd &lt;bearspawprint@...&gt;","replyTo":"LIST","senderId":"h2Qtv-xmzWfzUF3nXFyQG2MPGuSXLOWpfR0_a6dSHcjF2aTH8zXlaJgHYaqiPmbgfb_XXFubYqhnBrlbA8Bh2n-Q7frJYiLDTQYpOQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Indian School Bibliography","postDate":"990668058","msgId":21880,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDEwNTI0MDEzNDE4LjQ0Mjk2LnFtYWlsQHdlYjE0MzA1Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDAxNDUwMWMwZTMxZiQxODVjY2M0MCQxODVkZDFkMUBsZGlvbm5vPg=="},"prevInTopic":21857,"nextInTopic":0,"prevInTime":21879,"nextInTime":21881,"topicId":21761,"numMessagesInTopic":0,"msgSnippet":"Dear Lynda I m afraid I skimmed most of your post, however that bibliography is really impressive!  How did you do it so fast?  I m such an old fashioned sort","messageBody":"<div id=\"ygrps-yiv-325381188\">Dear Lynda<br/>\n<br/>\nI&#39;m afraid I skimmed most of your post, however that<br/>\nbibliography is really impressive!  How did you do it<br/>\nso fast?  I&#39;m such an old fashioned sort of<br/>\nresearcher.  More the card-catalogue vintage type of<br/>\nhunter.  Would you please email me, off list, with how<br/>\nto do a search like that?  That would be a VERY useful<br/>\nthing to know how to do.<br/>\n<br/>\nMy own opinions are entirely subjective, dunno how I<br/>\nwould footnote myself. Ha! And even though I, like so<br/>\nmany others, have a mixed ancestry, I am an Indian<br/>\nwith a roll number......does that make me authentic? <br/>\nNo, a number doesn&#39;t do anything but mark a spot. <br/>\n<br/>\nYou made a reference, somewhere, to fake Indian sites.<br/>\nPerhaps you should be careful what you search for.<br/>\nPerhaps we each find what we are looking for.<br/>\n<br/>\nAlso, Wannabees are not the worst sort of person.  At<br/>\nleast they are trying! So many don&#39;t make an effort at<br/>\nall. Collectors are a different sort, they aren&#39;t<br/>\nreally Wannabees, even.  More a Wasichu (spelling?)<br/>\ntype. Ya know.......  still even that is a<br/>\ngeneralization.  Who knows, there might be an<br/>\nenlightened artifact collector somewhere. Ha!<br/>\n<br/>\nAnd Lynda, if it isn&#39;t too personal, what is your<br/>\nIndian connection? If you want to answer you can email<br/>\nme off list, or on. But is is off topic.  If my<br/>\nquestions are too intrusive, please forgive me.  <br/>\n<br/>\nThanks for pointing out things from an outlook that is<br/>\ndifferent from most.  Like a hawk, you see acutely,<br/>\nbut you vision is narrow. It is not the usual way to<br/>\nview the world. It is good for me to be aware of the<br/>\nview from where you are.<br/>\n<br/>\nThank you for sharing your thoughts<br/>\nSharon<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nYahoo! Auctions - buy the things you want at great prices<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://auctions.yahoo.com/\">http://auctions.yahoo.com/</a></div>","specialLinks":[]},{"userId":0,"authorName":"Sharon Rudd","from":"Sharon Rudd &lt;bearspawprint@...&gt;","replyTo":"LIST","senderId":"2xUcvBsF7MoyRae33TPjTVzLMvDscUONoNGBb74w-mo8Il6ciAGzI0N6ngBOkH7PJg1LUCPIUfcvr6x2HSvKeMEzslBAz98eo0hIZg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Bibliography","postDate":"990652407","msgId":21857,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDEwNTIzMjExMzI3LjkzMTYzLnFtYWlsQHdlYjE0MzA5Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDAxNDUwMWMwZTMxZiQxODVjY2M0MCQxODVkZDFkMUBsZGlvbm5vPg=="},"prevInTopic":21761,"nextInTopic":21880,"prevInTime":21856,"nextInTime":21858,"topicId":21761,"numMessagesInTopic":0,"msgSnippet":"Dear Lynda That was an impressive bibliography! please email me off list and tell me how you did it.  I have a  few clues, but my way of researching is so old","messageBody":"<div id=\"ygrps-yiv-15228466\">Dear Lynda<br/>\n<br/>\nThat was an impressive bibliography! please email me<br/>\noff list and tell me how you did it.  I have a  few<br/>\nclues, but my way of researching is so old fashioned,<br/>\nI&#39;m a card catalogue vintage hunter!!<br/>\n<br/>\nAnd I am an Indian (yes, lots of us use that word)<br/>\nwith a roll number. Does that make me authentic? Ha! <br/>\n<br/>\nI haven&#39;t read all the 98 other posts in my inbox yet,<br/>\nbut I bet your is the only annotated OPINION! Most of<br/>\nmy opinions are entirely subjective.  I would have to<br/>\nput myself at the bottom of the page. <br/>\n<br/>\nFortunately I got to miss all of that horror. My own<br/>\nexperiences, there, are vicarious.  And you, Lynda,<br/>\nwhat is your personal connection?  Besides proving<br/>\nyour validity.  If my question is not too intrusive,<br/>\nyou may answer me off list.....or on.  If I am too<br/>\npersonal in my query please forgive me.  <br/>\n<br/>\nThanks, Sharon    <br/>\n<br/>\n<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nYahoo! Auctions - buy the things you want at great prices<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://auctions.yahoo.com/\">http://auctions.yahoo.com/</a></div>","specialLinks":[]},{"userId":0,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","replyTo":"LIST","senderId":"7E-VEPji6AN2zepMiU4OWBrSZgE_8gnneemgrjla4M6WOU_yCd6m5GjuOxFRzWPfcO2H3oJddCVtrYNfiAvi1v0ODg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Long response, stress and frustration","postDate":"990576640","msgId":21761,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNDUwMWMwZTMxZiQxODVjY2M0MCQxODVkZDFkMUBsZGlvbm5vPg==","referencesHeader":"PDI0LjEzZDZlYmJlLjI4M2E3OWYxQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":21857,"prevInTime":21760,"nextInTime":21762,"topicId":21761,"numMessagesInTopic":0,"msgSnippet":"Alrighty.  This post has not been edited, nor are all the links or references complete but since I am being accused (hmmmm, flamed, maybe would be more","messageBody":"<div id=\"ygrps-yiv-2041653510\">Alrighty.  This post has not been edited, nor are all the links or<br/>\nreferences complete but since I am being accused (hmmmm, flamed, maybe would<br/>\nbe more accurate) of ignoring DEMANDS by the below poster, here is the<br/>\nanswer to the DEMANDS.  If anyone wants the complete answer with all the<br/>\nreferences *complete,* then it will take a little longer to put together.  I<br/>\ndon&#39;t have all the congressional records sitting in front of me nor do I<br/>\nhave all the little &quot;pieces.&quot;  I was putting it together but I guess I will<br/>\nflunk the test if I don&#39;t turn in my DEMANDED report promptly.<br/>\n<br/>\nLynda, who, believe it or not is smiling while she sends this as she really<br/>\ndoesn&#39;t treat this stuff as a matter of life and death.  ~~sigh~~  guess<br/>\nsome folks do.<br/>\n<br/>\nP.S.  I sign quite a few posts with the initials CAM which means Clear As<br/>\nMud because sometimes it is hard to convey what one is trying to say when<br/>\none can&#39;t use body language or stop and edit verbally as one talks nor can<br/>\nthe person you are talking to stop you and ask for explanations as you talk.<br/>\nMOST folks understand that and then ask one to further explain instead of<br/>\njumping in and attacking.<br/>\n<br/>\nThat said, here is the reply to the post that Sandra is flaming about in<br/>\nanother post:<br/>\n<br/>\nO.K., this little game of creative editing and sniping really needs to stop.<br/>\nWhy, I just might have to stop giggling and LAYNWY!<br/>\n<br/>\nSandra rambled on creatively editing:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In a message dated 5/20/01 9:42:00 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lurine@...\">lurine@...</a> writes:<br/>\n&gt;<br/>\n&gt; &lt;&lt; The term that Hilliary made so icky to some, &quot;it takes a village&quot; is<br/>\n </span></blockquote>the<br/>\n<blockquote><span title=\"ireply\"> &gt; basis for American Indian learning up until the advent of the U.S.<br/>\n&gt; government passing laws stating that Indians were not humans and had no<br/>\n&gt; rights given to humans.  &gt;&gt;<br/>\n&gt;<br/>\n&gt; I didn&#39;t think it was an American Indian quote.<br/>\n<br/>\n </span></blockquote>***Duh!  It doesn&#39;t say it is an American Indian quote.  I said it is the<br/>\nbasis or, if one prefers, the philosophy of the American Indian as regarded<br/>\nlearning prior to the murderous white thieves coming to this continent.<br/>\nThey believed that a child learned from the whole tribe and family, that<br/>\nthey learned by doing, that they learned by listening to the elders.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I thought it was African.  Can anyone confirm or deny?<br/>\n&gt;<br/>\n&gt; &lt;&lt;This was used to remove all Indian children from<br/>\n&gt; their homes and ship them off to boarding schools where the worst of the<br/>\n&gt; worse parts of the Prussian model were practiced. &gt;&gt;<br/>\n&gt;<br/>\n&gt; This is not so.  &quot;It takes a village&quot; was not ANY justification for taking<br/>\n&gt; kids to boarding schools.<br/>\n<br/>\n </span></blockquote>***Creative editing again! ~~sigh~~ It IS getting soooo boring!  (Using my<br/>\nbest imitation of a valley girl &lt;g&gt;)  I said the laws that were passed that<br/>\ndeclared the American Indian not to be human was why they were sent to<br/>\nboarding schools.  Ya know, &quot;barbarians,&quot; and &quot;animals&quot; were two of their<br/>\nfavorite adjectives.<br/>\n<br/>\n&quot;In the difference of language to-day lies two-thirds of our trouble. . . .<br/>\nSchools should be established, which children should be required to attend;<br/>\ntheir barbarous dialect should be blotted out and the English language<br/>\nsubstituted. (Report of the Indian Peace Commissioners, 1868, pp. 16-17)&quot;<br/>\n<br/>\n&quot;how easy it would be to assimilate Indians into the general population by<br/>\ngiving them a white man&#39;s education for a few years in a boarding school<br/>\n(Hoxie, 1984).&quot;<br/>\n<br/>\n&quot;if there were a sufficient number of reservation boarding-school-buildings<br/>\nto accommodate all the Indian children of school age, and these building<br/>\ncould be filled and kept filled with Indian pupils, the Indian problem would<br/>\nbe solved within the school age of the Indian child now six years old.<br/>\n(Oberly, 1885, cxiii)&quot;<br/>\n<br/>\n&quot;English language only must be taught the Indian youth placed there for<br/>\neducational and industrial training at the expense of the Government. If<br/>\nDakota or any other language is taught such children, they will be taken<br/>\naway. (Atkins, 1887, p. xxi)&quot;<br/>\n<br/>\n&quot;Every nation is jealous of its own language, and no nation ought to be more<br/>\nso than ours, which approaches nearer than any other nationality to the<br/>\nperfect protection of its people. True Americans all feel that the<br/>\nConstitution, laws, and institutions of the United States, in their<br/>\nadaptation to the wants and requirements of man, are superior to those of<br/>\nany other country; and they should understand that by the spread of the<br/>\nEnglish language will these laws and institutions be more firmly established<br/>\na nd widely disseminated. Nothing so surely and perfectly stamps upon an<br/>\nindividual a national characteristic as language. . . . [As the Indians] are<br/>\nin an English-speaking country, they must be taught the language which they<br/>\nmust use in transacting business with the people of this country. Atkins,<br/>\n1887, pp. xxi-xxiii)&quot;<br/>\n<br/>\n&quot;All instruction shall be in the English language. Pupils shall be required<br/>\nto converse with employees and each other in English. All school employees<br/>\nmust be able to speak English fluently. (Rules for Indian Schools, 1898, p.<br/>\n25)&quot;<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &lt;&lt;They were all given<br/>\n&gt; Buster Brown haircuts (boys and girls) and dressed in white uniforms. &gt;&gt;<br/>\n&gt;<br/>\n&gt; Perhaps in one school you know of.  To make a claim like all Indian<br/>\n </span></blockquote>boarding schools wore white uniforms is simply to supply misinformation.<br/>\nAnd to<br/>\nclaim that they cut the hair of all the girls is false.  Boys, most likely.<br/>\n<blockquote><span title=\"ireply\"> &gt; I live where there were still Indian schools very lately (still might be<br/>\n </span></blockquote>St.<br/>\n<blockquote><span title=\"ireply\"> &gt; Katherines&#39; in Santa Fe, but if so, haircutting even for boys is long,<br/>\n </span></blockquote>long gone), and what you&#39;ve written is not applicable.<br/>\n<br/>\n***One of the most racist states in the union!  And, yes it was applicable<br/>\nto your state!  The children were removed from the reservation or sent to<br/>\nmissionary schools on the reservation.  They were forced to learn English<br/>\nand were punished for not doing so.  Physically punished!  You do realise<br/>\nthat NM is part of Four Corners, don&#39;t you or will you claim that the<br/>\nfollowing<br/>\nquote can&#39;t possibly apply to NM.  I mean, one of the worst was in your<br/>\nhometown.<br/>\n<br/>\n&quot;Kluckhohn and Leighton reported that 95% of Navajo children &quot;went home<br/>\nrather than to white communities, after leaving school, only to find<br/>\nthemselves handicapped for taking part in Navajo life because they did not<br/>\nknow the techniques and customs of their own people&quot; (1962, p. 141).&quot;<br/>\n<br/>\n&quot;In an introductory heading to a 1923 Current History article on &quot;America&#39;s<br/>\nTreatment of Her Indians,&quot; Collier (1923) declared that &quot;the administration<br/>\nof Indian affairs [is] a national disgrace -- A policy designed to rob<br/>\nIndians of their property, destroy their culture and eventually exterminate<br/>\nthem&quot; (p. 771, emphasis in original).&quot;<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &lt;&lt; They were denied their language and religion and punished for<br/>\n </span></blockquote>practicing<br/>\neither.&gt;&gt;<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; That is true, but that&#39;s was also true in public schools of children<br/>\n </span></blockquote>speaking LOTS of languages even until lately, and probably even today in<br/>\nsome<br/>\nplaces.<br/>\n<br/>\n***Get a grip.  Failing grades do not even vaguely compare to being<br/>\nphysically punished, denied parental visits, being denied meals or any of<br/>\nthe various other punishments inflicted on these children!<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &lt;&lt;Those children that were not shipped off to boarding schools were forced<br/>\n </span></blockquote>to attend church run schools on the reservations.  Same haircuts and<br/>\nuniforms<br/>\n<blockquote><span title=\"ireply\"> &gt; were required.  The treatment was brutal because it was &quot;o.k.&quot; to beat and<br/>\n&gt; torture Indian children because they weren&#39;t &quot;human.&quot;&gt;&gt;<br/>\n&gt;<br/>\n&gt; Where are you getting this information?<br/>\n<br/>\n </span></blockquote>***Congress, first person reports, first hand information, relatives,<br/>\nworking for Title III, Title V, Title IX and JOM!<br/>\n<br/>\n&quot;Regardless of the school system they are in, Navajo students find<br/>\nthemselves in an environment controlled and dominated by non-Indians. Most<br/>\nof the teachers and administrators in reservation schools are Anglo [white].<br/>\nPublic school boards of education are dominated by non-Indians and those few<br/>\nIndians who do serve wield little authority. Parent advisory boards are the<br/>\nBIA school equivalent of a board of education; while these are all Indian,<br/>\ntheir function is only advisory and they are essentially powerless.<br/>\n<br/>\nNavajos, in fact, have been excluded from the decision-making process in<br/>\nthese school systems. The result has been a variety of education policies<br/>\nunrelated to the Navajo community. The Navajo language and culture have been<br/>\nlargely ignored in the curriculum offered to Navajo students. (United<br/>\nStates, 1975, pp. 126-127)&quot;<br/>\n<br/>\n&quot;Enforcement of the English-only regulations was usually strict. Lawrence<br/>\nHorn, a Blackfeet, who attended the government school at Heart Butte,<br/>\nrecalled students getting a stroke of a leather strap with holes in it every<br/>\ntime they spoke Indian (Parsons, 1980). &quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Last time I asked for resources you said you had classified sources and<br/>\n </span></blockquote>then denied saying it.<br/>\n<br/>\n***You were given some sources but you wanted to be spoon fed.  You were not<br/>\ngiven all sources/links because you cannot get there.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Please, please--tell what is true or don&#39;t tell anything.<br/>\n<br/>\n </span></blockquote>***Unless you can prove otherwise, I would think you would be wise to not<br/>\nimply that someone else is lying!  Twisting and creative editing of posts is<br/>\na form of LYING!<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &lt;&lt;Which does not exactly answer your question but gives you a foundation<br/>\n </span></blockquote>for the answer....&gt;&gt;<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Answers should be founded in documentable truth when possible, and direct<br/>\n&gt; account when possible.  Sources and quotes, please.<br/>\n<br/>\n </span></blockquote>***If, and that&#39;s a mighty big IF, I had been answering a question from<br/>\n*you*, I would have been sure to quote the h*ll out of everything and<br/>\nanything available.  However, I wasn&#39;t.  I was answering a question directed<br/>\nat me.  Not a general question but one that referred to my *opinion* about<br/>\nthe general acceptance of Prussian type education.  However, I have given<br/>\nyou a long list of references and have included, in this post, many, many<br/>\nquotes and sources.  Enjoy!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m not questioning the evils of Indian schools.  I&#39;m questioning your<br/>\n&gt; assertion of details as thought there was one overall model of boarding<br/>\n&gt; school, or one overall group of Indians.<br/>\n<br/>\n </span></blockquote>***Yes indeedy,  you are AGAIN questioning me or any assertion that I may<br/>\nmake.  Everyone on the list has noticed it, btw.<br/>\n<br/>\nFurther, there was one over all model and it was the Carlisle school and<br/>\ngovernment regulation.  Again you speak as an authority about something you<br/>\nknow absolutely nothing about!<br/>\n<br/>\n&quot;The model for what became an entire system was the Carlisle Indian School,<br/>\nestablished in Pennsylvania in 1875 by Captain Richard Henry Pratt, a man<br/>\nwhose main qualification for the task seems to have been that he&#39;d earlier<br/>\nserved as warden of a military prison at Fort Marion, Florida. Following<br/>\nPratt&#39;s stated objective of &quot;killing the Indian&quot; in each student, Carlisle<br/>\nand other such facilities-Chilocco, Albuquerque, Phoenix, Haskell,<br/>\nRiverside; by 1902, there were two-dozen of thern-systematically<br/>\n&quot;deculturated&quot; their pupils. Children brought to the schools as young as age<br/>\nsix were denied most or all direct contact with their families and societies<br/>\nfor years on end. They were shorn of their hair and required to dress in the<br/>\nmanner of Euro-America, forbidden to speak their languages or practice their<br/>\nreligions, prevented from learning their own histories or being in any other<br/>\nway socialized among their own people.<br/>\n<br/>\nIndividual native families and, often, whole societies resisted the process.<br/>\nIn 1891, and again in 1893, Congress authorized the use of police, troops<br/>\nand other forcible means to compel the transfer of children from reservation<br/>\nto boarding school, and to keep them there once they&#39;d arrived. Hence,<br/>\ndespite the best efforts of their elders, and not infrequently of the<br/>\nstudents themselves, a total of 21,568 indigenous children--about a third of<br/>\nthe targeted age group-were confined in the schools in 1900. As of the late<br/>\n1920s, the system had been diversified and expanded to the point that<br/>\nupwards of eighty percent of each successive generation of native youth was<br/>\nbeing comprehensively &quot;acculturated&quot; in a more-or-less uniform fashion.&quot;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.zmag.org/ZMag/articles/jan98ward.htm\">http://www.zmag.org/ZMag/articles/jan98ward.htm</a><br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n </span></blockquote>***Here&#39;s a few more references to keep a ps teacher&#39;s soul happy and busy:<br/>\n<br/>\nAbbott, F. H. (1915). The administration of Indian affairs in Canada.<br/>\nWashington, DC: U.S. Government Printing Office.<br/>\n<br/>\nAnnual report of the board of Indian commissioners. (1869-1933). Washington:<br/>\nU.S. Government Printing Office.<br/>\n<br/>\nAtkins, J.D.C. (1887). Annual report of the commissioner of Indian affairs<br/>\nto the secretary of the interior for the year 1887. Washington: Government<br/>\nPrinting Office.<br/>\n<br/>\nBaron, D. (1990). The English-only question: An official language for<br/>\nAmericans? New Haven, CT: Yale University.<br/>\n<br/>\nBartlett, S. C. (1887, October 6). The Ruling of the Indian Bureau. The<br/>\nIndependent, 39(2027), pp. 1254-1255.<br/>\n<br/>\nBennett, W. J. (1986). First lessons: A report on elementary education in<br/>\nAmerica. Washington, DC: U.S. Department of Education.<br/>\n<br/>\nBrown, E. A. (1952). Stubborn fool: A narrative. Caldwell, ID: Caxton.<br/>\n<br/>\nButler, N. M. (Ed.) (1910). Education and the Indian. In Education in the<br/>\nUnited States. New York: American Book Co.<br/>\n<br/>\nCollier, J. (1923, March). Our Indian policy. Sunset Magazine, 13-15 &<br/>\n89-93.<br/>\n<br/>\nCollier, J. (1923, August). America&#39;s treatment of her Indians. Current<br/>\nHistory, 771-778.<br/>\n<br/>\nCrawford, J. (1990). Language freedom and restriction: A historical approach<br/>\nto the official language controversy. In J. Reyhner (Ed.), Effective<br/>\nlanguage education practices and native language survival (pp. 9-22).<br/>\nChoctaw, OK: Native American Language Issues.<br/>\n<br/>\nDeloria, Jr., V. (1990). Traditional education in the world. Winds of<br/>\nChange, 5(10), 13 & 16-18.<br/>\n<br/>\nDeyhle, D. (1989). Pushouts and pullouts: Navajo and Ute school leavers.<br/>\nJournal of Navajo Education, 6(2), 36-51.<br/>\n<br/>\nEder, J., & Reyhner, J. (1988). The historical background of Indian<br/>\neducation. In J. Reyhner (Ed.), Teaching the Indian child: A<br/>\nbilingual/multicultural approach (pp. 29-54). Billings, MT: Eastern Montana<br/>\nCollege.<br/>\n<br/>\nEditorial. (1874, January). IAPI OAYE, 3(1), 1874, p. 4.<br/>\n<br/>\nEditorial. (1990). Education, 10, 449-453.<br/>\n<br/>\nFuchs, E., & Havighurst, R. J. [1972] 1983. To live on this earth: American<br/>\nIndian education. Albuquerque, NM: University of New Mexico.<br/>\n<br/>\nGoodale, E. (1891). Self-teaching in the Indian schools. Educational Review,<br/>\n1, pp. 57-59.<br/>\n<br/>\nHakuta, K., & Pease-Alvarez, L. (Eds.). (1992). Special issue on bilingual<br/>\neducation. Educational Researcher, 21(2), 1-47.<br/>\n<br/>\nHawkins, J. E. (1971). Forward. In Bilingual education for American Indians<br/>\n(Curriculum Bulletin No. 3). Washington, DC: Office of Education Programs,<br/>\nBIA.<br/>\n<br/>\nHinman, S.D. (1869). Journal of the Rev. S.D. Hinman missionary to the<br/>\nSantee Sioux Indians. Philadelphia: McCalla & Stavely.<br/>\n<br/>\nHopkins, S. W. (1883). Life among the Piutes: Their wrongs and claims,<br/>\nedited by Mrs. Horace Mann. Boston: Cupples, Upham & Co.<br/>\n<br/>\nHoward, O. O. (1907). My life and experiences among our hostile Indians.<br/>\nHartford, CN: A.T. Worthington.<br/>\n<br/>\nHoxie, F.E. (1984). A final promise: The campaign to assimilate the Indians,<br/>\n1880-1920. Lincoln: University of Nebraska.<br/>\n<br/>\nIndian education: Americas unpaid debt. (1982). Washington, DC: U.S.<br/>\nGovernment Printing Office. (The eighth annual report to the Congress of the<br/>\nUnited States by the National Advisory Council on Indian Education).<br/>\n<br/>\nKluckhohn, C., & Leighton, D. (1962). The Navaho, revised edition. New York:<br/>\nDoubleday.<br/>\n<br/>\nKneale, A. H. (1950). Indian agent. Caldwell, ID: Caxton.<br/>\n<br/>\nLatham, G. I. (1989). Thirteen most common needs of American Indian<br/>\neducation in BIA schools. Journal of American Indian Education, 29(1), 1-11.<br/>\n<br/>\nLayman, M. E. (1942). A history of Indian education. Unpublished Doctoral<br/>\nDissertation, University of Minnesota.<br/>\n<br/>\nLeap, W.L. (1982). Roles for the linguist in Indian bilingual education. In<br/>\nR. St. Clair & W. Leap (Eds.), Language renewal among American Indian<br/>\ntribes: Issues, problems, and prospects (pp. 19-30). Rosslyn, VI: National<br/>\nClearinghouse for Bi lingual Education.<br/>\n<br/>\nLittlebear, D. (1990). Keynote address: Effective language education<br/>\npractices and native language survival. In J. Reyhner (Ed.), Effective<br/>\nlanguage education practices and native language survival (pp. 1-8).<br/>\nChoctaw, OK: Native American Language Issues.<br/>\n<br/>\nMeriam, L. (Ed.) (1928). The problem of Indian administration. Baltimore:<br/>\nJohn Hopkins.<br/>\n<br/>\nNader, R. (1969). &quot;Statement of Ralph Nader, author, Lecturer.&quot; Indian<br/>\nEducation, 1969, pt. 1, 47-55. Hearings before the subcommittee on Indian<br/>\nEducation of the Committee on Labor and Public Welfare. U.S. Senate, 91st<br/>\nCong., 1st sess. Washington, D.C.: Government Printing Office.<br/>\n<br/>\nNative American Languages Act of 1990, 104, 25 U.S.C. 2901-2906.<br/>\n<br/>\nNavajo Division of Education. (1985). Navajo Nation: Educational policies.<br/>\nWindow Rock, AZ: Navajo Division of Education.<br/>\n<br/>\nNorth, I. (1891). as quoted in The Word Carrier, 20(5), 10-11.<br/>\n<br/>\nNorthern Ute Tribe. 1985. Ute language policy. Cultural Survival Quarterly,<br/>\n9(2), 16-19.<br/>\n<br/>\nOffice of Indian Education Programs, Bureau of Indian Affairs, U.S.<br/>\nDepartment of the Interior. (1988). Report on BIA education: Excellence in<br/>\nIndian education the effective school process (Final review draft).<br/>\nWashington, DC: Author. (ERIC Document Reproduction Service No. ED 297 899)<br/>\n<br/>\nOffice of Inspector General, U.S. Department of the Interior. (1991). Audit<br/>\nreport: Implementation of the education amendments of 1978, Bureau of Indian<br/>\nAffairs. Washington, DC: Author. (Report No. 91-I-941)<br/>\n<br/>\nOberly, J. H. (1885). In Annual report of the commissioner of Indian affairs<br/>\nto the secretary of the interior for the year 1885, lxxv-ccxxv. Washington:<br/>\nGovernment Printing Office.<br/>\n<br/>\nParsons, J. (1980). The educational movement of the Blackfeet Indians<br/>\n1840-1979. Browning, MT: Blackfeet Heritage Program.<br/>\n<br/>\nPascua Yaqui Tribal Council. (1984). Yaqui language policy for the Pascua<br/>\nYaqui Tribe: Policy declaration. Tucson, AZ: Tucson Unified School District.<br/>\n<br/>\nPlatero Paperwork, Inc. (1986). Executive summary: Navajo area student<br/>\ndropout study. Window Rock, AZ: Navajo Nation, Navajo Division of Education.<br/>\n<br/>\nPond, Jr., S.W. (1893). Two volunteer missionaries among the Dakotas or the<br/>\nstory of the labors of Samuel W. and Gideon H. Pond. Boston: Congregational<br/>\nSunday-School and Publishing Society.<br/>\n<br/>\nPorter, R. P. (1990). Forked tongue: The politics of bilingual education.<br/>\nNew York: Basic Books.<br/>\n<br/>\nPrucha, F. P. (1973). Americanizing the American Indians. Cambridge, MA:<br/>\nHarvard University.<br/>\n<br/>\nReyhner, J. (1990). A description of the Rock Point Community School<br/>\nbilingual education program. In J. Reyhner (Ed.). Effective language<br/>\neducation practices and native language survival (pp. 95-106). Choctaw, OK:<br/>\nNative American Language Issues .<br/>\n<br/>\nReyhner, J. (Ed.). (1988). Teaching the Indian child: A<br/>\nbilingual/multicultural approach. Billings, MT: Eastern Montana College.<br/>\n(ERIC Document Reproduction Service No. 301 372)<br/>\n<br/>\nReyhner, J., & Eder, J. (1989). A history of Indian education. Billings, MT:<br/>\nEastern Montana College. (ERIC Document Reproduction Service No. 321 953)<br/>\n<br/>\nReport of Indian Peace Commissioners. (1868, January 7). House of<br/>\nRepresentatives, 40th Congress, 2nd Session, Executive Document No. 97.<br/>\n(Serial Set, 1337, Vol. 11, No. 97).<br/>\n<br/>\nRiggs, S. R. (1880). Mary and I: Forty years with the Sioux. Chicago: W.G.<br/>\nHolmes.<br/>\n<br/>\nRiggs, S. R., & Pond, G. H. (1839). The Dakota first reading Book.<br/>\nCincinnati: Kendall and Henry Printers.<br/>\n<br/>\nRiggs, M. B. (1928). Early days at Santee: The beginnings of Santee Normal<br/>\nTraining School founded by Dr. and Mrs. A.L. Riggs in 1870. Santee, NE:<br/>\nSantee N.T.S.<br/>\n<br/>\nRules for the Indian schools. (1898). Washington: Government Printing<br/>\nOffice.<br/>\n<br/>\nSpecial Subcommittee on Indian Education, Senate Committee on Labor and<br/>\nPublic Welfare. (1969). Indian education: A national tragedy, a national<br/>\nchallenge. (Senate Report 91-501 -- Commonly known as the Kennedy Report)<br/>\n<br/>\nStanding Bear, L. (1928). My people the Sioux, edited by E. A. Brininstool.<br/>\nBoston: Houghton Mifflin.<br/>\n<br/>\nSuina, J. H. (1988). When I went to school. In R. Cocking & J. P.Mestre<br/>\n(Eds.), Linguistic and cultural influences on learning mathematics (pp.<br/>\n295-299). Hillsdale, N.J.: Lawrence Erlbaum Associates.<br/>\n<br/>\nSzasz, M. C. (1988). Indian education in the American colonies, 1607-1783.<br/>\nAlbuquerque: University of New Mexico.<br/>\n<br/>\nSzasz, M. C. (1977). Education and the American Indian: The road to<br/>\nself-determination since 1928, 2nd ed. Albuquerque: University of New<br/>\nMexico.<br/>\n<br/>\nTask Force Five: Indian Education. (1976). Report on Indian education: Final<br/>\nreport to the American Indian Policy Review Commission. Washington, DC: U.S.<br/>\nGovernment Printing Office.<br/>\n<br/>\nThompson, H. (1975). The Navajos&#39; long walk for education: A history of<br/>\nNavajo education. Tsaile, AZ: Navajo Community College.<br/>\n<br/>\nUnited States Commission on Civil Rights. (1975, September). The Navajo<br/>\nNation: An American colony. Washington, DC: Author.<br/>\n<br/>\nWax, M. L. (1971). Indian Americans: Unity and diversity. Englewood Cliffs,<br/>\nNJ: Prentice-Hall.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://libweb.princeton.edu:2003/libraries/firestone/rbsc/finding_aids/aaia/\">http://libweb.princeton.edu:2003/libraries/firestone/rbsc/finding_aids/aaia/</a><br/>\naaia.html<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nross.com/namohist.htm#volume2\">http://www.nross.com/namohist.htm#volume2</a>  (tape with boarding school first<br/>\nperson narrative)<br/>\n<br/>\n***And just incase that isn&#39;t enough, here&#39;s a bucket more:<br/>\n<br/>\nPunishment:<br/>\n<br/>\nTwo of our girls ran away...but they got caught. They tied their legs up,<br/>\ntied their hands behind their backs, put them in the middle of the hallway<br/>\nso that if they fell, fell asleep or something, the matron would hear them<br/>\nand she&#39;d get out there and whip them and make them stand up again. (Helma<br/>\nWard, Makah, interview with Carolyn Marr)<br/>\n<br/>\n&quot;The placement of North American Indian youngsters in residential boarding<br/>\nschools - and the abusive treatment they received there - is a part of our<br/>\nhistory that is seldom talked about.&quot;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://staff.lib.muohio.edu/nawpa/manuelHaskell.html\">http://staff.lib.muohio.edu/nawpa/manuelHaskell.html</a><br/>\n<br/>\n&quot;Its effects, they say, were more devastating than the sexual assaults and<br/>\nbeatings that occurred in at least some of the 125 Indian Residential<br/>\nSchools from the mid-19th century until the 1970s.&quot;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.vanessascollection.com/main/2000/9-24indian.html\">http://www.vanessascollection.com/main/2000/9-24indian.html</a><br/>\n<br/>\nThrough the Eyes of a Basketweaver<br/>\nCreation Section<br/>\nDir., photo dir.: Vern Korb<br/>\nDocumentary. While she weaves her baskets according to traditional<br/>\ntechniques of the Hupa, Yurok and Karuk nations, Vivien Hailstone re-weaves<br/>\nthe historical and cultural background of these Northern California peoples.<br/>\nShe tells of the near disappearance of this art when, as a young girl in a<br/>\nboarding school, she was forbidden to express her heritage, either through<br/>\nher language or the practice of a craft passed on by her grandmother.<br/>\n<br/>\n&quot;Also, beginning in the 1880s, boarding schools were established, resulting<br/>\nin the forced separation of children from their families.  Language Loss and<br/>\nRevitalization in California , By Leanne Hinton, Department of Linguistics,<br/>\nUniversity of California, Berkeley&quot;<br/>\n<br/>\n&quot;Like many of our parents and grandparents, he was sent to a boarding school<br/>\nand punished for using his language.  People of the Seventh Fire by Dagmar<br/>\nThorpe&quot;<br/>\n<br/>\n&quot;Boarding Schools or Concentration Camps? The end of the Gold Rush era<br/>\nsignaled a change in U.S. policy towards Native people. Instead of directly<br/>\nkilling California indigenous people, reservations were created and<br/>\nindigenous people were re-located to them. The children were taken, often by<br/>\nforce, away from their parents and to far-away re-education centers.<br/>\nChildren as young as four attended these re-education centers. They were<br/>\nforced to cut their hair and give up their clothing upon arrival.<br/>\n<br/>\nChildren could not have visitors, including their parents, while they stayed<br/>\nat the centers. Some children stayed for years at a time. Indian children<br/>\nwere often farmed out as free labor to white settlers in boarding school<br/>\ncommunities, and sometimes sold outright at auctions held by boarding school<br/>\nteachers.&quot;  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.originalvoices.org/USGovtRolesSix.htm\">http://www.originalvoices.org/USGovtRolesSix.htm</a><br/>\n<br/>\n&quot;You know how I was raised? In a boarding school, being slapped across the<br/>\nface, beaten for being an Indian, feeling ashamed of the color of my skin.&quot;<br/>\nSweet Tears and Bitter Pills, Mariana Kawall Leal Ferreira.<br/>\n<br/>\n&quot;The model for what became an entire system was the Carlisle Indian School,<br/>\nestablished in Pennsylvania in 1875 by Captain Richard Henry Pratt, a man<br/>\nwhose main qualification for the task seems to have been that he&#39;d earlier<br/>\nserved as warden of a military prison at Fort Marion, Florida. Following<br/>\nPratt&#39;s stated objective of &quot;killing the Indian&quot; in each student, Carlisle<br/>\nand other such facilities-Chilocco, Albuquerque, Phoenix, Haskell,<br/>\nRiverside; by 1902, there were two-dozen of thern-systematically<br/>\n&quot;deculturated&quot; their pupils. Children brought to the schools as young as age<br/>\nsix were denied most or all direct contact with their families and societies<br/>\nfor years on end. They were shorn of their hair and required to dress in the<br/>\nmanner of Euro-America, forbidden to speak their languages or practice their<br/>\nreligions, prevented from learning their own histories or being in any other<br/>\nway socialized among their own people.<br/>\n<br/>\nIndividual native families and, often, whole societies resisted the process.<br/>\nIn 1891, and again in 1893, Congress authorized the use of police, troops<br/>\nand other forcible means to compel the transfer of children from reservation<br/>\nto boarding school, and to keep them there once they&#39;d arrived. Hence,<br/>\ndespite the best efforts of their elders, and not infrequently of the<br/>\nstudents themselves, a total of 21,568 indigenous children--about a third of<br/>\nthe targeted age group-were confined in the schools in 1900. As of the late<br/>\n1920s, the system had been diversified and expanded to the point that<br/>\nupwards of eighty percent of each successive generation of native youth was<br/>\nbeing comprehensively &quot;acculturated&quot; in a more-or-less uniform fashion.&quot;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.zmag.org/ZMag/articles/jan98ward.htm\">http://www.zmag.org/ZMag/articles/jan98ward.htm</a><br/>\n<br/>\n&quot;According to many observers, the regimen of the schools usually included<br/>\ngetting Indians to dress, speak, and act like white people (see for example,<br/>\nWhiteman, 1986).&quot;<br/>\n<br/>\n&quot;At that time Indians were not U.S. citizens, and they lacked the right to<br/>\ncontrol their own lives and the education of their children (Eder & Reyhner,<br/>\n1988; Whiteman, 1986).&quot;<br/>\n<br/>\n://www.zmag.org/ZMag/articles/jan98ward.htm<br/>\n&quot;Indian Commissioner Thomas J. Morgan wrote in 1889 that &quot;the Indians must<br/>\nconform &#39;to the white man&#39;s ways,&#39; peaceably if they will, forcibly if they<br/>\nmust.&quot; Many Indians began their education at this time in boarding schools,<br/>\noften far from home, where they had their hair cut, where their native<br/>\nclothes were replaced, and where they were often punished for speaking their<br/>\nown languages (Whiteman, 1986).&quot;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ed.gov/databases/ERIC_Digests/ed314228.html\">http://www.ed.gov/databases/ERIC_Digests/ed314228.html</a><br/>\n<br/>\nWhile some Indian resistance was crushed by dramatic massacres, for the most<br/>\npart it was subdued by a combination of disease, alcohol, food rationing,<br/>\nthe cooperation of Indian collaborators, and the theft of children for<br/>\nboarding schools - a situation not radically unlike today.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cwis.org/fwdp/Americas/anti-ind.txt\">http://www.cwis.org/fwdp/Americas/anti-ind.txt</a><br/>\n<br/>\nPictures:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://content.lib.washington.edu/cgi-bin/pview.exe?CISOROOT=/loc&CISOPTR=18\">http://content.lib.washington.edu/cgi-bin/pview.exe?CISOROOT=/loc&CISOPTR=18</a><br/>\n27&CISORESTMP=/aipnw/search-templates/aipnw-results.html&CISOVIEWTMP=/aipnw/<br/>\nsearch-templates/aipnw-view1.html&CISOCLICK=title:subjec</div>","specialLinks":[]}],"prevTopicId":21852,"nextTopicId":21837}}