{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":8151304,"authorName":"rubyprincesstsg@aol.com","from":"rubyprincesstsg@...","profile":"rubyprincesstsg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: balance/sex on tv","postDate":"1049979544","msgId":63862,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5Yi4xMzNlMGU3YS4yYmM2YzQ5OEBhb2wuY29tPg=="},"prevInTopic":63849,"nextInTopic":0,"prevInTime":63861,"nextInTime":63863,"topicId":63849,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/9/2003 10:34:02 PM Eastern Daylight Time, ... I know it s mostly my problem.  My 9 year old neighbor comes over every morning for me to","messageBody":"<div id=\"ygrps-yiv-1778816191\">In a message dated 4/9/2003 10:34:02 PM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:wenrom31@...\">wenrom31@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I really have to snap out of <br/>\n&gt; it.  For goodness sakes, he IS 11.  When I was that age, I&#39;m sure I <br/>\n&gt; was exposed to sex on TV.  Maybe not as intense as nowadays, but who <br/>\n&gt; knows.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I know it&#39;s mostly my problem.  My 9 year old neighbor comes over every <br/>\nmorning for me to put on the bus for school, this morning he shows up with <br/>\nthe DVD eight mile.  I haven&#39;t seen it, I know it&#39;s the eminem movie, I <br/>\nwonder if he&#39;s supposed to see it.  I know his grandparents only let him <br/>\nwatch veggie tales when they watch him over the summer.  So, I call his mom <br/>\nat work, make him wait the hour until she gets in.  Do you know Jordan <br/>\nbrought over the eight mile DVD?  Yes, she says.  Is he allowed to watch it?  <br/>\nOf course, he&#39;s seen it before.  There&#39;s nothing bad in it except for a few <br/>\nwords.  OK, she&#39;s his mother (although I feel like I&#39;ve raised him since two, <br/>\nreally really absent mom) she&#39;s seen it, I haven&#39;t.<br/>\n<br/>\nHe&#39;s watching away, I bring him his breakfast and I notice he&#39;s furiously <br/>\ntrying to pause the movie every time I come near the doorway.  I ask him <br/>\nwhat&#39;s the problem, he first says he thinks he has it in the wrong &quot;input&quot;.  <br/>\nWhich of course I know nothing about and tell him to stop pushing the buttons <br/>\nit was playing fine.  Then I come back by and I SEE, there it is in living <br/>\ncolor Eminem and the girl friend he asked out on Friday night going at it at <br/>\nwork.  They are clothed, but the movements and sounds are very clear that sex <br/>\nis happening in this corner and it&#39;s just totally close up on the upper body <br/>\nand face so you get the full glorious experience.<br/>\n<br/>\nThat was a total panic moment.  Obviously he KNEW about this part and was <br/>\ntrying to stop it before I saw it.  Soooooo I picked up a magazine and looked <br/>\nat it while I&#39;m sure he sat nervously wondering if I was going to say <br/>\nanything about it. <br/>\n<br/>\nAwkward moment?  Yes, longest three minutes I&#39;ve had lately.  But I guess it <br/>\nwas MY being uncomfortable with it.  I guess he was a little embarassed about <br/>\nit or he wouldn&#39;t have tried to let me NOT see that scene.<br/>\n<br/>\nBut I guess the real question is what kind of impact does it have on a child <br/>\nto see or not see stuff like that?  I don&#39;t know, I&#39;m sure there are others <br/>\nthat do.  I&#39;m sure there are varying opinions on the subject.<br/>\n<br/>\nI think probably the worst thing about it was the uncomfortable tension that <br/>\nwas in the room.  Maybe had I KNOWN it was in the movie, maybe if he had <br/>\nKNOWN I was going to take that particular time to sit down with him and <br/>\nwatch?  Mabye the catching us both off guard is what  made it uncomfortable.<br/>\n<br/>\nI think I won&#39;t mention it to him at all.  But I think I will probably be <br/>\nwatching it with him again and maybe take the opportunity to say something <br/>\nlike, well geez no wonder their relationship didn&#39;t last, look how it started <br/>\nout, sex before you even had a first date!  Then say no more about that scene <br/>\nand leave it at that.<br/>\n<br/>\nBut I think you are right, it just might be OUR nervousness about this issue.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":77817828,"authorName":"LOWRIEK@aol.com","from":"LOWRIEK@...","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: balance/sex on tv","postDate":"1049957006","msgId":63849,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkNS43MTE4MDdiLjJiYzY2YzhlQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":63862,"prevInTime":63848,"nextInTime":63850,"topicId":63849,"numMessagesInTopic":0,"msgSnippet":"In a message dated 09/04/2003 19:34:23 Pacific Daylight Time, ... Don t these children come with their own feelings about sexuality as well? My son is 7, and","messageBody":"<div id=\"ygrps-yiv-1074870274\">In a message dated 09/04/2003 19:34:23 Pacific Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:wenrom31@...\">wenrom31@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; ?&quot;)  He is actually more <br/>\n&gt; comfortable with sexuality than I am for him.  I just <br/>\n<br/>\n </span></blockquote>Don&#39;t these children come with their own feelings about sexuality as well? My <br/>\nson is 7, and he asked me to get rid of the picture for April on our <br/>\ncalendar. It is a painting byMaxfield Parrish, called Egypt. It depicts two <br/>\nfemale nudes by a pool, one pre-adolescent, one woman. Neither is full on. <br/>\nQuite beautiful. I asked why, and he said it just made him feel <br/>\nuncomfortable, he wasn&#39;t sure why. I asked if he could find a way to see the <br/>\nbeauty, or atleast just put up with it for a while and see what he thought <br/>\nabout it later. This boy has always been Very modest about nudity.(his). We <br/>\nare nude a lot in this house(hideous mental picture time, Maureen!!) and I am <br/>\nnot sure why he is so not into his own nudity. Even as a very little guy was <br/>\nuncomfortable with being naked. Has explored with his buddy, is somewhat <br/>\ncurious, but very reserved. <br/>\nI don&#39;t think it is anything we have done because his sister is the nudity <br/>\nqueen!<br/>\nJust wondering, in light of the conversations. Any ideas?<br/>\nNancy, in PG<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":63812,"nextTopicId":63788}}