{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"Corallyn","from":"&quot;Corallyn &quot; &lt;hape2day@...&gt;","replyTo":"LIST","senderId":"udtRdy5iG_e3gi_WQTZes4u1okkaSa0D15fLpe3OzyLnDmYKqfwfBl8KwSAwW9q663AZOt03BYdo9dqmkZkulMqMd03vrsc","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Some questions from a Newbie","postDate":"967265846","msgId":12181,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhvN2lubSsyczhrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGEwLjhkNjkxODYuMjZkNjc2YTNAY3MuY29tPg=="},"prevInTopic":12147,"nextInTopic":0,"prevInTime":12180,"nextInTime":12182,"topicId":12147,"numMessagesInTopic":0,"msgSnippet":"... dentist and you ... comments. ... I always take this opportunity to inform the person that HSing is not as difficult as they think it is. You can do in 15","messageBody":"<div id=\"ygrps-yiv-1983788019\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@egroups.com\">Unschooling-dotcom@egroups.com</a>, mommiesapp@c... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Also, I took the book I was currently reading with me to the <br/>\n </span></blockquote>dentist and you <br/>\n<blockquote><span title=\"ireply\"> &gt; can&#39;t (well, you probably can) believe the criticism I got and the <br/>\n </span></blockquote>comments.  <br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;Oh, you don&#39;t have a teaching degree?&quot;  &quot;I could never take on the <br/>\n&gt; challenge&quot;, etc., etc. <br/>\n<br/>\n </span></blockquote>I always take this opportunity to inform the person that HSing is not <br/>\nas difficult as they think it is. You can do in 15 min at home what <br/>\nit takes the ps to do in an hour. Besides, 5, 6, 7, etc...year olds<br/>\nneed to be outside exploring and playing and learning in Mother <br/>\nNatures class room more than the class room of the govn&#39;t. I don&#39;t <br/>\nalways word it quite that way but that is the basic jist of it.<br/>\n<br/>\n<br/>\nAnyway, I congratulate all of you for doing the work <br/>\n<blockquote><span title=\"ireply\"> &gt; you are doing and sticking with it -- I sense it is going to be yet <br/>\n </span></blockquote>another <br/>\n<blockquote><span title=\"ireply\"> &gt; battle of wills within my family and around my circle of friends <br/>\n </span></blockquote>(many of <br/>\n<blockquote><span title=\"ireply\"> &gt; whom are teachers -- great!). <br/>\n<br/>\n<br/>\n </span></blockquote>I feel very lucky that my mil, who is ps educator, is extremely <br/>\nsupportive of homeschooling especially on letting the child learn at <br/>\nhis/her own time and pace. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; One question I have does not relate directly to homeschooling but <br/>\n </span></blockquote>will <br/>\n<blockquote><span title=\"ireply\"> &gt; probably make or break my decision -- how do you deal with behavior <br/>\n </span></blockquote>issues?  <br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m talking about your day to day tantrums and non responsive <br/>\n </span></blockquote>behavior?  My <br/>\n<blockquote><span title=\"ireply\"> &gt; dd is 3yo and my ds is only 7mo but I feel like I&#39;m on a roller <br/>\n </span></blockquote>coaster with <br/>\n<blockquote><span title=\"ireply\"> &gt; my daughter&#39;s behavior and not sure how to deal with all the <br/>\n </span></blockquote>conflicts.  I <br/>\n<blockquote><span title=\"ireply\"> &gt; have read many books but nothing seems to click for her (or me).  I <br/>\n </span></blockquote>do NOT <br/>\n<blockquote><span title=\"ireply\"> &gt; believe in any type of physical correction (hitting, smacking, <br/>\n </span></blockquote>flicking, <br/>\n<blockquote><span title=\"ireply\"> &gt; etc.).  If anyone has suggestions on books to read or websites, or <br/>\n </span></blockquote>lists, <br/>\n<blockquote><span title=\"ireply\"> &gt; please let me know.<br/>\n<br/>\n </span></blockquote>I have a 5.5yob and 3.5yog. Neither of them really spoke until they <br/>\nwere right around 3. What I mean is that they didn&#39;t speak anything <br/>\nanyone other than me understood. At 3 and even at 4 and after they <br/>\nhave their language skills they don&#39;t understand how to verbalize <br/>\ntheir feelings. Tantrums are the only way they know how to express <br/>\ntheir feelings. What I did was to let them have their tantrums when <br/>\nand where they were untill they began to gain strong verbal skills.<br/>\n(what I mean by strong verbal skills is that they can be easily <br/>\nunderstood by those who are not around them on a daily basis.) Then <br/>\nwhen they can be more easily understood I still permit them to have <br/>\ntheir tantrums but not in public and at home they have to go to their <br/>\nbedrooms till they are finished. I always make sure that when I send <br/>\nthem to their rooms for a tantrum that I use a calm voice so they <br/>\ndon&#39;t feel that they are in trouble. I also explain to them that they <br/>\nare more than welcome to express their feelings in this way in the <br/>\nprivacy of their room. I also talk to them about their feelings and <br/>\ngive names to them and tell them that it is okay to tell me how they <br/>\nfeel. I also begin putting rules on their tantrums like you&#39;re not <br/>\nallowed to kick, hit or throw anything other than your own <br/>\nposessions, this does not include furniture or toys shared by other <br/>\nsiblings, and the floor. This has seemed to work out well. My 3.5yog <br/>\nwill be 4 in Dec. Her tantrums are far and few between. My 5.5yob <br/>\nstill has one once in a while. He did today which surprised me and I <br/>\ntold him he had to stop or go to his room and that he was too old to <br/>\nact that way. If there was a problem we could discuss it, but he was <br/>\nnot allowed to have a fit about it. It wasn&#39;t even a tantrum in the <br/>\ntraditional sense but more of him whining and yelling and carying on <br/>\nbecause he didn&#39;t get what he wanted.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Lastly (I think!) I was very interested in the posts about the <br/>\n </span></blockquote>reading, spelling, etc.  My dd always wants to know what lettersstart <br/>\nwhich words and  will constantly aske me &quot;what does ________ start <br/>\nwith?&quot;  She too wants to  learn how to write the letters and I&#39;m not <br/>\nsure if there is a specific format or method that I should look into <br/>\nabout making sure I teach her how to correctly write the letters (or <br/>\nis this even necessary).  I find myself  writing the letters and then <br/>\nwondering if I&#39;m doing it right!! <br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n </span></blockquote> My ds is into words that rhyme (did I spell that right) He will pipe <br/>\nup out of the blue and say two words then state that they rhyme. <br/>\nSometimes he is correct sometime close and sometimes completely off. <br/>\nHe loves to do this. Ya know I just thought of a rhyming game to play <br/>\nwith him. I will have to try it next week. (They are going out of <br/>\ntown for the weekend.) I wouldn&#39;t worry about your technique of <br/>\nshowing her how to write her letters. If she is learning to write the <br/>\nletters and is content with her own progress you are doing a great <br/>\njob. I used to feel this also but I would think that because ds <br/>\nwasn&#39;t doing it yet that I wasn&#39;t doing a good job. I have been <br/>\nexcited for him to start writing and learn his numbers so we can move <br/>\non to more advanced games. I get bored with such simple games over <br/>\nand over and over.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;Also, she is  the ONLY person in my whole family that is left <br/>\n </span></blockquote>handed but she has no problem  following my hand when she watches me <br/>\nwrite the letters -- I thought that was  sooo neat!<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n </span></blockquote>I just have to say as a lefthanded person that it is very important <br/>\nto cater to her left hand. I will be 32 this year and still have a <br/>\nproblem telling the difference when I am looking at other people. To <br/>\nme I see them as a mirror image, their rightside to me is the left. <br/>\nIt has been the past few months that I have finally been able to see <br/>\ntheir right side as their right side without thinking so hard about <br/>\nit. It was interesting the other night I was talking to my mil, the <br/>\nps educator who supports hsing, and she was talking to me about the <br/>\nmidline and how important it is. I told her this about myself and she <br/>\nsaid that someone at some point must have tried to force me to use my <br/>\nright hand. I relayed a story to her that I still remember as if it <br/>\nwere yesterday about when I was a child learning to cut. We lived in <br/>\nConnecticut at the time and I was no more than 4yo. It took me <br/>\nforever to learn how to work the scissors because they were right <br/>\nhanded. My mom couldn&#39;t find any lefthanded scissors till we moved to <br/>\nTexas when I was nearly 5. I have never forgotten the frustration I <br/>\nfelt when she came home with these lefthanded scissors and I couldn&#39;t <br/>\nmake them work because I had learned to cut with my right hand. The <br/>\nonly other time someone tried to force me to do something in a <br/>\nrighthanded manner was in 3rd grade when my teacher tried to make me <br/>\nwrite with my paper straight up and down. This does not work with a <br/>\nlefty because you can&#39;t see what you are writing. Also whenever I do <br/>\nsomething for the first time I have to figure out which hand to use. <br/>\nIn high school I took Cosmetology. It took me about a week to figure <br/>\nout which hand to hold the scissors with and which hand to hold the <br/>\ncomb with. It was confusing because I wanted to hold them both with <br/>\nthe same hand wether it was the left or the right. I even made the <br/>\ndecission to cut with my left hand but gave it up bacause the <br/>\ninstructor showed me everything righthanded. Anyway, can you tell <br/>\nthat I still have some frustration over the whole thing. I don&#39;t <br/>\nusually make a big deal about it but sometimes I wish that I had been <br/>\ncattered to more as a lefty. Now about all I do lefthanded is use the <br/>\nmouse and write. Fortunately, dh doesn&#39;t have time to use the comp <br/>\nbut when he did he would have a fit when I would switch the buttons <br/>\non the mouse so they worked for my left hand. I got tired of <br/>\nswitching them and started using my right hand for the mouse or I <br/>\nwould use my lefthand and had to remember not to use my index finger <br/>\nto click with.<br/>\n<br/>\nCorallyn</div>","specialLinks":[]},{"userId":0,"authorName":"mommiesapp@cs.com","from":"mommiesapp@...","replyTo":"LIST","senderId":"BaL3EgMCtu426jNgYIN4gCcoZ_2Yog1bplCbrEvTxe-yV37MkPHG4-3bGPM_Ghq41vREOzyxsaQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Some questions from a Newbie","postDate":"967122083","msgId":12147,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGEwLjhkNjkxODYuMjZkNjc2YTNAY3MuY29tPg=="},"prevInTopic":0,"nextInTopic":12181,"prevInTime":12146,"nextInTime":12148,"topicId":12147,"numMessagesInTopic":0,"msgSnippet":"Hi all, I m relatively new to the list and I am only in the information gathering stages about homeschooling.  I ve been getting books from the library to","messageBody":"<div id=\"ygrps-yiv-1411201505\">Hi all, I&#39;m relatively new to the list and I am only in the information <br/>\ngathering stages about homeschooling.  I&#39;ve been getting books from the <br/>\nlibrary to better educate myself on the subject of homeschooling.  If anyone <br/>\nhas a MUST READ book, I would love to hear what it is.  <br/>\n<br/>\nAlso, I took the book I was currently reading with me to the dentist and you <br/>\ncan&#39;t (well, you probably can) believe the criticism I got and the comments.  <br/>\n&quot;Oh, you don&#39;t have a teaching degree?&quot;  &quot;I could never take on the <br/>\nchallenge&quot;, etc., etc.  Anyway, I congratulate all of you for doing the work <br/>\nyou are doing and sticking with it -- I sense it is going to be yet another <br/>\nbattle of wills within my family and around my circle of friends (many of <br/>\nwhom are teachers -- great!).<br/>\n<br/>\nOne question I have does not relate directly to homeschooling but will <br/>\nprobably make or break my decision -- how do you deal with behavior issues?  <br/>\nI&#39;m talking about your day to day tantrums and non responsive behavior?  My <br/>\ndd is 3yo and my ds is only 7mo but I feel like I&#39;m on a roller coaster with <br/>\nmy daughter&#39;s behavior and not sure how to deal with all the conflicts.  I <br/>\nhave read many books but nothing seems to click for her (or me).  I do NOT <br/>\nbelieve in any type of physical correction (hitting, smacking, flicking, <br/>\netc.).  If anyone has suggestions on books to read or websites, or lists, <br/>\nplease let me know.<br/>\n<br/>\nLastly (I think!) I was very interested in the posts about the reading, <br/>\nspelling, etc.  My dd always wants to know what letters start which words and <br/>\nwill constantly aske me &quot;what does ________ start with?&quot;  She too wants to <br/>\nlearn how to write the letters and I&#39;m not sure if there is a specific format <br/>\nor method that I should look into about making sure I teach her how to <br/>\ncorrectly write the letters (or is this even necessary).  I find myself <br/>\nwriting the letters and then wondering if I&#39;m doing it right!!  Also, she is <br/>\nthe ONLY person in my whole family that is left handed but she has no problem <br/>\nfollowing my hand when she watches me write the letters -- I thought that was <br/>\nsooo neat!<br/>\n<br/>\nBTW, thanks for allowing me to be a part of this list -- I THOROUGHLY enjoy <br/>\nthe insight and information regarding homeshcooling in general and <br/>\nunschooling specifically.<br/>\n<br/>\nMichelle in DE</div>","specialLinks":[]}],"prevTopicId":12178,"nextTopicId":12180}}