{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":341636512,"authorName":"healthunlimited1","from":"&quot;healthunlimited1&quot; &lt;shileennixon@...&gt;","profile":"healthunlimited1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: airsoft guns","postDate":"1209745986","msgId":34621,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ2ZmZvMitzcWhlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZ2YTBrMSs3ajlvQGVHcm91cHMuY29tPg=="},"prevInTopic":34618,"nextInTopic":0,"prevInTime":34620,"nextInTime":34622,"topicId":34575,"numMessagesInTopic":0,"msgSnippet":"... Amy, we have been big into airsoft for years and have actually invested quite a bit of money into the sport over the years.  My youngest son is now 15 but","messageBody":"<div id=\"ygrps-yiv-446587309\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;graberamy&quot; &lt;graber@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; So, I guess I&#39;m asking here wondering if anyone has experience with<br/>\n&gt; these airsoft guns.  And I guess I&#39;m wondering if this yes should wait?? <br/>\n&gt; <br/>\n&gt; amy g<br/>\n&gt; iowa<br/>\n<br/>\n<br/>\n </span></blockquote>Amy, we have been big into airsoft for years and have actually invested quite a bit of <br/>\nmoney into the sport over the years.  My youngest son is now 15 but like I said we&#39;ve <br/>\nplayed for years.  I can&#39;t remember how old he was when he started playing.  the &quot;rule&quot; is <br/>\nthat everyone MUST wear protective gear at all times.  If someone in the group refuses <br/>\nthen my son is instructed not to play.  All of us parents in the neighborhood are pretty <br/>\nmuch on the same page so wherever they&#39;re playing we keep a watchful eye without <br/>\nhovering.  The kids &quot;get&quot; the importance of safety so it really isn&#39;t much of an issue.  My <br/>\nboys love it when I play with them which is rare.  They think it&#39;s pretty funny with all of my <br/>\ngirly screaming and carrying ons.  <br/>\n<br/>\nMy boys have always had an interest in weapons - not because of negative influences but <br/>\nbecause it&#39;s their bent.  I think it&#39;s normal for boys to have a healthy interest in weapons.  <br/>\nHaving said that my own personal rule of thumb has always been that if I see anything <br/>\nstrange going on as with any other interest, I explore it and if need be pull in the reins.  I <br/>\ncan only think of a couple times when I&#39;ve had to do that  and airsoft has not been one of <br/>\nthem.<br/>\n<br/>\nShileen</div>","specialLinks":[]},{"userId":252651125,"authorName":"rowinadequina16","from":"&quot;rowinadequina16&quot; &lt;rowinadequina16@...&gt;","profile":"rowinadequina16","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: airsoft guns","postDate":"1209713402","msgId":34618,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ2ZWZ0cSt2azlAZUdyb3Vwcy5jb20+","inReplyToHeader":"PGZ2YTBrMSs3ajlvQGVHcm91cHMuY29tPg=="},"prevInTopic":34583,"nextInTopic":34621,"prevInTime":34617,"nextInTime":34619,"topicId":34575,"numMessagesInTopic":0,"msgSnippet":"... wait?? ... Our family does have experience with these guns, and they are a lot of fun to play with. I ve had children using them responsibly at 8, although","messageBody":"<div id=\"ygrps-yiv-2146101298\"><blockquote><span title=\"ireply\">&gt; &gt; So, I guess I&#39;m asking here wondering if anyone has experience with<br/>\n&gt; these airsoft guns.  And I guess I&#39;m wondering if this yes should<br/>\n </span></blockquote>wait??<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n </span></blockquote>Our family does have experience with these guns, and they are a lot of<br/>\nfun to play with. I&#39;ve had children using them responsibly at 8,<br/>\nalthough it was illegal to sell them to those under 14 where we lived. <br/>\nBut we used to live in the middle of nowhere. Now we live in an area<br/>\nwhere playing with guns like these would be a dangerous choice to make.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.commercialappeal.com/news/2008/may/01/cville-officer-captures&#92;\">http://www.commercialappeal.com/news/2008/may/01/cville-officer-captures&#92;</a><br/>\n-suspect-11/<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.commercialappeal.com/news/2008/may/01/cville-officer-capture&#92;\">http://www.commercialappeal.com/news/2008/may/01/cville-officer-capture&#92;</a><br/>\ns-suspect-11/&gt;<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.commercialappeal.com/news/2007/jun/24/shooting-causes-uproar/\">http://www.commercialappeal.com/news/2007/jun/24/shooting-causes-uproar/</a><br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.commercialappeal.com/news/2007/jun/24/shooting-causes-uproar&#92;\">http://www.commercialappeal.com/news/2007/jun/24/shooting-causes-uproar&#92;</a><br/>\n/&gt;<br/>\n<br/>\n<br/>\nPeace,<br/>\nRobin<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":326163661,"authorName":"Mamachaos","from":"&quot;Mamachaos&quot; &lt;mamachaos@...&gt;","profile":"ron_monach","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:airsoft guns","postDate":"1209583604","msgId":34583,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDgwMWM4YWFmOCQyMTQyM2VhMCQ0NDAxYThjMEByb251MmZpczR0OHNrOD4="},"prevInTopic":34575,"nextInTopic":34618,"prevInTime":34582,"nextInTime":34584,"topicId":34575,"numMessagesInTopic":0,"msgSnippet":"Amy~ About airsoft guns:  I could ve written your letter.  It sounds exactly where I was at a few years ago, though my son was probably 10.  The kids from the","messageBody":"<div id=\"ygrps-yiv-142242336\">Amy~<br/>\n<br/>\nAbout airsoft guns:  I could&#39;ve written your letter.  It sounds exactly where I was at a few years ago, though my son was probably 10.  The kids from the hood with the guns were the kids he played with.  I told them to please not bring the guns to the house if they wanted to play at our home.  I had a 6 and 2 year old at the time.  The kids listened and respected that.  These same kids always walked the line between being great and practically breaking the law, so I had to keep a close eye on my son, who is only 1 year younger.  At 11, I gave in.  I say &quot;gave in&quot; because that is how I felt about it at the time.  I didn&#39;t want to argue about it EVERY day.  Yes, I was and still am very concerned about the safety....but he protected himself and I told all the kids *my* expectation that they ALL protect themselves at all times, that I was concerned and loved them all.  <br/>\n<br/>\nThey played a lot for a few weeks.  Then once a week, then once a month.  You get it.  But my son was so thrilled to be more of a part of his &quot;tribe&quot; and not so far on the outskirts.  Which I think he has always felt being homeschooled and our home being the LAST to own any video game system etc.  <br/>\n<br/>\nHis trust in me went up and mine in him as well.  It did lead to paint ball------------but again, 3x a year maybe??  It really was more about the mutual trust, and ME hearing what HIS wants were.  <br/>\n<br/>\nI hate guns.  I have never wanted anything to do with them.  I have 3 boys.  They love swords, knives, guns....you name it.  But they also fully believe in fairies, knomes, elves and goodness everlasting.  So that is the balance of the scales for them I guess.  I try to think about the hardwiring that is in each of us.  I tend to rely on this a lot to help me understand the needs of my boys.  Men/boys were the protectors for thousands of years.  They could not be afraid to be attacked or to attack.  They were busy hunting and focusing on that ONE goal----feeding the family or group.  (this might explain part of why we perceive men as only being able to accomplish one thing at a time).  <br/>\n<br/>\nMy boys&#39; drive toward guns was not brought on by MTV (never seen it) nor movies or real life dramas.  They made &quot;guns&quot; from sticks as early as they could walk.  So, I don&#39;t think it is about the violence for them.  Though *I* feel guns are violent by nature.......the boys do not.  We have talked for hours about his issue, and it helped my oldest be a bit more patient with me during the time he was hearing NO.  But I told him that I would really find a way to make his DESIRE be realized.  And I did.  I had to expand MY comfort zone.  Just as I ask him to expand his comfort zone by reading an article or joining me for a play.  We all need to stretch.<br/>\n<br/>\nThat being said, of course--go look, observe, and continue to talk and observe your son&#39;s play with these guns.  My little guys-now 9 and 5 play with them.......EMPTY.  That does not decrease the fun for them.  Besides, the &quot;bullets&quot; cost money and usually my oldest has other things he would rather do for the same cost.  Now it is on to ATV&#39;s and jet skies.........so stretch NOW!<br/>\n<br/>\nKelley<br/>\n<br/>\n<br/>\n<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandandstardust.blogspot.com/\">http://sandandstardust.blogspot.com/</a><br/>\n<br/>\n&quot;Childhood is a journey, not a race.&quot;<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":199360242,"authorName":"graberamy","from":"&quot;graberamy&quot; &lt;graber@...&gt;","profile":"graberamy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"airsoft guns","postDate":"1209566657","msgId":34575,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZ2YTBrMSs3ajlvQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":34583,"prevInTime":34574,"nextInTime":34576,"topicId":34575,"numMessagesInTopic":0,"msgSnippet":"OK, my 8 (almost 9) yo son was playing with some neighborhood kids yesterday and they were playing with these airsoft guns (kinda like a paintball game just","messageBody":"<div id=\"ygrps-yiv-770565906\">OK, my 8 (almost 9) yo son was playing with some neighborhood kids<br/>\nyesterday and they were playing with these airsoft guns (kinda like a<br/>\npaintball game just with plastic bb&#39;s).  So, my son wants one.  I want<br/>\nto say yes, but part of me is wondering if that is really just not<br/>\nvery smart on my part???<br/>\n<br/>\nI should say that I don&#39;t really care for these kids in the<br/>\nneighborhood and they aren&#39;t my sons first choice to play with, but<br/>\nsince it&#39;s warmed up they&#39;ve been coming over more often.<br/>\n<br/>\nMy concerns.<br/>\n<br/>\nWhat would the neighbors think of me for letting my son play with<br/>\nthese  ??  I know...who cares!  I can get over this one!!<br/>\n<br/>\nIs he old enough??  These boys are a few years older...but I wouldn&#39;t<br/>\nsay they&#39;re more mature.  In fact yesterday one of them had an extra<br/>\ngun for him to play with and he said he wanted to watch first and<br/>\ncheck it out with mom and dad?  (WOW, when I was a kid I sure wouldn&#39;t<br/>\nhave done that!!  What&#39;s that saying, easier to ask for forgiveness<br/>\nthan permission?? &lt;bwg&gt;)<br/>\n<br/>\nSo, last night I told him I&#39;d do some research (which I&#39;m in the<br/>\nprocess of and these are outlawed in some countries)! I also read that<br/>\nyou have to be 18 to purchase these.  One website selling these, says<br/>\nthis is NOT a toy.  Most articles I&#39;m reading are saying these guns<br/>\nare not for children unless supervised by an adult.  Which I could do.<br/>\n I also told him I&#39;d like to walk down to the park and see how it&#39;s<br/>\nplayed, check it out, see how safe I feel it is.<br/>\n<br/>\nI know all about the safety gear (eyewear,etc.) and knowing him he&#39;d<br/>\nbe really responsible about listening to the warnings and taking the<br/>\nsafety precautions!  One of my concerns is these kids that he&#39;s<br/>\nplaying with and that they won&#39;t be very careful. <br/>\n<br/>\nDS has always enjoyed weapons, light sabers, swords, toy guns, all<br/>\nthat kind of imaginative play! Which to be honest, before I had kids<br/>\n(my son), I would have said I&#39;d never bring a weapon into my house<br/>\n(real or fake)!  So, I&#39;ve done a 180, but I still don&#39;t own any real<br/>\nguns! :)  <br/>\n<br/>\nSo, I guess I&#39;m asking here wondering if anyone has experience with<br/>\nthese airsoft guns.  And I guess I&#39;m wondering if this yes should wait?? <br/>\n<br/>\namy g<br/>\niowa</div>","specialLinks":[]}],"prevTopicId":34571,"nextTopicId":34635}}