{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":280852700,"authorName":"Schuyler","from":"&quot;Schuyler&quot; &lt;s.waynforth@...&gt;","profile":"schuyler_waynforth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Unschooling outcomes","postDate":"1171194424","msgId":28010,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNGEwMWM3NGRkMiQ1YTcxOGIxMCQ0MDAxYThjMEBEYXZpZD4=","referencesHeader":"PFBLRUhKR0NJR05QUEFCRlBCS0xHTUVITkZHQUIuamFja2lAYm9hcmRwcmVwLm5ldD4gPFBLRUhKR0NJR05QUEFCRlBCS0xHTUVIT0ZHQUIuamFja2lAYm9hcmRwcmVwLm5ldD4gPCEmIUFBQUFBQUFBQUFBWUFBQUFBQUFBQUZCVllXUUtPZlJKbXdxRmdkM2xaaGJDZ0FBQUVBQUFBRThzTlkxY3NUeEFzTkZmOWtRTVFUSUJBQUFBQUE9PUBzb2NhbC5yci5jb20+IDwwMDEzMDFjNzRkNWYkZDBhZTE1NTAkMDMwMTAwMGFAUm9ieW5zTGFwdG9wPiA8ISYhQUFBQUFBQUFBQUFZQUFBQUFBQUFBRkJWWVdRS09mUkptd3FGZ2QzbFpoYkNnQUFBRUFBQUFLc0l4c2srcHloTWprQUo5dTNPV2xrQkFBQUFBQT09QHNvY2FsLnJyLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":28009,"nextInTime":28011,"topicId":28010,"numMessagesInTopic":0,"msgSnippet":"There aren t really unschooler statistics . Unschooling isn t something which science has put under the microscope and come up with a list of outcomes. That","messageBody":"<div id=\"ygrps-yiv-756457893\">There aren&#39;t really &quot;unschooler statistics&quot;. Unschooling isn&#39;t something which science has put under the microscope and come up with a list of outcomes. That said, Paula Rothermal, at the University of Durham (although she lives in Manchester with her three children who learn autonomously--which is the UK&#39;s unschooling) did a couple of papers on home-education in the UK. I can&#39;t find the paper of hers that I want, her site ( <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.dur.ac.uk/p.j.rothermel/\">http://www.dur.ac.uk/p.j.rothermel/</a> ) has been updated since the last time I was there. But what she found, by soliciting the Education Otherwise list for people willing to fill in questionaires and to have their children be given standard assessment tests, is that home-education, across the board, had far fewer failures than did schooled education and that children who were autonomously educated, or unschooled, did at least as well as their school-at-home peers on the standardized tests she administered. Although, the children with the steepest learning curve where those children in a religious household. You could probably contact her and ask for an e-copy of her papers. <br/>\n<br/>\nI think the reason why you are getting a mixed response to your questions is that you aren&#39;t being particularly specific about what you need, except to say that you want to know the failure rate of unschooling, the downsides to unschooling. And while I consider myself a scientist for whom the value of case studies is limited, I will tell you how we could be judged as failures or as successes. <br/>\n<br/>\nI have two children, Simon who is 9 and Linnaea who is 6. Neither of them have ever been to school. And, while I can remember giving Simon dot-to-dot pages of letters to trace when he was 3 to help him master his reading (I left those tendencies behind long ago), neither of them have ever been schooled-at-home. I don&#39;t know what milestones Simon or Linnaea are supposed to have met academically. I used to check Simon&#39;s progress against an about.com&#39;s school expectations page, but I also let that go some time past. I have never checked Linnaea&#39;s progress against anything, Simon had so successfully dispensed with all of my fears that I didn&#39;t feel any need to quantify Linnaea&#39;s learning. <br/>\n<br/>\nBoth Simon and Linnaea can think in numbers. They mentally play around with numbers and will talk about math comfortably. <br/>\nSimon isn&#39;t reading yet, Linnaea is. <br/>\nSimon has a good working knowledge of Greek and Roman and Egyptian mythology. <br/>\nLinnaea can recognize many different breeds of dogs.<br/>\nBoth Simon and Linnaea have seen and understand the life cycle of parasitic wasps, long-horned wood-boring beetles, wolf spiders, butterflies, frogs, and in the nearish future a cat. <br/>\nBoth are working on their understanding of cooking science. And are completely willing to try things that I would never have thought might possibly be appealling, but sometimes are. <br/>\nSimon can name any Pokemon at 500 paces, and because of that love, has a great understanding of how to use reference books. <br/>\nBoth can harness the research capabilities of the internet. <br/>\nBoth can formulate a hypothesis and test it.<br/>\nLinnaea can recognize the different birds that are coming to our feeders. <br/>\nSimon can tell stories that follow a very linear structure.<br/>\nBoth can hold conversations with adults. Linnaea is probably better while Simon is a bit more abrupt, but there exists no real fear of adults for either of them.<br/>\nThey both have a beginning understanding of who Shakespeare was and what he did.<br/>\nThey both have a beginning understanding of Gilbert and Sullivan.<br/>\n<br/>\n<br/>\nI could go on for quite a long time. I&#39;ve never actually done a list like this before. It is impressive to me to see it laid out. And while I have never been that nervous of how we would look if I had to put together a proforma for the education authorities in the UK, it is cool to see how it might look. <br/>\n<br/>\nWhat do you want for your daughter? What do you want to see happen? You said in your original post that she was a reluctant learner, but maybe if you look at what she does know, if you write it out, you will see that her reluctance is greatest in the areas that your pressure is greatest. In one of the Paula Rothermel papers I skimmed through seeing if I could find the one that compared educational approaches was this line: &quot;Education is compulsory, school is not. The anomaly is that the government, places compulsion upon learning, which is a human instinct.&quot; Learning is a part of life. School works very hard to make learning seem like work. <br/>\n<br/>\nWe are being there and doing that and I cannot see the downsides. I see Simon and Linnaea enjoying their lives and learning from every situation they are in. But it has been a long time since I felt any need to check to see if they are learning those things that school would require. It might be easier for people to reply to your needs if you were to ask more specific questions. <br/>\n<br/>\nSchuyler<br/>\nwww.waynforth.blogspot.com<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;Deborah Greenspan&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dgreens1@...\">dgreens1@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>&gt;<br/>\nSent: Sunday, February 11, 2007 5:11 AM<br/>\nSubject: RE: [AlwaysLearning] Special Needs Unschool: Mine or Hers<br/>\n<br/>\n<br/>\nI don&#39;t know many unschoolers. I think I&#39;ve met two. I don&#39;t know unschooler<br/>\nstatistics. My fear is based on the regret of following a theory before that<br/>\nfailed us painfully-&quot;site-based school is a good option, and the only way to<br/>\ngo, what do you have to lose?&quot; I bought it hook, line, and sinker. So now<br/>\nI&#39;m more cautious. <br/>\n<br/>\nI&#39;m asking questions. It seems that some people are OK with that. Others are<br/>\nnot. Some people understand the transition. Others get upset I ask<br/>\nquestions. I want to know the downside, yes. Every decision has a downside,<br/>\nbell curve or not.  I want perspective of someone who&#39;s been there and done<br/>\nthat. <br/>\n<br/>\n <br/>\n<br/>\nAll the best,<br/>\n<br/>\n <br/>\n<br/>\nDeborah :-)<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]}],"prevTopicId":28001,"nextTopicId":28011}}