{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":94797851,"authorName":"Karin","from":"&quot;Karin&quot; &lt;curtkar@...&gt;","profile":"kc85022","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom]  supportive letter","postDate":"1019489581","msgId":35598,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwM2IwMWMxZWExMiRmZDI1YWMyMCQ2NDAwYThjMEBnb2R6aWxsYT4=","referencesHeader":"PDUuMC4yLjEuMC4yMDAyMDQyMTE2NDUxMy4wMjk2N2I4MEBsb2NhbGhvc3Q+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":35597,"nextInTime":35599,"topicId":35598,"numMessagesInTopic":0,"msgSnippet":"Tia - I don t know why but reading this letter that you wrote to your son just made me cry. What a very sweet mom you are! I hope it makes him feel better","messageBody":"<div id=\"ygrps-yiv-1894588794\">Tia - I don&#39;t know why but reading this letter that you wrote to your son<br/>\njust made me cry.<br/>\nWhat a very sweet mom you are!<br/>\nI hope it makes him feel better about himself and his future.<br/>\nI think every kid deserves a loving, supporting letter like this at some<br/>\npoint, from their parents.<br/>\nThanks for sharing it with us.<br/>\n<br/>\nKarin<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So I&#39;m the one who convinced him that he was &quot;behind&quot; and needing to be<br/>\n&gt; &quot;caught up&quot;. . . sigh.  Since he&#39;s a kid who doesn&#39;t like to give much<br/>\n&gt; feedback during a conversation, I&#39;ve written him a letter.  I gave it to<br/>\n&gt; him last night, and so far he hasn&#39;t said anything about it.  That&#39;s<br/>\n </span></blockquote>pretty<br/>\n<blockquote><span title=\"ireply\"> &gt; normal for him.  He tends to like to think about things for a while.  This<br/>\n&gt; is what I wrote to him.  Maybe it will give you some ideas.  Maybe someone<br/>\n&gt; will have more ideas for me.  Who knows.<br/>\n&gt; ****************************************************************<br/>\n&gt; I want to explore this desire you have to get &quot;caught up&quot;. I wonder if you<br/>\n&gt; believe what the school system believes, that kids are empty vessels who<br/>\n&gt; need certain kinds of knowledge poured into them.  They have to be made to<br/>\n&gt; learn things because learning isn&#39;t any fun.  Well Dad and I don&#39;t believe<br/>\n&gt; that&#39;s true.<br/>\n&gt;<br/>\n&gt; We&#39;ve watched you absorb knowledge like a sponge since you were<br/>\n&gt; little.  You probably didn&#39;t realize you were learning things because it<br/>\n&gt; was so easy to do.  When you were in preschool, I realized that the other<br/>\n&gt; kids knew the colours, and you didn&#39;t.  I made a mental note to play some<br/>\n&gt; colour games or something with you but didn&#39;t get around to it.  A couple<br/>\n&gt; of months later, I noticed that you knew the colours.  It&#39;s been like that<br/>\n&gt; with all kinds of things.<br/>\n&gt;<br/>\n&gt; You still amaze me with your ability to do mental math.  You&#39;re way better<br/>\n&gt; than I am at that. I know that you have more trouble with written-down<br/>\n&gt; math, but most kids do at first.  It&#39;s just a different skill that you can<br/>\n&gt; learn when you need it.  In fact, I&#39;ll bet you could just start right now<br/>\n<br/>\n&gt; with, say, algebra, and work your way through any gaps in your math<br/>\n&gt; knowledge as you learned it.  (You couldn&#39;t do that in school because the<br/>\n&gt; class would be moving too fast.)<br/>\n&gt;<br/>\n&gt; That brings me to purpose for learning.  You seem to have little trouble<br/>\n&gt; finding out what you want to know about bikes and riding.  You watch.  You<br/>\n&gt; ask.  You read your magazines.  You read web pages.  You have a purpose,<br/>\n </span></blockquote>so<br/>\n<blockquote><span title=\"ireply\"> &gt; you learn.<br/>\n&gt;<br/>\n&gt; The kids in school have a purpose for learning the stuff they learn.  It&#39;s<br/>\n&gt; called grades, and it&#39;s totally artificial.  Grades don&#39;t even show what<br/>\n&gt; you&#39;ve actually learned.  They&#39;re just an average of all the scores you<br/>\n </span></blockquote>get<br/>\n<blockquote><span title=\"ireply\"> &gt; on homework and tests in a class.  You can sort of learn everything that&#39;s<br/>\n&gt; offered in a course and get a C.  You can also be really good at part of<br/>\n </span></blockquote>it<br/>\n<blockquote><span title=\"ireply\"> &gt; while not understanding the rest at all, and you&#39;ll still probably get a<br/>\n&gt; C.  You can ask your brother or sisters how much of it you&#39;d remember next<br/>\n&gt; year, or even next week.<br/>\n&gt;<br/>\n&gt; We follow a different philosophy of learning.  It&#39;s called<br/>\n&gt; unschooling.  Some people call it real learning.  Real learning is wanting<br/>\n&gt; to know something, finding the answers, and enjoying the process.  You<br/>\n&gt; actually do that all the time, though you haven&#39;t done it much so far in<br/>\n&gt; the academic areas.<br/>\n&gt;<br/>\n&gt; If the reason you want to get caught up is that you are concerned about<br/>\n&gt; your future, we can work with that. The first thing to do is think about<br/>\n&gt; your strengths. What are you good at? I&#39;ve started a separate list for<br/>\n&gt; that, which we can add to. Then you think about what you like doing. Once<br/>\n&gt; you&#39;ve thought about what you&#39;re good at and like doing, then we can help<br/>\n&gt; you start thinking about your goals. You take what you like and are good<br/>\n&gt; at, and explore careers that use those strengths and interests.<br/>\n&gt;<br/>\n&gt; The next step is to figure out what you need to do in order get started in<br/>\n&gt; that career. If there&#39;s an academic requirement, we can help you meet it.<br/>\n&gt; It&#39;s only at that point that you need to be concerned with &quot;catching up&quot;<br/>\n&gt; and then only in the areas that you&#39;re going to need.<br/>\n&gt;<br/>\n&gt; What about university or technical school? Don&#39;t assume that graduating<br/>\n&gt; from high school and going on to university is a good way into a career.<br/>\n </span></blockquote>It<br/>\n<blockquote><span title=\"qreply\"> &gt; rarely is. If you want to be a doctor or lawyer or veterinarian or<br/>\n&gt; something like that, you&#39;d need university (and a lot more). But there are<br/>\n&gt; lots of university grads who still don&#39;t know what they want to be when<br/>\n&gt; they grow up. A lot of them are flipping burgers to pay off their student<br/>\n&gt; loans. University is expensive. And for a person who doesn&#39;t use reading<br/>\n&gt; and writing as their preferred way of learning, it can be painful.  I&#39;m<br/>\n&gt; sure you could do it if it was your only path into your chosen career, but<br/>\n&gt; there are probably ways that would work better for you.<br/>\n&gt;<br/>\n&gt; There are lots of jobs that pay well that don&#39;t involve university.<br/>\n&gt; Electricians, plumbers, welders, sound technicians, for instance. Those<br/>\n&gt; usually involve a short college course and then maybe an apprenticeship.<br/>\n&gt; You get paid during an apprenticeship, and you learn by doing. The book<br/>\n&gt; learning is minimal for those kinds of jobs. They are also physical jobs,<br/>\n&gt; which you seem to lean toward. I know you don&#39;t want to plant trees for a<br/>\n&gt; living, but there are physical jobs that aren&#39;t so hard on your body and<br/>\n&gt; pay better.<br/>\n&gt;<br/>\n&gt; You also have a very good business sense that could be developed if you<br/>\n&gt; chose to start your own business. I could see you opening a bike store one<br/>\n&gt; day or running eco tours. (Taking groups of people mountain bike camping,<br/>\n&gt; for instance.) I could see you building furniture or houses or . . .  Once<br/>\n&gt; you really start exploring your strengths and interests, you&#39;ll be able to<br/>\n&gt; think of lots of ideas. We can help you figure out how to make your dreams<br/>\n&gt; come true, but you have to find the dreams.<br/>\n&gt; ***********************************************************************<br/>\n&gt; Tia<br/>\n&gt;<br/>\n&gt; No one can make you feel inferior without your consent.<br/>\n&gt; Eleanor Roosevelt<br/>\n&gt; *********************************************<br/>\n&gt; Tia Leschke<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a><br/>\n&gt; On Vancouver Island<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]}],"prevTopicId":35364,"nextTopicId":35581}}