{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":12,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Freedom To Learn - Benefits of Unschooling","postDate":"1330528732","msgId":65982,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4NkVBQTMyLUNCOUItNDA5Mi04NTFELTJGQzdBNzVGNDdFRUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGppbDY3MCttY2trQGVHcm91cHMuY29tPg==","referencesHeader":"PGppbDY3MCttY2trQGVHcm91cHMuY29tPg=="},"prevInTopic":65980,"nextInTopic":0,"prevInTime":65981,"nextInTime":65983,"topicId":65949,"numMessagesInTopic":0,"msgSnippet":"Child-led learning has been around, as a term, for a long time.  It IS used by lots of unschoolers.  Pam wrote something really great about why it s a","messageBody":"<div id=\"ygrps-yiv-283290946\">&quot;Child-led learning&quot; has been around, as a term, for a long time.  It IS used by lots of unschoolers.  Pam wrote something really great about why it&#39;s a problem recently.  We&#39;ve been objecting to it as it came up here for a long time.  <br/>\n<br/>\nIt&#39;s shorthand for something that might help very school-stuck people see the path lighting up, but it&#39;s not a good tool to carry to the end of the path.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://learninghappens.wordpress.com/2011/09/24/unschooling-is-not-child-led-learning/\">http://learninghappens.wordpress.com/2011/09/24/unschooling-is-not-child-led-learning/</a><br/>\n<br/>\nI think it&#39;s a perspective situation.  It depends on the audience.  The audience for Always Learning is generally analytical people who are already persuaded that unschooling is a good idea.   That audience is pretty rarified.  There are lots of vague and flighty people out there.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Freedom To Learn - Benefits of Unschooling","postDate":"1330527542","msgId":65980,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE0RDU1MTMwLTY1RTYtNDI4NC05QjA3LUY0NDNGMzBBNTRDNkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDUyNEQ4NUY2LTJGM0MtNEM4My05NEQ2LTgyM0NCQzU3ODMwQUBnbWFpbC5jb20+","referencesHeader":"PGppazJzbitkMGtuQGVHcm91cHMuY29tPiA8NTI0RDg1RjYtMkYzQy00QzgzLTk0RDYtODIzQ0JDNTc4MzBBQGdtYWlsLmNvbT4="},"prevInTopic":65978,"nextInTopic":65982,"prevInTime":65979,"nextInTime":65981,"topicId":65949,"numMessagesInTopic":0,"msgSnippet":"-=- When I started researching unschooling in 2008 I was sometimes overwhelmed with the sheer amount of information out there. I didn t know which sources were","messageBody":"<div id=\"ygrps-yiv-1135446148\">-=- When I started researching unschooling in 2008 I was sometimes overwhelmed with the sheer amount of information out there. I didn&#39;t know which sources were most credible in the anonymous world of the internet. I was disappointed that I did not have the example of families I knew in real life. Some of the unschooling information was contradictory, some of it was against what I believed at the time, some of it was great, some of it was fluff. -=-<br/>\n<br/>\nIf there were some way to put warnings on various lists and writers, my list would have a lot of warning signs from people who really love and prefer fluff and &quot;support.&quot;  I could put specific warnings on lots of other lists, about why they were formed--usually a fit if pique of the founder who really wanted to be important and couldn&#39;t hold her own in a group with me, Joyce and Pam (or others) in it. Years back there were some who just could not defend what they were doing and saying, and so went off and made their own forum where we wouldn&#39;t be there to say &quot;This is inconsistent, you know.&quot;  <br/>\n<br/>\nSome are sweet in public and very mean &quot;back stage.&quot;<br/>\n<br/>\nSome have changed the descriptions of their yahoo lists, starting off one way, and going quite another.  When I gave a lead to someone who really, truly did need a special needs group, the owner wrote me a mean e-mail saying to stop sending people to her list, that it wasn&#39;t for special needs and it never was.  Never WAS?  That&#39;s Animal-Farm stuff.  The description was still on webpages all over the internet: <br/>\n_______<br/>\nThis list is a forum for those either radically unschooling or learning how to radically unschool to discuss our Shining children (Highly Sensitive, Out of Sync, Asperger’s traits, Explosive) and all the glorious and challenging issues that accompany life with them. High volume list.<br/>\n_________<br/>\nI remember the list being created, and the reasons why.  Saying &quot;yes, it used to be special needs, but it has changed,&quot; would be honest.  Saying it never was is not honest.<br/>\n<br/>\nThere are other bad examples, and lists that started off with one person in a huff, and were inherited by others who didn&#39;t know the origins of what they had inherited.<br/>\n<br/>\nIf someone is known to be dishonest, or makes false claims (a PhD and Master&#39;s Degree that don&#39;t exist, or &quot;at the forefront of the unschooling movement for a decade&quot; when someone wasn&#39;t around at all a decade ago), how reliable can their stories be about their children&#39;s lives?  <br/>\n<br/>\nSome people are helping other people for money.  They have visions of fame and riches.  That&#39;s a danger, especially when combined with dishonesty. <br/>\n<br/>\nIf people have the energy to help to clarify what one prolific outside writer understands, that&#39;s great.  But just as with odd little protestant churches, they can pop up any time, and might become mega churches, and might dissolve in flaming scandals.  <br/>\n<br/>\nNo matter how horrible a person might be, there will still be supporters.  <br/>\n<br/>\nThe best I can do, I think, is to answer questions honestly and to continue to live with integrity.   If Peter Gray was describing what he saw, let him.    Clarifying would be peachy, but we can&#39;t control what everyone in the world thinks or says.  We can&#39;t always controls what WE think or say. :-)<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":439465581,"authorName":"Colleen","from":"&quot;Colleen&quot; &lt;3potatoes@...&gt;","profile":"trespotatoes","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Freedom To Learn - Benefits of Unschooling","postDate":"1330519072","msgId":65978,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGppbDY3MCttY2trQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMzA0OTAxMjMuNzEwNzguWWFob29NYWlsTmVvQHdlYjEyMjUwMy5tYWlsLm5lMS55YWhvby5jb20+"},"prevInTopic":65975,"nextInTopic":65980,"prevInTime":65977,"nextInTime":65979,"topicId":65949,"numMessagesInTopic":0,"msgSnippet":"***I wouldn t suggest using that term!  It already gets over used and complicates understanding!  Someone already suggested extreme .  I think he needs to","messageBody":"<div id=\"ygrps-yiv-47529311\">***I wouldn&#39;t suggest using that term!  It already gets over used and complicates understanding!  Someone already suggested &quot;extreme&quot;.  I think he needs to re-examine the spectrum he&#39;s using.  That&#39;s my thought!***<br/>\n<br/>\nExtreme was me.<br/>\nI thought if he really wants to define a spectrum of unschooling, that using the word &quot;radical&quot; to mean something different than it already means in unschooling circles seemed confusing.  And suggesting that instead of using &quot;moderate&quot; and &quot;radical&quot; he use &quot;people who get it&quot; and &quot;people who don&#39;t&quot; ... well... though I was tempted I decided sarcasm wouldn&#39;t be wise or kind :-) <br/>\n<br/>\nI do personally wish he would leave the spectrum aside and analyze and discuss the responses without needing the categories, and I agree with those who&#39;ve said it doesn&#39;t seem productive or helpful to group child-led learning and unschooling together under the unschooling umbrella.  To me those are definitely, if one wants to talk spectrums again, 2 opposite ends of such - those who are waiting for their kids to lead, and those who are opening the world up to their kids, seeing what makes them sparkle, and making sure they have more of that (my son calls things that interest him &quot;things that make me feel all sparkly&quot;) :-)  <br/>\n<br/>\nColleen</div>","specialLinks":[]},{"userId":332164648,"authorName":"Rippy and Graham Dusseldorp","from":"Rippy and Graham Dusseldorp &lt;ripgray@...&gt;","profile":"rdusseldorp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Freedom To Learn - Benefits of Unschooling","postDate":"1330510323","msgId":65975,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUyNEQ4NUY2LTJGM0MtNEM4My05NEQ2LTgyM0NCQzU3ODMwQUBnbWFpbC5jb20+","inReplyToHeader":"PGppazJzbitkMGtuQGVHcm91cHMuY29tPg==","referencesHeader":"PGppazJzbitkMGtuQGVHcm91cHMuY29tPg=="},"prevInTopic":65974,"nextInTopic":65978,"prevInTime":65974,"nextInTime":65976,"topicId":65949,"numMessagesInTopic":0,"msgSnippet":"Thanks Brie and Jenny for your feedback. Brie, I knew you were BJ :-) I wanted to use your full name in my comment, but decided to use BJ just in case you","messageBody":"<div id=\"ygrps-yiv-921065666\">Thanks Brie and Jenny for your feedback.<br/>\n<br/>\nBrie, I knew you were BJ :-) I wanted to use your full name in my comment, but decided to use BJ just in case you preferred to remain semi-anonymous. I&#39;ll use your full name on Freedom to Learn when I post on it later today.<br/>\n<br/>\nThe reason why I thought of the &#39;child-led&#39; and &#39;child-partnered&#39; distinction being helpful is that because 43% of his respondents are doing something fundamentally different than what is prescribed here on Always Learning. Since that is such a large percentage of his respondents, it seems he wants to label what they do in a way that differentiates them from us. Maybe I can suggest both - using terms other than &#39;moderate&#39; and &#39;radical&#39; and the suggestion of dropping the two distinctions all together. Hopefully, he&#39;ll make alterations in one form or another.<br/>\n<br/>\nI hesitated with &#39;child-led&#39; as well because I know it sends people off in the wrong direction. But I was thinking that by highlighting this difference between the two, the &#39;child-led&#39; unschoolers will examine this aspect of their unschooling and might reconsider after reading what Brie wrote and the links she posted. I also hope new unschoolers reading his article will be more attracted to the idea of being partners with their children. Or do you think this is naive? Do you think it would be better if I also suggested &#39;extreme&#39;, like Colleen P did in the comments section?<br/>\n<br/>\nI will relink the article by Pam: <a rel=\"nofollow\" target=\"_blank\" href=\"http://learninghappens.wordpress.com/2011/09/24/unschooling-is-not-child...\">http://learninghappens.wordpress.com/2011/09/24/unschooling-is-not-child...</a> and note that I believe children will have a much richer learning experience if parents are more involved.<br/>\n<br/>\nI do think there are families with younger children doing child-led learning. When I started researching unschooling in 2008 I was sometimes overwhelmed with the sheer amount of information out there. I didn&#39;t know which sources were most credible in the anonymous world of the internet. I was disappointed that I did not have the example of families I knew in real life. Some of the unschooling information was contradictory, some of it was against what I believed at the time, some of it was great, some of it was fluff. <br/>\n<br/>\nI liked John Holt, but missed reading about the love, joy and connection between parents and their children. I thought Sandra&#39;s and Joyce&#39;s websites were inspiring and exciting, but was afraid of some of their radical ideas and their (sometimes) piercing posts. I liked the soft nature of Dayna Martin&#39;s posts, but her writing lacked the depth that I was searching for and I found the interlay of the law of attraction to be confusing. I loved Jan Hunt&#39;s natural parenting website, but didn&#39;t feel like I knew enough to unschool really well after reading there. <br/>\n<br/>\nI didn&#39;t know which direction to go towards. <br/>\n<br/>\nThe moderators on some other lists often do not examine the writing of the people posting. Sometimes I read a nice story that ended with the message that always saying yes, not having rules, child-led learning, etc. was what worked for them. Looking back, I felt I was needlessly pointed in the wrong direction at times. No one in the group stepped up to help the newcomers navigate better. Or I had &#39;support&#39; (<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/support)\">http://sandradodd.com/support)</a>, but no direction. <br/>\n<br/>\nThank goodness I met Sandra at the London Unschooling Conference and she handed me a card for this always learning group. After I started reading here, everything started falling into place. I stopped reading in places that were leading me away from good unschooling practices. I doubt I would have picked up this skill as quickly and effectively if it hadn&#39;t been for this list. <br/>\n<br/>\nI think 43% of respondents in Peter Gray&#39;s study are headed in the wrong direction. I&#39;m hoping my comment will be a gentle nudge for them to take on a partnership role with their children. I don&#39;t feel like I have the experience or skill to take them further than a nudge. I think if both of you continue to comment, people will be have a better chance of going in the right direction.<br/>\n<br/>\nRippy<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Freedom To Learn - Benefits of Unschooling","postDate":"1330490123","msgId":65974,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzA0OTAxMjMuNzEwNzguWWFob29NYWlsTmVvQHdlYjEyMjUwMy5tYWlsLm5lMS55YWhvby5jb20+","inReplyToHeader":"PDA1QTRGNzY1LTY5MTctNDQ3My04NDgzLTZBOTE5QTY1NDc1OUBnbWFpbC5jb20+","referencesHeader":"PGppaXBvbysxMDJpakBlR3JvdXBzLmNvbT4gPDA1QTRGNzY1LTY5MTctNDQ3My04NDgzLTZBOTE5QTY1NDc1OUBnbWFpbC5jb20+"},"prevInTopic":65973,"nextInTopic":65975,"prevInTime":65973,"nextInTime":65975,"topicId":65949,"numMessagesInTopic":0,"msgSnippet":"***Maybe you could use child-led unschooling for the first group? If the second group are not all radical unschoolers, maybe you can use the term","messageBody":"<div id=\"ygrps-yiv-572307217\">***Maybe you could use &#39;child-led&#39; unschooling for the first group? If the second group are not all radical unschoolers, maybe you can use the term &#39;child-partnered&#39; unschooling for the second group? At least for the purpose of this article or similar articles.***<br/>\n<br/>\nI wouldn&#39;t suggest using that term!  It already gets over used and complicates understanding!  Someone already suggested &quot;extreme&quot;.  I think he needs to re-examine the spectrum he&#39;s using.  That&#39;s my thought!<br/>\n<br/>\nThere are, however, plenty of people calling themselves unschoolers who let the child be responsible for their own education.  As far as I know, I haven&#39;t met any yet that have older kids.  I think many unschoolers object to that idea because, legally speaking, each parent is responsible for their child&#39;s education.  At least in the US, that is the case.  I&#39;ve yet to read any law for any state that suggests that a kid can hold that responsibility.<br/>\n<br/>\nAt this point in time, my 17 yr old does her own thing most of the time with less and less input from me, but I did buy her a ticket to go see Giselle with her little sister.  She&#39;s still a minor and still my responsibility and it&#39;s still up to me to do things for her and provide things of interest!<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Freedom To Learn - Benefits of Unschooling","postDate":"1330489577","msgId":65973,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzA0ODk1NzcuOTA3NTkuWWFob29NYWlsTmVvQHdlYjEyMjUwNi5tYWlsLm5lMS55YWhvby5jb20+","inReplyToHeader":"PGppaXBvbysxMDJpakBlR3JvdXBzLmNvbT4=","referencesHeader":"PGppaWtpaytpYm1sQGVHcm91cHMuY29tPiA8amlpcG9vKzEwMmlqQGVHcm91cHMuY29tPg=="},"prevInTopic":65972,"nextInTopic":65974,"prevInTime":65972,"nextInTime":65974,"topicId":65949,"numMessagesInTopic":0,"msgSnippet":"***I m really, REALLY annoyed.  Given that the quote he offers for moderate unschoolers, is very similar to what I wrote, I m thinking that Dr. Gray is","messageBody":"<div id=\"ygrps-yiv-1533844410\">***I&#39;m really, REALLY annoyed.  Given that the quote he offers for &quot;moderate unschoolers,&quot; is very similar to what I wrote, I&#39;m thinking that Dr. Gray is hugely misunderstanding &quot;Radical Unschooling&quot; as discussed here. Is he drawing lines in the sand? ***<br/>\n<br/>\nI think it&#39;s the nature of giving a survey and taking the results from the voluntary sources they came from.  One need not delve too deeply into the accuracy of each person&#39;s statement to make it a part of the study participants responses.<br/>\n<br/>\nHe drew his own conclusions.  However, I don&#39;t think he knows that the term &quot;radical unschooling&quot; is already being used to describe something else entirely.  He&#39;s very open to corrections about such things!<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":472480490,"authorName":"sheeboo2","from":"&quot;sheeboo2&quot; &lt;brmino@...&gt;","profile":"sheeboo2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Freedom To Learn - Benefits of Unschooling","postDate":"1330482903","msgId":65972,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGppazJzbitkMGtuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDA1QTRGNzY1LTY5MTctNDQ3My04NDgzLTZBOTE5QTY1NDc1OUBnbWFpbC5jb20+"},"prevInTopic":65966,"nextInTopic":65973,"prevInTime":65971,"nextInTime":65973,"topicId":65949,"numMessagesInTopic":0,"msgSnippet":"Rippy, I m really happy to hear that the quote attributed to the moderate unschooler was one of us! I wanted to say that I was sure it was, but was afraid to","messageBody":"<div id=\"ygrps-yiv-1756813003\">Rippy, I&#39;m really happy to hear that the quote attributed to the &quot;moderate&quot; unschooler was one of us! <br/>\n<br/>\nI wanted to say that I was sure it was, but was afraid to be proven wrong and someone would come out and say that the quote was theirs and they aren&#39;t radical unschoolers.  (I am &quot;BJ,&quot; by the way....I was so frustrated I didn&#39;t use my full name in the post, but did in my private email to Dr. Gray.)<br/>\n<br/>\nI like everything you wrote; it is especially good that you said some nice things too (I wish I would have...should have waited a bit to reply, probably) but wonder if he shouldn&#39;t just drop the two distinctions all together. If he throws out a brand new term, how will folks find information when they need it? Would a search for &quot;&#39;child-partnered&#39; unschooling&quot; find Sandra or Joyce&#39;s sites?....okay, my Google search finds Sandra&#39;s &quot;Just add light&quot; blog: 4th result, and the Natural Child Project: 1st and 2nd. result.<br/>\n<br/>\nI do hope more radical unschoolers like the ones here comment. It could be that the people quoted in the first group also work hard at making their children&#39;s lives as rich as possible--I hope so, but the way it&#39;s laid out, I cringe thinking that people will take away from his selection of quotes that radical unschooling is hands-off parenting :(<br/>\n<br/>\nBrie</div>","specialLinks":[]},{"userId":332164648,"authorName":"Rippy and Graham Dusseldorp","from":"Rippy and Graham Dusseldorp &lt;ripgray@...&gt;","profile":"rdusseldorp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Freedom To Learn - Benefits of Unschooling","postDate":"1330472398","msgId":65966,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA1QTRGNzY1LTY5MTctNDQ3My04NDgzLTZBOTE5QTY1NDc1OUBnbWFpbC5jb20+","inReplyToHeader":"PGppaXBvbysxMDJpakBlR3JvdXBzLmNvbT4=","referencesHeader":"PGppaXBvbysxMDJpakBlR3JvdXBzLmNvbT4="},"prevInTopic":65957,"nextInTopic":65972,"prevInTime":65965,"nextInTime":65967,"topicId":65949,"numMessagesInTopic":0,"msgSnippet":"Could I get some feedback on this? Especially the part about child-led vs. child-partnered learning? I m worried this part of my post might make the","messageBody":"<div id=\"ygrps-yiv-254701857\">Could I get some feedback on this? Especially the part about &#39;child-led&#39; vs. &#39;child-partnered&#39; learning? I&#39;m worried this part of my post might make the discussion even more confusing. I&#39;m going to sleep now, and I won&#39;t post it until tomorrow on Freedom to Learn.<br/>\n<br/>\n-------<br/>\n<br/>\nI agree with BJ that your article&#39;s definition of radical and moderate unschooling is troublesome. I can understand how you would have interpreted your data in this way. If 43% of the families responded that they take a less deliberate, guiding role in their children&#39;s education, that does seem to be more radical than the 42% of the families that are more deliberate and guiding. It makes sense that you want to represent both groups.<br/>\n<br/>\nHowever, the fact that you used the word &#39;radical&#39; to describe the first group is problematic. Many experienced radical unschoolers, especially prominent unschooling advocates, define radical unschooling as BJ does. The &#39;radical&#39; part of the definition comes from the belief that natural learning and a child&#39;s ability to make choices extends to all areas of life: bedtime, food, media, chores. As BJ points out, these very same radical unschoolers also believe in being active participants in their children&#39;s learning.<br/>\n<br/>\nI was the person quoted as a &#39;moderate unschooler&#39;, but I would define what my family does as &#39;radical unschooling&#39;. My husband and I are most definitely facilitating, guiding, helping, encouraging, supporting, and inspiring our children&#39;s learning. <br/>\n<br/>\nMaybe you could use &#39;child-led&#39; unschooling for the first group? If the second group are not all radical unschoolers, maybe you can use the term &#39;child-partnered&#39; unschooling for the second group? At least for the purpose of this article or similar articles.<br/>\n<br/>\nPeople such as BJ, Sandra Dodd, Joyce Fetteroll, Pam Sorooshian spend many hours a week helping parents on unschooling discussion groups. BJ has helped me through some difficult spots with unschooling with her writing on various boards. I can understand why this article would be frustrating for her. It makes the volunteer work she does to help parents better able to understand how to unschool even more complicated. I hope you consider our comments and make the necessary revisions to your article.<br/>\n<br/>\nI enjoyed the rest of the article and I want to commend you on continuing to research and write about natural ways of learning. I read your comment that your work has largely been ignored by academia. I think what you are doing is really important and I hope it will be something that educators and policy advisors will find valuable in the future.</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Freedom To Learn - Benefits of Unschooling","postDate":"1330452460","msgId":65957,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzA0NTI0NjAuNDgwNjguWWFob29NYWlsTmVvQHdlYjgxNTA4Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGppaXBvbysxMDJpakBlR3JvdXBzLmNvbT4=","referencesHeader":"PGppaWtpaytpYm1sQGVHcm91cHMuY29tPiA8amlpcG9vKzEwMmlqQGVHcm91cHMuY29tPg=="},"prevInTopic":65952,"nextInTopic":65966,"prevInTime":65956,"nextInTime":65958,"topicId":65949,"numMessagesInTopic":0,"msgSnippet":"OH MY Brie!!! I get it. The answers he considered rdical unschoolers where clearly not something one would say here and the moderate was  what  this group","messageBody":"<div id=\"ygrps-yiv-362142526\">OH MY Brie!!! I get it. The answers he considered rdical unschoolers where clearly not something one would say here and the moderate was  what  this group discusses!<br/>\nHere are the quotes for radical unachoolers ( according to DrGrey)<br/>\n &quot;Unschooling equals freedom in learning and in life. We push aside paradigms and established regulations with regards to schooling and trust our children to pave their own way in their own educations. Everything they want to experience has value. We trust them.&quot; Another wrote: &quot;Unschooling, for us, means there is absolutely no curriculum, agenda, timetable, or goal setting. The children are responsible for what, how, and when they learn.&quot;<br/>\n<br/>\n<br/>\n<br/>\nAnd here is the quote for the moderate UNSCHOOLER:|<br/>\n<br/>\n<br/>\n &quot;We define unschooling as creating an enriching environment for our children where natural learning and passions can flourish. We want our life to be about connection—to each other, to our interests and passions, to a joyful life together....As a parent, I am my children&#39;s experienced partner and guide and I help them to gain access to materials and people that they might not otherwise have access to. I introduce them to things, places, people that I think might be interesting to them, but I do not push them or feel rejected or discouraged if they do not find it interesting....&quot; <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":439465581,"authorName":"Colleen","from":"&quot;Colleen&quot; &lt;3potatoes@...&gt;","profile":"trespotatoes","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Freedom To Learn - Benefits of Unschooling","postDate":"1330441839","msgId":65952,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGppaXFwZisxbjk4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGppaXBvbysxMDJpakBlR3JvdXBzLmNvbT4="},"prevInTopic":65951,"nextInTopic":65957,"prevInTime":65951,"nextInTime":65953,"topicId":65949,"numMessagesInTopic":0,"msgSnippet":"**Has anyone looked at this yet? I m really, REALLY annoyed.  Given that the quote he offers for moderate unschoolers, is very similar to what I wrote, I m","messageBody":"<div id=\"ygrps-yiv-671409378\">**Has anyone looked at this yet?<br/>\nI&#39;m really, REALLY annoyed.  Given that the quote he offers for &quot;moderate unschoolers,&quot; is very similar to what I wrote, I&#39;m thinking that Dr. Gray is hugely misunderstanding &quot;Radical Unschooling&quot; as discussed here. Is he drawing lines in the sand?**<br/>\n<br/>\nI read it after I posted the link - and had the same reaction to the &quot;moderate unschoolers&quot; part - <br/>\n<br/>\nI wonder if he&#39;s defining radical unschooling as being more like &quot;child-led learning&quot; - as he says those he defined as radical unschoolers &quot;most clearly saw their children as guiding their own education.&quot;  <br/>\n<br/>\nI don&#39;t see my son as &quot;guiding his own education&quot; - I see he and my husband and I exploring the world together, sharing our interests, delving more deeply into what intrigues us (one, two, or all three of us), and learning together as we go.  I do not passively wait for my child to &quot;lead&quot; us somewhere - I take an active role, for example, in strewing opportunities and materials - absolutely!  If parents taking &quot;deliberate roles in guiding or encouraging their children&#39;s education&quot; means &quot;moderate&quot; unschooling to Dr Gray, then I think by his definition I too would be a &quot;moderate unschooler.&quot;<br/>\n<br/>\nInteresting.</div>","specialLinks":[]},{"userId":472480490,"authorName":"sheeboo2","from":"&quot;sheeboo2&quot; &lt;brmino@...&gt;","profile":"sheeboo2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Freedom To Learn - Benefits of Unschooling","postDate":"1330440792","msgId":65951,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGppaXBvbysxMDJpakBlR3JvdXBzLmNvbT4=","inReplyToHeader":"PGppaWtpaytpYm1sQGVHcm91cHMuY29tPg=="},"prevInTopic":65949,"nextInTopic":65952,"prevInTime":65950,"nextInTime":65952,"topicId":65949,"numMessagesInTopic":0,"msgSnippet":"Has anyone looked at this yet? I m really, REALLY annoyed.  Given that the quote he offers for moderate unschoolers, is very similar to what I wrote, I m","messageBody":"<div id=\"ygrps-yiv-653741645\">Has anyone looked at this yet?<br/>\n<br/>\nI&#39;m really, REALLY annoyed.  Given that the quote he offers for &quot;moderate unschoolers,&quot; is very similar to what I wrote, I&#39;m thinking that Dr. Gray is hugely misunderstanding &quot;Radical Unschooling&quot; as discussed here. Is he drawing lines in the sand? <br/>\n<br/>\nBrie<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Colleen&quot; &lt;3potatoes@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Link to the first Freedom To Learn blog post based on the survey of unschooling families Peter Gray conducted a little while back :-) <br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.psychologytoday.com/blog/freedom-learn/201202/the-benefits-unschooling-report-i-survey-231-families?utm_source=feedburner&utm_medium=email&utm_campaign=Feed%3A+Freedom-to-Learn+%28Freedom+to+Learn%29\">http://www.psychologytoday.com/blog/freedom-learn/201202/the-benefits-unschooling-report-i-survey-231-families?utm_source=feedburner&utm_medium=email&utm_campaign=Feed%3A+Freedom-to-Learn+%28Freedom+to+Learn%29</a><br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":439465581,"authorName":"Colleen","from":"&quot;Colleen&quot; &lt;3potatoes@...&gt;","profile":"trespotatoes","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Freedom To Learn - Benefits of Unschooling","postDate":"1330435476","msgId":65949,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGppaWtpaytpYm1sQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":65951,"prevInTime":65948,"nextInTime":65950,"topicId":65949,"numMessagesInTopic":0,"msgSnippet":"Link to the first Freedom To Learn blog post based on the survey of unschooling families Peter Gray conducted a little while back :-) ","messageBody":"<div id=\"ygrps-yiv-2042951087\">Link to the first Freedom To Learn blog post based on the survey of unschooling families Peter Gray conducted a little while back :-) <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.psychologytoday.com/blog/freedom-learn/201202/the-benefits-unschooling-report-i-survey-231-families?utm_source=feedburner&utm_medium=email&utm_campaign=Feed%3A+Freedom-to-Learn+%28Freedom+to+Learn%29\">http://www.psychologytoday.com/blog/freedom-learn/201202/the-benefits-unschooling-report-i-survey-231-families?utm_source=feedburner&utm_medium=email&utm_campaign=Feed%3A+Freedom-to-Learn+%28Freedom+to+Learn%29</a></div>","specialLinks":[]}],"prevTopicId":65922,"nextTopicId":65931}}