{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":268949016,"authorName":"magenta_mum","from":"&quot;magenta_mum&quot; &lt;magenta_mum@...&gt;","profile":"magenta_mum","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"PS. Re: Let&#39;s go back to what the question was...","postDate":"1170048932","msgId":27875,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVwazEzNCs5bDZzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVwanJ2cys5YXJuQGVHcm91cHMuY29tPg=="},"prevInTopic":27874,"nextInTopic":0,"prevInTime":27874,"nextInTime":27876,"topicId":27862,"numMessagesInTopic":0,"msgSnippet":"... should I be okay if she were to make a decision to kiss this older child? ... I wonder if you still feel like I haven t answered your question. Unless","messageBody":"<div id=\"ygrps-yiv-2121958921\"><blockquote><span title=\"ireply\">&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;sorschasmom&quot;<br/>\n&gt; &lt;willowsfortress@&gt; wrote:<br/>\n<br/>\n&gt; &gt; If I truly trust Sorscha to make decisions for her self then<br/>\n </span></blockquote>should I be okay if she were to make a decision to kiss this older<br/>\nchild?  <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;<br/>\n<br/>\n </span></blockquote>I wonder if you still feel like I haven&#39;t answered your question. <br/>\n<br/>\nUnless there&#39;s some immediate question relating to a slightly older<br/>\nboy who is angling to spend time alone with your daughter, then I<br/>\nsuggest stepping back and shaking it off a bit. There&#39;s the potential<br/>\nfor you to start sounding like one of those &quot;so, heroin&#39;s okay with<br/>\nyou then?!&quot;.<br/>\n<br/>\nHope that doesn&#39;t feel like a slap in the face. If it does, deep<br/>\nbreathing would probably be useful right now. Or, harder for me to<br/>\nsay, I wonder if you do have some &#39;junk&#39; that&#39;s making it hard for you<br/>\nto get clear, that&#39;s causing you to push at this a bit... if it&#39;s more<br/>\nabout you than your daughter. Please know I say that with the warmest<br/>\nheart, that you needn&#39;t reply with specificity, and that if you do I<br/>\nhope you wont yell at me...<br/>\n<br/>\nTrepidatiously yours<br/>\nJo R</div>","specialLinks":[]},{"userId":268949016,"authorName":"magenta_mum","from":"&quot;magenta_mum&quot; &lt;magenta_mum@...&gt;","profile":"magenta_mum","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Let&#39;s go back to what the question was...","postDate":"1170043708","msgId":27874,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVwanJ2cys5YXJuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGVwaXRxcStsa2hxQGVHcm91cHMuY29tPg=="},"prevInTopic":27869,"nextInTopic":27875,"prevInTime":27873,"nextInTime":27875,"topicId":27862,"numMessagesInTopic":0,"msgSnippet":"... sexual) should as a RUing parent I be concerned / upset, etc.? ... Much as I don t necessarily like to use words like developmental and average, four years","messageBody":"<div id=\"ygrps-yiv-741564881\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;sorschasmom&quot;<br/>\n&lt;willowsfortress@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Here is my question:<br/>\n&gt; If a non-sexual 9-year-old Sorscha were in a situation with a child <br/>\n&gt; who was 13 or 14 who was sexual (again, the sexual is not a concern <br/>\n&gt; of mine, it is the difference in the age range and then being<br/>\n </span></blockquote>sexual) should as a RUing parent I be concerned / upset, etc.?<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n<br/>\n </span></blockquote>Much as I don&#39;t necessarily like to use words like developmental and<br/>\naverage, four years is quite a big gap that can make for substantial<br/>\ndifferences in experience (including knowledge and awareness of self<br/>\nand others and capabilities in all sorts of ways) throughout<br/>\nchildhood, through all the years of growth and development. Which is<br/>\nwhy I took a questioning approach to the hypothetical, because in some<br/>\nways my level of discomfort might depend on the children involved and<br/>\nwhat they knew and recognised about themselves and each other. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If I truly trust Sorscha to make decisions for her self then should<br/>\n </span></blockquote>I be okay if she were to make a decision to kiss this older child?  <br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n </span></blockquote>In the truth and dare situation, or just playing, there&#39;s a big<br/>\ndifference between a more platonic kind of lip-smacking kiss and what<br/>\nwe here downunder sometimes call pashing, where kissing gets to be<br/>\nabout tongues, maybe, and arousal and can carry people of all ages<br/>\ninto deeper water - though chances are the average 9-10yr wont be<br/>\n*there* yet and neither should an older child be going there with one<br/>\nso much younger, same as a 7yr old who can swim probably shouldn&#39;t<br/>\nassume a 3yr can swim and push or even just take them in the deep end<br/>\nof a swimming pool. That would be beyond disrespectful, to silly,<br/>\npotentially frightening and dangerous, I think. Which is, again, where<br/>\nI want to know that each child has some awareness of what might be the<br/>\nother child&#39;s experience. And I mean child and children generally<br/>\nthere, not only your child and other specific children your own<br/>\nparticular child knows. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I am feeling like I would have a problem with it and I am truly trying <br/>\n&gt; to figure out if my feelings are appropriate.  My first reaction <br/>\n&gt; would be to feel like Sorscha was being taken advantage of, however, <br/>\n&gt; I am feeling like by feeling that way that I am possibly placing <br/>\n&gt; my `junk&#39; onto the situation.  <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I don&#39;t think there&#39;s anything junky about knowing your child, being<br/>\naware of where they&#39;re at, as you clearly are and taking the broader<br/>\nculture into consideration, including your own experience within that<br/>\ncontext. To be quite direct, I do think your feelings are appropriate,<br/>\nthey&#39;re valid not only because you felt them but for reasons that<br/>\napply to human development, even without cultural influences. 9-10 yr<br/>\nold bodies and minds aren&#39;t ready for reproduction, which is one of<br/>\nthe places sexual activity goes, nor, I suggest, is the average 13-14<br/>\nyr old ready for all the feelings and consequences that can result<br/>\nfrom sexual activity, particularly within the culture, though these<br/>\nthings can and do happen to many young people, even though they might<br/>\nbe avoided with good info., awareness... education. And maybe because<br/>\nof what you&#39;ve learned through RUing you&#39;re exploring those feelings<br/>\nand thoughts rather than reacting, which is all good.<br/>\n<br/>\nRather than imagining Sorscha being taken advantage of, perhaps there<br/>\nare some other words that might work better... Disrespected, maybe.<br/>\nI&#39;m deliberately not leaping to a more imflammatory word like<br/>\nviolated, because that has not happened, and may not be the case, even<br/>\nin the hypothetical. You&#39;re concerned, and appropriately so, that<br/>\nSorscha might be disrespected, same as you might feel if someone who<br/>\nwas into calculus right now decided she needed to do calculus with<br/>\nthem, right now, even though she was neither that interested nor ready. <br/>\n<br/>\nIs any of that more helpful, odd analogies and all? I kind of hope in<br/>\nusing far less charged analogies, to take some of the repressiveness<br/>\nand fear around sex as a topic away from it. Not that I think you&#39;re<br/>\nbeing repressive and fearful, Crystal. I get that you&#39;ve been doing<br/>\nwhat you could to make that clear. <br/>\n<br/>\nThere are, of course, legalities which I haven&#39;t touched because I<br/>\ndon&#39;t feel they&#39;re relevant to the feelings and thoughts we have<br/>\naround sex and burgeoning, or not, sexuality and young people in this<br/>\nconversation. <br/>\n<br/>\nJo R</div>","specialLinks":[]},{"userId":232480378,"authorName":"sorschasmom","from":"&quot;sorschasmom&quot; &lt;willowsfortress@...&gt;","profile":"sorschasmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Let&#39;s go back to what the question was...","postDate":"1170016201","msgId":27869,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVwajE0OSs1M2NmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PERBRkJBRUI3LTFDRjgtNDk4My05MzcxLUIyMDdCOThBMTY4MEBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":27864,"nextInTopic":27874,"prevInTime":27868,"nextInTime":27870,"topicId":27862,"numMessagesInTopic":0,"msgSnippet":" Well put, but I am very careful to keep my junk out of her life and that is","messageBody":"<div id=\"ygrps-yiv-534885050\">&lt;&lt;Well your &quot;junk&quot; (your experiences and your feelings) ARE part of <br/>\nher life.&gt;&gt;<br/>\n<br/>\nWell put, but I am very careful to keep my &#39;junk&#39; out of her life and <br/>\nthat is why I am asking this question here. <br/>\n<br/>\n&lt;&lt;Well that seems unfair.  If she were likely to initiate sexual <br/>\nbehaviors with another child, would it really matter to you if that <br/>\nchild were younger, her age or older?  If it&#39;s inappropriate, it&#39;s <br/>\ninappropriate.&gt;&gt;<br/>\n<br/>\nIf two teens around the same age are sexual and decide to explore...I <br/>\ndo not have a problem with that or see it as inappropriate. They are <br/>\nequals, equal sexuality, equal age, etc.  There might be some <br/>\ninequalities but they are mostly equal.  What I am asking is if my <br/>\nfeelings of difference in age and experience are valid.  <br/>\n<br/>\n&lt;&lt;Little boys shouldn&#39;t sticking ANY parts of themselves (finger or <br/>\nanything else) inside any parts of little girls, , whether those  <br/>\ngirls are younger, same aged or older. Little girls shouldn&#39;t be <br/>\ninviting  that play, either. So if the only question is age, I don&#39;t <br/>\nthink that should matter.&gt;&gt;<br/>\n<br/>\nStraight talk that I appreciate.  <br/>\n<br/>\n&lt;&lt;After both kids are in or through puberty, they should have enough <br/>\nclues to know what the real dangers are, and parents can&#39;t protect  <br/>\nthem from everything forever (nor should they even want to).&gt;&gt;<br/>\n<br/>\nYES, that is why Sorscha and I talk a lot.  That is why I want to get <br/>\nmy feelings straight.  <br/>\n<br/>\n&lt;&lt;Once  they&#39;re out on their own away from adults, they&#39;ll have the <br/>\ntools their parents have helped them develop and whatever else <br/>\nthey&#39;ve gleaned from other sources.  The development of the tools <br/>\nshould start early, I think.  Knowledge is power.  Too much knowledge <br/>\ncan be abusive.  Telling children  EVERYTHING robs them of some of <br/>\nthe peace of childhood.  Telling them  nothing is also wrong. Balance <br/>\nand compassion and mindfulness are the only way to figure it  out for <br/>\nthe particular child. Watch your child, listen to your child,  don&#39;t <br/>\nbe too paranoid or too naive either one.&gt;&gt;<br/>\n<br/>\nYes, I like that.  I am finding that Sorscha&#39;s conversation with me <br/>\nabout a week ago about not wanting me to kiss her without her <br/>\npermission sparked a wonderful conversation about her personal <br/>\nrights, her body, and her choices.  I think we are on the right track <br/>\nin our communication.  <br/>\n~Crystal~</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Let&#39;s go back to what the question was...","postDate":"1170014250","msgId":27864,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERBRkJBRUI3LTFDRjgtNDk4My05MzcxLUIyMDdCOThBMTY4MEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGVwaXRxcStsa2hxQGVHcm91cHMuY29tPg==","referencesHeader":"PGVwaXRxcStsa2hxQGVHcm91cHMuY29tPg=="},"prevInTopic":27862,"nextInTopic":27869,"prevInTime":27863,"nextInTime":27865,"topicId":27862,"numMessagesInTopic":0,"msgSnippet":"-=-If I truly trust Sorscha to make decisions for her self then should I be okay if she were to make a decision to kiss this older child? I am feeling like I","messageBody":"<div id=\"ygrps-yiv-2042154048\">-=-If I truly trust Sorscha to make decisions for her self then should I<br/>\nbe okay if she were to make a decision to kiss this older child? I<br/>\nam feeling like I would have a problem with it and I am truly trying<br/>\nto figure out if my feelings are appropriate. My first reaction<br/>\nwould be to feel like Sorscha was being taken advantage of, however,<br/>\nI am feeling like by feeling that way that I am possibly placing<br/>\nmy `junk&#39; onto the situation. -=-<br/>\n<br/>\nWell your &quot;junk&quot; (your experiences and your feelings) ARE part of her  <br/>\nlife.<br/>\n<br/>\n-=-The sexuality part is not my concern it is<br/>\nthe age. If Sorscha were a sexual person and in a situation with<br/>\nanother child around her age I would not be feeling this way. It is<br/>\nthe difference of years and experience and how this plays a part in<br/>\nour Radical Unschooling lifestyle. -=-<br/>\n<br/>\nWell that seems unfair.  If she were likely to initiate sexual  <br/>\nbehaviors with another child, would it really matter to you if that  <br/>\nchild were younger, her age or older?  If it&#39;s inappropriate, it&#39;s  <br/>\ninappropriate.<br/>\n<br/>\nMany years ago in an incident my children don&#39;t remember, a six year  <br/>\nold boy did something inappropriate.  It involved touch and language,  <br/>\nand I could have thrown a gigantic fit but I didn&#39;t.  And the other  <br/>\nfamily offered to pay for counselling, but that wasn&#39;t even the  <br/>\npoint.  They needed themSELVES in counselling.  The mother said, when  <br/>\nwe discussed it very calmly for a long time, that she was sorry  <br/>\nbecause he was five years older than the girl, that if it had been  <br/>\n[named a six year old girl who was also in our playgroup] it would&#39;ve  <br/>\nbeen different, but...<br/>\n<br/>\nIt would NOT have been different.<br/>\n<br/>\nLittle boys shouldn&#39;t sticking ANY parts of themselves (finger or  <br/>\nanything else) inside any parts of little girls, , whether those  <br/>\ngirls are younger, same aged or older.<br/>\n<br/>\nLittle girls shouldn&#39;t be inviting  that play, either.<br/>\n<br/>\nSo if the only question is age, I don&#39;t think that should matter.<br/>\n<br/>\nAfter both kids are in or through puberty, they should have enough  <br/>\nclues to know what the real dangers are, and parents can&#39;t protect  <br/>\nthem from everything forever (nor should they even want to).  Once  <br/>\nthey&#39;re out on their own away from adults, they&#39;ll have the tools  <br/>\ntheir parents have helped them develop and whatever else they&#39;ve  <br/>\ngleaned from other sources.<br/>\n<br/>\nThe development of the tools should start early, I think.  Knowledge  <br/>\nis power.  Too much knowledge can be abusive.  Telling children  <br/>\nEVERYTHING robs them of some of the peace of childhood.  Telling them  <br/>\nnothing is also wrong.<br/>\n<br/>\nBalance and compassion and mindfulness are the only way to figure it  <br/>\nout for the particular child. Watch your child, listen to your child,  <br/>\ndon&#39;t be too paranoid or too naive either one.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":232480378,"authorName":"sorschasmom","from":"&quot;sorschasmom&quot; &lt;willowsfortress@...&gt;","profile":"sorschasmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Let&#39;s go back to what the question was...","postDate":"1170012826","msgId":27862,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVwaXRxcStsa2hxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":27864,"prevInTime":27861,"nextInTime":27863,"topicId":27862,"numMessagesInTopic":0,"msgSnippet":"I want to go back to what my question was, it seems the conversation is taking a different route then what I am needing information regarding. As for","messageBody":"<div id=\"ygrps-yiv-803967413\">I want to go back to what my question was, it seems the conversation <br/>\nis taking a different route then what I am needing information <br/>\nregarding.  <br/>\n<br/>\nAs for questions,the families involved are wonderful RUing families <br/>\nand the children have lots of support and great relationships with <br/>\ntheir families.  My question is not in regards to the particular <br/>\nsituation or children involved.  My question is about my feelings as <br/>\na RUing parent and Sorscha that arose from the situation.  In the <br/>\nparticular situation, the parents openly discussed it and have moved <br/>\non.  The situation that the families are absolutely fine with has <br/>\nsparked questions for me and my relationship with Sorscha.  <br/>\n<br/>\nHere is my question:<br/>\nIf a non-sexual 9-year-old Sorscha were in a situation with a child <br/>\nwho was 13 or 14 who was sexual (again, the sexual is not a concern <br/>\nof mine, it is the difference in the age range and then being sexual) <br/>\nshould as a RUing parent I be concerned / upset, etc.?<br/>\n<br/>\nIf I truly trust Sorscha to make decisions for her self then should I <br/>\nbe okay if she were to make a decision to kiss this older child?  I <br/>\nam feeling like I would have a problem with it and I am truly trying <br/>\nto figure out if my feelings are appropriate.  My first reaction <br/>\nwould be to feel like Sorscha was being taken advantage of, however, <br/>\nI am feeling like by feeling that way that I am possibly placing <br/>\nmy `junk&#39; onto the situation.  <br/>\n<br/>\nI hope I am making sense.  The sexuality part is not my concern it is <br/>\nthe age.  If Sorscha were a sexual person and in a situation with <br/>\nanother child around her age I would not be feeling this way.  It is <br/>\nthe difference of years and experience and how this plays a part in <br/>\nour Radical Unschooling lifestyle.  <br/>\n<br/>\n~Crystal~</div>","specialLinks":[]}],"prevTopicId":27841,"nextTopicId":27825}}