{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Socialization and Unschooling was: looking for a post","postDate":"1299280645","msgId":60191,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRENzE3MzA1LjUwMzA4MDdAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDNBNDg5OEY5LTk1RTctNERGNC05M0RGLTcxODkyMTNERDg2MkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEFBTkxrVGluZi1CZGF6ZC1XTzNaUmZSUXY4VndKM3BabndFYVlKcm5aLVpLakBtYWlsLmdtYWlsLmNvbT4gPDNBNDg5OEY5LTk1RTctNERGNC05M0RGLTcxODkyMTNERDg2MkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":60181,"nextInTopic":0,"prevInTime":60190,"nextInTime":60192,"topicId":60175,"numMessagesInTopic":0,"msgSnippet":"... I think time is an important factor - kids in school feel rushed all the time and if they spend 10 minutes trying to figure out how to organize their play","messageBody":"<div id=\"ygrps-yiv-1685024741\">On 3/4/2011 6:01 AM, Sandra Dodd wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I think that&#39;s true, but over-dramatically stated. I don&#39;t think <br/>\n&gt; &quot;false&quot; or robbery are factors so much that playing in mixed groups <br/>\n&gt; without time pressures is a big advantage school kids aren&#39;t given, <br/>\n&gt; except after school, depending on the personalities of the kids.<br/>\n<br/>\n </span></blockquote>I think time is an important factor - kids in school feel rushed all the <br/>\ntime and if they spend 10 minutes trying to figure out how to organize <br/>\ntheir play more fairly to be more fun for everybody, they&#39;ve lost half <br/>\ntheir recess time. Also there is the huge factor that the unschooling <br/>\nkids do have adults nearby who are ready and willing to help when <br/>\nneeded. Kids on a school playground don&#39;t have that kind of access (even <br/>\nwhen there is an adult on the playground, they typically only intervene <br/>\nafter a problem has erupted into conflict and usually only when someone <br/>\nis hurt).<br/>\n<br/>\nI wanted to add that I can remember a number of times, though, when our <br/>\nunschooled kids (large unschooling park day group) were not paying <br/>\nattention to the interests or needs of a few members and some were <br/>\nstarting to get frustrated and all it took to resolve it was for an <br/>\nadult to say, &quot;Do you guys think you can work this out better?&quot; That was <br/>\nenough for them all to stop and think about what was going on and they&#39;d <br/>\npretty quickly come up with some new ideas.<br/>\n<br/>\nI remember one incident in particular. A group of about 10 kids had <br/>\nplanned a game they were going to play at the park. One of the kids had <br/>\ngone home and really worked on it and come back with a lot of details <br/>\nplanned out. The kids were all standing while he was telling them all <br/>\nthe stuff he&#39;d worked on. There was one kid there who had not been at <br/>\nthe park the previous few weeks and hadn&#39;t been part of all the <br/>\nexcitement of planning this new game. The kids were very very eager to <br/>\nplay. I was nearby. I noticed that he was not given a role and I waited <br/>\nto see how he responded and how the kids responded. He spoke up, &quot;What <br/>\nabout me?&quot; The &quot;leader&quot; said, &quot;Sorry, there are no more roles.&quot; The kid <br/>\n(about 12 years old) sort of wandered away toward where the parents were <br/>\nall sitting, clearly hurt and disappointed. The other kids were all <br/>\ncaught up in getting started and ignored him. I went over near him and <br/>\nhe was telling his mom, &quot;They won&#39;t let me play.&quot; I went back to the <br/>\ngroup of kids and gathered them back together and said, &quot;Hey, guys, Cody <br/>\nis really disappointed. You guys could probably figure out a way to <br/>\ninclude him, right?&quot; And that was enough - they all turned their focus <br/>\nand within about 30 seconds had called him back over and divided up a <br/>\nrole into two so that there was something for him. They needed someone <br/>\nto call their attention to solving the problem, not to tell them what to <br/>\ndo, not to berate them or blame them.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Socialization and Unschooling was: looking for a post","postDate":"1299247285","msgId":60181,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNBNDg5OEY5LTk1RTctNERGNC05M0RGLTcxODkyMTNERDg2MkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEFBTkxrVGluZi1CZGF6ZC1XTzNaUmZSUXY4VndKM3BabndFYVlKcm5aLVpLakBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGluZi1CZGF6ZC1XTzNaUmZSUXY4VndKM3BabndFYVlKcm5aLVpLakBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":60175,"nextInTopic":60191,"prevInTime":60180,"nextInTime":60182,"topicId":60175,"numMessagesInTopic":0,"msgSnippet":"-=-Based on my (naturally limited) observations, it seems that unschooling helps children to develop the ability to organize themselves and cooperate with","messageBody":"<div id=\"ygrps-yiv-1625959436\">-=-Based on my (naturally limited) observations, it seems that unschooling<br/>\nhelps children to develop the ability to organize themselves and cooperate<br/>\nwith others. These children hold discussions about what to play and how to<br/>\nplay. Every child has input and all seem to have equal say, regardless of<br/>\nage or how long they have been part of the group. If they fail to come to a<br/>\nconsensus, which is rare, they take a vote and everyone abides by the vote<br/>\ncheerfully. All of the children considers everyone&#39;s needs and the<br/>\nteenagers look out for the smaller and younger children, without an adult<br/>\nreminding them to do so.-=-<br/>\n<br/>\nWe saw that in our unschooling play group years ago.  The kids would amend rules to running games so that little kids could play, too.  Some of them were natural leaders.  Some of them were natural counsellors.  If there were problems among kids, we learned to ask Sarah Cordova or Kirby for their take on it, even if they were at a distance.  Should a mom go over?  &quot;I&#39;ll talk to her,&quot; one of them might say, &quot; or they would watch the posture and movement and say &quot;I think theyr&#39;e okay.&quot;  They were always right.  Great peacemakers, both of them, from a young age, and they knew the group of kids, and met the new kids as they came along.<br/>\n<br/>\n-=-I feel that these children are not exceptional leaders or saints. I think<br/>\nthat when a child has not been exposed to the assembly line school system<br/>\nwhere false hierarchies are used to separate children into groups that are<br/>\nranked, thus robbing them of what I like to think of as natural dignity,<br/>\nthen they are able to develop the ability to empathize and practice<br/>\nfairness.-=-<br/>\n<br/>\nI think that&#39;s true, but over-dramatically stated.  I don&#39;t think &quot;false&quot; or robbery are factors so much that playing in mixed groups without time pressures is a big advantage school kids aren&#39;t given, except after school, depending on the personalities of the kids.    When I was in fifth grade, some Jr. High girls (who shared our campus) used to come and organize running and circle games for us.  It was GREAT!  They had really good ideas, and were sweet, and because they were volunteering to do it, for fun, they weren&#39;t grouchy or exasperated, and because we didn&#39;t have to be there but each person there had the option to go do something else instead, the level of peace and cooperation was huge.  That went on for months, and was one of my favorite memories.  One of the girls was later on national TV representing New Mexico in the Jr. Miss pageant.  Fire batons.  Her name was Jeanelle Livingston.  And I don&#39;t remember the other girl&#39;s name.  I taught a couple of those games to kids at the Live and Learn conference that was near St. Louis a few years ago.<br/>\n<br/>\n-=-When my children were young and thus inexperienced, I (or my husband or the<br/>\ntwo of us) was the natural leader in any group (family) activity because my<br/>\nchildren were learning so much. So when we went on our walks, I often had<br/>\nto redirect them because they hadn&#39;t learned yet how to cross a street for<br/>\nexample. As they grew and learned, the leadership role became more and more<br/>\ndiffuse. Now I am more of a facilitator for the family because my children<br/>\nat 12 and 14 are very capable and competent. We sit and meet and decide<br/>\nwhat we want to accomplish most days. Sometimes, I still have to arbitrate<br/>\nand decide, but rarely, and that is usually because I am the one who notices<br/>\nthat a household need exists.-=-<br/>\n<br/>\nNow that my kids are grown, I&#39;ll let them decide and arrange things totally, and it&#39;s very comfortable.  Holly was trying to juggle some babysitting, a Yoga-center anniversary party, and seeing a friend in a play.  The girl she&#39;s sitting could go to the play with us, and there are matinees, but one is turing the yoga party.  I told her I would go whenever she decided, and so she made all the plans and arranged for tickets.   Not all 19-year-old girls would include their moms in their plans.  Being a child&#39;s partner can pay off beyond childhood.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":231415297,"authorName":"chris ester","from":"chris ester &lt;chris.homeschool@...&gt;","profile":"chris_e_bear","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Socialization and Unschooling was: looking for a post","postDate":"1299218245","msgId":60175,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGluZi1CZGF6ZC1XTzNaUmZSUXY4VndKM3BabndFYVlKcm5aLVpLakBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":60181,"prevInTime":60174,"nextInTime":60176,"topicId":60175,"numMessagesInTopic":0,"msgSnippet":"Your post about your daughter learning to raise her handin tae kwon do reminded me of a gym and swim class that my kids were in many years ago. The age range","messageBody":"<div id=\"ygrps-yiv-1964045784\">Your post about your daughter learning to raise her handin tae kwon do<br/>\nreminded me of a gym and swim class that my kids were in many years ago.<br/>\n<br/>\nThe age range was 5-8, so most of the kids had never been in any<br/>\ninstitutional setting to learn.  They were dividing the kids into groups and<br/>\nwanted them to count off in a line.  All of the parents were sitting and<br/>\nwatching.<br/>\n<br/>\nWe all nearly fell over with laughter when a new teacher said, &quot;Okay,<br/>\neverybody line up!&quot; and the kids all just stood there and looked at him like<br/>\nhe had just spoken ancient Greek.  The more experienced teacher said, &quot;Okay,<br/>\nI would like everyone to stand on this red line on the floor.&quot;<br/>\n<br/>\nWe belong to a group of unschoolers and we get together every week for a<br/>\npark day and we parents love to watch as our kids arrange themselves and<br/>\ndecide what games to play and how they are going to be played.  The adults<br/>\ndo not facilitate any activity on these days, beyond providing<br/>\ntransportation to the event.  As far as I know, most of the kids (ranging in<br/>\nage from about 5 to 15) have never been in a school setting.<br/>\n<br/>\nBased on my (naturally limited) observations, it seems that unschooling<br/>\nhelps children to develop the ability to organize themselves and cooperate<br/>\nwith others.  These children hold discussions about what to play and how to<br/>\nplay.  Every child has input and all seem to have equal say, regardless of<br/>\nage or how long they have been part of the group.  If they fail to come to a<br/>\nconsensus, which is rare, they take a vote and everyone abides by the vote<br/>\ncheerfully.  All of the children considers everyone&#39;s needs and the<br/>\nteenagers look out for the smaller and younger children, without an adult<br/>\nreminding them to do so.<br/>\n<br/>\nNot all of this group is radically unschooled, some are not even unschooled,<br/>\nbut they have all grown into naturally considerate and mature human beings.<br/>\nI can say that all of the parents seem to hold the same values with regard<br/>\nto children being deserving of respect and have a right to self<br/>\ndetermination. So much for the infamous &quot;socialization&quot; question.<br/>\n<br/>\nI feel that these children are not exceptional leaders or saints.  I think<br/>\nthat when a child has not been exposed to the assembly line school system<br/>\nwhere false hierarchies are used to separate children into groups that are<br/>\nranked, thus robbing them of what I like to think of as natural dignity,<br/>\nthen they are able to develop the ability to empathize and practice<br/>\nfairness.  This, I think, all comes with the partnership that develops<br/>\nwithin a family, when everyone is respected and valued for where they are<br/>\ndevelopmentally and who they are.  All of these children have learned how to<br/>\nnavigate being part of a group without artificial rules based on false<br/>\nvaluation systems.  They have all learned respect and consideration and<br/>\nempathy because they were raised in homes being respected as humans, not<br/>\njust children.<br/>\n<br/>\nWhen my children were young and thus inexperienced, I (or my husband or the<br/>\ntwo of us) was the natural leader in any group (family) activity because my<br/>\nchildren were learning so much.  So when we went on our walks, I often had<br/>\nto redirect them because they hadn&#39;t learned yet how to cross a street for<br/>\nexample.  As they grew and learned, the leadership role became more and more<br/>\ndiffuse.  Now I am more of a facilitator for the family because my children<br/>\nat 12 and 14 are very capable and competent.  We sit and meet and decide<br/>\nwhat we want to accomplish most days.  Sometimes, I still have to arbitrate<br/>\nand decide, but rarely, and that is usually because I am the one who notices<br/>\nthat a household need exists.<br/>\n<br/>\nI forget who the quote is from, but it goes, &quot;Expecting a child to learn how<br/>\nto be socialized in a school is like expecting them to learn nutrition by<br/>\ngoing to a grocery store.&quot;  I personally think that a more accurate<br/>\ncomparison would be to expect your child to learn nutrition by going to<br/>\nMcDonalds.<br/>\n<br/>\nAs anyone else noticed that a lot of the competitive, self centered<br/>\nbehaviors that children are supposed to be known for seems to occur less (or<br/>\nhardly at all) in homeschooled children?  I might even go so far as to say<br/>\nthat the amount of poor socialization  is in direct proportion to the amount<br/>\nof time spent in a school setting, but I also admit to a certain amount of<br/>\nbias. :)<br/>\nChris<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":60139,"nextTopicId":60171}}