{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":39764976,"authorName":"Alan & Brenda Leonard","from":"Alan & Brenda Leonard &lt;abtleo@...&gt;","profile":"abtleo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] veggie kids","postDate":"1029791137","msgId":41461,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI5ODcyOUU5LjEwQjUlYWJ0bGVvQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDEwMjk3ODExNzQuMzY5LjUyMDUxLm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":41460,"nextInTime":41462,"topicId":41461,"numMessagesInTopic":0,"msgSnippet":"... Cathy, My son is still cheerfully a vegetarian, and I m proud of him for having the guts to decide something and stick to it.  His father and I do eat","messageBody":"<div id=\"ygrps-yiv-884206197\"><blockquote><span title=\"ireply\">&gt; She skipped a step and decided last week that she would no longer eat animals.<br/>\n&gt; Of course, we chuckled, but she is sticking to her guns.  So I remembered a<br/>\n&gt; mom on this list whose son also chose to become vegetarian.  Questions to her:<br/>\n&gt; where are you finding recipes?  How are you explaining nutritional needs?  And<br/>\n&gt; is the rest of your family omnivorous?  If so, how are you handling meals?<br/>\n<br/>\n </span></blockquote>Cathy,<br/>\n<br/>\nMy son is still cheerfully a vegetarian, and I&#39;m proud of him for having the<br/>\nguts to decide something and stick to it.  His father and I do eat meat; my<br/>\nhusband likes meat more than I do, so the deal is that he eats meat at lunch<br/>\nwhile he&#39;s at work.  I cook mainly vegetarian entrees, although we do<br/>\noccasionally add meat to our portions.  For the most part, it hasn&#39;t been a<br/>\nbig deal.<br/>\n<br/>\nI already had a fair number of vegetarian recipes; we&#39;ve given up meat for<br/>\nLent before, which is 40 days.  I also like the variety of meat and meatless<br/>\nmeals.  Probably your daughter already likes some easy veggie meals:<br/>\nspaghetti, cheese pizza, mac and cheese, bean and rice burritos, cheese<br/>\nquesadillas, PB & J, etc.  With some creativity, you can make your usual<br/>\ncasserole/stirfry/soup/salad type entrees meatless and add meat later if you<br/>\nwant it.  If we&#39;re doing meat as the entree (bbq type meal), I bought veggie<br/>\nburgers and chix nuggets for my son.  Check the freezer section at your<br/>\ngrocery.  All the brands taste different; my son only likes Morningstar<br/>\nbrand because it&#39;s the least spicy (no pepper for him!).  If you go with<br/>\nthose kind of substitutes, hunt around and see what works for your daughter.<br/>\nBe prepared to explain carefully, because they look a lot like the meat<br/>\nburgers and real chicken nuggets and got a very suspicious attitude from my<br/>\nson until he caught on!  (He&#39;s 6).<br/>\n<br/>\nAs far as new recipes, I&#39;ve been checking out cookbooks from the library,<br/>\nplus reading mine with an eye toward veggie meals.  Even our pitiful little<br/>\nlibrary here had 6 or 8 good vegetarian cookbooks.  (641.5 on the nonfiction<br/>\nshelves).  Eating out has been the hardest, since there aren&#39;t vegetarian<br/>\nkids meals, at least in the land of Schnitzel!<br/>\n<br/>\nI think my son has learned a great deal about nutrition; protein, carbs,<br/>\netc.  I know that there is a great deal of debate about the combining<br/>\nproteins to make complete proteins idea, but we have found that if we don&#39;t<br/>\nget Tim protein from several sources at each meal, he&#39;s hungry in an hour or<br/>\ntwo.  So he&#39;s learned about beans, tofu, whole grains, eggs, dairy proteins,<br/>\npeanuts and nuts, etc., and how having food from different food parts of the<br/>\nfood pyramid makes him healthy, even without meat.<br/>\n<br/>\nIf you want more specific ideas, Cathy, feel free to email me off list.  I<br/>\nhave some good recipes that might help you get going.   We&#39;ve been at this a<br/>\nmonth or so, and my son is happy with his decision and satisfied with what<br/>\nhe&#39;s eating.  In fact, I see his concern for animals spilling over into<br/>\nother parts of his life.  He&#39;s going to grow from this, whether it lasts a<br/>\nmonth or a lifetime.  (And Mom&#39;s losing weight, too!  Woohoo!)<br/>\n<br/>\nbrenda</div>","specialLinks":[]}],"prevTopicId":41381,"nextTopicId":41455}}