{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":2294225,"authorName":"freeform@juno.com","from":"freeform@...","profile":"freeform_ca","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] re: school-based homeschooling-long","postDate":"1012200679","msgId":3083,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwMTI3LjIzNTgzNS4tNDI3OTAxLjIuZnJlZWZvcm1AanVuby5jb20+"},"prevInTopic":3076,"nextInTopic":0,"prevInTime":3082,"nextInTime":3084,"topicId":3075,"numMessagesInTopic":0,"msgSnippet":"On Sun, 27 Jan 2002 22:21:58 -0800 Nichoel  ... Well, see, I agree with that being wrong. Lying to people is wrong. And I know at","messageBody":"<div id=\"ygrps-yiv-513145961\">On Sun, 27 Jan 2002 22:21:58 -0800 &quot;Nichoel&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:stormyrain73@...\">stormyrain73@...</a>&gt;<br/>\nwrites:<br/>\n<blockquote><span title=\"ireply\"> &gt; I agree, if you make the choice that is your choice, however; we <br/>\n&gt; need to make sure the public school district is telling the truth <br/>\n&gt; and being honest to people who are researching ....In this case they <br/>\n&gt; are even having the fill out a declaration of intent (What we fill <br/>\n&gt; out to declare our status as homeschoolers in order to be protected <br/>\n&gt; by the homeschooling law...) but then do NOT have it filed with <br/>\n&gt; anyone but the school (where it never goes to the school if you are <br/>\n&gt; going to be a homeschooler, it goes only to the district)..It&#39;s <br/>\n&gt; smoke and mirrors....<br/>\n<br/>\n </span></blockquote>Well, see, I agree with that being wrong. Lying to people is wrong. And I<br/>\nknow at least one independent study  charter in California told people<br/>\nthat homeschooling through an R-4 was illegal, and that&#39;s wrong too.<br/>\n<br/>\nI do think, though, that options are a good thing. As long as these<br/>\nprograms are honest, and don&#39;t try to take away less restrictive options,<br/>\nthen I think they should be allowed to remain, and people shouldn&#39;t be<br/>\nstigmatized for chosing them. I really see education as more of a<br/>\ncontinuum than an either-or... or maybe not a continuum, because that<br/>\nimplies one dimension, and I think there are more, it&#39;s not just how much<br/>\n&quot;school&quot;, but what kind of learning, and when and where and how... there<br/>\nare so many different directions. It doesn&#39;t have to be Us (the<br/>\nhomeschoolers) vs. Them (the schools), and I don&#39;t think it should be. I<br/>\ndon&#39;t like much of what they do, true, but I see potential, or<br/>\npossibilities...<br/>\n<br/>\nMostly, people need to become informed - the person I know  who was told<br/>\nby the charter here that R-4 homeschooling was illegal knew better, and<br/>\nhad found legal opinions  to back her up within an hour. <br/>\n<br/>\nI honestly don&#39;t worry too much about homeschooling becoming more<br/>\nregulated. I think the pendulum swings back and forth, and this swing<br/>\ntowards &quot;testing&quot; and &quot;accountability&quot; has gone about as far as it can<br/>\ngo, so we&#39;re due for a swing back to constructivism and freedom, a la the<br/>\nseventies. Perhaps I am naively hopeful.<br/>\n<br/>\nDar<br/>\n<br/>\n________________________________________________________________<br/>\nGET INTERNET ACCESS FROM JUNO!<br/>\nJuno offers FREE or PREMIUM Internet access for less!<br/>\nJoin Juno today!  For your FREE software, visit:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://dl.www.juno.com/get/web/.\">http://dl.www.juno.com/get/web/.</a></div>","specialLinks":[]},{"userId":90268604,"authorName":"Nichoel","from":"&quot;Nichoel&quot; &lt;stormyrain73@...&gt;","profile":"nichoel1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] re: school-based homeschooling-long","postDate":"1012199067","msgId":3076,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZmIwMWMxYTdjNCQ3MDE3N2E2MCRhYzAwZTUwY0BhdHRiaS5jb20+","referencesHeader":"PDExMC5jNTA0ZWRkLjI5ODY0MDYyQGFvbC5jb20+IDwwMGU4MDFjMWE3YzQkMTcyZGYxNDAkYWMwMGU1MGNAYXR0YmkuY29tPg=="},"prevInTopic":3075,"nextInTopic":3083,"prevInTime":3075,"nextInTime":3077,"topicId":3075,"numMessagesInTopic":0,"msgSnippet":"Blech I am SO sorry about the formatting on that last post, I will work on getting it formatted in a more readable and understandable format..Dont hurt your","messageBody":"<div id=\"ygrps-yiv-1998638681\">Blech I am SO sorry about the formatting on that last post, I will work on getting it formatted in a more readable and understandable format..Dont hurt your eyes on it!<br/>\n<br/>\nNichoel<br/>\n<br/>\nFertility Friend Online Support Guide <br/>\nNow you CAN conceive online..<br/>\nwww.fertilityfriend.com/sm/21749/<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Nichoel <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\n  Sent: Sunday, January 27, 2002 10:21 PM<br/>\n  Subject: [AlwaysLearning] re: school-based homeschooling-long<br/>\n<br/>\n<br/>\n  Pam,<br/>\n<br/>\n  In the instance given here in WA state the issue is black and white. By *our* laws, those enrolled in AEPs are NOT protected nor are they *legally* homeschooling or protected by that law..The *problem* is that the school district is *lying* to people saying that they *are* in an effort to *take back control* of those children.<br/>\n<br/>\n  Then we have those who *chose* to enroll in the AEP telling others who are wanting to *fully homeschool* that the AEP fulfills that &quot;slot&quot; of homeschooling, when it very simply *in this state* does *not*. It is a *public school funded and controlled* program.<br/>\n<br/>\n  It&#39;s not a semantics issue, it&#39;s a legal issue. It&#39;s black and white; you are either protected under the homeschooling RCW or you are not, and AEPs in this state are *public education* not *homeschooling* (legally). And when we get school districts trying to blur the lines, and people who are opting for the public education blanket blurring the lines even further for new homeschoolers it IS a situation where homeschoolers in the state need to step up and take notice, because if they do not then may not be long before we see legal action to incorporate all of us who ARE protected under the homeschooling RCW into stalls and corrals we&#39;d rather not be in...<br/>\n<br/>\n  If we dont take notice, we may wake up one day to find that we no longer *have* the choice to fully homeschool our children, and that would be a horrid, horrid loss.<br/>\n<br/>\n  I agree, if you make the choice that is your choice, however; we need to make sure the public school district is telling the truth and being honest to people who are researching ....In this case they are even having the fill out a declaration of intent (What we fill out to declare our status as homeschoolers in order to be protected by the homeschooling law...) but then do NOT have it filed with anyone but the school (where it never goes to the school if you are going to be a homeschooler, it goes only to the district)..It&#39;s smoke and mirrors....<br/>\n<br/>\n  Here, read for yourself what the issues are in this state: From the WHO (Washington homeschool organization) website<br/>\n<br/>\n             Homeschooling                                           Public Alternative Education <br/>\n        What laws regulate the programs? RCW 28A.200, the Home-Based Instruction Law WAC 392-121-182, Public School Alternative Learning Experience <br/>\n        Who has control and is accountable for the education of the child? The parents have control on what, when, where, why, and how their children will learn. The parents are accountable. Certificated staff is in control, responsible and accountable for the ALP (Alternative Learning Plan) and student assessments. <br/>\n        What about curriculum? Parents have complete control over curriculum content, level, presentation, etc. Parents provide their own curriculum. School district may allow parental input. Districts provide curriculum and sometimes purchase orders for curriculum purchases. <br/>\n        Is a faith-based curriculum OK? Absolutely. All decisions relating to curriculum and philosophy or doctrine are the responsibility of the parent. No. It is against the law for public school programs to use religious curriculum. <br/>\n        What are the testing requirements? There are two testing options - standardized achievement test or non-test-based assessment; the results remain in the home. All students take the state-mandated WASL (Washington Assessment of Student Learning). Students may opt out of testing, but passing the 10th grade WASL is a graduation requirement for 2008 high school graduation. <br/>\n        What are the requirements for student progress? It is the parents&#39; responsibility to see that the child&#39;s progress is appropriate for their age or stage of development. The student&#39;s performance is evaluated every 45 school days. If s/he is not progressing, the ALP is revised. <br/>\n        What are the record keeping requirements? Parents keep the health, testing and educational records of their child at home. ALP records, evaluations, grades, credits, WASL scores, etc. are kept at the school. <br/>\n        What about Outcome-Based Education and Goals 2000?  Homeschooled students are exempt from Outcome-Based Education and Goals 2000. The student&#39;s ALP must support the Outcome-Based education goals and objectives. <br/>\n<br/>\n<br/>\n  --------------------------------------------------------------------------------<br/>\n<br/>\n  Some public alternative education programs have the word &quot;homeschool&quot; in their title. How do I know if I&#39;m homeschooling, or in a public alternative education program? <br/>\n  The public alternative education programs (with increased oversight) are modeled on one of the ways we legally homeschool, namely, qualifying to homeschool by using a supervising teacher who meets with your child(ren) on an average of one hour a week.<br/>\n<br/>\n  You are probably in a public alternative education program if: you registered your child for the program on school district forms; you are meeting in a public school building; school district personnel (the teachers) are supervising or assessing your child; you have access to district curriculum materials, libraries, computers, etc.; your child has an alternative learning plan; you keep records on hours spent on academic pursuit at home; your child is assessed by the school personnel; your child is expected to take the WASL; and records are being kept at the school on your child.<br/>\n<br/>\n  The only program that we are aware of presently that is offered through the public schools for homeschoolers that is not a public alt. ed. program is the Manhattan Center in the Highline School District. If you don&#39;t know for sure, ask your district if they are receiving Full Time Enrollment (FTE) funding for your child. If they are, you are in an alternative education program.<br/>\n<br/>\n  My school district&#39;s alternative education program is not demanding about religious curriculum, logging hours, essential learning requirement goals, student&#39;s alternative learning plan, etc. <br/>\n  Some school districts are not in compliance with the alternative learning experience requirements, WAC 392-121-182 or the state laws. These programs are new and trying to attract a homeschooling population that does not traditionally like or want a lot of oversight. As these programs become successfully established they will conform with the WACs.<br/>\n<br/>\n  What concerns WHO about Public School Alternative Learning Programs?<br/>\n  These programs are being targeted at homeschoolers almost exclusively. In some districts public school students are not eligible. Why are homeschoolers targeted populations? Possibly because each student recruited from homeschooling to a public alternative education program brings with them FTE money. Then again, homeschool parents already know how to teach and will not require supervision or training. Or maybe it&#39;s because homeschooled students tend to be independent and motivated learners who score well on tests; a bonus for any public school program.<br/>\n<br/>\n  Evidence suggests that some school districts are deliberately misinforming parents interested in homeschooling as to their legal homeschooling option under Home-based Instruction, and then misdirecting them to public alternative programs as their only &quot;homeschooling&quot; choice. These actions serve to bring funding into the public alternative programs while reducing the ranks of homeschoolers.<br/>\n<br/>\n  These programs present to the public, and governing bodies, a more familiar, supervised and regulated form of &quot;homeschooling.&quot; The eventual result could be a lobbying of the legislature by public education to amend or abolish the Home-based Instruction law, and to re-absorb the homeschooling community into public education under the auspices of alternative education.<br/>\n<br/>\n  Nichoel<br/>\n<br/>\n  Fertility Friend Online Support Guide <br/>\n  Now you CAN conceive online..<br/>\n  www.fertilityfriend.com/sm/21749/<br/>\n    ----- Original Message ----- <br/>\n    From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:PSoroosh@...\">PSoroosh@...</a> <br/>\n    To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:alwayslearning@yahoogroups.com\">alwayslearning@yahoogroups.com</a> <br/>\n    Sent: Sunday, January 27, 2002 9:49 PM<br/>\n    Subject: [AlwaysLearning] re: school-based homeschooling<br/>\n<br/>\n<br/>\n    &gt;&gt;Here the AEP are programs by the district to entice new homeschooler <br/>\n    and suck them back into the system were they (the district) have the <br/>\n    control. And then to tell the bold face lie that you are still a <br/>\n    homeschooler.   &lt;&lt;<br/>\n<br/>\n    If you&#39;d made that choice it would be your choice. If you didn&#39;t choose to <br/>\n    participate, then you didn&#39;t. Either way, it wouldn&#39;t mean someone else <br/>\n    should tell you that you&#39;re not a real homeschooler, especially in the rest <br/>\n    of the homeschooling world where MANY people are enrolled (voluntarily) in <br/>\n    controlling programs - many of them private - and are still considered part <br/>\n    of the homeschooling community. People voluntarily sign up for all kinds of <br/>\n    correspondence schools, for example, and still consider themselves part of <br/>\n    the homeschooling community. People buy the full Calvert Curriculum with <br/>\n    teacher support and do just what the teacher tells them to do and send their <br/>\n    kids papers in to be graded, but they still consider themselves part of the <br/>\n    homeschooling community. Shall we start telling them that they aren&#39;t real <br/>\n    homeschoolers since they&#39;ve given up so much control (and they PAY to give up <br/>\n    that control so they don&#39;t even have the excuse of getting free materials).<br/>\n<br/>\n    What effect does telling people that they aren&#39;t real homeschoolers have on <br/>\n    those who choose the public school programs? Does it mean that the public <br/>\n    schools are going to shut down their programs and stop their nefarious <br/>\n    activities? <br/>\n<br/>\n    No, but it isolates those people in those programs even more than the public <br/>\n    schools try to do already. It makes them leave open email lists when they <br/>\n    have to hear, yet again, that they&#39;re not real homeschoolers. The more <br/>\n    isolated they are, the LESS aware they will be of the importance of <br/>\n    maintaining the option to homeschool independently and that is <br/>\n    counterproductive.<br/>\n<br/>\n    To tell people that are in certain programs that they aren&#39;t real <br/>\n    homeschoolers is hurtful for no good reason and it doesn&#39;t do anything at all <br/>\n    to reduce the possible negative impacts of the programs themselves.<br/>\n<br/>\n    --pam<br/>\n<br/>\n<br/>\n    [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n          Yahoo! Groups Sponsor <br/>\n                ADVERTISEMENT<br/>\n               <br/>\n         <br/>\n         <br/>\n<br/>\n    To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n<br/>\n<br/>\n    Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n              ADVERTISEMENT<br/>\n             <br/>\n       <br/>\n       <br/>\n<br/>\n  To unsubscribe from this group, send an email to:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n<br/>\n<br/>\n  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":90268604,"authorName":"Nichoel","from":"&quot;Nichoel&quot; &lt;stormyrain73@...&gt;","profile":"nichoel1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"re: school-based homeschooling-long","postDate":"1012198918","msgId":3075,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZTgwMWMxYTdjNCQxNzJkZjE0MCRhYzAwZTUwY0BhdHRiaS5jb20+","referencesHeader":"PDExMC5jNTA0ZWRkLjI5ODY0MDYyQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":3076,"prevInTime":3074,"nextInTime":3076,"topicId":3075,"numMessagesInTopic":0,"msgSnippet":"Pam, In the instance given here in WA state the issue is black and white. By *our* laws, those enrolled in AEPs are NOT protected nor are they *legally*","messageBody":"<div id=\"ygrps-yiv-1396981098\">Pam,<br/>\n<br/>\nIn the instance given here in WA state the issue is black and white. By *our* laws, those enrolled in AEPs are NOT protected nor are they *legally* homeschooling or protected by that law..The *problem* is that the school district is *lying* to people saying that they *are* in an effort to *take back control* of those children.<br/>\n<br/>\nThen we have those who *chose* to enroll in the AEP telling others who are wanting to *fully homeschool* that the AEP fulfills that &quot;slot&quot; of homeschooling, when it very simply *in this state* does *not*. It is a *public school funded and controlled* program.<br/>\n<br/>\nIt&#39;s not a semantics issue, it&#39;s a legal issue. It&#39;s black and white; you are either protected under the homeschooling RCW or you are not, and AEPs in this state are *public education* not *homeschooling* (legally). And when we get school districts trying to blur the lines, and people who are opting for the public education blanket blurring the lines even further for new homeschoolers it IS a situation where homeschoolers in the state need to step up and take notice, because if they do not then may not be long before we see legal action to incorporate all of us who ARE protected under the homeschooling RCW into stalls and corrals we&#39;d rather not be in...<br/>\n<br/>\nIf we dont take notice, we may wake up one day to find that we no longer *have* the choice to fully homeschool our children, and that would be a horrid, horrid loss.<br/>\n<br/>\nI agree, if you make the choice that is your choice, however; we need to make sure the public school district is telling the truth and being honest to people who are researching ....In this case they are even having the fill out a declaration of intent (What we fill out to declare our status as homeschoolers in order to be protected by the homeschooling law...) but then do NOT have it filed with anyone but the school (where it never goes to the school if you are going to be a homeschooler, it goes only to the district)..It&#39;s smoke and mirrors....<br/>\n<br/>\nHere, read for yourself what the issues are in this state: From the WHO (Washington homeschool organization) website<br/>\n<br/>\n           Homeschooling                                           Public Alternative Education <br/>\n      What laws regulate the programs? RCW 28A.200, the Home-Based Instruction Law WAC 392-121-182, Public School Alternative Learning Experience <br/>\n      Who has control and is accountable for the education of the child? The parents have control on what, when, where, why, and how their children will learn. The parents are accountable. Certificated staff is in control, responsible and accountable for the ALP (Alternative Learning Plan) and student assessments. <br/>\n      What about curriculum? Parents have complete control over curriculum content, level, presentation, etc. Parents provide their own curriculum. School district may allow parental input. Districts provide curriculum and sometimes purchase orders for curriculum purchases. <br/>\n      Is a faith-based curriculum OK? Absolutely. All decisions relating to curriculum and philosophy or doctrine are the responsibility of the parent. No. It is against the law for public school programs to use religious curriculum. <br/>\n      What are the testing requirements? There are two testing options - standardized achievement test or non-test-based assessment; the results remain in the home. All students take the state-mandated WASL (Washington Assessment of Student Learning). Students may opt out of testing, but passing the 10th grade WASL is a graduation requirement for 2008 high school graduation. <br/>\n      What are the requirements for student progress? It is the parents&#39; responsibility to see that the child&#39;s progress is appropriate for their age or stage of development. The student&#39;s performance is evaluated every 45 school days. If s/he is not progressing, the ALP is revised. <br/>\n      What are the record keeping requirements? Parents keep the health, testing and educational records of their child at home. ALP records, evaluations, grades, credits, WASL scores, etc. are kept at the school. <br/>\n      What about Outcome-Based Education and Goals 2000?  Homeschooled students are exempt from Outcome-Based Education and Goals 2000. The student&#39;s ALP must support the Outcome-Based education goals and objectives. <br/>\n<br/>\n<br/>\n--------------------------------------------------------------------------------<br/>\n<br/>\nSome public alternative education programs have the word &quot;homeschool&quot; in their title. How do I know if I&#39;m homeschooling, or in a public alternative education program? <br/>\nThe public alternative education programs (with increased oversight) are modeled on one of the ways we legally homeschool, namely, qualifying to homeschool by using a supervising teacher who meets with your child(ren) on an average of one hour a week.<br/>\n<br/>\nYou are probably in a public alternative education program if: you registered your child for the program on school district forms; you are meeting in a public school building; school district personnel (the teachers) are supervising or assessing your child; you have access to district curriculum materials, libraries, computers, etc.; your child has an alternative learning plan; you keep records on hours spent on academic pursuit at home; your child is assessed by the school personnel; your child is expected to take the WASL; and records are being kept at the school on your child.<br/>\n<br/>\nThe only program that we are aware of presently that is offered through the public schools for homeschoolers that is not a public alt. ed. program is the Manhattan Center in the Highline School District. If you don&#39;t know for sure, ask your district if they are receiving Full Time Enrollment (FTE) funding for your child. If they are, you are in an alternative education program.<br/>\n<br/>\nMy school district&#39;s alternative education program is not demanding about religious curriculum, logging hours, essential learning requirement goals, student&#39;s alternative learning plan, etc. <br/>\nSome school districts are not in compliance with the alternative learning experience requirements, WAC 392-121-182 or the state laws. These programs are new and trying to attract a homeschooling population that does not traditionally like or want a lot of oversight. As these programs become successfully established they will conform with the WACs.<br/>\n<br/>\nWhat concerns WHO about Public School Alternative Learning Programs?<br/>\nThese programs are being targeted at homeschoolers almost exclusively. In some districts public school students are not eligible. Why are homeschoolers targeted populations? Possibly because each student recruited from homeschooling to a public alternative education program brings with them FTE money. Then again, homeschool parents already know how to teach and will not require supervision or training. Or maybe it&#39;s because homeschooled students tend to be independent and motivated learners who score well on tests; a bonus for any public school program.<br/>\n<br/>\nEvidence suggests that some school districts are deliberately misinforming parents interested in homeschooling as to their legal homeschooling option under Home-based Instruction, and then misdirecting them to public alternative programs as their only &quot;homeschooling&quot; choice. These actions serve to bring funding into the public alternative programs while reducing the ranks of homeschoolers.<br/>\n<br/>\nThese programs present to the public, and governing bodies, a more familiar, supervised and regulated form of &quot;homeschooling.&quot; The eventual result could be a lobbying of the legislature by public education to amend or abolish the Home-based Instruction law, and to re-absorb the homeschooling community into public education under the auspices of alternative education.<br/>\n<br/>\nNichoel<br/>\n<br/>\nFertility Friend Online Support Guide <br/>\nNow you CAN conceive online..<br/>\nwww.fertilityfriend.com/sm/21749/<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:PSoroosh@...\">PSoroosh@...</a> <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:alwayslearning@yahoogroups.com\">alwayslearning@yahoogroups.com</a> <br/>\n  Sent: Sunday, January 27, 2002 9:49 PM<br/>\n  Subject: [AlwaysLearning] re: school-based homeschooling<br/>\n<br/>\n<br/>\n  &gt;&gt;Here the AEP are programs by the district to entice new homeschooler <br/>\n  and suck them back into the system were they (the district) have the <br/>\n  control. And then to tell the bold face lie that you are still a <br/>\n  homeschooler.   &lt;&lt;<br/>\n<br/>\n  If you&#39;d made that choice it would be your choice. If you didn&#39;t choose to <br/>\n  participate, then you didn&#39;t. Either way, it wouldn&#39;t mean someone else <br/>\n  should tell you that you&#39;re not a real homeschooler, especially in the rest <br/>\n  of the homeschooling world where MANY people are enrolled (voluntarily) in <br/>\n  controlling programs - many of them private - and are still considered part <br/>\n  of the homeschooling community. People voluntarily sign up for all kinds of <br/>\n  correspondence schools, for example, and still consider themselves part of <br/>\n  the homeschooling community. People buy the full Calvert Curriculum with <br/>\n  teacher support and do just what the teacher tells them to do and send their <br/>\n  kids papers in to be graded, but they still consider themselves part of the <br/>\n  homeschooling community. Shall we start telling them that they aren&#39;t real <br/>\n  homeschoolers since they&#39;ve given up so much control (and they PAY to give up <br/>\n  that control so they don&#39;t even have the excuse of getting free materials).<br/>\n<br/>\n  What effect does telling people that they aren&#39;t real homeschoolers have on <br/>\n  those who choose the public school programs? Does it mean that the public <br/>\n  schools are going to shut down their programs and stop their nefarious <br/>\n  activities? <br/>\n<br/>\n  No, but it isolates those people in those programs even more than the public <br/>\n  schools try to do already. It makes them leave open email lists when they <br/>\n  have to hear, yet again, that they&#39;re not real homeschoolers. The more <br/>\n  isolated they are, the LESS aware they will be of the importance of <br/>\n  maintaining the option to homeschool independently and that is <br/>\n  counterproductive.<br/>\n<br/>\n  To tell people that are in certain programs that they aren&#39;t real <br/>\n  homeschoolers is hurtful for no good reason and it doesn&#39;t do anything at all <br/>\n  to reduce the possible negative impacts of the programs themselves.<br/>\n<br/>\n  --pam<br/>\n<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n              ADVERTISEMENT<br/>\n             <br/>\n       <br/>\n       <br/>\n<br/>\n  To unsubscribe from this group, send an email to:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n<br/>\n<br/>\n  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]}],"prevTopicId":3079,"nextTopicId":3098}}