{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":108821967,"authorName":"Cindi Sanchez","from":"&quot;Cindi Sanchez&quot; &lt;cinsurf@...&gt;","profile":"cinsurf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Good Mother&#39;s Day","postDate":"1242162232","msgId":44964,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1Y283bytqbGJ0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":44963,"nextInTime":44965,"topicId":44964,"numMessagesInTopic":0,"msgSnippet":"... I totally agree!! I wanted to share my Mother s Day here because it tuned out to be a great day that just unfolded without expectations. I woke up late,","messageBody":"<div id=\"ygrps-yiv-1466530609\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;I think a solidly normal day can be the BEST once a mom has figured<br/>\n&gt;&gt;&gt;how wonderful a good normal day can be!<br/>\n<br/>\n </span></blockquote>I totally agree!!<br/>\n<br/>\nI wanted to share my Mother&#39;s Day here because it tuned out to be a great day that just unfolded without expectations.<br/>\n<br/>\nI woke up late, around 8, and Ron was already up and had made coffee. We sat on the couch and talked until Jess (17)woke up and came out to join us. We all watched a garden design show for a while and then Jess got up and cooked us all a nice breakfast. Ronny (19)had joined us by then and we watched the &#39;Barefoot Contessa&#39; cooking show while we ate. The BC was making shortbread cookies dipped in chocolate. Right away Jess and I realized we had all the ingredients and decided to make them. <br/>\n<br/>\nI started washing the breakfast dishes while Jess set up the stuff for cookies. Ron and Ronny were watching a show on strange sharks with double hinged jaws and called us over to see/talk about them several times. Our house is pretty small so we were all basically in the same room already. Once the cookie dough was made and cooling in the fridge, Jess and I started in on the new lasagna recipe that I wanted to try for dinner. We went outside and picked the herbs for the sauce and lettuce for the salad. The boys were watching a show on historical weapons and were deep into a discussion about what they would need to make a crossbow from scratch and how they would do it. <br/>\n<br/>\nThe cookies were baked and cooling and the lasagna was in the oven and I said I was going down to the nursery to spend the birthday money I had saved from last month on flowers. We had 5 empty pots on the front porch that I wanted to fill. Ronny and Jess decided to come with me while Ron took a nap and we all had a good time picking out combinations of flowers that we thought were pretty together.<br/>\n<br/>\nWhen we got home the lasagna was ready and everyone loved it. I&#39;ve been trying new recipes lately to add to my list of things to cook, so that was a happy success. <br/>\n<br/>\nAfter our dinner we ran over to visit Grandma and Grandpa to give cards and hugs for mother&#39;s day. We came home and had a couple of  cookies and some coffee, then headed over to the theater to see the new Star Trek movie. It was kind of funny and corny like the original TV show and we all really enjoyed it.<br/>\n<br/>\nWe got home around 11 and settled in to watch another shark show before going to bed. At midnight I got cards and presents that I didn&#39;t expect, but by then it was a picture perfect day already.<br/>\n<br/>\nIt was my favorite mother&#39;s day yet.<br/>\n<br/>\n<br/>\nCindi</div>","specialLinks":[]}],"prevTopicId":44696,"nextTopicId":44968}}