{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":85994576,"authorName":"Kolleen","from":"Kolleen &lt;Kolleen@...&gt;","profile":"kaydeecross","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"experience, experts, ownership and road trip","postDate":"1016767084","msgId":33226,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwMzIyMDMxNi5nMk0zRzRsdDAwODQ2N0BueWNzbXRwMm91dC5yZGMtbnljLnJyLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":33225,"nextInTime":33227,"topicId":33226,"numMessagesInTopic":0,"msgSnippet":"There were so many posts that I wanted to respond to. But alas there must of been a reason the power went out twice and I lost the snippets. With no time to go","messageBody":"<div id=\"ygrps-yiv-1943805556\">There were so many posts that I wanted to respond to. But alas there must <br/>\nof been a reason the power went out twice and I lost the snippets. With <br/>\nno time to go back through the massive amount of mail to find them <br/>\n(again).<br/>\n<br/>\nBridget&#39;s explanation of experience reminded me of when I was hiring a <br/>\npressman. Not an easy task at a time when unemployment was low. A very <br/>\nwise person said to me &quot;Make sure they have experience. I mean 15 years <br/>\nof experience, not 1 year of experience 15 times over.&quot;<br/>\n<br/>\nIf all your children fall easily into unschooling, are very adaptive and <br/>\nthere&#39;s no neurological damage going on.. then you&#39;re going to have very <br/>\nlittle rocks in the road with unschooling. It becomes a challange when <br/>\nyou hit bumps outside the norm. Or when you take on another child that <br/>\nyou didn&#39;t raise and have to deschool them, or *gasp* they are damaged <br/>\nbeyond repair and now you still need to fit that into a lifestyle.<br/>\n<br/>\nExperience comes in many shapes and forms. And what about the ones that <br/>\nare born into it.. are they more experienced? Or the ones that it comes <br/>\nnatural and they didn&#39;t have to awaken to it? There was no &#39;aha&#39; it just <br/>\nalways was and anything outside of it seems strange...<br/>\n<br/>\nLike I said.. many shapes and forms... I&#39;m not going to judge who&#39;s is <br/>\nworth more in anyone elses eyes but my own. Which leads to experts.<br/>\n<br/>\nEven experts with degress might not be considered experts by others at <br/>\nall. If you show me your chiropractic expert, I&#39;m going to ask if he is <br/>\nGrostic. If not, he&#39;s no expert to me. In my eyes.<br/>\n<br/>\nWe all pick our experts that belong to our belief system. In the realm of <br/>\nunschooling, I would choose my father for a start.. then think about <br/>\nHolt.. then maybe jump over to Lynda because she sums things up in a way <br/>\nthat I can relate to instantly. I haven&#39;t read enough of anyone elses <br/>\ninformation to determine if they are my experts.<br/>\n<br/>\nWithout a bonafide expert. Nor any officially recognized movement, then <br/>\nunschooling doesn&#39;t have an owner per se. It has advocates. Some of them <br/>\nvehemently disagree on certain points. Somehow, there is a commonality <br/>\namongst them, even if the devil is in the details.<br/>\n<br/>\nWith all these advocates, who then has the right, the power, the <br/>\nownership to determine what fits into this term and what doesn&#39;t.<br/>\n<br/>\nShould we use your expert? or my expert? (blanket question, not directed <br/>\nat anyone)<br/>\n<br/>\nNY Times, Washington Post, Globe and Mail.. I haven&#39;t seen any <br/>\nproclamations that there is a unified group of the unschoolers and they <br/>\nhave chosen a leader and defined the term. So we&#39;re back to square one. <br/>\nNo nationally recognized experts.<br/>\n<br/>\nAnd for that, I&#39;m glad. I remember learning how the AMA established <br/>\nitself in courts as the medical experts. So anything alternative isn&#39;t <br/>\nviable. I would hate to see the same of something so organic as <br/>\nunschooling.<br/>\n<br/>\nThere might be factions or groups that look to certain experts. But they <br/>\nare congregating in specific places. A group here, a group there. Nothing <br/>\non a nationally established level. So there is no ownership of the word. <br/>\nOr a movement en masse that says this is how it has to be if you want to <br/>\nbe an unschooler.<br/>\n<br/>\nTherefore, nobody has the right to proclaim it as this or that, and you <br/>\ndon&#39;t belong unless you follow what my group has established.<br/>\n<br/>\nLets find the commonalities, like &#39;the child&#39;s agenda&#39;, and after that... <br/>\nmaybe it can grow into something beyond this website, that conference, <br/>\nthis publication etc. Who know?<br/>\n<br/>\nOff on a road trip, just me and the kid. I even went as far to get myself <br/>\none of those brain-scrambling cell phones for emergencies.<br/>\n<br/>\nGoing offmail for a bit.. I&#39;ll drop in if I get near a computer... enjoy <br/>\nthe discussion.<br/>\n<br/>\nkolleen<br/>\n<br/>\nMac OS X is like a wigwam: no Windows, no Gates, Apache inside.<br/>\n<br/>\n&quot;People take different roads seeking <br/>\nfulfillment and happiness. Just <br/>\nbecause they&#39;re not on your road <br/>\ndoesn&#39;t mean they&#39;ve gotten lost.&quot;<br/>\n             -H. Jackson Brown, Jr.</div>","specialLinks":[]}],"prevTopicId":33223,"nextTopicId":33123}}