{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":8378727,"authorName":"zenmomma *","from":"&quot;zenmomma *&quot; &lt;zenmomma@...&gt;","profile":"zenmomma2kids","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Homeschooling-9years, New to Unschooling","postDate":"1027604155","msgId":39403,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY1OGNBVzlBMmVQdGkwMUVybk0wMDAxZDA4ZUBob3RtYWlsLmNvbT4="},"prevInTopic":39354,"nextInTopic":0,"prevInTime":39402,"nextInTime":39404,"topicId":39351,"numMessagesInTopic":0,"msgSnippet":"... Very well!! ... Well no, I still have a life to live. ;-) If you mean do I do no schoolwork unless my child initiates it, then I d have to say we do no ","messageBody":"<div id=\"ygrps-yiv-1003258818\"><blockquote><span title=\"ireply\">&gt;&gt;How does unschooling really work?&gt;&gt;<br/>\n<br/>\n </span></blockquote>Very well!!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Do you do nothing unless the child initiates it?&gt;&gt;<br/>\n<br/>\n </span></blockquote>Well no, I still have a life to live. ;-) If you mean do I do no <br/>\n&quot;schoolwork&quot; unless my child initiates it, then I &#39;d have to say we do no <br/>\nschoolwork at all! What we do is look at the world as one big interesting <br/>\nplace that is fun and interesting to learn about. We explore it together. <br/>\nSometimes I suggest an activity, sometimes they do. There&#39;s just no hidden <br/>\nrequirement that every activity have a &quot;learning goal&quot; or that it must even <br/>\nbe completed in a certain way.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I have been homeschooling for 9 years. We have 8 children, the oldest <br/>\n&gt;&gt;graduating this past May. Do I still teach my little ones to read? How do <br/>\n&gt;&gt;they pick up on it themselves?&gt;&gt;<br/>\n<br/>\n </span></blockquote>I think it&#39;s counterproductive to sit little children down with lessons. It <br/>\ntakes all the joy and exploration out of the process. Your little ones will <br/>\nlearn to read because it&#39;s a fun and useful life skill. They&#39;ll pick up on <br/>\nit by being surrounded with the printed word, by being read to, by having <br/>\ntheir questions answered right as they think of them, by trying to figure <br/>\nout roadsigns and t-shirt sayings, by playing with games, by playing around <br/>\nwith words with you. Unschooling does NOT mean ignore them. I&#39;m sure you&#39;ll <br/>\nbe doing all sorts of activities with them that involve reading. They&#39;ll <br/>\nlearn!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;After all these years of homeschooling I have decided I hate textbooks. <br/>\n&gt;&gt;I&#39;m tired of making out assignments for 5 children, making them do boring <br/>\n&gt;&gt;meaningless work.&gt;&gt;<br/>\n<br/>\n </span></blockquote>Hurray for you and hurray for your kids!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;If I went into the kitchen right now and told my kids they never had to <br/>\n&gt;&gt;have school again, they would be thrilled and immediately veg out in front <br/>\n&gt;&gt;of the tv or nintendo.&gt;&gt;<br/>\n<br/>\n </span></blockquote>Maybe for awhile, but not forever. I myself have been know to veg out on <br/>\noccassion. :o) Sometimes we need that time to recharge, relax and regroup. <br/>\nThey most especially will need time to deschool. Even school-at-home is <br/>\nschool. Give them time to get out of that mindset. Give them time to get <br/>\nused to making their own choices about how they&#39;ll spend their time. For <br/>\nawhile it may very well be TV or Nintendo, but they&#39;ll get tired of it <br/>\neventually. And they&#39;ll have had time to think about what other things <br/>\nthey&#39;d really like to do.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;How do you keep your kids from just doing nothing?&gt;&gt;<br/>\n<br/>\n </span></blockquote>We all need our down times. And even when a kid looks like they&#39;re doing <br/>\nnothing, they&#39;re doing something. It&#39;s just not a something that looks like <br/>\nschoolwork.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;As you can see, I have many questions. This really seems to be what I want <br/>\n&gt;&gt;to do, but I&#39;m just plain old s-c-a-r-e-d to take the plunge. Please help <br/>\n&gt;&gt;me with your advice.&gt;&gt;<br/>\n<br/>\n </span></blockquote>Go for it! You&#39;ve given the school-at-home thing a try and you&#39;re feeling <br/>\nburned out and disillusioned by it. Go ahead and give real life a try <br/>\nwithout textbooks and curriculums. Your kids will amaze you with what they <br/>\nwill learn by just being a part of this world. We&#39;re all learning all the <br/>\ntime.<br/>\n<br/>\nLife is good.<br/>\n~Mary<br/>\n<br/>\n<br/>\n_________________________________________________________________<br/>\nSend and receive Hotmail on your mobile device: <a rel=\"nofollow\" target=\"_blank\" href=\"http://mobile.msn.com\">http://mobile.msn.com</a></div>","specialLinks":[]},{"userId":113028911,"authorName":"Dnowens@aol.com","from":"Dnowens@...","profile":"hsmominoz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Homeschooling-9years, New to Unschooling","postDate":"1027449940","msgId":39354,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJiLjIzNjM4ZTczLjJhNmVmZTU0QGFvbC5jb20+"},"prevInTopic":39352,"nextInTopic":39403,"prevInTime":39353,"nextInTime":39355,"topicId":39351,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/23/02 12:32:45 PM Central Daylight Time, ... I call this, *What Moly Really Did That Day She Spent Vegging on the Couch* I apologize to","messageBody":"<div id=\"ygrps-yiv-799889848\">In a message dated 7/23/02 12:32:45 PM Central Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lajoward@...\">lajoward@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How do you keep your kids from just doing nothing?<br/>\n&gt; <br/>\n </span></blockquote>I call this, *What Moly Really Did That Day She Spent &#39;Vegging&#39; on the Couch*<br/>\nI apologize to anyone who has read this, I wrote something similar on another <br/>\nlist.<br/>\n<br/>\nThe other day Moly was vegging on the couch, watching a video on apes but, <br/>\nwhile watching, what really interested her was the jungle, and how cool all <br/>\nthe plants are. So she got some books and fliped channels between the <br/>\nNational Geographic, history, and discovery channels. She found things on <br/>\ntropical plants, she learned about the rain forests, logging practices, <br/>\nendangered species, poaching, illegal capture and sale of exotic birds and <br/>\nother wild life, the medicinal values of certain plants, the tribes of people <br/>\nand their cultures, how they make their huts, whether they are <br/>\nhunter/gatherers or farmers, why they decorate their bodies the way they do, <br/>\nwhy do people all around the world use piercing and tattoos as expression, <br/>\nwhy has this become such a fad in America... All this from vegging on the <br/>\ncouch! Jack got in on the discussion too, and we called their Uncle in <br/>\nGeorgia who is a tattoo artist, and he told the kids some interesting things. <br/>\nThen we had a discussion of how to run a business. That is unschooling, (to <br/>\nme anyway) and Moly spent a good part of the day on the couch. To the casual <br/>\nobserver, I am sure it would have looked like we sat around and did nothing <br/>\nall day. <br/>\n<br/>\nWhen I was a child, we traveled a lot because of my Dad&#39;s job. We also got to <br/>\nlive in some real exotic places, so many times when my kids are just sitting <br/>\naround, they are going through all my things. It amazes me what they learn <br/>\njust by doing that. My Mom just gave me all the National Geographic Magazines <br/>\nthey have collected over the years. My grandparents started the collection <br/>\nback in the 30&#39;s. I really hope my kids find some time to *veg out* with some <br/>\nof those. Vegging out can be a good thing. <br/>\n~Nancy<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Homeschooling-9years, New to Unschooling","postDate":"1027447162","msgId":39352,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5LjJhNzc1Njg3LjJhNmVmMzdhQGFvbC5jb20+"},"prevInTopic":39351,"nextInTopic":39354,"prevInTime":39351,"nextInTime":39353,"topicId":39351,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/23/02 11:32:55 AM, lajoward@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-496323917\">In a message dated 7/23/02 11:32:55 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lajoward@...\">lajoward@...</a> writes:<br/>\n<br/>\n&lt;&lt;  If my family or neighbors found out I was not &quot;doing school&quot; like it was <br/>\ndone in the school system, they would report me for neglect. &gt;&gt;<br/>\n<br/>\nNot if you&#39;re not being neglectful they won&#39;t.<br/>\nTell them you&#39;re doing unit studies if that will ease them into the idea.  I <br/>\ndo the unit of everything. &lt;g&gt;  &quot;The Universal Unit!&quot;<br/>\n<br/>\nYou can still keep a list of activities, movies you watched, books people <br/>\nused/read/checked out, places you went, projects and hobbies people worked <br/>\non, if you&#39;re afraid of the friends and relatives.<br/>\n<br/>\n&lt;&lt;This year I have told my 17dd that she didn&#39;t have to do math anymore (she <br/>\nhates math) unless she wanted to. We just have never been able to get through <br/>\na pre-algebra textbook (Saxon). We&#39;ve tried 4 times! &gt;&gt;<br/>\n<br/>\nIf she were in high school they might have told her that two years ago.  If <br/>\nthey only required two math units to graduate...<br/>\n<br/>\n&lt;&lt;She loves to read and work on crafts. Egypt and Atlantis are biggies for <br/>\nher <br/>\nright now. &gt;&gt;<br/>\n<br/>\nIf she even just talks to the other kids about what she&#39;s discovering about <br/>\nthose things you can &quot;count it&quot; for all of them.<br/>\n<br/>\nAnd eventually you can stop counting anything.<br/>\n<br/>\n&lt;&lt;If I went into the kitchen right now and told my kids they never had to <br/>\nhave <br/>\nschool again, they would be thrilled and immediately veg out in front of the <br/>\ntv or nintendo. How do you keep your kids from just doing nothing?&gt;&gt;<br/>\n<br/>\nI don&#39;t.  They can watch all they want.  And if you just LET them, they&#39;ll <br/>\nplay Nintendo (although I don&#39;t consider it vegging out at all) or watch TV <br/>\n(where they&#39;ll see all kinds of things to think about and ask about and think <br/>\nabout and connect) and they might seem to be &quot;doing nothing,&quot; but I seriously <br/>\ndoubt it will ever be &quot;nothing.&quot; Even if it&#39;s waiting or resting or <br/>\ndaydreaming or thinking or meditating, it&#39;s not nothing.<br/>\n<br/>\nThey won&#39;t just do the same thing forever.  Nobody does unless they&#39;re really <br/>\nemotionally wounded.<br/>\n<br/>\n&lt;&lt;This really seems to be what I want to do, but I&#39;m just plain old <br/>\ns-c-a-r-e-d to take the plunge. Please help me with your advice. &gt;&gt;<br/>\n<br/>\nOne good trick is to &quot;Take a month off.&quot;<br/>\n<br/>\nLots of people tell their kids this when they first take them out of school.  <br/>\nAnd in  a way you&#39;re taking yours out of school, but it won&#39;t be so obvious <br/>\nto them.  You could tell them you want to JUST take a break.<br/>\n<br/>\nBut during the break you could be doing things you think you&#39;d like to be <br/>\ndoing if you keep on having that break for years.  And you can see their <br/>\nreaction to things which are &quot;just for fun&quot; and not intended to be <br/>\neducational.<br/>\n<br/>\nBecause even you yourself have divided the world into &quot;learning&quot; and &quot;not <br/>\nlearning&quot; and &quot;work&quot; and &quot;nothing&quot; for so long, it might be harder for you <br/>\nthan it will be for them.  The next issue of Home Education Magazine is going <br/>\nto have at least two articles on deschooling.  If you haven&#39;t yet subscribed <br/>\nto HEM, this might be the perfect time to do that!<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/\">http://www.home-ed-magazine.com/</a><br/>\n<br/>\nI did not teach my children to read.  Holly surprised me by being slow to <br/>\nread even though she&#39;s VERY verbal, has a big vocabulary and has liked to <br/>\nwrite since she was very young.  Today she was reading Harry Potter cards, <br/>\nthough, and only missed a few words.  Usually a long word with lots of vowels <br/>\nbut only one or two syllable will stump her.<br/>\n<br/>\nI have something I think you should definitely read.  Go to <br/>\nwww.unschooling.com and click on &quot;library&quot; at the left.  It&#39;s an article by <br/>\nmy friend and my former La Leche League leader Carol Rice.  I know her four <br/>\nkids REALLY very well.  The girls are at my house at least once a week.  We <br/>\nwere in a babysitting co-op together.  Our families have known each other <br/>\nsince Kirby was four months old and her kids were all pre-readers, so I can <br/>\nvouch for all she says.<br/>\n<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":68562015,"authorName":"lajoward@aol.com","from":"lajoward@...","profile":"lajoward","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Homeschooling-9years, New to Unschooling","postDate":"1027445494","msgId":39351,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMy4xMWI2MDEwYS4yYTZlZWNmNkBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":39352,"prevInTime":39350,"nextInTime":39352,"topicId":39351,"numMessagesInTopic":0,"msgSnippet":"Hello, I have been a member of your group for a bit, and have just been reading and enjoying all your emails. So now I have some questions. How does","messageBody":"<div id=\"ygrps-yiv-72476945\">Hello,<br/>\nI have been a member of your group for a bit, and have just been reading and <br/>\nenjoying all your emails. So now I have some questions.<br/>\nHow does unschooling really work? <br/>\nDo you do nothing unless the child initiates it?<br/>\nI have been homeschooling for 9 years. We have 8 children, the oldest <br/>\ngraduating this past May. Do I still teach my little ones to read? How do <br/>\nthey pick up on it themselves?<br/>\nAfter all these years of homeschooling I have decided I hate textbooks. I&#39;m <br/>\ntired of making out assignments for 5 children, making them do boring <br/>\nmeaningless work. I dislike so much about that, but I&#39;ve always felt &quot;Big <br/>\nBrother&quot; looming over me and just couldn&#39;t break free of it. If my family or <br/>\nneighbors found out I was not &quot;doing school&quot; like it was done in the school <br/>\nsystem, they would report me for neglect.<br/>\nThis year I have told my 17dd that she didn&#39;t have to do math anymore (she <br/>\nhates math) unless she wanted to. We just have never been able to get through <br/>\na pre-algebra textbook (Saxon). We&#39;ve tried 4 times! She is so happy. She <br/>\nloves to read and work on crafts. Egypt and Atlantis are biggies for her <br/>\nright now. <br/>\nI am taking baby steps toward unschooling. I am a voracious reader and am <br/>\nchecking out large quantities of books about unschooling. I am a bit nervous. <br/>\nIf I went into the kitchen right now and told my kids they never had to have <br/>\nschool again, they would be thrilled and immediately veg out in front of the <br/>\ntv or nintendo. How do you keep your kids from just doing nothing?<br/>\nAs you can see, I have many questions. This really seems to be what I want to <br/>\ndo, but I&#39;m just plain old s-c-a-r-e-d to take the plunge. Please help me <br/>\nwith your advice. <br/>\nLaura<br/>\n<br/>\nWife to David for 21 years<br/>\nMother to Ben, Rachel, Eli, Rebekah, Bethany, Sam, Josiah, and MaryGrace<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":39316,"nextTopicId":39358}}