{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":109480760,"authorName":"tinkiechelle1@aol.com","from":"tinkiechelle1@...","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Zan on the fringe","postDate":"1027791486","msgId":39533,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3ZC5iYjA4NGM0LjJhNzQzNDdlQGFvbC5jb20+"},"prevInTopic":39489,"nextInTopic":0,"prevInTime":39532,"nextInTime":39534,"topicId":39474,"numMessagesInTopic":0,"msgSnippet":"hey cat! i was in your shoes as well! i live in the south and have mostly bible belter around me. i have alot of different views but whenever i say my views ","messageBody":"<div id=\"ygrps-yiv-927337195\">hey cat!<br/>\n  i was in your shoes as well! i live in the south and have mostly bible <br/>\nbelter around me. i have alot of different views but whenever i say my views <br/>\nmost people give me an odd look. see i believe that every religon must have <br/>\nsome value or so many wouldn&#39;t follow them. and who am i to say which way is <br/>\nthe right way, that&#39;s not my place and religous freedom is what our country <br/>\nwas founded on.  anyway when i first thought of hsing i thought you could <br/>\nonly do it if you had religous reasons, then i did some research, and found <br/>\nsome groups. i can&#39;t begin to tell you the difference hsing has made in our <br/>\nlives. we are lucky enough to have a good group here that isn&#39;t based on <br/>\nreligon, but we walk to a different beat and mostly do things with <br/>\nourselves.but i have really enjjoyed having our hs group especially when i <br/>\nhave questions about nc or our county. have you ever thought of starting your <br/>\nown group. go to educational stores and put out flyers about what you would <br/>\nlike to achieve. it may just take off before you know it!!!!<br/>\ntina<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":112382817,"authorName":"Jamie Lemon","from":"&quot;Jamie Lemon&quot; &lt;zanhawk@...&gt;","profile":"jamielemon2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Zan on the fringe","postDate":"1027703176","msgId":39489,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNGUwMWMyMzRjNiRjNDg2YzIxMCQ4N2ZlYThjMEBzcGVlZGRlYW1vbj4=","referencesHeader":"PDIwMDIwNzI2MTQwODM2LjY4NDE0LnFtYWlsQHdlYjEyMTAyLm1haWwueWFob28uY29tPg=="},"prevInTopic":39474,"nextInTopic":39533,"prevInTime":39488,"nextInTime":39490,"topicId":39474,"numMessagesInTopic":0,"msgSnippet":"Hi Cat! I m sad to hear that you struggle with the same issues as I do.  But I must say that I see the choice to unschool separate from the problems with my","messageBody":"<div id=\"ygrps-yiv-1137386129\">Hi Cat!<br/>\n<br/>\nI&#39;m sad to hear that you struggle with the same issues as I do.  But I must<br/>\nsay that I see the choice to unschool separate from the problems with my own<br/>\n&quot;socialization&quot;  (yucky word!) If I never met another person who homeschools<br/>\nor unschools I would still have my children at home learning in their own<br/>\nspecial ways.  I beleive in it that much, that all in all I don&#39;t NEED the<br/>\nsupport, I just WANT it.  Don&#39;t let other&#39;s closed-minds deter you from<br/>\nchoosing what you see as right for your child.  Trust me, I speak from<br/>\nexperience.  I did put my kids back in PS(once for a year and once for a few<br/>\nmonths), it was a mistake that left &quot;scars&quot; on their learning styles. Now<br/>\nthey have been home for 2 years and I wouldn&#39;t change it for the world<br/>\n(unless they insisted).<br/>\nI have to say that I am very lucky, my dh is extremely supportive and he is<br/>\nmy closest and dearest friend.  He&#39;s the only one I can truly trust to give<br/>\nsupport in this and all endeavors.  Regardless of all my &quot;fringe&quot; ways he<br/>\nloves me (as a matter of fact I think he loves me because of my fringe ways)<br/>\nhaha<br/>\n<br/>\nWell I am sorry I can&#39;t say more now, it is friday and fridays are very busy<br/>\naround here. I haven&#39;t even gotten dressed yet! AHHHHH!<br/>\nThank you for posting, your post got me thinking and has made me realize<br/>\nthat I am lucky, maybe not in all areas of my life, but in the most<br/>\nimportant areas.<br/>\nI wish you the best in making these important decisions.<br/>\nZan<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\nFrom: Cathy Gardner<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a><br/>\nSent: Friday, July 26, 2002 9:08 AM<br/>\nSubject: [Unschooling-dotcom] Zan on the fringe<br/>\n<br/>\n<br/>\n<br/>\nHi to everyone and especially Zan!<br/>\n<br/>\nI&#39;ve been lurking on this list for quite awhile.  We live in rural southern<br/>\nOklahoma and my only child, 4 yo girl, will start public school this<br/>\nfall...if I let her.  I&#39;m a former teacher myself and have strong misgivings<br/>\nabout our schools.  I&#39;ve been really struggling with the idea of<br/>\nhomeschooling/unschooling.  One of my primary problems is that, like Zan&#39;s<br/>\nexperience in Indiana, all HS groups here are faith based.  Now, I would<br/>\nnominally call myself a Christian...but I was raised in Oregon (need I say<br/>\nmore?!?) and my ideals/beliefs are so liberal, I don&#39;t fit in anywhere.  In<br/>\nfact, I&#39;m more buddhist than anything.  Needless to say, I will NOT sign a<br/>\nfaith statement.  Zan, I read your post about feeling on the fringe and it<br/>\nis a comment I make to my husband so much.  I&#39;ve lived here 6 years and can<br/>\nfind NO ONE to relate to.  Finding this group online a few months ago has<br/>\nbeen such a good thing for me.  Until then, I had no concept that anyone<br/>\nother than fundamental Christians wanted to avoid the public schools.<br/>\n<br/>\nSo here I struggle, with a headstrong daughter who undertook this summer to<br/>\nteach herself the alphabet.  She is also far, FAR too sensitive to the<br/>\nridicule of her classmates (she&#39;s been in part time daycare since 11 months<br/>\nbecause, unfortunately, I MUST work...for now).  It&#39;s the sessions of<br/>\ncomforting her after picking her up, trying to convince her that even though<br/>\nJohnny told her we didn&#39;t love her, it wasn&#39;t true.  And even though Susie<br/>\nsaid her clothes were stupid (she takes great pride in dressing<br/>\nherself...sometimes in *interesting* outfits), they were okay if SHE liked<br/>\nthem.<br/>\n<br/>\nI must admit...I&#39;m just scared that I don&#39;t have the ability to properly<br/>\nteach her.  I know it&#39;s my former teacher indoctrination...but<br/>\nstill...Anyway, I&#39;m so glad to hear all of your successes on this list.<br/>\n<br/>\nCat<br/>\n<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nDo You Yahoo!?<br/>\nYahoo! Health - Feel better, live better<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\nYahoo! Groups Sponsor<br/>\n<br/>\nClick here to find your contact lenses!<br/>\n<br/>\nIf you have questions, concerns or problems with this list, please email the<br/>\nModerator, Joyce Fetteroll, at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a><br/>\n<br/>\nTo unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a><br/>\n<br/>\nVisit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n<br/>\nYour use of Yahoo! Groups is subject to the Yahoo! Terms of Service. </span></blockquote></div>","specialLinks":[]},{"userId":3057982,"authorName":"Cathy Gardner","from":"Cathy Gardner &lt;gardnergirl_99@...&gt;","profile":"GardnerGirl_99","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Zan on the fringe","postDate":"1027692516","msgId":39474,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwNzI2MTQwODM2LjY4NDE0LnFtYWlsQHdlYjEyMTAyLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDEwMjc2NDkzNDYuMzI3LjcyMDcyLm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":39489,"prevInTime":39473,"nextInTime":39475,"topicId":39474,"numMessagesInTopic":0,"msgSnippet":"Hi to everyone and especially Zan! I ve been lurking on this list for quite awhile.  We live in rural southern Oklahoma and my only child, 4 yo girl, will","messageBody":"<div id=\"ygrps-yiv-747606598\">Hi to everyone and especially Zan!<br/>\n<br/>\nI&#39;ve been lurking on this list for quite awhile.  We live in rural southern Oklahoma and my only child, 4 yo girl, will start public school this fall...if I let her.  I&#39;m a former teacher myself and have strong misgivings about our schools.  I&#39;ve been really struggling with the idea of homeschooling/unschooling.  One of my primary problems is that, like Zan&#39;s experience in Indiana, all HS groups here are faith based.  Now, I would nominally call myself a Christian...but I was raised in Oregon (need I say more?!?) and my ideals/beliefs are so liberal, I don&#39;t fit in anywhere.  In fact, I&#39;m more buddhist than anything.  Needless to say, I will NOT sign a faith statement.  Zan, I read your post about feeling on the fringe and it is a comment I make to my husband so much.  I&#39;ve lived here 6 years and can find NO ONE to relate to.  Finding this group online a few months ago has been such a good thing for me.  Until then, I had no concept that anyone other than fundamental Christians wanted to avoid the public schools.<br/>\n<br/>\nSo here I struggle, with a headstrong daughter who undertook this summer to teach herself the alphabet.  She is also far, FAR too sensitive to the ridicule of her classmates (she&#39;s been in part time daycare since 11 months because, unfortunately, I MUST work...for now).  It&#39;s the sessions of comforting her after picking her up, trying to convince her that even though Johnny told her we didn&#39;t love her, it wasn&#39;t true.  And even though Susie said her clothes were stupid (she takes great pride in dressing herself...sometimes in *interesting* outfits), they were okay if SHE liked them.<br/>\n<br/>\nI must admit...I&#39;m just scared that I don&#39;t have the ability to properly teach her.  I know it&#39;s my former teacher indoctrination...but still...Anyway, I&#39;m so glad to hear all of your successes on this list.<br/>\n<br/>\nCat<br/>\n<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nDo You Yahoo!?<br/>\nYahoo! Health - Feel better, live better<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":39491,"nextTopicId":39542}}