{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":21,"messages":[{"userId":276080282,"authorName":"delphini004","from":"&quot;delphini004&quot; &lt;delphini004@...&gt;","profile":"delphini004","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Pleasing my husband","postDate":"1315579139","msgId":62848,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo0ZDhlMys4N2VuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBTXVqbWRzTS1lclUxYS0wc1lndmFldDE0b2UzVERnOXBrRDhXUGFfdU9oRnR0aDJQUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":62777,"nextInTopic":0,"prevInTime":62847,"nextInTime":62849,"topicId":62560,"numMessagesInTopic":0,"msgSnippet":"And maybe take a look at Alan Thomas and Harriet Pattison works (UK): http://www.howchildrenlearnathome.co.uk/ Edith","messageBody":"<div id=\"ygrps-yiv-199560832\">And maybe take a look at Alan Thomas and Harriet Pattison works (UK):<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.howchildrenlearnathome.co.uk/\">http://www.howchildrenlearnathome.co.uk/</a><br/>\n<br/>\nEdith<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, chris ester &lt;chris.homeschool@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Though the Moore&#39;s are not unschooling, they have some good information on<br/>\n&gt; the &quot;better late than early&quot; concept.  The names are Raymond and Dorothy<br/>\n&gt; Moore.  They are both deceased and someone has taken up what appears to be a<br/>\n&gt; profitable crusade of sorts to spread the message of the &quot;moore formula&quot;.<br/>\n&gt; Some of this can fit with unschooling, but I really just liked the info as<br/>\n&gt; food for thought.<br/>\n&gt; <br/>\n&gt; Anyway, Dr. Moore had research about development and learning that pointed<br/>\n&gt; to the damage that could be created when learning is forced.  Amazon still<br/>\n&gt; has some of his books, and you may be able to find some of the articles<br/>\n&gt; online.<br/>\n&gt; <br/>\n&gt; The info that stuck with me is that &quot;average age of reading attainment&quot;<br/>\n&gt; (when kids learn to read) is between the ages of 8 and 13.  Basically this<br/>\n&gt; man&#39;s research seemed to indicate that if left to their own devices and<br/>\n&gt; exposed to print in their environment (people read to them, they see print,<br/>\n&gt; they get the message that reading is useful...) then children learn to read<br/>\n&gt; eventually.  Also, he found that as long as they weren&#39;t given the message<br/>\n&gt; that they were defective for not reading &quot;on time&quot;, then the kids who<br/>\n&gt; started reading at an older age were not found to be &quot;behind&quot; in college as<br/>\n&gt; young adults.<br/>\n&gt; <br/>\n&gt; I was struck by the size of the span of &#39;average&#39; age that kids will learn<br/>\n&gt; to read.  Oh, he also found that scores on IQ tests and age of reading<br/>\n&gt; attainment were not closely related at all.  In other words, &quot;smart&quot; kids<br/>\n&gt; are not any more likely to read &quot;early&quot; than &quot;average&quot; kids and vice versa.<br/>\n&gt; He seemed to suggest that reading skills were a lot like physical<br/>\n&gt; coordination.  Everyone (or nearly everyone) learns to walk, but some<br/>\n&gt; develop the coordination sooner than others, but by the time they are young<br/>\n&gt; adults you really can&#39;t tell who was earlier than whom...<br/>\n&gt; Chris<br/>\n&gt; <br/>\n&gt; On Sun, Aug 28, 2011 at 4:25 PM, Amy &lt;a.l.jonesz@...&gt; wrote:<br/>\n&gt; <br/>\n&gt; &gt; **<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; I am having to balance my desire to unschool for my husbands desire for the<br/>\n&gt; &gt; children to go to school. We have been home educating for 2 years now. My<br/>\n&gt; &gt; oldest is 6 and a half and her sister is 4. He is so worried that the oldest<br/>\n&gt; &gt; is failing because her reading and math levels aren&#39;t what he thinks they<br/>\n&gt; &gt; should be. He has been teaching her to read in the evenings for the past 6<br/>\n&gt; &gt; months. He has agreed to let the home education continue but wants us to set<br/>\n&gt; &gt; some targets and keep some record and have periodic reassessments.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Does anyone have any experience with doing something along these lines? We<br/>\n&gt; &gt; live in the UK and I am trying to get ahold of something from the schools to<br/>\n&gt; &gt; see what they consider succeeding but the language they use is so ambiguous.<br/>\n&gt; &gt;<br/>\n&gt; &gt; I am feeling very discouraged and like just giving up and letting him put<br/>\n&gt; &gt; them in school. I don&#39;t disagree that he has a right to have input to their<br/>\n&gt; &gt; education but his fear levels are so high. I just feel like nothing I do<br/>\n&gt; &gt; will be enough as he actually wants them doing more advanced stuff than they<br/>\n&gt; &gt; would be doing in school. He will not read anything on home education or<br/>\n&gt; &gt; unschooling.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Thanks,<br/>\n&gt; &gt; Amy<br/>\n&gt; &gt;<br/>\n&gt; &gt;  <br/>\n&gt; &gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Pleasing my husband","postDate":"1315194389","msgId":62777,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY5NzNGQzlFLTcwOTAtNEFEQy05RjVGLTRGMkM5MjZFMjEzN0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBTUhKS0w4SE5ld29qK19qck1HaHBXXy1OSmEtdVF0REd3ZlVNNEFSam1RNlZlc1BnZ0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGozaXNpdStmOWUwQGVHcm91cHMuY29tPiA8ajNtanJjK2dxdjhAZUdyb3Vwcy5jb20+IDxDQU1ISktMOEhOZXdvaitfanJNR2hwV18tTkphLXVRdERHd2ZVTTRBUmptUTZWZXNQZ2dAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":62776,"nextInTopic":62848,"prevInTime":62776,"nextInTime":62778,"topicId":62560,"numMessagesInTopic":0,"msgSnippet":"-=- Would he be willing to listen to a podcast? I know there are several videos of Sandra and one at least of her daughter Holly. I think there may be some","messageBody":"<div id=\"ygrps-yiv-2117972421\">-=- Would he be willing to listen to a<br/>\npodcast? I know there are several videos of Sandra and one at least of her<br/>\ndaughter Holly. I think there may be some interviews that could be<br/>\ndownloaded for him to listen to in the car or while at the gym...-=-<br/>\n<br/>\nThe comments under the video of Holly, at YouTube, are a horror show.  Kirby laughed and told me not to read them.  I forget sometimes, and go back and look.  HORRIBLE!!! Then I remember that all those folks went to school, who are saying the more horrible, ignorant, hateful things.  REALLY stupid things.  Then I look back at Holly (either there, or here) and shake it off and I laugh too.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":345817076,"authorName":"Sylvia Woodman","from":"Sylvia Woodman &lt;sylvia057@...&gt;","profile":"sylviawoodman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Pleasing my husband","postDate":"1315193625","msgId":62776,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTUhKS0w4SE5ld29qK19qck1HaHBXXy1OSmEtdVF0REd3ZlVNNEFSam1RNlZlc1BnZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGozbWpyYytncXY4QGVHcm91cHMuY29tPg==","referencesHeader":"PGozaXNpdStmOWUwQGVHcm91cHMuY29tPgk8ajNtanJjK2dxdjhAZUdyb3Vwcy5jb20+"},"prevInTopic":62664,"nextInTopic":62777,"prevInTime":62775,"nextInTime":62777,"topicId":62560,"numMessagesInTopic":0,"msgSnippet":"Would your husband be willing to look at some youtube videos about unschooling and natural learning? Would he be willing to listen to a podcast?  I know there","messageBody":"<div id=\"ygrps-yiv-324080095\">Would your husband be willing to look at some youtube videos about<br/>\nunschooling and natural learning? Would he be willing to listen to a<br/>\npodcast?  I know there are several videos of Sandra and one at least of her<br/>\ndaughter Holly.  I think there may be some interviews that could be<br/>\ndownloaded for him to listen to in the car or while at the gym...<br/>\n<br/>\nWarm regards,<br/>\n<br/>\nSylvia<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed, Aug 31, 2011 at 8:32 PM, Bea &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:beatrice.mantovani@...\">beatrice.mantovani@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; === I suppose to some degree I need to do what parents who have to produce<br/>\n&gt; results and work for an educational authority have to do while they<br/>\n&gt; unschool. Except it is my husband I am doing this for so feel it requires a<br/>\n&gt; slightly higher level of honesty/integrity. ===<br/>\n&gt;<br/>\n&gt; From what you write here it sounds like maybe you don&#39;t really completely<br/>\n&gt; believe that your daughter can learn by &quot;just&quot; playing and doing no<br/>\n&gt; workbooks.<br/>\n&gt;<br/>\n&gt; What I mean is, parents who need to report progress by subjects look at<br/>\n&gt; playing video games, for example, and see math, logic, and a lot more - they<br/>\n&gt; are not being dishonest, they really do see all that learning. I don&#39;t have<br/>\n&gt; to report to a school board but if I did I would be able to break down what<br/>\n&gt; my daughter is learning and I wouldn&#39;t be lying about it. I see the learning<br/>\n&gt; in everything she is doing.<br/>\n&gt;<br/>\n&gt; I can&#39;t remember what your daughter is into but can *you* see what she is<br/>\n&gt; learning? And could you break it up in your head in order to explain it to<br/>\n&gt; your husband? If not, then maybe you need to do more deschooling and take<br/>\n&gt; another look at what your daughter does to find the value in it.<br/>\n&gt;<br/>\n&gt; Bea<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":413967925,"authorName":"Bea","from":"&quot;Bea&quot; &lt;beatrice.mantovani@...&gt;","profile":"bmantovani","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Pleasing my husband","postDate":"1314837164","msgId":62664,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGozbWpyYytncXY4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGozaXNpdStmOWUwQGVHcm91cHMuY29tPg=="},"prevInTopic":62644,"nextInTopic":62776,"prevInTime":62663,"nextInTime":62665,"topicId":62560,"numMessagesInTopic":0,"msgSnippet":"=== I suppose to some degree I need to do what parents who have to produce results and work for an educational authority have to do while they unschool.","messageBody":"<div id=\"ygrps-yiv-1155139598\">=== I suppose to some degree I need to do what parents who have to produce results and work for an educational authority have to do while they unschool.  Except it is my husband I am doing this for so feel it requires a slightly higher level of honesty/integrity. ===<br/>\n<br/>\nFrom what you write here it sounds like maybe you don&#39;t really completely believe that your daughter can learn by &quot;just&quot; playing and doing no workbooks.<br/>\n<br/>\nWhat I mean is, parents who need to report progress by subjects look at playing video games, for example, and see math, logic, and a lot more - they are not being dishonest, they really do see all that learning. I don&#39;t have to report to a school board but if I did I would be able to break down what my daughter is learning and I wouldn&#39;t be lying about it.  I see the learning in everything she is doing. <br/>\n<br/>\nI can&#39;t remember what your daughter is into but can *you* see what she is learning? And could you break it up in your head in order to explain it to your husband?  If not, then maybe you need to do more deschooling and take another look at what your daughter does to find the value in it.  <br/>\n<br/>\nBea</div>","specialLinks":[]},{"userId":416020383,"authorName":"Carole Lovesey","from":"Carole Lovesey &lt;carole.lovesey@...&gt;","profile":"carole_lovesey","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Pleasing my husband","postDate":"1314789483","msgId":62644,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU1NUYyRTdDLTBBNjEtNEREMC04M0YyLTMyQkQ5OTNEMTk2NEBtZS5jb20+"},"prevInTopic":62622,"nextInTopic":62664,"prevInTime":62643,"nextInTime":62645,"topicId":62560,"numMessagesInTopic":0,"msgSnippet":"== have you seen this: http://curriculum.qcda.gov.uk/ ? == == Thanks for this but I was looking for more ideas on how to still maintain some degree of autonomy","messageBody":"<div id=\"ygrps-yiv-1862858963\">== have you seen this: <a rel=\"nofollow\" target=\"_blank\" href=\"http://curriculum.qcda.gov.uk/\">http://curriculum.qcda.gov.uk/</a> ? ==<br/>\n<br/>\n== Thanks for this but I was looking for more ideas on how to still maintain some degree of autonomy for the kids and not end up just doing school at home. <br/>\nAmy ===<br/>\n<br/>\nI wasn&#39;t suggesting that you follow the national curriculum, but that you could use the guidelines to understand how your husband&#39;s expectations broadly compare to what your daughter would be doing if she were at school. If his expectations turn out to be higher than the government&#39;s, the information could help to reassure him and reduce his concerns, and maybe buy you a bit of breathing space. I was responding to these parts of your original message, where it sounds like your discussions are based on assumptions, opinion & fear :<br/>\n<br/>\n==He is so worried that the oldest is failing because her reading and math levels aren&#39;t what he thinks they should be. ==<br/>\nand == We live in the UK and I am trying to get ahold of something from the schools to see what they consider succeeding ==<br/>\n<br/>\nCarole <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":183568025,"authorName":"Bob Collier","from":"&quot;Bob Collier&quot; &lt;bobcollier@...&gt;","profile":"quaussiebob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Pleasing my husband","postDate":"1314758617","msgId":62622,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGozazc0cCtuZDJyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGozZTg3YSszZWJ1QGVHcm91cHMuY29tPg=="},"prevInTopic":62617,"nextInTopic":62644,"prevInTime":62621,"nextInTime":62623,"topicId":62560,"numMessagesInTopic":0,"msgSnippet":"... It s interesting I think that so-called alternative education is so often framed as an opportunity to create academic superstars, as if to make a point,","messageBody":"<div id=\"ygrps-yiv-922795340\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Amy&quot; &lt;a.l.jonesz@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I am having to balance my desire to unschool for  my husbands desire for the children to go to school.  We have been home educating for 2 years now.  My oldest is 6 and a half  and her sister is 4.  He is so worried that the oldest is failing because her reading and math levels aren&#39;t what he thinks they should be.  He has been teaching her to read in the evenings for the past 6 months.   He has agreed to let the home education continue but wants us to set some targets and keep some record and have periodic reassessments.  <br/>\n&gt; <br/>\n&gt; Does anyone have any experience with doing something along these lines?  We live in the UK and I am trying to get ahold of something from the schools to see what they consider succeeding but the language they use is so ambiguous.<br/>\n&gt; <br/>\n&gt; I am feeling very discouraged and like just giving up and letting him put them in school.   I don&#39;t disagree that he has a right to have input to their education but his fear levels are so high.  I just feel like nothing I do will be enough as he actually wants them doing more advanced stuff than they would be doing in school.  He will not read anything on home education or unschooling.  <br/>\n&gt; <br/>\n&gt; Thanks,<br/>\n&gt; Amy<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>It&#39;s interesting I think that so-called &quot;alternative education&quot; is so often framed as an opportunity to create academic superstars, as if to make a point, and yet most parents, when asked, will say that what they want most for their children is for them to be happy.<br/>\n<br/>\nMy wife and I took our son out of school in 2002 when he was seven because he was unhappy and we wanted him to be happy. Apart from the first two weeks when we tried structured learning and that didn&#39;t work out, he&#39;s done no academic work at home at all, even though his mother is an academic - a university lecturer in fact - and his older sister was an &quot;A student&quot; through school and has three university degrees.<br/>\n<br/>\nPersonally, I would have loved for my son to make a point on my behalf by using the internet to complete the K-12 curriculum in a fraction of the time it takes schools to teach it but he had other ideas about what would make him happy.<br/>\n<br/>\nAbout a month or so ago, his mother suggested to him that he took an assessment to study for a &quot;Year 10 Certificate&quot; as it&#39;s called here in Australia at a further education college. It&#39;s the first qualification school children are expected to obtain, only in this case the course is for teenagers who have left school without one. Our son was happy to consider that, we spent a week looking at Year 9 literacy and numeracy test papers we&#39;d downloaded from the internet to discover what he might not be familiar with, which turned out to be not that much, and worked on those things over a cup of tea and a conversation before the day. He top scored on both the literacy and numeracy assessments. Sure it wasn&#39;t an entrance exam to an elite school or anything like that, but it wasn&#39;t a bad effort on the back of a few days preparation. Now he&#39;s started on the course, he&#39;s free to study at his own pace and expects to complete the syllabus by the end of December. Five months. This is to reach a standard of education that schools sprinkle over ten years of classroom attendance.<br/>\n<br/>\nMy son&#39;s college record has his previous education noted as &quot;homeschooled&quot;. Implying school at home because that&#39;s what they understand. The two tutors who ran the assessments couldn&#39;t quite get their heads around him not having done any academic work at all since he was seven. Had I mentioned that he&#39;d spent most of that time playing violent videogames I&#39;m sure it would have totally freaked them out but I didn&#39;t quite have the cojones for that.<br/>\n<br/>\nAnyway my son is doing fine. He&#39;s a fine young man. He&#39;s discovered that he loves maths (math) and still thinks the English language is pretty crazy (he often commented on its nonsensical spellings in particular when he was younger).<br/>\n<br/>\nBut my real point is this.<br/>\n<br/>\nI failed my GCE (General Certificate of Education) Mathematics &quot;O&quot; level (the first academic qualifications schoolchildren in the UK were expected to obtain at that time) when I was at school - twice. Eight years after I left school, I signed up with a &quot;correspondence college&quot;, studied the entire syllabus in nine months in my spare time, took the exam and passed with an A. That was in 1976. All my work was handwritten, all my communications with the college were by snail mail. Sometimes it was two weeks before a marked assignment came back to me. In 2011, would something like that be harder to do or easier? It would be easier to do of course.<br/>\n<br/>\nOne time, somewhere, somebody made a comment about Sandra&#39;s daughter Holly along the lines of &quot;If you don&#39;t go to school you&#39;ll end up flipping burgers&quot;. What???!!! How absurd is that?<br/>\n<br/>\nEven regardless of the truth about how children learn, &quot;further education&quot; has been an established reality for a century, and additionally in this century schools have become the laggards of the education world. <br/>\n<br/>\nI see the boy across the road from me, who&#39;s about the same age as my son, sometimes trudging off to the bus stop on a cold morning with his huge backpack weighing him down, and I&#39;m sitting at my dining room table with my laptop and a cup of tea and I think about his father&#39;s obsession with academic achievement and I wonder if there&#39;s anything his son will learn at school today that he can&#39;t learn from the comfort of his own home.<br/>\n<br/>\nEven if your husband wants your children to do nothing but study the K-12 curriculum, sitting in a classroom with 25-30 other children waiting to be taught is a complete nonsense in this day and age compared to what can be achieved online by a self-motivated solo learner.<br/>\n<br/>\nAnd I&#39;m not going to get started on what schools teach that&#39;s irrelevant to success as an adult and what they don&#39;t or won&#39;t teach that&#39;s very necessary or I&#39;ll be here all day. Or perhaps I&#39;m the only person to emerge from 12 years of school into the adult world only to find myself feeling ignorant and lost.<br/>\n<br/>\nSo. My apologies for writing so much about school but it&#39;s relevant here I think.<br/>\n<br/>\nThere&#39;s no need to be afraid of anything because a child doesn&#39;t go to school. Happy children love learning. Wherever they are. And the plain fact of my own experience is that the obvious fundamentals take care of themselves and beyond that nobody knows what&#39;s important and what isn&#39;t. I promised my son when he was first out of school that we would work on the multiplication tables just as soon as it became obvious that he needed to know them. He memorised them over the course of two days the week before his Year 10 assessment. My son hasn&#39;t read a book since he was at school (if your child won&#39;t read books thank a teacher) yet his reading is excellent. His vocabulary is amazing. When he used to frequent the gamer forums, he would often correct other people&#39;s spelling and grammar. Those are the kinds of things that have happened in my experience from putting happiness first. Get into a mindset of &quot;I&#39;ll be happy when ...&quot; - well, that&#39;s the proverbial recipe for disaster. Do what makes you happy now. And do what makes you happy now. And do what makes you happy now. And fascinating outcomes emerge that can be very pleasing indeed.<br/>\n<br/>\nMy daughter became a lawyer. My son is becoming something different. Do I care that he isn&#39;t studying for an LLB? Nope. He has his own path to a successful adult life that&#39;s equally valid. I would be distraught however if I had done anything to destroy his enthusiasm out of my fear that something would &quot;go wrong&quot;. Millions of people end up in therapy because they&#39;ve had their enthusiasm squashed. The self-help industry makes millions of dollars a year helping people rediscover their lost motivation. It&#39;s all damage that can be avoided by a little faith in the innate intelligence of the human child.<br/>\n<br/>\nAnyway, I&#39;m getting on my soapbox about this now and I have to go. Perhaps what I really mean to say is that your husband&#39;s perception of what &quot;school&quot; is and what it can do may be seriously out of date. Check out the work of Judy Breck and Clark Aldrich. And Alfie Kohn&#39;s classic article &quot;What Does It Mean To Be Well Educated?&quot;.<br/>\n<br/>\nBob</div>","specialLinks":[]},{"userId":284087656,"authorName":"Karen","from":"&quot;Karen&quot; &lt;semajrak@...&gt;","profile":"semajrak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Pleasing my husband","postDate":"1314736948","msgId":62617,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGozamh2aytnbTliQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGozaXM0NitpYTg3QGVHcm91cHMuY29tPg=="},"prevInTopic":62615,"nextInTopic":62622,"prevInTime":62616,"nextInTime":62618,"topicId":62560,"numMessagesInTopic":0,"msgSnippet":"... I was three when I learned to read.  I used to be asked to read to people on the bus to amuse them and my mom.  My husband was considered a late reader,","messageBody":"<div id=\"ygrps-yiv-1089779151\"><blockquote><span title=\"ireply\">&gt; He feels that she must learn to read early, that she will not succeed at life if she doesn&#39;t.  &gt; He feels that it all must happen as soon as possible.<br/>\n<br/>\n </span></blockquote>I was three when I learned to read.  I used to be asked to read to people on the bus to amuse them and my mom.  My husband was considered a &quot;late&quot; reader, really struggling to read in grade two.  It was suggested that perhaps he needed special education classes, or to be held back.  He went on to be an over achiever in school, always working endlessly to prove to everyone that he was smart.  I spent most of my school years thinking I was so smart I didn&#39;t need to try. <br/>\n<br/>\nReading is a tool that we add to our tool belt in order to help us accomplish a job we want to accomplish.  It is an effective way to gain information, but it isn&#39;t the only way.  <br/>\n<br/>\n*When* we read isn&#39;t a measure of intelligence or future success.  In the instance of my husband and myself,  that *when* had a negative impact on who we *thought* we were.  We have both moved on just fine, but being defined by our reading skills didn&#39;t help us in any way.  <br/>\n<br/>\nMy son read early.  His friend (age 7) isn&#39;t reading yet.  Thankfully, neither of them see reading as a measure of anything.  They sit side by side playing games on the computer.  When something needs to be read, Ethan reads it.  We visit places together and sometimes reading (signs, papers, books...) is requested.  Our friend asks for our help.  We all enjoy that opportunity to interact.  When some other tool is needed, our friend is happy to share his skills with Ethan.  One time, the two of them were looking at a CD together.  Ethan read the lyrics to his friend, and his friend sang the song.  They both danced around, and it was very rewarding for both of them.</div>","specialLinks":[]},{"userId":123650904,"authorName":"Amy","from":"&quot;Amy&quot; &lt;a.l.jonesz@...&gt;","profile":"aljonesz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Pleasing my husband","postDate":"1314732157","msgId":62615,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGozamQ5dCtiMjFiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDkwNDREQkJFLUU3NzEtNDRBNi04OUVFLTkwNzIwMzM5REI4MUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":62609,"nextInTopic":62617,"prevInTime":62614,"nextInTime":62616,"topicId":62560,"numMessagesInTopic":0,"msgSnippet":"... I meant the parents who are required by state or country law to produce evidence of their children s education by some means.  I did not mean parents who","messageBody":"<div id=\"ygrps-yiv-345209359\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; I don&#39;t know what you mean by that, parents who work for an educational authority and unschool.<br/>\n<br/>\n </span></blockquote>I meant the parents who are required by state or country law to produce evidence of their children&#39;s education by some means.  I did not mean parents who are employed by the education system.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; -=- Except it is my husband I am doing this for so feel it requires a slightly higher level of honesty/integrity. -=-<br/>\n&gt; <br/>\n&gt; Whoa.<br/>\n&gt; SLIGHTLY!?<br/>\n<br/>\n </span></blockquote>I meant that I see producing some educational results for my husband as different than if I were producing them for an educational authority.<br/>\n<br/>\nAmy</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Pleasing my husband","postDate":"1314724656","msgId":62609,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEyOUM4MDA2LUM3RTktNEVGRi1CQzQxLTdDOTVCN0YwQkNBOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBTXVqbWRzTS1lclUxYS0wc1lndmFldDE0b2UzVERnOXBrRDhXUGFfdU9oRnR0aDJQUUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGozZTg3YSszZWJ1QGVHcm91cHMuY29tPiA8Q0FNdWptZHNNLWVyVTFhLTBzWWd2YWV0MTRvZTNURGc5cGtEOFdQYV91T2hGdHRoMlBRQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":62606,"nextInTopic":62615,"prevInTime":62608,"nextInTime":62610,"topicId":62560,"numMessagesInTopic":0,"msgSnippet":"The Finnish school system that s all the rage these days doesn t have kids in school until they re 7 years old.  They re not trying to teach five year olds to","messageBody":"<div id=\"ygrps-yiv-1652251641\">The Finnish school system that&#39;s all the rage these days doesn&#39;t have kids in school until they&#39;re 7 years old.  They&#39;re not trying to teach five year olds to read and six year olds to write complete sentences by hand.  Meanwhile, in the US and other places that ARE trying that, what they&#39;re actually doing is creating failure.  Gobs and wads of failure.</div>","specialLinks":[]},{"userId":231415297,"authorName":"chris ester","from":"chris ester &lt;chris.homeschool@...&gt;","profile":"chris_e_bear","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Pleasing my husband","postDate":"1314723202","msgId":62606,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTXVqbWRzTS1lclUxYS0wc1lndmFldDE0b2UzVERnOXBrRDhXUGFfdU9oRnR0aDJQUUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGozZTg3YSszZWJ1QGVHcm91cHMuY29tPg==","referencesHeader":"PGozZTg3YSszZWJ1QGVHcm91cHMuY29tPg=="},"prevInTopic":62604,"nextInTopic":62609,"prevInTime":62605,"nextInTime":62607,"topicId":62560,"numMessagesInTopic":0,"msgSnippet":"Though the Moore s are not unschooling, they have some good information on the better late than early concept.  The names are Raymond and Dorothy Moore.","messageBody":"<div id=\"ygrps-yiv-1421757014\">Though the Moore&#39;s are not unschooling, they have some good information on<br/>\nthe &quot;better late than early&quot; concept.  The names are Raymond and Dorothy<br/>\nMoore.  They are both deceased and someone has taken up what appears to be a<br/>\nprofitable crusade of sorts to spread the message of the &quot;moore formula&quot;.<br/>\nSome of this can fit with unschooling, but I really just liked the info as<br/>\nfood for thought.<br/>\n<br/>\nAnyway, Dr. Moore had research about development and learning that pointed<br/>\nto the damage that could be created when learning is forced.  Amazon still<br/>\nhas some of his books, and you may be able to find some of the articles<br/>\nonline.<br/>\n<br/>\nThe info that stuck with me is that &quot;average age of reading attainment&quot;<br/>\n(when kids learn to read) is between the ages of 8 and 13.  Basically this<br/>\nman&#39;s research seemed to indicate that if left to their own devices and<br/>\nexposed to print in their environment (people read to them, they see print,<br/>\nthey get the message that reading is useful...) then children learn to read<br/>\neventually.  Also, he found that as long as they weren&#39;t given the message<br/>\nthat they were defective for not reading &quot;on time&quot;, then the kids who<br/>\nstarted reading at an older age were not found to be &quot;behind&quot; in college as<br/>\nyoung adults.<br/>\n<br/>\nI was struck by the size of the span of &#39;average&#39; age that kids will learn<br/>\nto read.  Oh, he also found that scores on IQ tests and age of reading<br/>\nattainment were not closely related at all.  In other words, &quot;smart&quot; kids<br/>\nare not any more likely to read &quot;early&quot; than &quot;average&quot; kids and vice versa.<br/>\nHe seemed to suggest that reading skills were a lot like physical<br/>\ncoordination.  Everyone (or nearly everyone) learns to walk, but some<br/>\ndevelop the coordination sooner than others, but by the time they are young<br/>\nadults you really can&#39;t tell who was earlier than whom...<br/>\nChris<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sun, Aug 28, 2011 at 4:25 PM, Amy &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:a.l.jonesz@...\">a.l.jonesz@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I am having to balance my desire to unschool for my husbands desire for the<br/>\n&gt; children to go to school. We have been home educating for 2 years now. My<br/>\n&gt; oldest is 6 and a half and her sister is 4. He is so worried that the oldest<br/>\n&gt; is failing because her reading and math levels aren&#39;t what he thinks they<br/>\n&gt; should be. He has been teaching her to read in the evenings for the past 6<br/>\n&gt; months. He has agreed to let the home education continue but wants us to set<br/>\n&gt; some targets and keep some record and have periodic reassessments.<br/>\n&gt;<br/>\n&gt; Does anyone have any experience with doing something along these lines? We<br/>\n&gt; live in the UK and I am trying to get ahold of something from the schools to<br/>\n&gt; see what they consider succeeding but the language they use is so ambiguous.<br/>\n&gt;<br/>\n&gt; I am feeling very discouraged and like just giving up and letting him put<br/>\n&gt; them in school. I don&#39;t disagree that he has a right to have input to their<br/>\n&gt; education but his fear levels are so high. I just feel like nothing I do<br/>\n&gt; will be enough as he actually wants them doing more advanced stuff than they<br/>\n&gt; would be doing in school. He will not read anything on home education or<br/>\n&gt; unschooling.<br/>\n&gt;<br/>\n&gt; Thanks,<br/>\n&gt; Amy<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Pleasing my husband","postDate":"1314722303","msgId":62604,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkwNDREQkJFLUU3NzEtNDRBNi04OUVFLTkwNzIwMzM5REI4MUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGozaXNpdStmOWUwQGVHcm91cHMuY29tPg==","referencesHeader":"PGozaXNpdStmOWUwQGVHcm91cHMuY29tPg=="},"prevInTopic":62603,"nextInTopic":62606,"prevInTime":62603,"nextInTime":62605,"topicId":62560,"numMessagesInTopic":0,"msgSnippet":"-=-Thanks for this but I was looking for more ideas on how to still maintain some degree of autonomy for the kids and not end up just doing school at home. I","messageBody":"<div id=\"ygrps-yiv-906297905\">-=-Thanks for this but I was looking for more ideas on how to still maintain some degree of autonomy for the kids and not end up just doing school at home. I suppose to some degree I need to do what parents who have to produce results and work for an educational authority have to do while they unschool-=-<br/>\n<br/>\nI don&#39;t know what you mean by that, parents who work for an educational authority and unschool.<br/>\n<br/>\n-=- Except it is my husband I am doing this for so feel it requires a slightly higher level of honesty/integrity. -=-<br/>\n<br/>\nWhoa.<br/>\nSLIGHTLY!?<br/>\n<br/>\nThose who succeed in unschooling full-on should understand natural learning so well and be so committed to it that they can be honest with no compromise to their integrity.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Pleasing my husband","postDate":"1314722171","msgId":62603,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBERDRFRDZCLThDOTQtNEVFQS05M0RGLUE3NEE3RTZFQjMwRkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGozaXM0NitpYTg3QGVHcm91cHMuY29tPg==","referencesHeader":"PGozaXM0NitpYTg3QGVHcm91cHMuY29tPg=="},"prevInTopic":62602,"nextInTopic":62604,"prevInTime":62602,"nextInTime":62604,"topicId":62560,"numMessagesInTopic":0,"msgSnippet":"-=-He feels that she must learn to read early, that she will not succeed at life if she doesn t. He feels that it all must happen as soon as possible.-=- His","messageBody":"<div id=\"ygrps-yiv-1694136858\">-=-He feels that she must learn to read early, that she will not succeed at life if she doesn&#39;t. He feels that it all must happen as soon as possible.-=-<br/>\n<br/>\nHis feelings are based on what!?<br/>\n<br/>\nMaybe ask him that.  Maybe ask him whether scientific evidence isn&#39;t more important than &quot;his feelings,&quot; and whether her emotional health and wholeness aren&#39;t more important than either of those two.<br/>\n<br/>\n-=-What triggered this is that we were away for seven weeks and I didn&#39;t force her to read. -=-<br/>\n<br/>\nYou can&#39;t force her to read.  Perhaps you could persuade her to try to read, but you cannot FORCE her to read.  I hope you didn&#39;t think you were doing that before, or that you can do that now.  <br/>\n<br/>\n-=- But when he had her start again he feels she went &quot;backwards&quot; because she seems to have forgotten words she used to know. -=-<br/>\n<br/>\nIf she forgot them, she didn&#39;t &quot;know&quot; them.  Short term memory isn&#39;t the learning you want.   It&#39;s not knowledge or understanding.<br/>\n<br/>\n-=-I am not opposed to her going to school, I just would rather she lived, learned and enjoyed life with her sister and I for as long as possible. I&#39;m just trying to find a way to balance all this and ultimately what is best for her.<br/>\n-=-<br/>\n<br/>\nIf you&#39;re doing school at home, school at school might be better.  If you&#39;re risking ruining her relationship with her dad and with you, it would be better for her to be in school and have home as a peaceful, loving haven from school.    Parents at home can do the same kind of damage school does, only in those cases the child has nowhere to go to escape.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":123650904,"authorName":"Amy","from":"&quot;Amy&quot; &lt;a.l.jonesz@...&gt;","profile":"aljonesz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Pleasing my husband","postDate":"1314715038","msgId":62602,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGozaXNpdStmOWUwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFFMUM2MTUwLTIxNjktNDg5NC05Rjk3LTI4NjMzNTVCMEYxNkBtZS5jb20+"},"prevInTopic":62601,"nextInTopic":62603,"prevInTime":62601,"nextInTime":62603,"topicId":62560,"numMessagesInTopic":0,"msgSnippet":"... Thanks for this but I was looking for more ideas on how to still maintain some degree of autonomy for the kids and not end up just doing school at home.  I","messageBody":"<div id=\"ygrps-yiv-630795635\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Carole Lovesey &lt;carole.lovesey@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Hi Amy - have you seen this: <a rel=\"nofollow\" target=\"_blank\" href=\"http://curriculum.qcda.gov.uk/\">http://curriculum.qcda.gov.uk/</a> ? If you click onto the primary curriculum section, you can get info on what is expected within the national curriculum for each subject. Also, under assessment, you can see some real examples of school children&#39;s work. I&#39;m not sure how it will fit with an unschooling approach, but it might be helpful for you to get an idea of how your daughter fits with state school expectations, and how your husband&#39;s expectations fit with those school levels.   <br/>\n&gt; Carole<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Thanks for this but I was looking for more ideas on how to still maintain some degree of autonomy for the kids and not end up just doing school at home.  I suppose to some degree I need to do what parents who have to produce results and work for an educational authority have to do while they unschool.  Except it is my husband I am doing this for so feel it requires a slightly higher level of honesty/integrity. <br/>\nAmy</div>","specialLinks":[]},{"userId":123650904,"authorName":"Amy","from":"&quot;Amy&quot; &lt;a.l.jonesz@...&gt;","profile":"aljonesz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Pleasing my husband","postDate":"1314714566","msgId":62601,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGozaXM0NitpYTg3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDVDNzhDNDM4LTVBRTEtNDBGNS1CRjU4LUFFRDdENzJDRDFCNUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":62584,"nextInTopic":62602,"prevInTime":62600,"nextInTime":62602,"topicId":62560,"numMessagesInTopic":0,"msgSnippet":"The last part is the worst. How is HE as a reader? Does he read for fun? He s not reading for information he could clearly and immediately use. Could you try","messageBody":"<div id=\"ygrps-yiv-1628340593\">&quot;The last part is the worst. How is HE as a reader? Does he read for fun? <br/>\nHe&#39;s not reading for information he could clearly and immediately use. Could<br/>\nyou try asking him why that is? WHY should a child learn to read? Just to get<br/>\ngrades in school? How were his own reading grades?&quot;<br/>\n<br/>\n<br/>\n<br/>\nHe reads all the time, he teaches and does research at a university.  He rarely reads for fun because he is always working.<br/>\n<br/>\nSHe is learning to read.  I think she reads well.  She can read most anything she cares to when she is on computer, or looking at instructions.  I hear her read stories to her little sister or to her dolls.  She sounds things out all the time.  She reads signs she sees.  And she reads these reading scheme books he has her read at night and she is moving thru them for what that is worth.  He feels that she must learn to read early, that she will not succeed at life if she doesn&#39;t.  He feels that it all must happen as soon as possible.<br/>\n<br/>\nWhat triggered this is that we were away for seven weeks and I didn&#39;t force her to read.  As I said above she still did all the reading as above except for the reading with her father.  But when he had her start again he feels she went &quot;backwards&quot; because she seems to have forgotten words she used to know.  <br/>\n<br/>\nShe actually will do lot of traditional type schoolwork with me when I ask.  I just feel it&#39;s asking her to jump thru lots of pointless hoops.  And how we do enuf to satisfy him?  It feels like it would never be enuf unless she is applying to Oxford at age 10.<br/>\n<br/>\nI am not opposed to her going to school, I just would rather she lived, learned and enjoyed life with her sister and I for as long as possible.  I&#39;m just trying to find a way to balance all this and ultimately what is best for her.<br/>\n<br/>\nThanks,<br/>\nAmy</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Pleasing my husband","postDate":"1314649259","msgId":62584,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNDOUZENjdBLTUzNTEtNDhFRS05MjIyLUJGOThCRTRFOTE1OEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGozZ2FwYitzMHBwQGVHcm91cHMuY29tPg==","referencesHeader":"PGozZ2FwYitzMHBwQGVHcm91cHMuY29tPg=="},"prevInTopic":62574,"nextInTopic":62601,"prevInTime":62583,"nextInTime":62585,"topicId":62560,"numMessagesInTopic":0,"msgSnippet":"-=-I found mentioning the Finnish school system helped me with worried members of my extended family. Finnish children start school at 7 and have some of the","messageBody":"<div id=\"ygrps-yiv-781647177\">-=-I found mentioning the Finnish school system helped me with worried members of my extended family. Finnish children start school at 7 and have some of the best results on the international PISA exams. -=-<br/>\n<br/>\nI think it&#39;s a good tactic--get them to read about that, because in the course of looking at what&#39;s cool in Finland, they&#39;ll coincidentally get some analysis of standardized testing in general (the Finns don&#39;t do it except one test right at the end, it seems).  There&#39;s an article in the current (September 2011) issue of Smithsonian Magazine.<br/>\n<br/>\nThere is a stunning quote in that article:<br/>\n“Children from wealthy families with lots of education can be taught by stupid teachers,” Louhivuori said, smiling. “We try to catch the weak students. It’s deep in our thinking.”<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.smithsonianmag.com/people-places/Why-Are-Finlands-Schools-Successful.html\">http://www.smithsonianmag.com/people-places/Why-Are-Finlands-Schools-Successful.html</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":332164648,"authorName":"Rippy Dusseldorp","from":"&quot;Rippy Dusseldorp&quot; &lt;ripgray@...&gt;","profile":"rdusseldorp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Pleasing my husband","postDate":"1314631275","msgId":62574,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGozZ2FwYitzMHBwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGozZTg3YSszZWJ1QGVHcm91cHMuY29tPg=="},"prevInTopic":62568,"nextInTopic":62584,"prevInTime":62573,"nextInTime":62575,"topicId":62560,"numMessagesInTopic":0,"msgSnippet":"-=-He has agreed to let the home education continue but wants us to set some targets and keep some record and have periodic reassessments.-=- I found","messageBody":"<div id=\"ygrps-yiv-1854228855\">-=-He has agreed to let the home education continue but wants us to set some<br/>\ntargets and keep some record and have periodic reassessments.-=-<br/>\n<br/>\nI found mentioning the Finnish school system helped me with worried members of my extended family. Finnish children start school at 7 and have some of the best results on the international PISA exams. <br/>\n<br/>\nI used the Finnish system as a shield to give me some more time to learn about unschooling and to not spend too much of my energy fielding my family&#39;s questions. And as a way to help me relax in the beginning.<br/>\n<br/>\nMy extended family did not want to learn about home education, unschooling or the Finnish school system. They wanted to feel secure in knowing that I have a plan for the children&#39;s education and the skill to follow it through. They are less interested in my &#39;plan&#39; to have a joyful life with children filled with interesting places, people, things and opportunities, than in the results of what the children do. I let them know of specific activities we do, trips we take, observations the children make, projects that the children get involved with, etc. and repackage all of this as &#39;my educational plan/record&#39;.<br/>\n<br/>\nRippy</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Pleasing my husband","postDate":"1314626759","msgId":62568,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MjQwMUZGLUE0NzYtNDVFNS04NkE0LUZFNkY5N0E5MjlENEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEFFMUM2MTUwLTIxNjktNDg5NC05Rjk3LTI4NjMzNTVCMEYxNkBtZS5jb20+","referencesHeader":"PEFFMUM2MTUwLTIxNjktNDg5NC05Rjk3LTI4NjMzNTVCMEYxNkBtZS5jb20+"},"prevInTopic":62565,"nextInTopic":62574,"prevInTime":62567,"nextInTime":62569,"topicId":62560,"numMessagesInTopic":0,"msgSnippet":"-=-have you seen this: http://curriculum.qcda.gov.uk/ ? If you click onto the primary curriculum section, you can get info on what is expected within the","messageBody":"<div id=\"ygrps-yiv-931726457\">-=-have you seen this: <a rel=\"nofollow\" target=\"_blank\" href=\"http://curriculum.qcda.gov.uk/\">http://curriculum.qcda.gov.uk/</a> ? If you click onto the primary curriculum section, you can get info on what is expected within the national curriculum for each subject.-=-<br/>\n<br/>\nWhen Kirby was little I got a copy of what teachers used to create their lesson plans.  It was called the &quot;expected competencies&quot; and something or other, of the Albuquerque Public Schools.  I had thought at first that each week I would look at it for ideas of what to do with Kirby, and I started marking each thing he could already do, or already knew.  After a couple of weeks, I checked it less frequently, and I realized it was only once a month and then not at all, all within six months.  <br/>\n<br/>\nHe had learned TONS of things that weren&#39;t on there until second or third grade, and by the next year I could see that if I was looking at &quot;first grade,&quot; instead of at Kirby, that I was missing too much Kirby.  What he was learning worked in long threads and connections, and didn&#39;t fit those lists very well.  He was ahead in some and behind in some, as are kids in school!  So I stopped looking.  But at first it probably helped me a little.  I was pretty aware of what young teens knew and were doing in school, having taught 7th and 9th graders for several years, but it helped me to look at what teachers were looking at for kindergarten &quot;requirements.&quot;  And having been helped a bit, I quit looking.<br/>\n<br/>\nSo yes, look!  But don&#39;t live in there.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":416020383,"authorName":"Carole Lovesey","from":"Carole Lovesey &lt;carole.lovesey@...&gt;","profile":"carole_lovesey","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Pleasing my husband","postDate":"1314623137","msgId":62565,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFFMUM2MTUwLTIxNjktNDg5NC05Rjk3LTI4NjMzNTVCMEYxNkBtZS5jb20+"},"prevInTopic":62562,"nextInTopic":62568,"prevInTime":62564,"nextInTime":62566,"topicId":62560,"numMessagesInTopic":0,"msgSnippet":"Hi Amy - have you seen this: http://curriculum.qcda.gov.uk/ ? If you click onto the primary curriculum section, you can get info on what is expected within the","messageBody":"<div id=\"ygrps-yiv-562472460\">Hi Amy - have you seen this: <a rel=\"nofollow\" target=\"_blank\" href=\"http://curriculum.qcda.gov.uk/\">http://curriculum.qcda.gov.uk/</a> ? If you click onto the primary curriculum section, you can get info on what is expected within the national curriculum for each subject. Also, under assessment, you can see some real examples of school children&#39;s work. I&#39;m not sure how it will fit with an unschooling approach, but it might be helpful for you to get an idea of how your daughter fits with state school expectations, and how your husband&#39;s expectations fit with those school levels.   <br/>\nCarole<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Pleasing my husband","postDate":"1314567886","msgId":62562,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVDNzhDNDM4LTVBRTEtNDBGNS1CRjU4LUFFRDdENzJDRDFCNUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGozZTg3YSszZWJ1QGVHcm91cHMuY29tPg==","referencesHeader":"PGozZTg3YSszZWJ1QGVHcm91cHMuY29tPg=="},"prevInTopic":62561,"nextInTopic":62565,"prevInTime":62561,"nextInTime":62563,"topicId":62560,"numMessagesInTopic":0,"msgSnippet":"-=-He is so worried that the oldest is failing because her reading and math levels aren t what he thinks they should be. He has been teaching her to read in","messageBody":"<div id=\"ygrps-yiv-1829677857\">-=-He is so worried that the oldest is failing because her reading and math levels aren&#39;t what he thinks they should be. He has been teaching her to read in the evenings for the past 6 months. -=-<br/>\n<br/>\nIs she reading?<br/>\n<br/>\nIf she&#39;s still not reading, what he&#39;s doing is teaching her NOT to read, teaching her that reading is hard and scary, and putting reading in between her and him.<br/>\n<br/>\nSchools teach those things to MANY children who become lifelong non-readers.  Maybe they can eventually sound things out, but they won&#39;t read for fun.<br/>\n<br/>\nIf the damage is being done anyway, maybe send them to school.  When he sees that they&#39;re not happy there (if they aren&#39;t), then you will have a starting place if you bring them home again.<br/>\n<br/>\nIf he&#39;s going to do the same damage as school does AND let homeschooling damage his relationship with you and his children, AND the children don&#39;t have the advantages of school (other kids, other people, other things), then why do it?<br/>\n<br/>\n-=-We live in the UK and I am trying to get ahold of something from the schools to see what they consider succeeding but the language they use is so ambiguous.-=-<br/>\n<br/>\nThe schools are running a competition, all the time, every day, until the end.  It&#39;s not about &quot;success,&quot; it&#39;s about who&#39;s doing it first, fastest, best.  And about who is failing to do it first and fast.  The best advantage of home ed is to avoid all that, but your husband seems to have brought it home.  How does he think she can be &quot;behind&quot; if she&#39;s the only one there?<br/>\n<br/>\n-=-I am feeling very discouraged and like just giving up and letting him put them in school. I don&#39;t disagree that he has a right to have input to their education but his fear levels are so high. I just feel like nothing I do will be enough as he actually wants them doing more advanced stuff than they would be doing in school. He will not read anything on home education or unschooling. -=-<br/>\n<br/>\nThe last part is the worst.   How is HE as a reader?  Does he read for fun?  He&#39;s not reading for information he could clearly and immediately use.  Could you try asking him why that is?  WHY should a child learn to read?  Just to get grades in school?  How were his own reading grades?<br/>\n<br/>\n(Don&#39;t tell us; maybe ask him.  Maybe you can shake him into talking about it, or at least thinking about it.)<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Pleasing my husband","postDate":"1314567229","msgId":62561,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTQ1NjcyMjkuNzM2MTMuWWFob29NYWlsTmVvQHdlYjgxNTA3Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGozZTg3YSszZWJ1QGVHcm91cHMuY29tPg==","referencesHeader":"PGozZTg3YSszZWJ1QGVHcm91cHMuY29tPg=="},"prevInTopic":62560,"nextInTopic":62562,"prevInTime":62560,"nextInTime":62562,"topicId":62560,"numMessagesInTopic":0,"msgSnippet":"Then maybe he will read what some educators wrote? Maybe some John Holt or even Montessori can help. Alfie Khon  will probably help with Unconditional","messageBody":"<div id=\"ygrps-yiv-1565371959\">Then maybe he will read what some educators wrote?<br/>\nMaybe some John Holt or even Montessori can help.<br/>\nAlfie Khon  will probably help with Unconditional Parenting and Punished by Rewards<br/>\nSome of his articles like :<br/>\nConfusing Harder with Better:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.alfiekohn.org/teaching/edweek/chwb.htm\">http://www.alfiekohn.org/teaching/edweek/chwb.htm</a><br/>\n<br/>\n&quot;Compounding the problem is a reliance on the sort of instruction <br/>\n            that treats children as passive receptacles into which knowledge or <br/>\n            skills are poured. &quot;Back to basics&quot; education--a misnomer, really, <br/>\n            because most American schools never left it--might be described as <br/>\n            outdated except for the fact that there never was a time when it <br/>\n            worked all that well. Modern cognitive science just explains more <br/>\n            systematically why this approach has always come up short. When you <br/>\n            watch students slogging through textbooks, memorizing lists, being <br/>\n            lectured at, and working on isolated skills, you begin to realize <br/>\n            that nothing bears a greater responsibility for undermining <br/>\n            educational excellence than the continued dominance of traditional <br/>\n            instruction. Shrill calls for &quot;accountability&quot; usually just produce <br/>\n            an accelerated version of the same thing. <br/>\n            &quot;<br/>\n<br/>\nYes you may never be able to unschool but this may help your husband change his ideas of  how children learn and what it looks like<br/>\n<br/>\nSo those are not unschooling or homeschooling people but well known educators and he may be more open to reading them.<br/>\n<br/>\n<br/>\nAlex Polikowsky<br/>\n <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n________________________________<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":123650904,"authorName":"Amy","from":"&quot;Amy&quot; &lt;a.l.jonesz@...&gt;","profile":"aljonesz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Pleasing my husband","postDate":"1314563114","msgId":62560,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGozZTg3YSszZWJ1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":62561,"prevInTime":62559,"nextInTime":62561,"topicId":62560,"numMessagesInTopic":0,"msgSnippet":"I am having to balance my desire to unschool for  my husbands desire for the children to go to school.  We have been home educating for 2 years now.  My oldest","messageBody":"<div id=\"ygrps-yiv-1759280503\">I am having to balance my desire to unschool for  my husbands desire for the children to go to school.  We have been home educating for 2 years now.  My oldest is 6 and a half  and her sister is 4.  He is so worried that the oldest is failing because her reading and math levels aren&#39;t what he thinks they should be.  He has been teaching her to read in the evenings for the past 6 months.   He has agreed to let the home education continue but wants us to set some targets and keep some record and have periodic reassessments.  <br/>\n<br/>\nDoes anyone have any experience with doing something along these lines?  We live in the UK and I am trying to get ahold of something from the schools to see what they consider succeeding but the language they use is so ambiguous.<br/>\n<br/>\nI am feeling very discouraged and like just giving up and letting him put them in school.   I don&#39;t disagree that he has a right to have input to their education but his fear levels are so high.  I just feel like nothing I do will be enough as he actually wants them doing more advanced stuff than they would be doing in school.  He will not read anything on home education or unschooling.  <br/>\n<br/>\nThanks,<br/>\nAmy</div>","specialLinks":[]}],"prevTopicId":62839,"nextTopicId":62852}}