{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":39764976,"authorName":"Alan & Brenda Leonard","from":"Alan & Brenda Leonard &lt;abtleo@...&gt;","profile":"abtleo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] A Rant about homeschoolers","postDate":"1061699230","msgId":79142,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJCNkUwOTM2LjJFMEYlYWJ0bGVvQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDEwNjE2NjQ5NzIuNDkzLjk2OTY3Lm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":79141,"nextInTime":79143,"topicId":79142,"numMessagesInTopic":0,"msgSnippet":"... It s a big Christian thing among the conservatives.  I m Episcopalian, so of course I can t quote you chapter and verse , but the idea is that children","messageBody":"<div id=\"ygrps-yiv-342378223\"><blockquote><span title=\"ireply\">&gt; One woman was asking me about unschooling and kept coming back to her<br/>\n&gt; concern about retaining Authority over her children. What is with this????<br/>\n<br/>\n </span></blockquote>It&#39;s a big Christian thing among the conservatives.  I&#39;m Episcopalian, so of<br/>\ncourse I can&#39;t quote you chapter and verse &lt;g&gt;, but the idea is that<br/>\nchildren are to be subservient to their parents, and that parents MUST take<br/>\nauthority over their children.  Otherwise, the children will instantly go<br/>\nbad and go to hell.  See, Satan is lurking right there, waiting to pull in<br/>\nyour precious children, the moment you let down your guard.  If your<br/>\nreligion mandates that you train up your child in the love and fear of the<br/>\nLord, failing to hold proper authority over your children could send you to<br/>\nhell, too.  And lest you be laughing here, hell is no laughing matter.  It&#39;s<br/>\na very real and scary place for many of these folks.  So they take their<br/>\nresponsibility very seriously.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I want to be an advocate for unschooling, yet am not comfortable really<br/>\n&gt; talking about it to these other homeschoolers because it seems to freak them<br/>\n&gt; out. Any one else go thru this?  What do you do?<br/>\n<br/>\n </span></blockquote>Yep.  I smile a lot at homeschool gatherings.  (I also avoid them...)  I<br/>\ndon&#39;t advocate unschooling, I merely exist and drive everyone nuts because I<br/>\ndo it &quot;wrong&quot; and it still seems to work, and God hasn&#39;t smote me yet for<br/>\nunschooling.  I don&#39;t evangelize, but I answer questions when asked.<br/>\n<br/>\nThere&#39;s a little book called Christian Unschooling, Growing Your Children in<br/>\nthe Freedom of Christ, which you might like to read.  It&#39;s not very radical,<br/>\nand there are things in it that aren&#39;t very unschooly.  But it does give you<br/>\nsome words and ways to explain unschooling to Christians.  I do also see<br/>\nwhere many Christian homeschoolers relax after a period of strict<br/>\nschool-at-home, and try to be positive about any moves towards the more<br/>\nrelaxed end of the continuum, even if they&#39;re still not anywhere near my<br/>\npersonal definition of unschooling.<br/>\n<br/>\nI answer curriculum gripes and questions with some comment along the lines<br/>\nof &quot;Ah, well, you know I can&#39;t help you with THAT, but have I told you<br/>\nabout....&quot;  Become a world-champion topic-changer, and people eventually<br/>\nlearn to not complain to you much!  &lt;g&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Also, how do I get over this weird desire to buy school supplies every time<br/>\n&gt; school rolls around?&lt;G&gt;<br/>\n<br/>\n </span></blockquote>But you CAN (and should, I think!) buy school supplies in August.  Right<br/>\nafter all the kids go back to school.  The store aisles are quiet, and it&#39;s<br/>\nall on sale.  Buy a couple reams of paper, some nice new colored pencils and<br/>\ncrayons, and a spiral notebook or two; they&#39;re always useful.  Stock up on<br/>\npencils and pens while they&#39;re cheap and buy some pocket folders at 12 for a<br/>\ndollar.  Your house is stocked, and you can get back to the very serious<br/>\nbusiness of unschooling!<br/>\n<br/>\nbrenda<br/>\nat the conference with laptop!</div>","specialLinks":[]}],"prevTopicId":79141,"nextTopicId":79140}}