{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":15,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Helping with Chores","postDate":"1340353784","msgId":67801,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYyMkM1MjczLTM3NzEtNDIzNC04QTY4LTZCN0NCQzBFM0IxRUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEzNDAwMzc3MDMuNDc0NTMuWWFob29NYWlsTmVvQHdlYjE4NDUyMC5tYWlsLm5lMS55YWhvby5jb20+","referencesHeader":"PGpyZnIzaSttOHZoQGVHcm91cHMuY29tPiA8MTMzOTc5ODI0Mi45ODY1LllhaG9vTWFpbE5lb0B3ZWI4MTUwNC5tYWlsLm11ZC55YWhvby5jb20+IDxFMTIyQjdGMi1CMDhBLTQyQzktOUQ0OS01NjY5NDlBMzZDRjNAU2FuZHJhZG9kZC5jb20+IDwxMzQwMDM3NzAzLjQ3NDUzLllhaG9vTWFpbE5lb0B3ZWIxODQ1MjAubWFpbC5uZTEueWFob28uY29tPg=="},"prevInTopic":67704,"nextInTopic":0,"prevInTime":67800,"nextInTime":67802,"topicId":67679,"numMessagesInTopic":0,"msgSnippet":"-=-Chores were a big one at our house. Everyone in the house had a zone they were responsible for. We stopped having the kids do chores after an unschool","messageBody":"<div id=\"ygrps-yiv-1329345135\">-=-Chores were a big one at our house. Everyone in the house had a zone they were responsible for. We stopped having the kids do chores after an unschool conference 2 years ago.  My oldest son who also wanted to give the younger ones this gift offered to help more. He was 17 and dating a long time unschooler and he loves the philosophy. The house became a huge mess for a while.  After many months I went through lots of emotions about it. I think the kids were testing the waters a lot. -=-<br/>\n<br/>\nThis story had a whiz-bang happy ending, I know, but I wanted to stop at the place where the mom uses a timeworn phrase.<br/>\n<br/>\n&quot;Timeworn phrase&quot; is a timeworn phrase.  So is &quot;testing the waters.&quot;<br/>\n<br/>\nThe idea that a child will &quot;test&quot; a parent, or &quot;see how far he can push&quot; is language from a world of antagonistic, adversarial relationships.  It has to do with control, and fear, and trickery, and mysterious boundaries and conditions.<br/>\n<br/>\nWhen we move toward living differently with our children, those phrases don&#39;t make much sense.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/phrases\">http://sandradodd.com/phrases</a><br/>\n<br/>\nThe end of the poster&#39;s tale is a happy one:  <br/>\n-=-Fast forward to this week(2yrs later).  My Mom is coming to town and we are hosting a big party.  I created a list of things I wanted to get done before she arrives.  I asked my kids to please help me get through my list. My kids jumped right in all 5 of them.  The list was completed in 1 day.  The amazing part for me is that most of the jobs I did not think the kids could do.  They were not thought out by what could this kid or that kid do.  They chose what they wanted and I helped them if they needed it. I think the reason they did such a great job was because it was real work with a real purpose and they got to choose what they did. Before this kind of event would have had me yelling and crying all week long. Now here we are Monday morning, no yelling, no panicking.  Instead we are going to go play.-=-<br/>\n<br/>\nI think the difference is that there was a clear and sensible reason to clean.<br/>\nWhen cleaning is &quot;a rule,&quot; and a constant, it doesn&#39;t make sense to kids and they balk.<br/>\n<br/>\nSame with &quot;a bedtime&quot; that&#39;s set from a book, based on a child&#39;s age.  That doesn&#39;t make sense.  But &quot;We need to get up early tomorrow to be ready by 8:00&quot; when it&#39;s for something special, important and fun, makes sense!  And they will go to bed!  But not if the mom is being manipulative, only if she&#39;s being honest and helpful.  <br/>\n<br/>\nThey don&#39;t need to test waters when they smell manipulation or arbitrary control.  And there&#39;s no reason to test once they trust the mom is being their partner and wouldn&#39;t suggest going to sleep early or cleaning the house without a real reason that makes sense.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Helping with Chores","postDate":"1340041930","msgId":67704,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhOam8rSC0xNlhvM21ESnhwaU5WX3EycXdwVmp4WlVzMk9uc2QzUEo3Q1VMZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDEzNDAwMzc3MDMuNDc0NTMuWWFob29NYWlsTmVvQHdlYjE4NDUyMC5tYWlsLm5lMS55YWhvby5jb20+","referencesHeader":"PGpyZnIzaSttOHZoQGVHcm91cHMuY29tPgk8MTMzOTc5ODI0Mi45ODY1LllhaG9vTWFpbE5lb0B3ZWI4MTUwNC5tYWlsLm11ZC55YWhvby5jb20+CTxFMTIyQjdGMi1CMDhBLTQyQzktOUQ0OS01NjY5NDlBMzZDRjNAU2FuZHJhZG9kZC5jb20+CTwxMzQwMDM3NzAzLjQ3NDUzLllhaG9vTWFpbE5lb0B3ZWIxODQ1MjAubWFpbC5uZTEueWFob28uY29tPg=="},"prevInTopic":67703,"nextInTopic":67801,"prevInTime":67703,"nextInTime":67705,"topicId":67679,"numMessagesInTopic":0,"msgSnippet":"I loved that whole post - but this one part is just as sweet as anything else I ve ever read!! On Mon, Jun 18, 2012 at 9:41 AM, Tiffani","messageBody":"<div id=\"ygrps-yiv-1970455897\">I loved that whole post - but this one part is just as sweet as anything<br/>\nelse I&#39;ve ever read!!<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mon, Jun 18, 2012 at 9:41 AM, Tiffani &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tiffermomof5@...\">tiffermomof5@...</a>&gt; wrote:<br/>\n<br/>\n&lt;&lt;My house is not as tidy as it used to be but it is much happier.&gt;&gt;<br/>\n<br/>\n<br/>\nWHAT a great trade-off, right? Happiness in exchange for tidiness?<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":352884218,"authorName":"Tiffani","from":"Tiffani &lt;tiffermomof5@...&gt;","profile":"tiffermomof5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Helping with Chores","postDate":"1340037703","msgId":67703,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDAwMzc3MDMuNDc0NTMuWWFob29NYWlsTmVvQHdlYjE4NDUyMC5tYWlsLm5lMS55YWhvby5jb20+","inReplyToHeader":"PEUxMjJCN0YyLUIwOEEtNDJDOS05RDQ5LTU2Njk0OUEzNkNGM0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGpyZnIzaSttOHZoQGVHcm91cHMuY29tPiA8MTMzOTc5ODI0Mi45ODY1LllhaG9vTWFpbE5lb0B3ZWI4MTUwNC5tYWlsLm11ZC55YWhvby5jb20+IDxFMTIyQjdGMi1CMDhBLTQyQzktOUQ0OS01NjY5NDlBMzZDRjNAU2FuZHJhZG9kZC5jb20+"},"prevInTopic":67698,"nextInTopic":67704,"prevInTime":67702,"nextInTime":67704,"topicId":67679,"numMessagesInTopic":0,"msgSnippet":"Chores were a big one at our house. Everyone in the house had a zone they were responsible for. We stopped having the kids do chores after an unschool","messageBody":"<div id=\"ygrps-yiv-66326089\">Chores were a big one at our house. Everyone in the house had a zone they were responsible for. We stopped having the kids do chores after an unschool conference 2 years ago.  My oldest son who also wanted to give the younger ones this gift offered to help more. He was 17 and dating a long time unschooler and he loves the philosophy. The house became a huge mess for a while.  After many months I went through lots of emotions about it. I think the kids were testing the waters a lot. After a while things started to balance out. My house is not as tidy as it used to be but it is much happier.  Currently there are 2 huge lego sets being built on the table. My 8 year old would never have had a chance to finish a project like this before.  I required the table to be cleared daily.<br/>\n<br/>\nFast forward to this week(2yrs later).  My Mom is coming to town and we are hosting a big party.  I created a list of things I wanted to get done before she arrives.  I asked my kids to please help me get through my list. My kids jumped right in all 5 of them.  The list was completed in 1 day.  The amazing part for me is that most of the jobs I did not think the kids could do.  They were not thought out by what could this kid or that kid do.  They chose what they wanted and I helped them if they needed it. I think the reason they did such a great job was because it was real work with a real purpose and they got to choose what they did. Before this kind of event would have had me yelling and crying all week long. Now here we are Monday morning, no yelling, no panicking.  Instead we are going to go play.<br/>\n<br/>\nTiffani<br/>\n<br/>\n<br/>\n________________________________<br/>\n From: Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\nSent: Friday, June 15, 2012 11:04 PM<br/>\nSubject: Re: [AlwaysLearning] Helping with Chores<br/>\n <br/>\n<br/>\n  <br/>\n-=- Making them do it to learn to be responsible  is like making them do chores so they can learn to have a neat home. <br/>\nSome kids were made to do chores and grow up and have tidy homes. some will not care at all!-=-<br/>\n<br/>\nThere&#39;s reason to think it&#39;s genetic, too, the urge or ability to &quot;be neat&quot; and to organize the environment physically or timewise.<br/>\n<br/>\nForcing a non-physical kid to shoot baskets every day doesn&#39;t make him more manly, nor a girl less dainty.  It just makes them frustrated, and makes them think their parents are mean and unreasonable and don&#39;t love them.<br/>\n<br/>\nA child is too young to enter into a contract, and &quot;we will get a dog if you feed it every day for years&quot; is more than they can understand and probably more than they can do.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Helping with Chores","postDate":"1339871212","msgId":67697,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpyaWo1Yys1MDdsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpyaTRzbCtjMHF1QGVHcm91cHMuY29tPg=="},"prevInTopic":67695,"nextInTopic":67698,"prevInTime":67696,"nextInTime":67698,"topicId":67679,"numMessagesInTopic":0,"msgSnippet":"... *************** More importantly, the personalities will be different - personality makes an enormous difference in how people interpret their values.","messageBody":"<div id=\"ygrps-yiv-968474496\">&quot;in4mkaren&quot; &lt;kasmail@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Your values will be different from ours so your results will be different. <br/>\n </span></blockquote>***************<br/>\n<br/>\nMore importantly, the personalities will be different - personality makes an enormous difference in how people interpret their values. Valuing safety doesn&#39;t automatically mean everyone agrees to keep the floors clean, it can mean knowing escape routes and emergency plans, a knowledge of where the fire extinguishers are and what to do in case of a tornado. <br/>\n<br/>\nSome kids won&#39;t want to have any kind of discussion at all! That&#39;s another aspect of personality - some people like to discuss and work things out between one another with words. For other people, that feels like a kind of assault and they&#39;ll give in to whatever in order to stop the barrage of verbiage. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; I used to think the unschooling way, due to a book I read, was that I could never ask my children to do anything.<br/>\n </span></blockquote>**************<br/>\n<br/>\nSometimes in the process of learning about unschooling parents go from one set of internal rules to another. Instead of a generalized parenting rule of &quot;set rules and limits&quot; parents can move to a generalized rule of &quot;let the children be free&quot; (or whatever). To an extent, that kind of flip-flop from one extreme to another is part of how you learn what you really want - kind of like calibrating a tool by overshooting and undershooting to figure out where the real target range is. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":529985200,"authorName":"louise.king76","from":"&quot;louise.king76&quot; &lt;louise.j.king@...&gt;","profile":"louise.king76","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Helping with Chores","postDate":"1339869266","msgId":67698,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpyaWg4aSt0MXRuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpyZ2NvZCtuZm9uQGVHcm91cHMuY29tPg=="},"prevInTopic":67697,"nextInTopic":67703,"prevInTime":67697,"nextInTime":67699,"topicId":67679,"numMessagesInTopic":0,"msgSnippet":"... ****************** I think you are right Dina.  I do have a lot of questions and have started reading two books that have just arrived that were suggested","messageBody":"<div id=\"ygrps-yiv-1032199535\"><blockquote><span title=\"ireply\">&gt; I noticed that the original poster (Louise, I think) has been asking lots of questions in the last few weeks.  You may want to  &quot;Read a little, try a little, wait a while, watch.&quot;<br/>\n </span></blockquote>******************<br/>\n<br/>\nI think you are right Dina.  I do have a lot of questions and have started reading two books that have just arrived that were suggested to me by this group, &#39;Free to Learn&#39; by Pam Laricchia and &#39;Parenting A Free Child: An Unschooled Life&#39; by Rue Kream.   <br/>\n<br/>\nBut I&#39;m grateful to all those who responded to my post.  There was some great advice and food for thought.  I will follow the suggested links too.   <br/>\nEven in these early stages, the gradual change in my perception and way of doing things, is having such an effect on my relationship with my children and our family life.<br/>\n<br/>\nThis morning, we needed to bring in our &quot;Bell Tent&quot; from the garden which had been erected for our daughter&#39;s birthday last week.  The weather here, in the UK , has turned stormy so hence the tent needed to be taken down.  It was a bit of a race against the rain and strong winds.   I asked our children if they were willing to help us.  Our daughter happily said &quot;Yes&quot; but our son said &quot;No&quot;, he was busy with his Lego.  I accepted his decision and me, their dad and our daughter went to action in getting the tent down.  About 10 mins later our son appear, welly boots on and tent peg in hand, as he joined us in what turned out to be quite an adventure of taking a tent down just as the beginnings of a storm was coming in.   Of course, it would have still been fine if he hadn&#39;t joined in at all.<br/>\n<br/>\nI also really take on board the comments about clearing up after projects.  My husband and I do need to &quot;let go&quot; of having a &quot;perfectly&quot; tidy house and our obsession for having things put away.  My husband grew up with an &quot;obsessively&quot; tidy mother and so finds it hard to have the house less than perfectly tidy.  He works from home, so we are all at home together most days.    <br/>\nI am an artist and in the past I&#39;ve had a studio which was always a mess...a creative mess!  To &quot;tidy away&quot; after myself would have been disruptive to the creative project I was involved in. <br/>\nIt is really helpful and freeing to realise it is our &quot;choice&quot; to do what ever we do! <br/>\n<br/>\nKnowing and accepting our limits when it comes to taking care of animals is also very good advice.  I grew up on a &quot;small holding&quot; and my parents were very busy tending to the animals, so I have a very realistic understanding of how much time and care an animal needs and deserves.  It is unrealistic to believe a child can be totally responsible for an animal and thank you for the reassurance that it is ok for me to say &quot;No&quot; to getting another animal.<br/>\n<br/>\nreagards<br/>\nLouise    <br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;dapsign&quot; &lt;dapsign@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I noticed that the original poster (Louise, I think) has been asking lots of questions in the last few weeks.  You may want to  &quot;Read a little, try a little, wait a while, watch.&quot;<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/gradualchange\">http://sandradodd.com/gradualchange</a><br/>\n&gt; <br/>\n&gt; Dina<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;louise.king76&quot; &lt;louise.j.king@&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; <br/>\n&gt; &gt; Our daughter, who is 11 years olds and our son, 5 years old refuse to help with any chores around the house or the garden.   My husband and I seem to spend a lot of time running around doing everything including clearing away after our children (putting away all the materials they have used for projects as well as toys, clothes, etc)   <br/>\n&gt; &gt; We get very tired and feel that if we could all be working together as a family, there would be more time for other creative projects.  <br/>\n&gt; &gt; <br/>\n&gt; &gt; When we ask our daughter or son if they could help us, they always say &quot;NO, I don&#39;t want too.&quot;<br/>\n&gt; &gt; <br/>\n&gt; &gt; We have been homeschooling for 3 years and the issue of chores is a constant struggle.<br/>\n&gt; &gt; Our home is a very small but it is rich environment, we have lots of books, art materials, media and also a vegetable garden and a couple of Chickens.  When we were considering getting the chickens my daughter offered to help out, she said she would collect the eggs everyday......she never collects the eggs, even if we remind her daily.   <br/>\n&gt; &gt; Again the chickens have become another responsibility for her dad and me to take care of.<br/>\n&gt; &gt; <br/>\n&gt; &gt; Now, she wants a Rabbit.  I would love for her to have a Rabbit, but her father and I just don&#39;t want to take on any more chores to do and also to take on the battle of reminding her all the time to feed and care for the Rabbit.  <br/>\n&gt; &gt; Being a NAG is boring! <br/>\n&gt; &gt; Doing it all yourself is exhausting! <br/>\n&gt; &gt; Saying NO to anymore animals seems like being a meany!<br/>\n&gt; &gt; <br/>\n&gt; &gt; My daughter and Son do get an allowance every week which is not conditional of doing chores but I&#39;m wondering if we should start &quot;paying&quot; them for each chore they do on top of getting their allowance?<br/>\n&gt; &gt; <br/>\n&gt; &gt; I was wondering how others deal with chores?<br/>\n&gt; &gt; <br/>\n&gt; &gt; thank you<br/>\n&gt; &gt; <br/>\n&gt; &gt; Louise<br/>\n&gt; &gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":300223612,"authorName":"in4mkaren","from":"&quot;in4mkaren&quot; &lt;kasmail@...&gt;","profile":"in4mkaren","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Helping with Chores","postDate":"1339856597","msgId":67695,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpyaTRzbCtjMHF1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpyZ2QyMSsybWs1QGVHcm91cHMuY29tPg=="},"prevInTopic":67693,"nextInTopic":67697,"prevInTime":67694,"nextInTime":67696,"topicId":67679,"numMessagesInTopic":0,"msgSnippet":"We give our kids an allowance too, just based on being members of the family. But then my 9 yo son asked for things he could do so he could earn some money.","messageBody":"<div id=\"ygrps-yiv-8523027\">We give our kids an allowance too, just based on being members of the family. But then my 9 yo son asked for things he could do so he could earn some money. Around the same time I was having trouble with our cleaning crew and decided to take on the cleaning again myself, a la the FlyLady method. I agreed that he could do any of the things the cleaning crew used to be doing for pay. Now some weeks he chooses to earn extra money. Some weeks he doesn&#39;t. But he likes knowing there&#39;s a way to get extra money if he wants it, and I don&#39;t mind paying him because I had already been paying, even though I used to be against paying for chores.<br/>\n<br/>\nWhen my kids were a little younger, say around 5 and 7, we had a conversation where we talked about our values. This was not me telling them what our family values are, but a conversation where we talked about the things we liked to do and what that said about the values that were important to us. I realized that there was no reason I should control what my children&#39;s rooms looked like, whether they made their bed or picked up toys. Just like I keep my room the way I want to, they could keep their rooms they way they want to.<br/>\n<br/>\nWe did agree that making our house welcoming to guests was important and that some picking up for guests was appropriate. We also agreed that we needed to be able to get out of our rooms safely in case of fire. And their dad and I let them know that we did not feel safe coming in to their rooms to tuck them in at night if there were things on the floor in our way. Using these guidelines, we came up with general agreements for when and how much to pick up. Most of the time they do the bare minimum they agreed to but sometimes they do a lot more. And the agreements aren&#39;t in stone if we want to change them.<br/>\n<br/>\nI used to think the unschooling way, due to a book I read, was that I could never ask my children to do anything. Since then I&#39;ve realized that just like my son has the freedom to ask me, &quot;Mom, would you help me rearrange my room?&quot; I have the freedom to ask him, &quot;Would you mind taking out the recycling?&quot; but he is also free to say no. I want his participation to come from goodwill and not from obligation.<br/>\n<br/>\nYour values will be different from ours so your results will be different. If you choose to discuss your family values, how you like to keep your home, and come up with an agreement as a family, it&#39;s best to discuss it at a non-pressured time and in a non-pressured manner, preferably while you are doing something else together.<br/>\n<br/>\nKaren<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;usuheinerfam&quot; &lt;usuheinerfam@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; My daughter and Son do get an allowance every week which is not conditional of doing chores but I&#39;m wondering if we should start &quot;paying&quot; them for each chore they do on top of getting their allowance?<br/>\n&gt; &gt; <br/>\n&gt; <br/>\n&gt; Our kids get an &#39;allowance&#39; every two weeks (though we don&#39;t call it that). When Daddy gets his paycheck, he gets some money from it, I get some money from it, and so do our older two girls. (The other two are too young to care or want any.) It&#39;s not tied to anything that they do, it&#39;s just part of being a family. The money also goes up or down (for all of us) depending on our current financial state.<br/>\n&gt; <br/>\n&gt; Our reason for this is basic - we don&#39;t get paid for what we do around the house and they don&#39;t either. They&#39;ve seen their cousins and friends get money for doing basic things and have asked if they could get paid for doing that also but the answer is always no. We just do what needs to be done at our house, each according to their desire/need. I need to have a clean bathroom, so I do that. My husband&#39;s hot spot is the kitchen so he does that. The kids don&#39;t have anything that bugs them yet, so sometimes they help us, sometimes they surprise us by just doing stuff, sometimes they don&#39;t help out at all. And it gets better with age, too, but while we ask and invite them to help, we don&#39;t get upset if the answer is no. <br/>\n&gt; <br/>\n&gt; *I* have seen what happens with their cousins and friends who get paid to do chores - so far I have seen every single one of them refuse to help out voluntarily and make a *huge* stink if the parent makes them help out without financial recompense. They&#39;ve tied helping around the house to getting paid and if they don&#39;t get paid (not just money - one cousin gets paid in popsicles, so if the mom thinks he&#39;s had enough sugar, no more popsicles), they&#39;re not going to do it. We&#39;ve been able to steer clear of that.<br/>\n&gt; <br/>\n&gt; The animals ... I agree with Alex. You know that most kids are not going to be taking care of the pets exactly as you&#39;d like, sometimes not at all. But if you make them take care of them and nag them all of the time they&#39;re going to grow to dislike the animals. That&#39;s probably not what you want either. We have three dogs, my working border collie, my oldest girl&#39;s chihuahua, and my younger girl&#39;s dachshund. My girls *adore* their dogs. My oldest does pretty well with feeding but always forgets watering. She is good at walking her dog when I exercise mine. My youngest pretty much just loves her dog. As the adult, I take on the responsibility of making sure that they&#39;re all fed, watered, trained, and exercised. Seeing my girls loving on them is worth it. You need to decide whether having that rabbit is going to send you over the edge responsibility-wise because you have fair warning now (from yourself and your knowledge of your daughter&#39;s current state) that you&#39;ll be doing most of the caring of it.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Helping with Chores","postDate":"1339854636","msgId":67693,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzk4NTQ2MzYuNzA0NTIuWWFob29NYWlsTmVvQHdlYjgxNTAzLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PEUxMjJCN0YyLUIwOEEtNDJDOS05RDQ5LTU2Njk0OUEzNkNGM0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGpyZnIzaSttOHZoQGVHcm91cHMuY29tPiA8MTMzOTc5ODI0Mi45ODY1LllhaG9vTWFpbE5lb0B3ZWI4MTUwNC5tYWlsLm11ZC55YWhvby5jb20+IDxFMTIyQjdGMi1CMDhBLTQyQzktOUQ0OS01NjY5NDlBMzZDRjNAU2FuZHJhZG9kZC5jb20+"},"prevInTopic":67689,"nextInTopic":67695,"prevInTime":67692,"nextInTime":67694,"topicId":67679,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1577275608\">&lt;&lt;&quot;A  child is too young to enter into a contract, and &quot;we will get a dog if you feed it every day for years&quot; is more than they can understand and probably more than they can do.&quot;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\nAnd there are lots of animals that are taken to shelters , where most die, because the parent  decided to teach them to be responsible by taking care of the animal and when that does not happen they give up on the animal. What the child is really maybe learning is not to care for that animal , or consequence for not taking care , but that the animal&#39;s life is disposable and you can just give them up like that. Very very sad.<br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Helping with Chores","postDate":"1339826650","msgId":67685,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUxMjJCN0YyLUIwOEEtNDJDOS05RDQ5LTU2Njk0OUEzNkNGM0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEzMzk3OTgyNDIuOTg2NS5ZYWhvb01haWxOZW9Ad2ViODE1MDQubWFpbC5tdWQueWFob28uY29tPg==","referencesHeader":"PGpyZnIzaSttOHZoQGVHcm91cHMuY29tPiA8MTMzOTc5ODI0Mi45ODY1LllhaG9vTWFpbE5lb0B3ZWI4MTUwNC5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":67684,"nextInTopic":67687,"prevInTime":67684,"nextInTime":67686,"topicId":67679,"numMessagesInTopic":0,"msgSnippet":"-=- Making them do it to learn to be responsible  is like making them do chores so they can learn to have a neat home. Some kids were made to do chores and","messageBody":"<div id=\"ygrps-yiv-1635218605\">-=- Making them do it to learn to be responsible  is like making them do chores so they can learn to have a neat home. <br/>\nSome kids were made to do chores and grow up and have tidy homes. some will not care at all!-=-<br/>\n<br/>\nThere&#39;s reason to think it&#39;s genetic, too, the urge or ability to &quot;be neat&quot; and to organize the environment physically or timewise.<br/>\n<br/>\nForcing a non-physical kid to shoot baskets every day doesn&#39;t make him more manly, nor a girl less dainty.  It just makes them frustrated, and makes them think their parents are mean and unreasonable and don&#39;t love them.<br/>\n<br/>\nA child is too young to enter into a contract, and &quot;we will get a dog if you feed it every day for years&quot; is more than they can understand and probably more than they can do.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Helping with Chores","postDate":"1339813108","msgId":67684,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpyZ3Fkays2NDUyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpyZnIzaSttOHZoQGVHcm91cHMuY29tPg=="},"prevInTopic":67683,"nextInTopic":67685,"prevInTime":67683,"nextInTime":67685,"topicId":67679,"numMessagesInTopic":0,"msgSnippet":"... ************** That s the way it is in most families. Most parents persevere because they believe the struggle teaches kids valuable life lessons. But","messageBody":"<div id=\"ygrps-yiv-1783519601\">&quot;louise.king76&quot; &lt;louise.j.king@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; We have been homeschooling for 3 years and the issue of chores is a constant struggle.<br/>\n </span></blockquote>**************<br/>\n<br/>\nThat&#39;s the way it is in most families. Most parents persevere because they believe the struggle teaches kids valuable life lessons. <br/>\nBut there&#39;s no real evidence backing up that belief - if you look at lazy adults, passive aggressive adults, slobs and irresponsible adults, you&#39;ll find most of them were raised with similar chores and rules and discipline as people who are responsible, dependable, and/or tidy. Chores don&#39;t teach what they&#39;re thought to teach. If anything, the one consistent thing people learn from doing chores as children is to think of them as chores; drudgery. <br/>\n<br/>\nSo if all that struggle is for nothing, is there any other reason to continue pushing the kids to &quot;help out&quot;? If you do a cost-benefit analysis with your effort and energy and stress on one side and the amount of effort and energy your kids save you by grudgingly doing some of the labor - are the chores worth it? It sure doesn&#39;t sound that way from here.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; When we ask our daughter or son if they could help us, they always say &quot;NO, I don&#39;t want too.&quot;<br/>\n </span></blockquote>**************<br/>\n<br/>\nYou said it was a struggle to get them to do chores - is asking a new thing, then? If so, it&#39;s to be expected that they&#39;ll say no for a long while. After all, you made &quot;helping&quot; into something unpleasant. They&#39;ll need time and perspective to develop real reasons to help.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Doing it all yourself is exhausting! <br/>\n<br/>\n </span></blockquote>Maybe you have too much &quot;all&quot; - can you cut some things out? Shift your expectations to accommodate the fact that you have a bunch of people sharing a home which is also, essentially, an office and workshop and laboratory. A lot of offices, workshops and laboratories have designated people to clean them. Most of the others are messy! The shop where I work now has a running joke: oh, you cleaned? yes, I couldn&#39;t find x (a tool, a piece of furniture, an invoice...).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;if we could all be working together as a family, there would be more time for other creative projects.<br/>\n </span></blockquote>**************<br/>\n<br/>\nCome at that from another angle. If you could figure out the logistics, you could do more creative projects. The problem is that you&#39;ve already decided what the solution is and are trying to stick to that solution even though it obviously doesn&#39;t work. So look for other ways to solve the problem - Not the &quot;how to work together&quot; problem but the real problem, how to do more of what you (all of you) want to do. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;(putting away all the materials they have used for projects as well as toys, clothes, etc)<br/>\n </span></blockquote>***********<br/>\n<br/>\nDo they need to be put away? If something is in the way, then that&#39;s something to point out: help me move these clothes off the table so we can do this puzzle. In my home, the couch gets a lot of use and can get so piled up with odds and ends no-one can sit down, but it makes sense to say &quot;give me a hand - put your art supplies over there while I move these books and there will be room for us to play this game&quot;. Or &quot;move these dishes to the sink while I wipe down the counter and we&#39;ll make cookies&quot;. We have a very small, rather cluttered house, so moving things out of the way is a regular occurrence.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;the chickens have become another responsibility for her dad and me to take care of<br/>\n </span></blockquote>************<br/>\n<br/>\nHonestly, if you talk to your kids about chores and responsibility the way you&#39;re expressing them in this post, it&#39;s no wonder your kids don&#39;t want to be involved. Get away from what You learned about work: that it&#39;s a Chore, and instead focus on the positive. What good about having chickens? Do you like having fresh eggs? Think happy thoughts about nice, farm fresh eggs as you go cheerily out to collect them. Enjoy the day while you&#39;re out. Invite your kids to come along if they&#39;re not busy and make it a pleasure to go egg gathering. Approach more of your life with enthusiasm and interest. Maybe the kids will be intrigued - but even if they don&#39;t You&#39;ll have more enthusiasm and interest. That&#39;s a good thing in and of itself. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Now, she wants a Rabbit.  I would love for her to have a Rabbit, but her father and I just don&#39;t want to take on any more chores to do and also to take on the battle of reminding her all the time to feed and care for the Rabbit.<br/>\n </span></blockquote>*******************<br/>\n<br/>\nDon&#39;t fight with her over the care of the rabbit. Either decide you&#39;re willing to do it, or don&#39;t get the rabbit. But here are a few things to consider - if you drop all the fighting, you&#39;ll have more time, more energy, and less stress. That might even things up. If you value having the rabbit for some reason, consider what other valuable thing you might spend money on - a curriculum, a camping trip, a new bicycle, a musical instrument - and think about the &quot;cost&quot; of caring for a rabbit weighed against the benefits of having one in those terms. Maybe a rabbit isn&#39;t a good investment compared to, say, a video game like Harvest Moon or Shepherd&#39;s Crossing (where she could play at having rabbits). <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Saying NO to anymore animals seems like being a meany!<br/>\n<br/>\n </span></blockquote>Why? What&#39;s got you so tied up that saying &quot;I&#39;m sorry, not right now&quot; feels like a mean thing to say? Is it that you see it as a kind of punishment? Like you&#39;re saying she&#39;s not &quot;good enough&quot;? All the more reason to drop the idea that your kids should be doing work for you, if it&#39;s making you value their labor more than their happiness.<br/>\n<br/>\nDo things for the people you love as a gift. Tidy and clean and care for the critters sweetly and graciously, the way you&#39;d hope to be treated if you couldn&#39;t care for things yourself. Spread more sweetness and care in your life, and take care of your own needs, too. <br/>\n<br/>\nWhile you&#39;re at it, look at your children in warm, pleasant moments and see that they actually Do help you, already. See the times they do nice things for each other and for you as evidence that they are gracious, kind people. That&#39;s important. All this fussing over chores ruins your opinion of your kids. The more you can see them as innately kind and helpful, the more you&#39;ll notice them helping - really helping out of the goodness of their hearts, not because they&#39;ve been bullied into it. That&#39;s worth a lot of laundry and dishes ;) <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":283914803,"authorName":"jo kirby","from":"jo kirby &lt;jokirby2004@...&gt;","profile":"jokirby2004","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Helping with Chores","postDate":"1339806032","msgId":67687,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzk4MDYwMzIuMjA0NzcuWWFob29NYWlsTmVvQHdlYjI5NjA2Lm1haWwuaXJkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGpyZnIzaSttOHZoQGVHcm91cHMuY29tPg==","referencesHeader":"PGpyZnIzaSttOHZoQGVHcm91cHMuY29tPg=="},"prevInTopic":67685,"nextInTopic":67689,"prevInTime":67686,"nextInTime":67688,"topicId":67679,"numMessagesInTopic":0,"msgSnippet":"*My husband and I seem to spend a lot of time running around doing everything including clearing away after our children (putting away all the materials they","messageBody":"<div id=\"ygrps-yiv-38063571\">*My husband and I seem to spend a lot of time running around doing everything including clearing away after our children (putting away all the materials they have used for projects as well as toys, clothes, etc)*<br/>\n<br/>\n<br/>\nIf you could start to see what you are doing as giving, rather than as a chore, I think that might help a little. Don&#39;t even call them chores - maybe call them what they are - cleaning, feeding, tidying etc. these are all positive things if you really think about them, whereas a chore doesn&#39;t sound very much fun!<br/>\n<br/>\n*We get very tired and feel that if we could all be working together as a family, there would be more time for other creative projects. *<br/>\n<br/>\nWith toys, scoop them up and put them in some of those big tub-trug things you can buy at gardening stores. Maybe keep one in each room (or two, or three!), to make it a two minute job to scoop all the day&#39;s toys into. With crafty/project stuff, put it away when someone is ready to start a new activity/project and needs the space. It might be you, it might be them, they might help, they might not. It doesn&#39;t matter, your focus and excitement is with the next thing, and clearing is just a necessity to go through, not a problem.<br/>\n<br/>\n*Being a NAG is boring! Doing it all yourself is exhausting! *<br/>\n<br/>\n<br/>\nPerhaps it is the emotional weight you are putting on it that&#39;s making you so tired? It really doesn&#39;t have to be so tiring, if you can make it suit you practically (the tubs and things I mean) and do it with joy and giving.<br/>\n<br/>\nIf I was 11, or 5, and someone kept pushing me to do something I didn&#39;t want to (perhaps because I&#39;m busy with other stuff, perhaps because to me it&#39;s boring, perhaps because I love being looked after...), I would start getting resentful pretty quickly, and then really NOT want to do that thing! I think it will eat at your relationship a little. It&#39;s a kind of little battle, and those are best avoided.<br/>\n<br/>\nIt&#39;s not too late. Just stop with the nagging, stop asking all together for quite a while. Get things organised so that it&#39;s all more convenient for your husband and yourself to tidy etc., start seeing it all as another one of your gifts to them. Take the weight of their shoulders, and yours. No more little battles about this. Work to reach a place in your head and in your heart where it really is ok if they decline. Then, you might ask every now and then for a hand with something, but be ready for them to decline, then if they accept it&#39;s a nice suprise!<br/>\n<br/>\n<br/>\n*Saying NO to anymore animals seems like being a meany!*<br/>\n<br/>\n<br/>\nFor now, tell them you need more time to decide on that one (if they ask). After a while, once you have got your set-up suiting you and your husband better, and hopefully changed your mind-set a little, then you can maybe find a way to happily say yes.<br/>\n<br/>\nAll the best,<br/>\nJo<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n From: louise.king76 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:louise.j.king@...\">louise.j.king@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\nSent: Friday, 15 June 2012, 18:24<br/>\nSubject: [AlwaysLearning] Helping with Chores<br/>\n <br/>\n<br/>\n  <br/>\n<br/>\nOur daughter, who is 11 years olds and our son, 5 years old refuse to help with any chores around the house or the garden.   My husband and I seem to spend a lot of time running around doing everything including clearing away after our children (putting away all the materials they have used for projects as well as toys, clothes, etc) <br/>\nWe get very tired and feel that if we could all be working together as a family, there would be more time for other creative projects. <br/>\n<br/>\nWhen we ask our daughter or son if they could help us, they always say &quot;NO, I don&#39;t want too.&quot;<br/>\n<br/>\nWe have been homeschooling for 3 years and the issue of chores is a constant struggle.<br/>\nOur home is a very small but it is rich environment, we have lots of books, art materials, media and also a vegetable garden and a couple of Chickens.  When we were considering getting the chickens my daughter offered to help out, she said she would collect the eggs everyday......she never collects the eggs, even if we remind her daily. <br/>\nAgain the chickens have become another responsibility for her dad and me to take care of.<br/>\n<br/>\nNow, she wants a Rabbit.  I would love for her to have a Rabbit, but her father and I just don&#39;t want to take on any more chores to do and also to take on the battle of reminding her all the time to feed and care for the Rabbit. <br/>\nBeing a NAG is boring! <br/>\nDoing it all yourself is exhausting! <br/>\nSaying NO to anymore animals seems like being a meany!<br/>\n<br/>\nMy daughter and Son do get an allowance every week which is not conditional of doing chores but I&#39;m wondering if we should start &quot;paying&quot; them for each chore they do on top of getting their allowance?<br/>\n<br/>\nI was wondering how others deal with chores?<br/>\n<br/>\nthank you<br/>\n<br/>\nLouise <br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":186403821,"authorName":"usuheinerfam","from":"&quot;usuheinerfam&quot; &lt;usuheinerfam@...&gt;","profile":"usuheinerfam","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Helping with Chores","postDate":"1339799425","msgId":67683,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpyZ2QyMSsybWs1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpyZnIzaSttOHZoQGVHcm91cHMuY29tPg=="},"prevInTopic":67682,"nextInTopic":67684,"prevInTime":67682,"nextInTime":67684,"topicId":67679,"numMessagesInTopic":0,"msgSnippet":"... Our kids get an allowance every two weeks (though we don t call it that). When Daddy gets his paycheck, he gets some money from it, I get some money from","messageBody":"<div id=\"ygrps-yiv-629544734\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; My daughter and Son do get an allowance every week which is not conditional of doing chores but I&#39;m wondering if we should start &quot;paying&quot; them for each chore they do on top of getting their allowance?<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Our kids get an &#39;allowance&#39; every two weeks (though we don&#39;t call it that). When Daddy gets his paycheck, he gets some money from it, I get some money from it, and so do our older two girls. (The other two are too young to care or want any.) It&#39;s not tied to anything that they do, it&#39;s just part of being a family. The money also goes up or down (for all of us) depending on our current financial state.<br/>\n<br/>\nOur reason for this is basic - we don&#39;t get paid for what we do around the house and they don&#39;t either. They&#39;ve seen their cousins and friends get money for doing basic things and have asked if they could get paid for doing that also but the answer is always no. We just do what needs to be done at our house, each according to their desire/need. I need to have a clean bathroom, so I do that. My husband&#39;s hot spot is the kitchen so he does that. The kids don&#39;t have anything that bugs them yet, so sometimes they help us, sometimes they surprise us by just doing stuff, sometimes they don&#39;t help out at all. And it gets better with age, too, but while we ask and invite them to help, we don&#39;t get upset if the answer is no. <br/>\n<br/>\n*I* have seen what happens with their cousins and friends who get paid to do chores - so far I have seen every single one of them refuse to help out voluntarily and make a *huge* stink if the parent makes them help out without financial recompense. They&#39;ve tied helping around the house to getting paid and if they don&#39;t get paid (not just money - one cousin gets paid in popsicles, so if the mom thinks he&#39;s had enough sugar, no more popsicles), they&#39;re not going to do it. We&#39;ve been able to steer clear of that.<br/>\n<br/>\nThe animals ... I agree with Alex. You know that most kids are not going to be taking care of the pets exactly as you&#39;d like, sometimes not at all. But if you make them take care of them and nag them all of the time they&#39;re going to grow to dislike the animals. That&#39;s probably not what you want either. We have three dogs, my working border collie, my oldest girl&#39;s chihuahua, and my younger girl&#39;s dachshund. My girls *adore* their dogs. My oldest does pretty well with feeding but always forgets watering. She is good at walking her dog when I exercise mine. My youngest pretty much just loves her dog. As the adult, I take on the responsibility of making sure that they&#39;re all fed, watered, trained, and exercised. Seeing my girls loving on them is worth it. You need to decide whether having that rabbit is going to send you over the edge responsibility-wise because you have fair warning now (from yourself and your knowledge of your daughter&#39;s current state) that you&#39;ll be doing most of the caring of it.</div>","specialLinks":[]},{"userId":311341422,"authorName":"dapsign","from":"&quot;dapsign&quot; &lt;dapsign@...&gt;","profile":"dapsign","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Helping with Chores","postDate":"1339799117","msgId":67689,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpyZ2NvZCtuZm9uQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpyZnIzaSttOHZoQGVHcm91cHMuY29tPg=="},"prevInTopic":67687,"nextInTopic":67693,"prevInTime":67688,"nextInTime":67690,"topicId":67679,"numMessagesInTopic":0,"msgSnippet":"I noticed that the original poster (Louise, I think) has been asking lots of questions in the last few weeks.  You may want to  Read a little, try a little,","messageBody":"<div id=\"ygrps-yiv-1190557006\">I noticed that the original poster (Louise, I think) has been asking lots of questions in the last few weeks.  You may want to  &quot;Read a little, try a little, wait a while, watch.&quot;<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/gradualchange\">http://sandradodd.com/gradualchange</a><br/>\n<br/>\nDina<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;louise.king76&quot; &lt;louise.j.king@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; Our daughter, who is 11 years olds and our son, 5 years old refuse to help with any chores around the house or the garden.   My husband and I seem to spend a lot of time running around doing everything including clearing away after our children (putting away all the materials they have used for projects as well as toys, clothes, etc)   <br/>\n&gt; We get very tired and feel that if we could all be working together as a family, there would be more time for other creative projects.  <br/>\n&gt; <br/>\n&gt; When we ask our daughter or son if they could help us, they always say &quot;NO, I don&#39;t want too.&quot;<br/>\n&gt; <br/>\n&gt; We have been homeschooling for 3 years and the issue of chores is a constant struggle.<br/>\n&gt; Our home is a very small but it is rich environment, we have lots of books, art materials, media and also a vegetable garden and a couple of Chickens.  When we were considering getting the chickens my daughter offered to help out, she said she would collect the eggs everyday......she never collects the eggs, even if we remind her daily.   <br/>\n&gt; Again the chickens have become another responsibility for her dad and me to take care of.<br/>\n&gt; <br/>\n&gt; Now, she wants a Rabbit.  I would love for her to have a Rabbit, but her father and I just don&#39;t want to take on any more chores to do and also to take on the battle of reminding her all the time to feed and care for the Rabbit.  <br/>\n&gt; Being a NAG is boring! <br/>\n&gt; Doing it all yourself is exhausting! <br/>\n&gt; Saying NO to anymore animals seems like being a meany!<br/>\n&gt; <br/>\n&gt; My daughter and Son do get an allowance every week which is not conditional of doing chores but I&#39;m wondering if we should start &quot;paying&quot; them for each chore they do on top of getting their allowance?<br/>\n&gt; <br/>\n&gt; I was wondering how others deal with chores?<br/>\n&gt; <br/>\n&gt; thank you<br/>\n&gt; <br/>\n&gt; Louise<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":311341422,"authorName":"dapsign","from":"&quot;dapsign&quot; &lt;dapsign@...&gt;","profile":"dapsign","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Helping with Chores","postDate":"1339798581","msgId":67682,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpyZ2M3bCs2cXI2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpyZnIzaSttOHZoQGVHcm91cHMuY29tPg=="},"prevInTopic":67681,"nextInTopic":67683,"prevInTime":67681,"nextInTime":67683,"topicId":67679,"numMessagesInTopic":0,"msgSnippet":"There is A LOT of great info collected here that you should read: www.sandradodd.com/chores http://sandradodd.com/service and here (half way down on the right","messageBody":"<div id=\"ygrps-yiv-331502479\">There is A LOT of great info collected here that you should read:<br/>\n<br/>\nwww.sandradodd.com/chores<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/service\">http://sandradodd.com/service</a><br/>\n<br/>\nand here (half way down on the right hand sidebar)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/\">http://joyfullyrejoycing.com/</a><br/>\n<br/>\nDina<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;louise.king76&quot; &lt;louise.j.king@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; Our daughter, who is 11 years olds and our son, 5 years old refuse to help with any chores around the house or the garden.   My husband and I seem to spend a lot of time running around doing everything including clearing away after our children (putting away all the materials they have used for projects as well as toys, clothes, etc)   <br/>\n&gt; We get very tired and feel that if we could all be working together as a family, there would be more time for other creative projects.  <br/>\n&gt; <br/>\n&gt; When we ask our daughter or son if they could help us, they always say &quot;NO, I don&#39;t want too.&quot;<br/>\n&gt; <br/>\n&gt; We have been homeschooling for 3 years and the issue of chores is a constant struggle.<br/>\n&gt; Our home is a very small but it is rich environment, we have lots of books, art materials, media and also a vegetable garden and a couple of Chickens.  When we were considering getting the chickens my daughter offered to help out, she said she would collect the eggs everyday......she never collects the eggs, even if we remind her daily.   <br/>\n&gt; Again the chickens have become another responsibility for her dad and me to take care of.<br/>\n&gt; <br/>\n&gt; Now, she wants a Rabbit.  I would love for her to have a Rabbit, but her father and I just don&#39;t want to take on any more chores to do and also to take on the battle of reminding her all the time to feed and care for the Rabbit.  <br/>\n&gt; Being a NAG is boring! <br/>\n&gt; Doing it all yourself is exhausting! <br/>\n&gt; Saying NO to anymore animals seems like being a meany!<br/>\n&gt; <br/>\n&gt; My daughter and Son do get an allowance every week which is not conditional of doing chores but I&#39;m wondering if we should start &quot;paying&quot; them for each chore they do on top of getting their allowance?<br/>\n&gt; <br/>\n&gt; I was wondering how others deal with chores?<br/>\n&gt; <br/>\n&gt; thank you<br/>\n&gt; <br/>\n&gt; Louise<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Helping with Chores","postDate":"1339798242","msgId":67681,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzk3OTgyNDIuOTg2NS5ZYWhvb01haWxOZW9Ad2ViODE1MDQubWFpbC5tdWQueWFob28uY29tPg==","inReplyToHeader":"PGpyZnIzaSttOHZoQGVHcm91cHMuY29tPg==","referencesHeader":"PGpyZnIzaSttOHZoQGVHcm91cHMuY29tPg=="},"prevInTopic":67679,"nextInTopic":67682,"prevInTime":67680,"nextInTime":67682,"topicId":67679,"numMessagesInTopic":0,"msgSnippet":"As someone who grew up with many animals, who has worked with dogs for over 30 years, who was married to a veterinarian and is now married to a Dairy Farmer I","messageBody":"<div id=\"ygrps-yiv-876119348\">As someone who grew up with many animals, who has worked with dogs for over 30 years, who was married to a veterinarian and is now married to a Dairy Farmer I have to say this about animal care and kids.<br/>\nThe care of pets should not be the responsibility of children. It should never be a way to teach responsibility ( and I have heard that so so many times).<br/>\nKids need their parents support to care for animals. <br/>\nSome kids will be more conscious at it and some will love the pets but never really remember to feed, water or do any needed care.<br/>\n<br/>\nI started training dogs when I was 13 and was professionally showing them at 14.<br/>\nStill my parents stepped in and helped with our many pets at home.<br/>\nI was the kid that gave baths, fed most days and made sure they had water. My dad walked the dogs at least once a day. He also gave them baths.<br/>\nMy mom made sure they were fed if I was not home or busy.<br/>\nMy younger sister never really did anything but today I would say she is a much better pet owner than I am!<br/>\nFor some kids they will mature and do better when they are older. Making them do it to learn to be responsible  is like making them do chores so they can learn to have a neat home. <br/>\nSome kids were made to do chores and grow up and have tidy homes. some will not care at all!<br/>\n<br/>\nMy daughter loves to help dad in the farm. She is only 6 so there is only so much she can do but she is very often outside hanging out.<br/>\nMy son will do it sometimes. many times I ask for help and he runs to help. Others he declines. If we need help  for something urgent or important he has always helped. <br/>\nBoth were never made to help. They can decline. They have declined.<br/>\nI just love when they come and just want to help out because they care for me or dad. It is very sweet!<br/>\n<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":529985200,"authorName":"louise.king76","from":"&quot;louise.king76&quot; &lt;louise.j.king@...&gt;","profile":"louise.king76","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Helping with Chores","postDate":"1339781042","msgId":67679,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpyZnIzaSttOHZoQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":67681,"prevInTime":67678,"nextInTime":67680,"topicId":67679,"numMessagesInTopic":0,"msgSnippet":"Our daughter, who is 11 years olds and our son, 5 years old refuse to help with any chores around the house or the garden.   My husband and I seem to spend a","messageBody":"<div id=\"ygrps-yiv-1890102258\">Our daughter, who is 11 years olds and our son, 5 years old refuse to help with any chores around the house or the garden.   My husband and I seem to spend a lot of time running around doing everything including clearing away after our children (putting away all the materials they have used for projects as well as toys, clothes, etc)   <br/>\nWe get very tired and feel that if we could all be working together as a family, there would be more time for other creative projects.  <br/>\n<br/>\nWhen we ask our daughter or son if they could help us, they always say &quot;NO, I don&#39;t want too.&quot;<br/>\n<br/>\nWe have been homeschooling for 3 years and the issue of chores is a constant struggle.<br/>\nOur home is a very small but it is rich environment, we have lots of books, art materials, media and also a vegetable garden and a couple of Chickens.  When we were considering getting the chickens my daughter offered to help out, she said she would collect the eggs everyday......she never collects the eggs, even if we remind her daily.   <br/>\nAgain the chickens have become another responsibility for her dad and me to take care of.<br/>\n<br/>\nNow, she wants a Rabbit.  I would love for her to have a Rabbit, but her father and I just don&#39;t want to take on any more chores to do and also to take on the battle of reminding her all the time to feed and care for the Rabbit.  <br/>\nBeing a NAG is boring! <br/>\nDoing it all yourself is exhausting! <br/>\nSaying NO to anymore animals seems like being a meany!<br/>\n<br/>\nMy daughter and Son do get an allowance every week which is not conditional of doing chores but I&#39;m wondering if we should start &quot;paying&quot; them for each chore they do on top of getting their allowance?<br/>\n<br/>\nI was wondering how others deal with chores?<br/>\n<br/>\nthank you<br/>\n<br/>\nLouise</div>","specialLinks":[]}],"prevTopicId":67767,"nextTopicId":67706}}