{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"(Lorrie Pimentel)","from":"&quot;(Lorrie Pimentel)&quot; &lt;Momandmore@...&gt;","replyTo":"LIST","senderId":"i_5veE8q9EvImVxd0TCn1zb_r0ItYtwWXMFsSDdVj0NymUSOzwCcL4SzK5WJZy4edxPmux45W5xt9d1jdqJKBK1ncDBzly341_XbSOhvYA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Off topic but beautiful","postDate":"962111653","msgId":10033,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhqYTliNStoN2hqQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":10032,"nextInTime":10034,"topicId":10033,"numMessagesInTopic":0,"msgSnippet":"This was forwarded to me from another list.  I think this is just beautiful. In Brooklyn, New York, Chush is a school that caters to learning disabled","messageBody":"<div id=\"ygrps-yiv-134660215\">This was forwarded to me from another list.  I think this is just <br/>\nbeautiful.<br/>\nIn Brooklyn, New York, Chush is a school that caters to learning <br/>\ndisabled children.  Some children remain in Chush <br/>\nfor their entire school <br/>\ncareer, while others can be mainstreamed into conventional schools. <br/>\nAt a Chush fundraising dinner, the father of a Chush <br/>\nchild delivered a speech <br/>\nthat would never be forgotten by all who attended.  <br/>\n<br/>\n After extolling the school and its dedicated staff, he cried <br/>\nout, &quot;Where is the perfection in my <br/>\nson Shaya?  Everything God does is done with perfection.  But my <br/>\nchild cannot understand things as other children do.  My <br/>\nchild cannot remember <br/>\nfacts and figures as other children do.  Where is <br/>\nGod&#39;s perfection? <br/>\n<br/>\nThe audience was shocked by the question, pained by the <br/>\nfather&#39;s anguish and <br/>\nstilled by the piercing query.  &quot;I believe,&quot; the father <br/>\nanswered, &quot;that when God brings a child like this into the world, <br/>\nthe  perfection that he seeks is <br/>\nin the way people react to this child.&quot;  <br/>\n<br/>\nHe then told the following story <br/>\nabout his son Shaya:  <br/>\n<br/>\nOne afternoon, Shaya and his father walked past a park where some <br/>\nboys Shaya knew were playing baseball.  Shaya asked, &quot;Do you think <br/>\nthey will let me play?&quot; Shaya&#39;s father knew that his son was not at <br/>\nall athletic and that most boys would not want him on their team.  <br/>\nBut Shaya&#39;s father understood that if his son was chosen to play it <br/>\nwould give him a comfortable sense of <br/>\nbelonging. Shaya&#39;s father approached one of the boys <br/>\nin the field and asked if Shaya could play. The boy looked around for <br/>\nguidance from his teammates.  <br/>\n<br/>\n Getting none, he took matters into his own hands and said &quot;We are <br/>\nlosing by six runs and the game is in the eighth inning.  I <br/>\nguess he can be on our <br/>\nteam and we&#39;ll try to put him up to bat in the ninth inning.&quot; <br/>\n<br/>\nShaya&#39;s father was ecstatic as Shaya smiled broadly.  Shaya was told <br/>\nto put on a glove and <br/>\ngo out to play short center field.  In the bottom of the eighth <br/>\ninning, Shaya&#39;s team scored a few runs but was still behind <br/>\nby three. In the bottom of the ninth inning, Shaya&#39;s team scored <br/>\nagain and now with two outs and the bases loaded with the potential <br/>\nwinning run on base.<br/>\n<br/>\nShaya was scheduled to be up.  Would the team actually let Shaya bat <br/>\nat this juncture and give away their chance to win the game?  <br/>\nSurpassingly, Shaya <br/>\nwas given the bat.  <br/>\n<br/>\nEveryone knew that it was all but impossible because Shaya didn&#39;t <br/>\neven know how to hold the bat properly, let alone hit with it.  <br/>\nHowever as Shaya stepped up to the plate, the pitcher moved a few <br/>\nsteps to lob the ball in softly so Shaya should at least be able to <br/>\nmake contact. The first pitch <br/>\ncame and Shaya swung clumsily and missed.  One of Shaya&#39;s teammates <br/>\ncame up to Shaya and together they held the bat and faced the pitcher <br/>\nwaiting for <br/>\nthe next pitch.  The pitcher again took a few steps forward to toss <br/>\nthe ball softly toward Shaya.  As the pitch came in, Shaya and his <br/>\nteammate swung at the ball and together they hit a slow ground ball <br/>\nto the pitcher. <br/>\n<br/>\nThe pitcher picked up the soft grounder and could easily have thrown <br/>\nthe ball to the first baseman.  Shaya would have been out and that <br/>\nwould have ended the game.  Instead, the pitcher took the ball and <br/>\nthrew <br/>\nit on a high arc to right field, far beyond reach of the first <br/>\nbaseman.  <br/>\n<br/>\nEveryone started yelling, &quot;Shaya, run to first.  Run to first.&quot; <br/>\n<br/>\nNever in his life had Shaya <br/>\nrun to first.  He scampered down the baseline wide-eyed and <br/>\nstartled.  By the time he reached first base, the right fielder <br/>\nhad the ball.  He could have thrown he ball to the second baseman who <br/>\nwould tag out Shaya, who was still running.  <br/>\n<br/>\nBut the right fielder understood <br/>\nwhat the pitcher&#39;s intentions were, so he threw the ball high and far <br/>\nover the third baseman&#39;s  head.  Everyone yelled, &quot;Run to second, run <br/>\nto <br/>\nsecond.&quot; <br/>\n<br/>\nShaya ran towards second base as the runners ahead of him deliriously <br/>\ncircled the bases <br/>\ntowards home.  As Shaya reached second base, the <br/>\nopposing short stop ran to <br/>\nhim, turned him in the direction of third base and shouted, &quot;Run to <br/>\nthird.&quot;  <br/>\n<br/>\nAs Shaya rounded third, the boys from both teams ran <br/>\nbehind him screaming, <br/>\n&quot;Shaya run home.&quot;  Shaya ran home, stepped on home plate and all 18 <br/>\nboys lifted him on their shoulders and made him the hero, as if he <br/>\nhad just hit a <br/>\n&quot;grand slam&quot; and won the game for his team. <br/>\n<br/>\n&quot;That day,&quot; said the father softly with tears now rolling down his <br/>\nface, &quot;those 18 boys reached their level of God&#39;s perfection.&quot;</div>","specialLinks":[]}],"prevTopicId":10032,"nextTopicId":10034}}