{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":288405080,"authorName":"diana jenner","from":"diana jenner &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Choices, and living in balance","postDate":"1265638219","msgId":50548,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MThhOTM2MTAwMjA4MDYxMGs0N2I4M2VmZmo1MjNjYTMwMmIzYmQyOTI5QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDc5YzFkMWI0MTAwMjA1MDk0MnI1NTU4MmJhYXFlMmFkZGM3MWRmZGZhMzQxQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDQ5QjJCRDFELTVDQzgtNEQ1MC05MjUyLTg5N0JCRjM3Rjc1MUBTYW5kcmFkb2RkLmNvbT4JIDw3OWMxZDFiNDEwMDIwNTA5NDJyNTU1ODJiYWFxZTJhZGRjNzFkZmRmYTM0MUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":50542,"nextInTopic":0,"prevInTime":50547,"nextInTime":50549,"topicId":50475,"numMessagesInTopic":0,"msgSnippet":"**No point getting into too many castles in the air for fun. What if unfun panned out? From experience, I know that I d go with the flow, but... it wouldn t be","messageBody":"<div id=\"ygrps-yiv-1485702076\">**No point getting into too many castles in the air for fun. What if<br/>\nunfun panned out? From experience, I know that I&#39;d go with the flow, but...<br/>\nit wouldn&#39;t be as much fun as &#39;my choice&#39;. Hmm...**<br/>\n<br/>\nFirst, you&#39;re not talking about a choice (as in something real and current),<br/>\nyou&#39;re talking about a pipe dream.<br/>\nYou have a human child, not a pipe-dream-fulfiller. This childhood belongs<br/>\nto *him* not to your dreams.<br/>\nNor is it fair that a mere few months into parenting, you already judge<br/>\ndiffering opinions as less fun than your (future imagined) choices.<br/>\nI&#39;ve been led down many a new path by many a new passion of my son&#39;s -- oh<br/>\nmy! They&#39;re not my passions, they are surely his & I am on his passion team.<br/>\n<br/>\nWe&#39;ve all had childhoods, they&#39;re over. This childhood is the child&#39;s very<br/>\nown, one and only. This childhood is my one and only chance to be my kids<br/>\nparent.<br/>\nAfter acute parenting, your wunderlust will remain/return. Or not.<br/>\n<br/>\n**Just seems unlikely that a child would choose school over joining parents<br/>\nin travel and adventure; play and computers. That would also be the end of<br/>\nmy wanderlust days :D Or perhaps they have ended already, and I&#39;m just<br/>\nraising<br/>\nghosts...**<br/>\n<br/>\nFunny choice of words. I&#39;ll talk about some real ghosts ;)  It&#39;s unlikely<br/>\nmen die at 32, though my husband did. Or daughters at 9, like mine. Or mamas<br/>\nwhen their kids are still young, like my friend Lisa, two years ago.  It<br/>\nhappens.<br/>\nShit happens.Shit happens and sometimes BIG choices are taken away. (as are<br/>\npipe dreams, they like to linger and sting, though, if you can&#39;t let go --<br/>\nhence the above warning)<br/>\nDoing the best with the right here right now is the ultimate gift to the<br/>\nwhole world. For real.  The world that counts, the one you live in with your<br/>\nchild.<br/>\nNo need to stir up extra shit over a tomorrow that may never come. NONE!<br/>\n Give that extra time and energy to looking into your child&#39;s face, smelling<br/>\ntheir hair, truly appreciating their laughter.<br/>\nKnowing what an honor it is to care so deeply and tenderly for one you&#39;ve<br/>\ninvited into this world, for just a moment of your life, for a tiny precious<br/>\nblip of time.<br/>\nIt all matters.<br/>\n~diana :)<br/>\nxoxoxoxo<br/>\nhannahbearski.wordpress.com<br/>\nhannahsashes.blogspot.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":301108410,"authorName":"Marina DeLuca-Howard","from":"Marina DeLuca-Howard &lt;delucahoward@...&gt;","profile":"matedgirl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Choices, and living in balance","postDate":"1265591763","msgId":50542,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3NGRmOWRjMTAwMjA3MTcxNnU0M2MzMDhkOWdmZTYxNTJlYTFmMzVjMTMyQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGhra2prcStjNTJuQGVHcm91cHMuY29tPg==","referencesHeader":"PDc5YzFkMWI0MTAwMjA1MjE0Mm0yOWNhMzNjOHhhY2Y1YzYyZmY5ZTc3MGZlQG1haWwuZ21haWwuY29tPgkgPGhra2prcStjNTJuQGVHcm91cHMuY29tPg=="},"prevInTopic":50507,"nextInTopic":50548,"prevInTime":50541,"nextInTime":50543,"topicId":50475,"numMessagesInTopic":0,"msgSnippet":"My kids haven chosen school and have withdrawn, but by age four they were used to choices.  School looked good and had a prominent place in literature,","messageBody":"<div id=\"ygrps-yiv-1809529507\">My kids haven chosen school and have withdrawn, but by age four they were<br/>\nused to choices.  School looked good and had a prominent place in<br/>\nliterature, television, and movies.  Home based learning seemed unnamed and<br/>\nwas invisible.  They chose school and with a vegetarian mother chose meat,<br/>\ntoo.<br/>\n<br/>\nHere is the comprehensive list of choices they made prior to age three:<br/>\nThey chose when to breastfeed; chose how much, what, and when they ate;<br/>\nchose when to learn to sit up; when to fall asleep, when to crawl; when to<br/>\nwalk and when to learn to self-toilet.  They also chose how much clothing to<br/>\nwear.  I learned to trust they knew when they were cold or hot or needed<br/>\nsomething and they in turn trusted that I would take their needs seriously<br/>\nso they were able to communicate them.  They also were all early talkers<br/>\nwith the youngest Crispin using two word sentences at eight months old--his<br/>\nchoice to talk and mine to listen.   By six months Rowan was choosing which<br/>\nfood to eat, and adeptly getting some of it to his mouth.  Marty started<br/>\ngrabbing at food before six months(banana, and avocado) and getting it to<br/>\nhis mouth.  Crispin learned to walk before nine months, well, he learned to<br/>\nrun actually:)  Rowan was writing out random letters of the alphabet by age<br/>\none and a half.  I always gave encouragment and opportunities.  I supplied<br/>\npaper and writing supplies but I was expecting drawings, not letters!  In<br/>\ntruth I wasn&#39;t even expecting the drawings--I just thought it would be fun<br/>\nto put colour on paper and offered him the supplies.<br/>\n<br/>\nThey chose when to leave school, too.  But while they were in school I<br/>\nfought for them, and we learned about empowerment and working with<br/>\nbureaucracy.  I didn&#39;t enjoy the endless meetings and crazy circular<br/>\narguments in favor of report cards/homework or the school admin&#39;s refusal to<br/>\nadmit the bullying and mind games engaged in by both teachers and students.<br/>\nBut when we hit a wall my kids agreed leaving was a good option.  It was an<br/>\noption I reminded them they had, but I supported their choices and worked<br/>\nwith them.<br/>\n<br/>\nMarina<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nRent our cottage:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://davehoward.ca/cottage/\">http://davehoward.ca/cottage/</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":8667530,"authorName":"m_kher","from":"&quot;m_kher&quot; &lt;m_kher@...&gt;","profile":"m_kher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Choices, and living in balance","postDate":"1265488346","msgId":50507,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhra2prcStjNTJuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc5YzFkMWI0MTAwMjA1MjE0Mm0yOWNhMzNjOHhhY2Y1YzYyZmY5ZTc3MGZlQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":50501,"nextInTopic":50542,"prevInTime":50506,"nextInTime":50508,"topicId":50475,"numMessagesInTopic":0,"msgSnippet":"... It s possible that the reason Grandma is not trying to sneak solids into the baby is that she sees that he s growing nicely and is not crying with hunger.","messageBody":"<div id=\"ygrps-yiv-1746414671\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Vidyut Kale &lt;wide.aware@...&gt; wrote:<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; Without that earlier &quot;declaration of breastfeeding for 6 months at least&quot;<br/>\n&gt; and the ensuing flurry of advice, debates and what not, today, I would be<br/>\n&gt; getting stressed trying to keep the MIL from sneaking him tastes of solids,<br/>\n&gt; the husband from feeling pressured and unsure about what happens and when,<br/>\n&gt; myself from the pressure of breastfeeding a growing child till a certain<br/>\n&gt; date, rather than needs....<br/>\n<br/>\n </span></blockquote>It&#39;s possible that the reason Grandma is not trying to sneak solids into the baby is that she sees that he&#39;s growing nicely and is not crying with hunger. I&#39;d like you to ponder on this idea that perhaps the lack of trying to feed him solids has very little to do with your &quot;declaration&quot; and much more to do with the reality of a healthy growing baby. And perhaps if she see&#39;s him being hungry she&#39;ll try to feed him because she loves him. I do not want you to write here about whether this is possible or not. I want you to think about it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; That blog is mostly read by family and friends. It is a way<br/>\n&gt; of getting the word out, of removing the shame and illegitimacy of not going<br/>\n&gt; to school before my child is old enough to have pressure from these<br/>\n&gt; &#39;stigmas&#39; that forces him to conform.<br/>\n<br/>\n </span></blockquote>That stigma will go only when they see him learning things without going to school. My kids are 10 and 8 and when asked about how long I plan to homeschool, I continue to say things like &quot;we&#39;re taking it year by year&quot; or &quot;as long as it works&quot;. I believe that was the advice I got here or on UnschoolingDiscussion. Maybe next time I&#39;m in India, I&#39;ll bring over my children as &quot;proof&quot; :-)<br/>\n<br/>\nI think you have started a storm that need not have been started for two more years. Sometimes it&#39;s easier to slide into homeschooling by saying things like &quot;not this year... We&#39;re not quite ready...&quot; It may feel dishonest, but sometimes it&#39;s worth maintaining peace.<br/>\n<br/>\nManisha</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Choices, and living in balance","postDate":"1265479648","msgId":50501,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCNkRBRkUwLjUwOTA2MDNAbWFjLmNvbT4=","inReplyToHeader":"PDc5YzFkMWI0MTAwMjA1MjE0Mm0yOWNhMzNjOHhhY2Y1YzYyZmY5ZTc3MGZlQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDQ5QjJCRDFELTVDQzgtNEQ1MC05MjUyLTg5N0JCRjM3Rjc1MUBTYW5kcmFkb2RkLmNvbT4gPDc5YzFkMWI0MTAwMjA1MDk0MnI1NTU4MmJhYXFlMmFkZGM3MWRmZGZhMzQxQG1haWwuZ21haWwuY29tPiA8OTBGQTI4NkItMjYwMS00M0YwLUIwMDMtMTlCRERFMzFEMTcwQFNhbmRyYWRvZGQuY29tPiA8NzljMWQxYjQxMDAyMDUyMTQybTI5Y2EzM2M4eGFjZjVjNjJmZjllNzcwZmVAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":50499,"nextInTopic":50507,"prevInTime":50500,"nextInTime":50502,"topicId":50475,"numMessagesInTopic":0,"msgSnippet":"Sandra wrote: If a mother makes a decision the child needs to try to counteract, they re not partners.  ... If you agree, then the rest of what your wrote on","messageBody":"<div id=\"ygrps-yiv-1127389176\">Sandra wrote:<br/>\n<br/>\n&quot;If a mother makes a decision the child needs to try to counteract, they&#39;re<br/>\nnot partners. &quot;<br/>\n<br/>\nVidyut Kale wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I understand your concern that it is too early to decide his life for him<br/>\n&gt; and agree.<br/>\n </span></blockquote>If you agree, then the rest of what your wrote on at length about was <br/>\nsuperfluous.<br/>\n<br/>\nPlease note the use of the word &quot;If&quot; in both what Sandra wrote and what <br/>\nI wrote. Go back and read both our statements above, please.<br/>\n<br/>\nYou completely ignored the &quot;if&quot; and went on and on as if Sandra had <br/>\nsaid, to you, &quot;You will not be partners with your child.&quot;<br/>\n<br/>\nIf you read more carefully, you would maybe have said to yourself, &quot;Ah, <br/>\nSandra is pointing out that &#39;if&#39; I make a decision the child needs to <br/>\ntry to counteract....then I&#39;d be setting us up as adversaries, rather <br/>\nthan partners. That seems true &quot;IF&quot; I was doing that. I wonder if I am <br/>\nmaking decisions the child will feel he needs to counteract, later.&quot; And <br/>\nyou would PONDER that question, all by yourself, in your own head. And, <br/>\n&quot;IF&quot; you don&#39;t feel you&#39;re doing that, you&#39;ll just think, to yourself, <br/>\nthat you&#39;re not doing that, and you&#39;ll move on because it doesn&#39;t apply <br/>\nto YOU. And if, as you ponder, you think, &quot;I might be doing that, so I <br/>\nshould become more aware of the possibility,&quot; then it might apply to you <br/>\nand now you know it and you can move on with that understanding. And if, <br/>\nas you ponder, you think, &quot;Oh dear - that DOES apply to me and I should <br/>\nstop doing that,&quot; then you have become aware of a problem and you can <br/>\nchange it and move on.<br/>\n<br/>\nThe ONLY reason you would need to respond here on this list would be if <br/>\nyou wish to discuss the statement itself - the IDEA of whether or not <br/>\nthe statement makes sense or why it does or doesn&#39;t make sense - as an <br/>\nidea - not whether it applies to you, personally, in your own life. You <br/>\ndon&#39;t need to defend your own decisions here - those are yours to make.<br/>\n<br/>\nI&#39;ve noticed something about people who write in glowing ideals and in <br/>\nflowing and lovely imagery, that the thinking ability, their analytical <br/>\nability, can benefit a lot if they make a conscious decision to speak <br/>\nwith more simple clarity.  It is an exercise that is useful. The glowing <br/>\nidealism and beautiful imagery is wonderful for being inspiring - I&#39;m <br/>\nnot saying it is always a bad thing. I&#39;m saying that there is value to <br/>\nbe gained from going back to some of the stuff written like that and <br/>\nchopping it down to the bare minimum - find the logic, or lack of logic, <br/>\nin it. Some people don&#39;t read each word and go, instead, for an overall <br/>\nfeeling created by the stream of words. But this is a critical analysis <br/>\ndiscussion list and we ask that people try to use words carefully - <br/>\nwe&#39;re not looking for poetic writing here, but for logical thinking.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":326782993,"authorName":"Vidyut Kale","from":"Vidyut Kale &lt;wide.aware@...&gt;","profile":"vidyutgore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Choices, and living in balance","postDate":"1265434926","msgId":50499,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5YzFkMWI0MTAwMjA1MjE0Mm0yOWNhMzNjOHhhY2Y1YzYyZmY5ZTc3MGZlQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDkwRkEyODZCLTI2MDEtNDNGMC1CMDAzLTE5QkRERTMxRDE3MEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDQ5QjJCRDFELTVDQzgtNEQ1MC05MjUyLTg5N0JCRjM3Rjc1MUBTYW5kcmFkb2RkLmNvbT4JIDw3OWMxZDFiNDEwMDIwNTA5NDJyNTU1ODJiYWFxZTJhZGRjNzFkZmRmYTM0MUBtYWlsLmdtYWlsLmNvbT4JIDw5MEZBMjg2Qi0yNjAxLTQzRjAtQjAwMy0xOUJEREUzMUQxNzBAU2FuZHJhZG9kZC5jb20+"},"prevInTopic":50480,"nextInTopic":50501,"prevInTime":50498,"nextInTime":50500,"topicId":50475,"numMessagesInTopic":0,"msgSnippet":"If a mother makes a decision the child needs to try to counteract, they re not partners.  You seem to see this as a rather dishonest process of setting up","messageBody":"<div id=\"ygrps-yiv-718025388\">&quot;If a mother makes a decision the child needs to try to counteract, they&#39;re<br/>\nnot partners. &quot;<br/>\n<br/>\nYou seem to see this as a rather dishonest process of &quot;setting up&quot; the child<br/>\nfor something that will need counteracting for him to act from a place for<br/>\nfreedom. What is happening here is a process of sharing my resolve and my<br/>\nattitude on the subject of his education with people who play important<br/>\nroles in his life. It is completely here and now, and has nothing to do with<br/>\nwhat he decides, which will be his decision. I can&#39;t make it for him, and<br/>\nI&#39;m not making it for him.<br/>\n<br/>\nIn this case, what seems to you a decision the child will need to<br/>\ncounteract, to someone living in that situation is simply telling people to<br/>\nlay off the traditional discipline and milestones and teaching<br/>\nmerry-go-round and open their minds to the fact that there is something<br/>\ndifferent coming up, and that someone feels strongly about it. It is the act<br/>\nof putting it on the table, refusing to see it removed, talking about it,<br/>\ndescribing, sharing, challenging conventional views, sharing some ground<br/>\nrules that apply right now - school or not - freedom of learning, for<br/>\nexample - whether it is fist in drooly mouth or taking apart toy engines.<br/>\nIts like saying a lot of yes. Its an attitude change. They need to go<br/>\nthrough a process of acceptance with a drastically different idea. All the<br/>\nargument has provided a way for us to find a working merge of minds.<br/>\n<br/>\nI don&#39;t see this the same as making a decision the child needs to<br/>\ncounteract. Plans are plans, recommendations are recommendations, actions<br/>\nare actions. I had planned on exclusive breastfeeding for the first six<br/>\nmonths. The doctor recommends to give him a taste of light pureed stuff to<br/>\n&quot;get him used to it&quot;. What is actually playing out, and unanimously in the<br/>\nhouse is that he will show interest when he is ready. No disagreement,<br/>\nthough earlier there had been plenty. I see this possible only because we<br/>\ncan face storms head on when we spot them on the horizon rather than throw<br/>\nthe child around through conflicting actions by not looking at differences<br/>\nwhen we could.<br/>\n<br/>\nWithout that earlier &quot;declaration of breastfeeding for 6 months at least&quot;<br/>\nand the ensuing flurry of advice, debates and what not, today, I would be<br/>\ngetting stressed trying to keep the MIL from sneaking him tastes of solids,<br/>\nthe husband from feeling pressured and unsure about what happens and when,<br/>\nmyself from the pressure of breastfeeding a growing child till a certain<br/>\ndate, rather than needs.... We looked at all sides of the coin and arrived<br/>\ntogether at this place where he gets to breastfeed as long as possible,<br/>\nexclusively as long as he doesn&#39;t show interest in other stuff, or I have<br/>\nadequate milk, and feed him at whatever pace comes without stress.<br/>\n<br/>\nToday, there is movement from &quot;your mother is depriving you of education&quot; to<br/>\n&quot;Your mother has crazy ideas&quot;. I am hoping to see us being able to work to a<br/>\nplace of acceptance for what unfolds according to his desires. If rather<br/>\nthan declaring that he will not go to school, I say that he will go to<br/>\nschool only if he wants it, no one is going to accept it - &quot;kids have to<br/>\naccept grown up decisions&quot; is their mental model - he&#39;ll have the entire<br/>\nworld on his case trying to brainwash him into asking for school. If I do<br/>\nnothing about it, this storm is going to burst when he is capable of<br/>\nunderstanding the many words being thrown around about his future and his<br/>\nmother and with a decision to make riding on his neck, where he will be<br/>\nunder a lot of pressure to decide. I don&#39;t think it would be fair on him.<br/>\nMaybe I might be unintentionally making a decision he would have to<br/>\ncounteract, but he&#39;ll find plenty of support for that. On the other hand, if<br/>\nI left him to make it without even creating acceptance for the possibility,<br/>\nhe would be facing the storm right along with me.<br/>\n<br/>\nI think our cultures are different. I understand that in the west it is<br/>\ncommon for families to be completely autonomous and if others don&#39;t like,<br/>\nthey can stay away. It is not possible for me to alienate family, not just<br/>\nculturally, but I see it as a process of throwing the baby with the<br/>\nbathwater to let disagreements come in the way of a child getting that<br/>\nspecial relationship that grandparents bring in his life. Crazy, but equally<br/>\ntrue, I couldn&#39;t alienate them through anything I do - they will not get<br/>\nalienated either, just hurt. I must manage responses with minimal damage to<br/>\nmy child and everyone, and maximum possibilities left open.<br/>\n<br/>\nI understand your concern that it is too early to decide his life for him<br/>\nand agree. What is happening in that post you quoted is no decision on his<br/>\nlife, but a process of creating space for his freedom by getting the &#39;storm&#39;<br/>\nout of the way. That blog is mostly read by family and friends. It is a way<br/>\nof getting the word out, of removing the shame and illegitimacy of not going<br/>\nto school before my child is old enough to have pressure from these<br/>\n&#39;stigmas&#39; that forces him to conform.<br/>\n<br/>\nVidyut<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sat, Feb 6, 2010 at 1:40 AM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; -=-kids are supposed to be unpredictable<br/>\n&gt;<br/>\n&gt; (talk of oxymoron). I guess, if that is what he wants, it would be<br/>\n&gt; fine.-=-<br/>\n&gt;<br/>\n&gt; Kids aren&#39;t so unpredictable to people who know them well, but it<br/>\n&gt; seems a little early to decide his life for him. There&#39;s your vision<br/>\n&gt; for his life and there&#39;s your mother in law&#39;s, neither of which seems<br/>\n&gt; to be taking into consideration what he might want to do. But there&#39;s<br/>\n&gt; still time.<br/>\n&gt;<br/>\n&gt; The problem is that you&#39;ve created something to argue about when there<br/>\n&gt; was no reason to argue about it at all. And the argument came to<br/>\n&gt; this list, when there was no reason to argue about it at all anywhere.<br/>\n&gt;<br/>\n&gt; &quot;If that&#39;s what he wants&quot; isn&#39;t the problem. If a mother makes a<br/>\n&gt; decision the child needs to try to counteract, they&#39;re not partners.<br/>\n&gt; If the only way the child &quot;wins&quot; is to make a decision that goes<br/>\n&gt; against his mother&#39;s pre-stated preference, one wins and one loses.<br/>\n&gt; Being partners, waiting to get to know your child and see what he<br/>\n&gt; wants is a different world from setting a path (however traditional or<br/>\n&gt; radical) and then trying to steer him on it.<br/>\n&gt;<br/>\n&gt; It&#39;s putting the mother&#39;s needs and desires before the child&#39;s. It&#39;s<br/>\n&gt; not a good long range plan to make unschooling work well.<br/>\n&gt;<br/>\n&gt; Sandra<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Choices, and living in balance","postDate":"1265400642","msgId":50480,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkwRkEyODZCLTI2MDEtNDNGMC1CMDAzLTE5QkRERTMxRDE3MEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDc5YzFkMWI0MTAwMjA1MDk0MnI1NTU4MmJhYXFlMmFkZGM3MWRmZGZhMzQxQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDQ5QjJCRDFELTVDQzgtNEQ1MC05MjUyLTg5N0JCRjM3Rjc1MUBTYW5kcmFkb2RkLmNvbT4gPDc5YzFkMWI0MTAwMjA1MDk0MnI1NTU4MmJhYXFlMmFkZGM3MWRmZGZhMzQxQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":50477,"nextInTopic":50499,"prevInTime":50479,"nextInTime":50481,"topicId":50475,"numMessagesInTopic":0,"msgSnippet":"-=-kids are supposed to be unpredictable (talk of oxymoron). I guess, if that is what he wants, it would be fine.-=- Kids aren t so unpredictable to people who","messageBody":"<div id=\"ygrps-yiv-1679387902\">-=-kids are supposed to be unpredictable<br/>\n(talk of oxymoron). I guess, if that is what he wants, it would be  <br/>\nfine.-=-<br/>\n<br/>\nKids aren&#39;t so unpredictable to people who know them well, but it  <br/>\nseems a little early to decide his life for him.  There&#39;s your vision  <br/>\nfor his life and there&#39;s your mother in law&#39;s, neither of which seems  <br/>\nto be taking into consideration what he might want to do.  But there&#39;s  <br/>\nstill time.<br/>\n<br/>\nThe problem is that you&#39;ve created something to argue about when there  <br/>\nwas no reason to argue about it at all.   And the argument came to  <br/>\nthis list, when there was no reason to argue about it at all anywhere.<br/>\n<br/>\n&quot;If that&#39;s what he wants&quot; isn&#39;t the problem.  If a mother makes a  <br/>\ndecision the child needs to try to counteract, they&#39;re not partners.   <br/>\nIf the only way the child &quot;wins&quot; is to make a decision that goes  <br/>\nagainst his mother&#39;s pre-stated preference, one wins and one loses.   <br/>\nBeing partners, waiting to get to know your child and see what he  <br/>\nwants is a different world from setting a path (however traditional or  <br/>\nradical) and then trying to steer him on it.<br/>\n<br/>\nIt&#39;s putting the mother&#39;s needs and desires before the child&#39;s.  It&#39;s  <br/>\nnot a good long range plan to make unschooling work well.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":326782993,"authorName":"Vidyut Kale","from":"Vidyut Kale &lt;wide.aware@...&gt;","profile":"vidyutgore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Choices, and living in balance","postDate":"1265391733","msgId":50477,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5YzFkMWI0MTAwMjA1MDk0MnI1NTU4MmJhYXFlMmFkZGM3MWRmZGZhMzQxQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDQ5QjJCRDFELTVDQzgtNEQ1MC05MjUyLTg5N0JCRjM3Rjc1MUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDQ5QjJCRDFELTVDQzgtNEQ1MC05MjUyLTg5N0JCRjM3Rjc1MUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":50475,"nextInTopic":50480,"prevInTime":50476,"nextInTime":50478,"topicId":50475,"numMessagesInTopic":0,"msgSnippet":"Interesting take on my words. Leads to much reflection. Interesting the assumptions I already make on his behalf. I hadn t realized how they appear to someone","messageBody":"<div id=\"ygrps-yiv-1336226564\">Interesting take on my words. Leads to much reflection. Interesting the<br/>\nassumptions I already make on his behalf.<br/>\n<br/>\nI hadn&#39;t realized how they appear to someone who doesn&#39;t know me. I agree<br/>\nwith much of what you said. I&#39;m going to look like a fool if Nisarga wants<br/>\nto go to school. Its not impossible - kids are supposed to be unpredictable<br/>\n(talk of oxymoron). I guess, if that is what he wants, it would be fine.<br/>\nJust seems unlikely that a child would choose school over joining parents in<br/>\ntravel and adventure; play and computers. That would also be the end of my<br/>\nwanderlust days :D Or perhaps they have ended already, and I&#39;m just raising<br/>\nghosts...<br/>\n<br/>\nThe other possibility is that the little guy may not want to go to school,<br/>\nbut the outdoors could bore him... I&#39;d still be landed solidly home.<br/>\n<br/>\nThat would be then, and I imagine I&#39;d follow his choice of life adventure,<br/>\ncomplete with landing up at the same place day after day. At least that is<br/>\nthe intention.<br/>\n<br/>\nNo point getting into too many castles in the air for fun. What if unfun<br/>\npanned out? From experience, I know that I&#39;d go with the flow, but... it<br/>\nwouldn&#39;t be as much fun as &#39;my choice&#39;. Hmm...<br/>\n<br/>\nVidyut<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Choices, and living in balance","postDate":"1265387402","msgId":50475,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5QjJCRDFELTVDQzgtNEQ1MC05MjUyLTg5N0JCRjM3Rjc1MUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":50477,"prevInTime":50474,"nextInTime":50476,"topicId":50475,"numMessagesInTopic":0,"msgSnippet":"The discussion of choices is interesting, and isn t new, and will continue to come up forever, because there s always someone new to the idea. Part of being a","messageBody":"<div id=\"ygrps-yiv-126566794\">The discussion of choices is interesting, and isn&#39;t new, and will  <br/>\ncontinue to come up forever, because there&#39;s always someone new to the  <br/>\nidea.<br/>\n<br/>\nPart of being a child&#39;s partner, in my opinion and experience, is not  <br/>\ndeciding years in advance what that child will or won&#39;t want to do.   <br/>\nWe can have hopes and dreams, but can we make declarations?  I would  <br/>\nlike for Marty to never smoke cigarettes, but his girlfriend smokes,  <br/>\nand he has occasionally.  If he starts to smoke, can I still love  <br/>\nhim?  It depends in part how strongly I&#39;ve stated my objections or  <br/>\nprejudices or intentions.<br/>\n<br/>\nThis is a quote made anonymous.  I&#39;m using my own son&#39;s name in the  <br/>\nspot of someone else&#39;s.<br/>\n<br/>\n&quot;Okay, its world war three, and as usual, I’m in the thick of things.  <br/>\nThis time, it is the declaration that Marty will not go to school. &quot;<br/>\n<br/>\nLet&#39;s say the for discussion purposes, Marty is less than a year old.<br/>\n<br/>\nSomeone asked me to explain, a week or so ago, what I meant when I  <br/>\nsaid negativity was bad for children.  If it&#39;s &quot;world war  <br/>\nthree&quot; (figuratively speaking) and the mom is, as usual, in the thick  <br/>\nof things, how much peace can Marty be having?<br/>\n<br/>\nWe started unschooling when Marty was two and a half.  Kirby was newly  <br/>\nfive.  When people asked about it, we said Kirby wasn&#39;t going to  <br/>\nschool, but Marty might, later, if he wanted to.  We figured Marty  <br/>\nmight want to.<br/>\n<br/>\nThat wasn&#39;t a decision I made for Marty two years or four years in  <br/>\nadvance.  And it was NOT world war three!  It was happy Kirby and  <br/>\nMarty world. It was moment by moment sweetness that was not all about  <br/>\nme and what I wanted.<br/>\n<br/>\nWhat came of that, over days and months and years was that each of my  <br/>\nchildren chose to stay home with me.  Not one of them could have  <br/>\nchosen that if he or she hadn&#39;t had any choice.<br/>\n<br/>\nAt the heart of what we&#39;re talking about--all this unschooling, all  <br/>\nthis parenting, is the deep value of partnership and choices.<br/>\n<br/>\n<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":50544,"nextTopicId":50514}}