{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":43907726,"authorName":"Tia Graham","from":"Tia Graham &lt;sixredheads@...&gt;","profile":"clarasmommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Sandra, on neighbor","postDate":"1065315527","msgId":82096,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMDA0LjIxMDExMC4tNzI4MjkzLjQuc2l4cmVkaGVhZHNAanVuby5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":82095,"nextInTime":82097,"topicId":82096,"numMessagesInTopic":0,"msgSnippet":"A little more about the neighbor situation.... ","messageBody":"<div id=\"ygrps-yiv-1710780496\">A little more about the neighbor situation....<br/>\n&lt;&lt;Maybe he doens&#39;t know how because he&#39;s not seen it done, or he&#39;s just<br/>\nnot <br/>\ngood at it, or he hates school and school books so much he can&#39;t stand to<br/>\nlook at <br/>\nthem for one second he doesn&#39;t have to.<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>That was exactly my point. His mother though, insists he is lazy and<br/>\ncareless.<br/>\n<br/>\n&lt;&lt;&lt;<br/>\n&lt;&lt;I was thinking that this kid missing an assignment or two just might be<br/>\nthe example he needs to live through in order to discover it&#39;s important<br/>\nto keep up with things well.&gt;&gt;<br/>\n<br/>\nThis sounds vindictive.  Traditionally punitive and anti-child.&gt;&gt;&gt;]<br/>\n<br/>\nNope. I&#39;m FAR from anti-child OR vindictive. This kid has never<br/>\nexperienced that balling up papers in  your locker results in lost stuff<br/>\nand suffered grades. It&#39;s not a connection his brain makes. I was<br/>\nthinking it was possible that be allowed to make this connection might be<br/>\nthe very thing that gives him that &quot;aha&quot; moment. Or maybe not. The point<br/>\nis, right now, he doens&#39;t get it and mom is spinning her wheels.<br/>\n<br/>\n&lt;&lt;&lt;&lt;Or maybe he doens&#39;t care at all<br/>\nand they both need to face that. But her doing it for him, in order to<br/>\nkeep him from facing any sorrow (and ruining his afternoon fun) isn&#39;t<br/>\nresulting in anything but a continuance of frustration on her part. She&#39;s<br/>\ngetting madder and he&#39;s getting messier. &gt;&gt;<br/>\n<br/>\nSounds like you&#39;re madder than she is, if she laughed, and she did it <br/>\nvoluntarily.  <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n<br/>\n </span></blockquote>I am a little bugged she is so blind to what she&#39;s really doing. She also<br/>\nlaughed about how she kept him up to 11:30, pulled his hair, and kept him<br/>\nfrom having supper until all those balled up papers were in his organizer<br/>\nand all assignments done. To her, mising an assignment is worse than a<br/>\nnight like that with Mom. She thinks she&#39;s doing him a favor....but what<br/>\nshe&#39;s doing is *not* going to result in him becoming a neat person. <br/>\n<br/>\n&lt;&lt;Maybe he doesn&#39;t care.  <br/>\nMaybe she DOES want him to have unruined afternoon fun and lack of<br/>\nsorrow.  <br/>\nSchool is sorrow enough.  <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n<br/>\n </span></blockquote>He doesn&#39;t care about school and yes, it is sorrow for him. He asks to be<br/>\nkept home and she&#39;s debating it. However, I don&#39;t always support her on<br/>\nthat. She&#39;s so controlling of everything that they do that I doubt they&#39;d<br/>\nbe happier at home. And he got his ruined afternoon, but not in her eyes.<br/>\nTo her, she was saving him an &quot;F&quot;. When she was young, that was her worst<br/>\nfear. He could care less about grades.<br/>\n<br/>\n&lt;&lt;&lt;&lt; And clean dishes to eat from are important to me. My family isn&#39;t<br/>\nold enough to clean thier own, or I&#39;d just wash my own and let them work<br/>\nout for themselves what was important to them. &gt;&gt;<br/>\n<br/>\nWould you want them to get old enough to just wash their own and never<br/>\nwash <br/>\nyours or the rest of the family&#39;s?  Generosity will gain more generosity<br/>\nthan <br/>\nmeasuring and scheduling and drawing lines can.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n<br/>\n </span></blockquote>When my kids are too busy to get to something they typically care for<br/>\nthemselves, and I have a minute, I have absolutely no problem helping<br/>\nthem out. Right now, they like clean rooms but don&#39;t like to clean them<br/>\nthemselves. They know I&#39;ve offered to come in once a week and help them<br/>\npick it up. I&#39;m here to help. I do believe that attitude will lead to<br/>\nhaving adults that will help. They do it now...laundry will get cycled<br/>\nwithout me asking and volunteers will crop up here and there for floors<br/>\nor dishes. It&#39;s very random but they are young. My comment above was<br/>\nspeaking of the future...when we are a house full of near adults, I<br/>\nreally don&#39;t think any one person will in charge of one complete job,<br/>\nlike the dishes, unless we as a family decided on such a thing. I do it<br/>\nnow because it&#39;s my job as mom. When they are grown, they may prefer me<br/>\nto spend my energy in other helping ways, and take care of their own<br/>\ndishes themselves. We will find something that works. But it won&#39;t be<br/>\nbecause we arent&#39; generous enough to one another.<br/>\n<br/>\nTia in Fl<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":81964,"nextTopicId":82097}}