{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":12,"messages":[{"userId":241447822,"authorName":"thecugals","from":"&quot;thecugals&quot; &lt;thecugals@...&gt;","profile":"thecugals","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Hello and Goodbye, and sharing +reactions","postDate":"1291362323","msgId":58256,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlkYTc2aithNDI2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ0QTI5QUQzLUEzNUEtNDhFQS1BRTcyLTBENkU2NjU5OTcyN0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":58244,"nextInTopic":0,"prevInTime":58255,"nextInTime":58257,"topicId":58181,"numMessagesInTopic":0,"msgSnippet":"... --Sometimes people want to communicate wordlessly and they don t want to talk about it!  Maybe even kids should have the right not to be cross-examined","messageBody":"<div id=\"ygrps-yiv-162190740\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n--Sometimes people want to communicate wordlessly and they don&#39;t want to talk about it!  Maybe even kids should have the right not to be cross-examined about their decisions sometimes.--<br/>\n<br/>\nThat&#39;s true--I was just thinking about what works well in our own family.  My son generally loves talking about things that are bothering him.  And he likes to be understood and respected.  Sometimes I DON&#39;T understand him without asking clarifying questions.  I didn&#39;t mean anyone should be cross-examined.  The OP seemed to think her son dressing the way he did was an act of defiance or simply reactionary.  I just thought it was a good idea not to assume either of those things.  Maybe if she had asked him about how he dressed he would have said, &quot;I always get so hot in that restaurant.&quot;<br/>\n<br/>\nBeth </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Hello and Goodbye, and sharing +reactions","postDate":"1291311933","msgId":58244,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ0QTI5QUQzLUEzNUEtNDhFQS1BRTcyLTBENkU2NjU5OTcyN0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlkN2kyOCtjM2hpQGVHcm91cHMuY29tPg==","referencesHeader":"PGlkN2kyOCtjM2hpQGVHcm91cHMuY29tPg=="},"prevInTopic":58242,"nextInTopic":58256,"prevInTime":58243,"nextInTime":58245,"topicId":58181,"numMessagesInTopic":0,"msgSnippet":"-=-I think the best thing to do would be to ask him. Like, Did you want to dress that way because you didn t want to go out? My son, Calvin, 13, is sometimes","messageBody":"<div id=\"ygrps-yiv-1829083114\">-=-I think the best thing to do would be to ask him. Like, &quot;Did you want to dress that way because you didn&#39;t want to go out?&quot; My son, Calvin, 13, is sometimes hard to figure out. My husband and I will sometimes misinterpret his actions or words and it can take a long time for us to truly understand what&#39;s really going on.-=-<br/>\n<br/>\nSometimes people want to communicate wordlessly and they don&#39;t want to talk about it!<br/>\nMaybe even kids should have the right not to be cross-examined about their decisions sometimes.<br/>\n<br/>\nSome kids are verbal and some aren&#39;t.  Lots of people aren&#39;t on a list like this (or come and leave) because they don&#39;t like people asking them what they&#39;re thinking and why they did what they did, or wrote what they wrote.  Naturally, some people DO like it and stay.  But we should remember not all people are that way.<br/>\n<br/>\nRather than ask the child to explain himself, perhaps the parents could learn from the situation to make sure he understands where and why and what he should wear if it&#39;s important enough to the parents.<br/>\n<br/>\n--**The conversation that night was; to ignore how your body feels in reaction to an old rule or to rebel against going to dinner by wearing clothes that are not reasonable choices and leave you uncomfortable is just a reaction to an old rule, not unschooling.**--<br/>\n<br/>\n-=-That is a very good point, but to your son it could have sounded preachy or blaming. Your son may not be anything like mine, but in the past I have also made some good points that just made him feel worse about himself or me. Nowadays I try very, very hard to say something like this instead: &quot;I know that I had a lot of rules in the past, but I really hope you won&#39;t make yourself uncomfortable because you&#39;re reacting to an old rule. And I hope we can always work together to solve any problems we&#39;re having.&quot;-=-<br/>\n<br/>\nToo many words for most boys.  Not all.  Some are wordy.<br/>\n<br/>\nSometimes the parents should watch and wait and try a different approach the next time.  Being partners, like being dance partners, sometimes you need to accept that the other person did something you didn&#39;t expect, and so anticipate that possibility the next time, but not as an adversary, as a team member.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":336246301,"authorName":"NCMama","from":"&quot;NCMama&quot; &lt;dharmamama1@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Hello and Goodbye, and sharing +reactions","postDate":"1291299256","msgId":58242,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlkODlqbys1MGxqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlkN2kyOCtjM2hpQGVHcm91cHMuY29tPg=="},"prevInTopic":58233,"nextInTopic":58244,"prevInTime":58241,"nextInTime":58243,"topicId":58181,"numMessagesInTopic":0,"msgSnippet":"... Why interpret at all? Why should choosing shorts on a cold day mean defiance? Maybe... he just wanted to wear shorts. My youngest doesn t like jackets,","messageBody":"<div id=\"ygrps-yiv-2031425518\">~~~&gt; --When we came home it came out he didn&#39;t want to go to dinner so I guess the clothing choices were based on his desire to stay home and not go out? I don&#39;t know. It just seemed defiant and unreasonable.--<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I think the best thing to do would be to ask him.  Like, &quot;Did you want to dress that way because you didn&#39;t want to go out?&quot;  My son, Calvin, 13, is sometimes hard to figure out.  My husband and I will sometimes misinterpret his actions or words and it can take a long time for us to truly understand what&#39;s really going on.~~~<br/>\n<br/>\n<br/>\n </span></blockquote>Why interpret at all? Why should choosing shorts on a cold day mean defiance? Maybe... he just wanted to wear shorts. My youngest doesn&#39;t like jackets, never has. Sometimes he&#39;s cold because he&#39;s chosen to not bring one - I usually bring a backup, or yesterday, he wore my sweater while I wore my jacket. I don&#39;t think his not wearing a jacket is defiant, or unreasonable; it&#39;s a choice he&#39;s making.<br/>\n<br/>\nEven if you&#39;re coming from a more controlling background, you really don&#39;t have to look for &quot;meaning&quot; in your son&#39;s choices. You don&#39;t have to talk about reacting toward rules... things will even out over time IF you honor him, IF you stop making him go places he doesn&#39;t want to, IF you let go even more, and accept even more.<br/>\n<br/>\nDon&#39;t make such a big deal out his choices. Speak up if the clothes are *truly* inappropriate for where you&#39;re going, but other than that, love him, love his choices, don&#39;t question them.<br/>\n<br/>\nYou might mention - &#39;It&#39;s pretty cold out, do you want to bring long pants in case you get cold?&#39; Or, actually, *I&#39;d* just bring the pants, because any suggestion will sound like controlling if you&#39;re coming from a controlling past. Which I know is what you did, but then you questioned his choice later. I wouldn&#39;t make any kind of big deal about it. Assume positive intent. Let him make choices you wouldn&#39;t make, with your full support.<br/>\n<br/>\nPoor guy can&#39;t even choose his own clothes without getting the third degree! I know you&#39;re coming from a place of caring, of wanting to make amends... the best amends you can make is acceptance, and not repeating old mistakes. It will take time for him to heal from being controlled - let him do that in his own way! It&#39;s not wrong to react against rules, it&#39;s part of his process. Let him have his own process.<br/>\n<br/>\nWhen Sandra wrote, &quot;We shouldn&#39;t be living by rules, nor by an opposite version of the rules. That&#39;s reactionary&quot;, she was talking to the Mom! It doesn&#39;t mean you need to stop your child from being reactionary. YOU can stop giving him things to react against, and YOU can choose to not live by opposite rules. <br/>\n<br/>\nTo talk to your son as if his clothing choice was &quot;wrong&quot; (which, I imagine, is how he would take it) is STILL being controlling, even if you&#39;re wanting to find out his thought process. Accept, accept, accept - and watch, and connect, and get to know your son. You&#39;ll soon be able to know even better when things are not flowing.<br/>\n<br/>\npeace,<br/>\nCaren</div>","specialLinks":[]},{"userId":241447822,"authorName":"thecugals","from":"&quot;thecugals&quot; &lt;thecugals@...&gt;","profile":"thecugals","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Hello and Goodbye, and sharing +reactions","postDate":"1291275144","msgId":58233,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlkN2kyOCtjM2hpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGk9YWl4Y3Y1RUV1UXJrUTJDdFpnZncxOT1teT1CY0ZhWWpHWHNZbkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":58198,"nextInTopic":58242,"prevInTime":58232,"nextInTime":58234,"topicId":58181,"numMessagesInTopic":0,"msgSnippet":"--Now how to I talk to a 9 year old boy about it?-- --When we came home it came out he didn t want to go to dinner so I guess the clothing choices were based","messageBody":"<div id=\"ygrps-yiv-1945783621\">--Now how to I talk to a 9 year old boy about it?--<br/>\n<br/>\n--When we came home it came out he didn&#39;t want to go to dinner so I guess the clothing choices were based on his desire to stay home and not go out? I don&#39;t know. It just seemed defiant and unreasonable.--<br/>\n<br/>\nI think the best thing to do would be to ask him.  Like, &quot;Did you want to dress that way because you didn&#39;t want to go out?&quot;  My son, Calvin, 13, is sometimes hard to figure out.  My husband and I will sometimes misinterpret his actions or words and it can take a long time for us to truly understand what&#39;s really going on.<br/>\n<br/>\n--We have talked before that unschooling isn&#39;t do whatever you want, whenever you want...--<br/>\n<br/>\n--The conversation that night was; to ignore how your body feels in reaction to an old rule or to rebel against going to dinner by wearing clothes that are not reasonable choices and leave you uncomfortable is just a reaction to an old rule, not unschooling.--<br/>\n<br/>\nThat is a very good point, but to your son it could have sounded preachy or blaming.  Your son may not be anything like mine, but in the past I have also made some good points that just made him feel worse about himself or me.  Nowadays I try very, very hard to say something like this instead:  &quot;I know that I had a lot of rules in the past, but I really hope you won&#39;t make yourself uncomfortable because you&#39;re reacting to an old rule.  And I hope we can always work together to solve any problems we&#39;re having.&quot;<br/>\n<br/>\nBeth</div>","specialLinks":[]},{"userId":454093105,"authorName":"lalow","from":"&quot;lalow&quot; &lt;lalougor@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Hello and Goodbye, and sharing +reactions","postDate":"1290549438","msgId":58198,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGljaGRidSszM2g1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDUyQzg0NjU1LUJGMTAtNDg5Ny1BNTdBLTc4MUNGMDJGM0IwNUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":58197,"nextInTopic":58233,"prevInTime":58197,"nextInTime":58199,"topicId":58181,"numMessagesInTopic":0,"msgSnippet":"... it seems like often when people dont feel in control of a situation or feel they have no say in something, they will take control of something they know","messageBody":"<div id=\"ygrps-yiv-895717279\"><blockquote><span title=\"ireply\">&gt; -=-When we came home it came<br/>\n&gt; out he didn&#39;t want to go to dinner so I guess the clothing choices were<br/>\n&gt; based on his desire to stay home and not go out? I don&#39;t know. It just<br/>\n&gt; seemed defiant and unreasonable.-=-<br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>it seems like often when people dont feel in control of a situation or feel they have no say in something, they will take control of something they know they have control of.  perhaps he didnt feel he would be heard if he said he didnt want to go, he may have even not wanted to disappoint you but would still rather have stayed home but putting those clothes on gave him control over something again.  Alot of people react this way, adults and kids.</div>","specialLinks":[]},{"userId":263488403,"authorName":"hmbpie","from":"&quot;hmbpie&quot; &lt;heatherpie@...&gt;","profile":"hmbpie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Hello and Goodbye, and sharing +reactions","postDate":"1290536544","msgId":58197,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGljaDBwMCtqcnZ2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGljZ2xwditsY3U5QGVHcm91cHMuY29tPg=="},"prevInTopic":58193,"nextInTopic":58198,"prevInTime":58196,"nextInTime":58198,"topicId":58181,"numMessagesInTopic":0,"msgSnippet":"We have been getting along so great and the household has been so happy and connected lately that I am disappointed in myself for the other night.  We were","messageBody":"<div id=\"ygrps-yiv-177292191\">We have been getting along so great and the household has been so happy and connected lately that I am disappointed in myself for the other night.  We were making some great steps forward and I feel I just made us step backwards.  I was feeling very needy and PMS-y but I don&#39;t know why I didn&#39;t stop for a minute and think and breathe because I have actually been doing a good job of stopping and thinking and breathing lately.  <br/>\n<br/>\nI have been reading a lot since we started de-schooling.  I have noticed lately that it feels passive when I read.  Like I&#39;m overloaded with info and not absorbing so I stopped reading for a week. Last week.  I think even when it feels passive it is still keeping me on track and maybe I&#39;m not ready to stop reading so much.  I also haven&#39;t been hanging out with un-schoolers as much the past couple weeks due to new video games coming in the mail and now a cold. Maybe I should get an un-school phone buddy to talk to when we aren&#39;t getting out and being around unschoolers as much.  <br/>\n<br/>\nThanks guys and gals.  I really appreciate you taking the time.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Heather Booth &lt;heatherpie@&gt; wrote:<br/>\n&gt; &gt;All night I just kept thinking, &quot;OK where did the train go off<br/>\n&gt; &gt; the tracks?  Where did I mess up?&quot;<br/>\n&gt; <br/>\n&gt; It sounds like y&#39;all are still deschooling, so a certain amount of resistant/rebellious behavior from your son is going to be normal for awile - he doesn&#39;t yet trust you to be his ally and partner.<br/>\n&gt; <br/>\n&gt; &gt;When we came home it came<br/>\n&gt; &gt; out he didn&#39;t want to go to dinner so I guess the clothing choices were<br/>\n&gt; &gt; based on his desire to stay home and not go out? <br/>\n&gt; <br/>\n&gt; And right now, he doesn&#39;t trust that saying &quot;I don&#39;t want to go&quot; will get him anywhere. Did you ask him if he wanted to go, or was this all planned around him, and his attendance was simply expected? If he wasn&#39;t involved and you didn&#39;t look for ways to help him deal with a situation that might be dull or otherwise uncomfortable for him, then its natural he&#39;d be cranky about that. Next time, it would be better to check in before you leave the house, and if he isn&#39;t thrilled about going and you don&#39;t want to cancel, look for ways to make the experience more pleasant for him - bring books and games, offer to stop somewhere fun for him, too, so going out isn&#39;t just some annoying parentally imposed chore. Going out should be something he can look forward to, not dread and try to &quot;get back at you&quot; for making him suffer through. <br/>\n&gt; <br/>\n&gt; Working on being more sensitive to his needs overall. He won&#39;t be able to tell you what they are for awhile. My 17yo, after four years of radical unschooling, still doesn&#39;t always let me know what his needs are - he learned too well to stuff them down! So I work on being extra sensitive to his possible needs, and offer extra kindness. <br/>\n&gt; <br/>\n&gt; ---Meredith<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Hello and Goodbye, and sharing +reactions","postDate":"1290525311","msgId":58193,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGljZ2xwditsY3U5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGk9YWl4Y3Y1RUV1UXJrUTJDdFpnZncxOT1teT1CY0ZhWWpHWHNZbkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":58191,"nextInTopic":58197,"prevInTime":58192,"nextInTime":58194,"topicId":58181,"numMessagesInTopic":0,"msgSnippet":"... It sounds like y all are still deschooling, so a certain amount of resistant/rebellious behavior from your son is going to be normal for awile - he doesn t","messageBody":"<div id=\"ygrps-yiv-1151277733\">Heather Booth &lt;heatherpie@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;All night I just kept thinking, &quot;OK where did the train go off<br/>\n&gt; the tracks?  Where did I mess up?&quot;<br/>\n<br/>\n </span></blockquote>It sounds like y&#39;all are still deschooling, so a certain amount of resistant/rebellious behavior from your son is going to be normal for awile - he doesn&#39;t yet trust you to be his ally and partner.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;When we came home it came<br/>\n&gt; out he didn&#39;t want to go to dinner so I guess the clothing choices were<br/>\n&gt; based on his desire to stay home and not go out? <br/>\n<br/>\n </span></blockquote>And right now, he doesn&#39;t trust that saying &quot;I don&#39;t want to go&quot; will get him anywhere. Did you ask him if he wanted to go, or was this all planned around him, and his attendance was simply expected? If he wasn&#39;t involved and you didn&#39;t look for ways to help him deal with a situation that might be dull or otherwise uncomfortable for him, then its natural he&#39;d be cranky about that. Next time, it would be better to check in before you leave the house, and if he isn&#39;t thrilled about going and you don&#39;t want to cancel, look for ways to make the experience more pleasant for him - bring books and games, offer to stop somewhere fun for him, too, so going out isn&#39;t just some annoying parentally imposed chore. Going out should be something he can look forward to, not dread and try to &quot;get back at you&quot; for making him suffer through. <br/>\n<br/>\nWorking on being more sensitive to his needs overall. He won&#39;t be able to tell you what they are for awhile. My 17yo, after four years of radical unschooling, still doesn&#39;t always let me know what his needs are - he learned too well to stuff them down! So I work on being extra sensitive to his possible needs, and offer extra kindness. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Hello and Goodbye, and sharing +reactions","postDate":"1290522115","msgId":58191,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUyQzg0NjU1LUJGMTAtNDg5Ny1BNTdBLTc4MUNGMDJGM0IwNUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEFBTkxrVGk9YWl4Y3Y1RUV1UXJrUTJDdFpnZncxOT1teT1CY0ZhWWpHWHNZbkBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGk9YWl4Y3Y1RUV1UXJrUTJDdFpnZncxOT1teT1CY0ZhWWpHWHNZbkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":58189,"nextInTopic":58193,"prevInTime":58190,"nextInTime":58192,"topicId":58181,"numMessagesInTopic":0,"msgSnippet":"-=-When we came home it came out he didn t want to go to dinner so I guess the clothing choices were based on his desire to stay home and not go out? I don t","messageBody":"<div id=\"ygrps-yiv-1350019231\">-=-When we came home it came<br/>\nout he didn&#39;t want to go to dinner so I guess the clothing choices were<br/>\nbased on his desire to stay home and not go out? I don&#39;t know. It just<br/>\nseemed defiant and unreasonable.-=-<br/>\n<br/>\n&quot;Defiance&quot; is a reaction to something.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/rebellion\">http://sandradodd.com/rebellion</a><br/>\n<br/>\n-=-We have talked before that unschooling isn&#39;t do whatever you want,  <br/>\nwhenever<br/>\nyou want and ignore rules that exist outside our house.-=-<br/>\n<br/>\nSure, but there&#39;s not a rule outside your house about going to dinner  <br/>\nor wearing warm clothes.<br/>\n<br/>\nParenting, for unschoolers, isn&#39;t doing whatever you want, whenever  <br/>\nyou want, ignoring the principles behind mindful parenting.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/mindfulparenting\">http://sandradodd.com/mindfulparenting</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/parentingpeacefully\">http://sandradodd.com/parentingpeacefully</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Hello and Goodbye, and sharing +reactions","postDate":"1290515107","msgId":58189,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU4N0MzRTFGLTMyMjItNEJDNi05RjdGLTA4RTYyQTlEQ0JGQUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGljZjR1aStuYWV0QGVHcm91cHMuY29tPg==","referencesHeader":"PGljZjR1aStuYWV0QGVHcm91cHMuY29tPg=="},"prevInTopic":58188,"nextInTopic":58191,"prevInTime":58188,"nextInTime":58190,"topicId":58181,"numMessagesInTopic":0,"msgSnippet":"-=- I don t want a Nobody s happy if mama ain t happy household which, is what happened this weekend.-=- And the major part of that phrase is always","messageBody":"<div id=\"ygrps-yiv-734107425\">-=- I don&#39;t want a &quot;Nobody&#39;s happy if mama ain&#39;t happy&quot; household  <br/>\nwhich, is what happened this weekend.-=-<br/>\n<br/>\nAnd the major part of that phrase is always &quot;nobody&#39;s happy.&quot;   It  <br/>\nnever makes for an &quot;everybody&#39;s happy if mama&#39;s happy&quot; outcome.  It  <br/>\nturns out it&#39;s one of those put-down phrases used to make other people  <br/>\nfeel bad, and to justify selfish behavior.<br/>\n<br/>\nThere are quite a few such phrases.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/phrases\">http://sandradodd.com/phrases</a><br/>\n<br/>\nAny time that what you&#39;re saying or thinking is a cliche or a quote,  <br/>\nstop and rephrase it into your own words.  If you can&#39;t, then you&#39;re  <br/>\nnot really thinking clearly or thinking for yourself.  You&#39;re letting  <br/>\nfloaty thoughts justify your emotions.<br/>\n<br/>\nThis might help too:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/being\">http://sandradodd.com/being</a><br/>\nand possibly<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/joy\">http://sandradodd.com/joy</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":263488403,"authorName":"hmbpie","from":"&quot;hmbpie&quot; &lt;heatherpie@...&gt;","profile":"hmbpie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Hello and Goodbye, and sharing +reactions","postDate":"1290475282","msgId":58188,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGljZjR1aStuYWV0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBRjEyNTU3LTU3MTAtNEZEQS04N0E3LUY0ODE4NTJCNDE5RkBjb21jYXN0Lm5ldD4="},"prevInTopic":58185,"nextInTopic":58189,"prevInTime":58187,"nextInTime":58189,"topicId":58181,"numMessagesInTopic":0,"msgSnippet":"=If he didn t, (have a choice) and he didn t feel comfortable saying so, it was a creative choice to get you to notice.= He didn t have a choice whether to go","messageBody":"<div id=\"ygrps-yiv-357176836\">=If he didn&#39;t, (have a choice) and he didn&#39;t feel comfortable saying so, it was a creative choice to get you to notice.=<br/>\n<br/>\nHe didn&#39;t have a choice whether to go or not.  I asked if he would give me this night.  I wanted to go out.  I didn&#39;t want to cancel with our friends.  He did state he didn&#39;t want to go.   I wasn&#39;t assuming anything.  I wanted to go and that was it! (stomps foot)<br/>\n<br/>\n=Were there rules in then this instance?=<br/>\n<br/>\nNo.  He could wear what he wanted and did.  I brought things for him in case he got cold.  We brought a small backpack with paper, pencils, iPad and iPod to try to make it as painless as possible for him.<br/>\n<br/>\n=Is he still deschooling? Maybe give him a break. Maybe ask him next time instead of assuming.=<br/>\n<br/>\nWe are still deschooling and I guess this week I have been feeling the heavy weight of not leaving the house very often.  We had a sitter and she had to cancel due to illness.  We are new to the area so we don&#39;t have as many options as we did back home as far as sitters go.  So, honestly it was all about me and my desire to get out of the house, put on some make-up and outside clothes and talk about something other than LBP or Spiderman.  I tried to make a good deal but they were all shot down and in the end I decided I just didn&#39;t care.  &quot;I&quot; wanted to go.  <br/>\n<br/>\nLooking at the calendar it is apparent why I have been so unwavering and anxious the past couple days.  I need to be more aware and ask for more help from my husband when I am feeling emotionally needy and desperate for me time then I won&#39;t have to get to the point where I feel like I am going to lose my mind if I don&#39;t get out of the house and take it out on my family.  I&#39;ve just felt trapped and was having a very selfish moment. <br/>\n<br/>\n=You haven&#39;t been unschooling very long. I think you&#39;re expecting too much. You haven&#39;t given the train much of a chance to stay on the tracks.=<br/>\n<br/>\nI think you are right.  I think I also need to read a little about neediness and the kind of relationship I want to have with my family because I don&#39;t want a &quot;Nobody&#39;s happy if mama ain&#39;t happy&quot; household which, is what happened this weekend.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Robin Bentley &lt;robin.bentley@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; We had a situation the other night where we were all going out to  <br/>\n&gt; &gt; dinner.<br/>\n&gt; <br/>\n&gt; &gt;   When we came home it came<br/>\n&gt; &gt; out he didn&#39;t want to go to dinner so I guess the clothing choices  <br/>\n&gt; &gt; were<br/>\n&gt; &gt; based on his desire to stay home and not go out?<br/>\n&gt; <br/>\n&gt; It&#39;s possible, especially if he didn&#39;t have a say in whether he wanted  <br/>\n&gt; to go out for dinner. If he didn&#39;t, and he didn&#39;t feel comfortable  <br/>\n&gt; saying so, it was a creative choice to get you to notice.<br/>\n&gt; <br/>\n&gt; &gt; I don&#39;t know.  It just<br/>\n&gt; &gt; seemed defiant and unreasonable.<br/>\n&gt; <br/>\n&gt; You could see it that way. Or not.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; We have talked before that unschooling isn&#39;t do whatever you want,  <br/>\n&gt; &gt; whenever<br/>\n&gt; &gt; you want and ignore rules that exist outside our house.<br/>\n&gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt;  It isn&#39;t the<br/>\n&gt; &gt; complete opposite of what we were doing.  The conversation that night<br/>\n&gt; &gt; was; to ignore how your body feels in reaction to an old rule or to  <br/>\n&gt; &gt; rebel<br/>\n&gt; &gt; against going to dinner by wearing clothes that are not reasonable  <br/>\n&gt; &gt; choices<br/>\n&gt; &gt; and leave you uncomfortable is just a reaction to an old rule, not<br/>\n&gt; &gt; unschooling.<br/>\n&gt; <br/>\n&gt; &gt; Is he still deschooling? Maybe give him a break. Maybe ask him next  <br/>\n&gt; time instead of assuming.<br/>\n<br/>\n&gt; &gt; All night I just kept thinking, &quot;OK where did the train go off<br/>\n&gt; &gt; the tracks?  Where did I mess up?&quot;<br/>\n&gt; <br/>\n&gt; You haven&#39;t been unschooling very long. I think you&#39;re expecting too  <br/>\n&gt; much. You haven&#39;t given the train much of a chance to stay on the  <br/>\n&gt; tracks.<br/>\n&gt; <br/>\n&gt; &quot;Read a little, try a little, wait a while, watch.&quot;<br/>\n&gt; <br/>\n&gt; Robin B.<br/>\n&gt; &gt;<br/>\n&gt; &gt; -- <br/>\n&gt; &gt; nobody makes a greater mistake than he who did nothing because he  <br/>\n&gt; &gt; could do<br/>\n&gt; &gt; only a little. - edmund burke<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; [Non-text portions of this message have been removed]<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; ------------------------------------<br/>\n&gt; &gt;<br/>\n&gt; &gt; Yahoo! Groups Links<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Hello and Goodbye, and sharing +reactions","postDate":"1290471529","msgId":58185,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRjEyNTU3LTU3MTAtNEZEQS04N0E3LUY0ODE4NTJCNDE5RkBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PEFBTkxrVGk9YWl4Y3Y1RUV1UXJrUTJDdFpnZncxOT1teT1CY0ZhWWpHWHNZbkBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGk9YWl4Y3Y1RUV1UXJrUTJDdFpnZncxOT1teT1CY0ZhWWpHWHNZbkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":58181,"nextInTopic":58188,"prevInTime":58184,"nextInTime":58186,"topicId":58181,"numMessagesInTopic":0,"msgSnippet":"... It s possible, especially if he didn t have a say in whether he wanted to go out for dinner. If he didn t, and he didn t feel comfortable saying so, it was","messageBody":"<div id=\"ygrps-yiv-485850433\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; We had a situation the other night where we were all going out to  <br/>\n&gt; dinner.<br/>\n<br/>\n&gt;   When we came home it came<br/>\n&gt; out he didn&#39;t want to go to dinner so I guess the clothing choices  <br/>\n&gt; were<br/>\n&gt; based on his desire to stay home and not go out?<br/>\n<br/>\n </span></blockquote>It&#39;s possible, especially if he didn&#39;t have a say in whether he wanted  <br/>\nto go out for dinner. If he didn&#39;t, and he didn&#39;t feel comfortable  <br/>\nsaying so, it was a creative choice to get you to notice.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t know.  It just<br/>\n&gt; seemed defiant and unreasonable.<br/>\n<br/>\n </span></blockquote>You could see it that way. Or not.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; We have talked before that unschooling isn&#39;t do whatever you want,  <br/>\n&gt; whenever<br/>\n&gt; you want and ignore rules that exist outside our house.<br/>\n<br/>\n </span></blockquote>Were there rules in this instance?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  It isn&#39;t the<br/>\n&gt; complete opposite of what we were doing.  The conversation that night<br/>\n&gt; was; to ignore how your body feels in reaction to an old rule or to  <br/>\n&gt; rebel<br/>\n&gt; against going to dinner by wearing clothes that are not reasonable  <br/>\n&gt; choices<br/>\n&gt; and leave you uncomfortable is just a reaction to an old rule, not<br/>\n&gt; unschooling.<br/>\n<br/>\n </span></blockquote>Is he still deschooling? Maybe give him a break. Maybe ask him next  <br/>\ntime instead of assuming.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; All night I just kept thinking, &quot;OK where did the train go off<br/>\n&gt; the tracks?  Where did I mess up?&quot;<br/>\n<br/>\n </span></blockquote>You haven&#39;t been unschooling very long. I think you&#39;re expecting too  <br/>\nmuch. You haven&#39;t given the train much of a chance to stay on the  <br/>\ntracks.<br/>\n<br/>\n&quot;Read a little, try a little, wait a while, watch.&quot;<br/>\n<br/>\nRobin B.<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; -- <br/>\n&gt; nobody makes a greater mistake than he who did nothing because he  <br/>\n&gt; could do<br/>\n&gt; only a little. - edmund burke<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":263488403,"authorName":"Heather Booth","from":"Heather Booth &lt;heatherpie@...&gt;","profile":"hmbpie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Hello and Goodbye, and sharing +reactions","postDate":"1290459991","msgId":58181,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGk9YWl4Y3Y1RUV1UXJrUTJDdFpnZncxOT1teT1CY0ZhWWpHWHNZbkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":58185,"prevInTime":58180,"nextInTime":58182,"topicId":58181,"numMessagesInTopic":0,"msgSnippet":"=The opposite of do everything that s expected might be do NOTHING that s expected. We shouldn t be living by rules, nor by an opposite version of the ","messageBody":"<div id=\"ygrps-yiv-1902207494\">=The opposite of &quot;do everything that&#39;s expected&quot; might be &quot;do NOTHING<br/>\nthat&#39;s expected.&quot;<br/>\nWe shouldn&#39;t be living by rules, nor by an opposite version of the<br/>\nrules. That&#39;s reactionary.=<br/>\n<br/>\nGreat point! Now how to I talk to a 9 year old boy about it?<br/>\n<br/>\nWe had a situation the other night where we were all going out to dinner.<br/>\nIt was in the 40&#39;s and raining.  Before we got dressed we (my son and I) let<br/>\nthe dog out and he dressed in rain boots, sweatpants, and a jacket.  That<br/>\nmade sense.  It was cold and wet out.  When it came time to get ready for<br/>\ndinner he came out in shorts, t-shirt and flip flops.  I was so confused and<br/>\nwhen I asked him why he was dressed for summer he said this is how he wanted<br/>\nto dress.  OK?  I grabbed warm clothes and put them in my purse for when he<br/>\ndid get cold.  He never once said he was cold.  When we came home it came<br/>\nout he didn&#39;t want to go to dinner so I guess the clothing choices were<br/>\nbased on his desire to stay home and not go out? I don&#39;t know.  It just<br/>\nseemed defiant and unreasonable.<br/>\n<br/>\nWe have talked before that unschooling isn&#39;t do whatever you want, whenever<br/>\nyou want and ignore rules that exist outside our house.  It isn&#39;t the<br/>\ncomplete opposite of what we were doing.  The conversation that night<br/>\nwas; to ignore how your body feels in reaction to an old rule or to rebel<br/>\nagainst going to dinner by wearing clothes that are not reasonable choices<br/>\nand leave you uncomfortable is just a reaction to an old rule, not<br/>\nunschooling.  All night I just kept thinking, &quot;OK where did the train go off<br/>\nthe tracks?  Where did I mess up?&quot;<br/>\n<br/>\n-- <br/>\nnobody makes a greater mistake than he who did nothing because he could do<br/>\nonly a little. - edmund burke<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":58220,"nextTopicId":58281}}