{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":62434209,"authorName":"jenstarc4","from":"&quot;jenstarc4&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: the history and cause of restrictions concerning servants and lower classes","postDate":"1190608462","msgId":30810,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZkN2VvZSs3bjZnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDI2QUQ3NzkwLTA5NUQtNDY0RC1CRDA0LTMxMDM5NDY4NkYyMUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":30806,"nextInTopic":0,"prevInTime":30809,"nextInTime":30811,"topicId":30804,"numMessagesInTopic":0,"msgSnippet":"... and ... like ... sessions ... use ... ended). Absolutely!  Then, what kids really miss, is that opportunity to connect things in their own way that makes","messageBody":"<div id=\"ygrps-yiv-909762450\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; I think school tells people way, WAY, too little and far, FAR too  <br/>\n&gt; lamely.  I want my kids to know what the teachers missed knowing, <br/>\n </span></blockquote>and  <br/>\n<blockquote><span title=\"ireply\"> &gt; not limit themselves to a 180 day curriculum (okay, really more <br/>\n </span></blockquote>like  <br/>\n<blockquote><span title=\"ireply\"> &gt; 160, honestly) based on what would fit easily into 45 minute <br/>\n </span></blockquote>sessions  <br/>\n<blockquote><span title=\"ireply\"> &gt; and break into units and test easily.  Things that teachers can <br/>\n </span></blockquote>use  <br/>\n<blockquote><span title=\"ireply\"> &gt; to &quot;prove&quot; kids are learning (so nothing too esoteric or open-<br/>\n </span></blockquote>ended).<br/>\n<br/>\nAbsolutely!  Then, what kids really miss, is that opportunity to <br/>\nconnect things in their own way that makes it meaningful and <br/>\nrelevant.  Connections happen, but it&#39;s limited and restricted.  <br/>\nUnschooling lets those connections reach into farther and farther <br/>\nplaces leading kids into extraordinary paths.  That&#39;s what I see my <br/>\nown kids doing that schooled kids don&#39;t.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; And I absolutely do NOT want a school categorizing my kids as <br/>\n </span></blockquote>servant- <br/>\n<blockquote><span title=\"ireply\"> &gt; class, blue-collar-class, teach-a-trade, forget literature and <br/>\n </span></blockquote>music...<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Because the prejudice that some people just don&#39;t need to know <br/>\n </span></blockquote>much  <br/>\n<blockquote><span title=\"ireply\"> &gt; exists still.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I remember doing aptitude tests and skill tests that were supposed to <br/>\ntell you what you were good at and what careers to consider.  I <br/>\nbelieve that we did those tests in the beginning of middle school to <br/>\nhelp guide you toward which sorts of extracurricular activities to <br/>\nexplore.  I remember thinking what a small set of career choices <br/>\nthere were and that I&#39;d like to have tried several of those career <br/>\nchoices rather than picking one or two.<br/>\n<br/>\nChamille is just a little older than I was when I had to take those <br/>\ntests.  I&#39;m so glad that she gets to let her life unfold in front of <br/>\nher without someone telling her what she needs to know and that she <br/>\nshould know which direction to go to get there, and worse, following <br/>\nthe direction that someone else has set for her to follow to get her <br/>\nthere.<br/>\n<br/>\nSchool makes a very narrow path for kids to follow and tells those <br/>\nkids that if they follow it, they will achieve their goals.  I just <br/>\ndon&#39;t see that to be true at all in what actually happens.  <br/>\n<br/>\nAll I wanted to do was art.  That&#39;s it, well, maybe a few other <br/>\nthings, but mostly art.  I could&#39;ve spent my entire teen years doing <br/>\nthat in exclusion to almost everything else.  However, the actual <br/>\namount of time that I spent doing art was so minimal it&#39;s laughable.  <br/>\nBy the time I was done doing all the other required stuff, my time <br/>\nwas gone and art was rushed and hurried for some homework project or <br/>\nanother.  Even now, I find it hard to break those confines, like <br/>\neating dessert last in a way.<br/>\n<br/>\nIn college, my degree program was eliminated a year before I was <br/>\nsupposed to graduate.  I got my degree, but under special <br/>\ncircumstances because some of my required courses ceased to exist.  I <br/>\nwas able to take anthropology as my science instead of biology and <br/>\nhuman anatomy because I reworked my whole required classes.  I could <br/>\nunderstand why those were core requirements for my degree, but after <br/>\ntaking all the anthropology classes, I could see the benefit of that <br/>\ntoo and could apply it to my field of study.  Not a single person <br/>\nwith my degree that graduated at my university took those classes, <br/>\nthey all took the other ones.  I was the last person to graduate with <br/>\nmy degree from that university.<br/>\n<br/>\nThe school had a set path to study, and after someone followed that <br/>\npath, they were considered knowledgable enough to get a degree.  I <br/>\nfind the whole concept a bit arbitrary.  If DaVinci had tried to get <br/>\na degree in art, would he have come up with all of his inventions and <br/>\nmathmatical concepts?  I&#39;ve thought about that a lot.  <br/>\n<br/>\nIn life, what sets someone apart, is their unique abilities or <br/>\nknowledge.  If everyone gets cut the same, or molded the same, how <br/>\ndoes that help create a better world?</div>","specialLinks":[]},{"userId":62434209,"authorName":"jenstarc4","from":"&quot;jenstarc4&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: the history and cause of restrictions concerning servants and lower classes","postDate":"1190575604","msgId":30806,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZkNmVsays5cWo5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMTIwMWM3ZmUwOCQwODJiMmZmMCQ0MDAxYThjMEBEYXZpZD4="},"prevInTopic":30805,"nextInTopic":30810,"prevInTime":30805,"nextInTime":30807,"topicId":30804,"numMessagesInTopic":0,"msgSnippet":"It is kind of interesting. Today, as we walkied through the ... expansive and ... about ... for ... We had the same kind of discussions when reading most","messageBody":"<div id=\"ygrps-yiv-432077939\">It is kind of interesting. Today, as we walkied through the <br/>\n<blockquote><span title=\"ireply\"> &gt; harvested and hayed barley field I was talking about how Ramona&#39;s <br/>\n&gt; relationship with adults is all about her trying to be big and <br/>\n </span></blockquote>expansive and <br/>\n<blockquote><span title=\"ireply\"> &gt; loved and seen in positive light, and their response to her is all <br/>\n </span></blockquote>about <br/>\n<blockquote><span title=\"ireply\"> &gt; making her small and manageable and never really looking or listening <br/>\n </span></blockquote>for <br/>\n<blockquote><span title=\"ireply\"> &gt; long enough to see how much she wants to be loved. <br/>\n<br/>\n </span></blockquote>We had the same kind of discussions when reading most Beverly Cleary <br/>\nbooks.  The main thing that kept us interested in the books was the <br/>\nfact that we lived right next to the playground pictured here, for a <br/>\nlot of years: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.beverlycleary.com/adventures/map.html\">http://www.beverlycleary.com/adventures/map.html</a><br/>\n<br/>\nIt put it into a picturesque context for Chamille, and historical as <br/>\nwell since the neighborhood was very different in many ways as how it&#39;s <br/>\ndescribed in the books.</div>","specialLinks":[]},{"userId":280852700,"authorName":"Schuyler","from":"&quot;Schuyler&quot; &lt;s.waynforth@...&gt;","profile":"schuyler_waynforth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [AlwaysLearning] the history and cause of restrictions concerning servants and lower classes","postDate":"1190568884","msgId":30805,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTIwMWM3ZmUwOCQwODJiMmZmMCQ0MDAxYThjMEBEYXZpZD4=","referencesHeader":"PDI2QUQ3NzkwLTA5NUQtNDY0RC1CRDA0LTMxMDM5NDY4NkYyMUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":30804,"nextInTopic":30806,"prevInTime":30804,"nextInTime":30806,"topicId":30804,"numMessagesInTopic":0,"msgSnippet":"Not at all about the history and cause of restrictions, but definitely about wanting Simon and Linnaea to have ideas. Linnaea and I are reading Ramona the Pest","messageBody":"<div id=\"ygrps-yiv-540389067\">Not at all about the history and cause of restrictions, but<br/>\ndefinitely about wanting Simon and Linnaea to have ideas.<br/>\n<br/>\nLinnaea and I are reading Ramona the Pest right now and we are spending at <br/>\nleast as much time discussing the problems we have with the book as we are <br/>\nreading it. It is kind of interesting. Today, as we walkied through the <br/>\nharvested and hayed barley field I was talking about how Ramona&#39;s <br/>\nrelationship with adults is all about her trying to be big and expansive and <br/>\nloved and seen in positive light, and their response to her is all about <br/>\nmaking her small and manageable and never really looking or listening for <br/>\nlong enough to see how much she wants to be loved. To which Linnaea replied <br/>\nthat she is huge and powerful in her life. And I talked about how important <br/>\nthat was to David and I. Realizing, once again, how easy it is to limit, to <br/>\ncontrol, but how much more fantastic it is to listen to her shout out about <br/>\nher power.<br/>\n<br/>\nSo, not about history, but about embiggening a life.<br/>\n<br/>\nSchuyler<br/>\nwww.waynforth.blogspot.com<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; Personally, I have always wanted my kids to get ideas.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"the history and cause of restrictions concerning servants and lower classes","postDate":"1190564486","msgId":30804,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI2QUQ3NzkwLTA5NUQtNDY0RC1CRDA0LTMxMDM5NDY4NkYyMUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":30805,"prevInTime":30803,"nextInTime":30805,"topicId":30804,"numMessagesInTopic":0,"msgSnippet":"the history and cause of restrictions concerning servants and lower classes... Another aspect of social  history I want to touch on just a little bit. From","messageBody":"<div id=\"ygrps-yiv-1482639266\">the history and cause of restrictions concerning servants and lower  <br/>\nclasses...<br/>\n<br/>\nAnother aspect of social  history I want to touch on just a little bit.<br/>\n<br/>\n From times and places where it was illegal to help a slave learn to  <br/>\nread to schedules in English stately homes that required servants to  <br/>\nbe up very late AND up very early (no eight hours of sleep for them,  <br/>\never), there are common themes.<br/>\n<br/>\nWHY should some people be limited to a place and to a subset of  <br/>\ninformation?<br/>\nSo they won&#39;t get ideas.<br/>\n<br/>\nSo if you don&#39;t want your kids to get ideas, keep them away from TV  <br/>\nand books and movies and people you haven&#39;t hand picked.<br/>\n<br/>\nPersonally, I have always wanted my kids to get ideas.<br/>\n<br/>\nI don&#39;t care if they know more than I know, or if the things they  <br/>\nlearn cause them to reject things I believe.<br/>\n<br/>\nI want them to be rich with knowledge and images and thoughts and  <br/>\ncontact people and opportunities.  I want their world to be BIGGER,  <br/>\nnot smaller.<br/>\n<br/>\nSome people homeschool to protect their kids from ideas and people.   <br/>\nSome people think school tells kids too much.<br/>\n<br/>\nI don&#39;t think those people can be (nor would want to be) successful  <br/>\nunschoolers.<br/>\n<br/>\nI think school tells people way, WAY, too little and far, FAR too  <br/>\nlamely.  I want my kids to know what the teachers missed knowing, and  <br/>\nnot limit themselves to a 180 day curriculum (okay, really more like  <br/>\n160, honestly) based on what would fit easily into 45 minute sessions  <br/>\nand break into units and test easily.  Things that teachers can use  <br/>\nto &quot;prove&quot; kids are learning (so nothing too esoteric or open-ended).<br/>\n<br/>\nAnd I absolutely do NOT want a school categorizing my kids as servant- <br/>\nclass, blue-collar-class, teach-a-trade, forget literature and music...<br/>\n<br/>\nBecause the prejudice that some people just don&#39;t need to know much  <br/>\nexists still.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":30807,"nextTopicId":30813}}