{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":321996436,"authorName":"","from":"missalexmissalex@...","profile":"missalexmissalex","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Community guidelines for activity group?","postDate":"1434087669","msgId":75983,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PG1sZHJkbCtkcjgwdDNAWWFob29Hcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":75982,"nextInTime":75984,"topicId":75983,"numMessagesInTopic":0,"msgSnippet":"Hi! I am almost completely sure I am starting up a weekly activity group with field trips & hikes. I have a newly 8 yo girl and a 2.5 yo boy. I feel like","messageBody":"<div id=\"ygrps-yiv-1413503777\"><span><p><span>Hi! </span></p><p><span><br></span></p><p><span>I am almost completely sure I am starting up a weekly activity group with field trips &amp; hikes. I have a newly 8 yo girl and a 2.5 yo boy. I feel like getting more organized about&nbsp; sharing activities that appeal to both of them is the best way to build up a community with kids in both ranges, that spans the area between our town &amp; where our friends mostly live 25 minutes south of here. I&#39;ve got 3-6 families of mostly relaxed, eclectic&nbsp;homeschoolers whose kids are friends with my daughter who are already interested in getting together more regularly. Yay! So it&#39;s an unschooling-friendly group run by an unschooler, not exactly an unschooling group.</span></p><p><span><br></span></p><p><span>I&#39;d like to be able to remind people to reread&nbsp;a posted&nbsp;policy if the same problems occur repeatedly, to minimize uncomfortable conversations and people feeling singled out.&nbsp;This is definitely for the adults, not so much making rules for the children. One&nbsp;idea I had was that I would request that if two children had a conflict, that both parents would be expected to keep a closer eye on or be more involved with their own child&nbsp;for the following meetings.&nbsp; On a related note, I want to make it clear that it is the parent&#39;s job to ensure that their child isn&#39;t repeatedly hurting other kids, physically. I know sometimes in groups in which the policy is that everyone just deal swith their own kid, many families have left because of the repeated behavior of one or two families. At the same time, I have come a long way since my elementary school teacher days, and I think it is very important for kids to have the freedom to not play with anyone they don&#39;t want to play with. Likewise with not expecting&nbsp;immediate, forced apologies. On the other hand, it seems really wrong to not intervene when kids are being discriminated against on the basis of gender, race, etc. So maybe a note about intervening if &quot;no girls/boys allowed&quot; type situations occur, and please make sure your kids follow the rules&nbsp;at any venue we are visiting.</span><span>&nbsp;I feel that just&nbsp;asking people to be safe and&nbsp;kind could actually lead to some big misunderstandings. </span></p><p><span><br></span></p><p><span>I know that declaring myself not in charge is an answer that has worked for some. <span>I&#39;ve started, moderated, and/or organized for various homeschool&nbsp;&amp;&nbsp;attachment parenting&nbsp;groups before, and I have learned a lot. I think cooperative groups are great in theory but </span><span>I have worked fairly hard on 4 in the last 5 years, and every one either didn&#39;t&nbsp;really take off&nbsp;or was suddenly, radically changed by the lead organizer in a way that didn&#39;t work for us. I&#39;m ready to have a group where I as the owner organize things that both my kids like, and if other people have suggestions or want to add to it, that&#39;s great too. </span></span></p><p><span><span><br></span></span></p><p><span>I would really appreciate any input. If anyone knows of a likeminded group with a posted policy, I&#39;d love to see it. </span></p><p><span><br></span></p><span><p><span>Thanks! </span></p><p><span>Alex N</span></p></span><p></p></span></div>","specialLinks":[]}],"prevTopicId":75979,"nextTopicId":54278}}