{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":1352017,"authorName":"kayb85","from":"&quot;kayb85&quot; &lt;sheran@...&gt;","profile":"kayb85","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: On the subject of video games and how do I keep from having a heart attack?!","postDate":"1109556379","msgId":104025,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGN2dHVhcisxbzVkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDUwMjI3MTIyNDAyLjY0MTM1LnFtYWlsQHdlYjIxNDMwLm1haWwueWFob28uY29tPg=="},"prevInTopic":104010,"nextInTopic":0,"prevInTime":104024,"nextInTime":104026,"topicId":104010,"numMessagesInTopic":0,"msgSnippet":"Everything im finding for a 5 year old age range seems to be geared towards teaching them something and I thought it would be nice to have a game just for","messageBody":"<div id=\"ygrps-yiv-1499143905\">&quot;Everything im finding for a 5 year old age range seems to be geared <br/>\ntowards teaching them something and I thought it would be nice to <br/>\nhave a game just for fun. Any suggestions?&quot;<br/>\n<br/>\nMy kids all loved Putt Putt, Freddi the Fish, and Spy Fox games.  <br/>\n<br/>\n<br/>\n&quot; Anyway someone put things into perspective for me and help prevent <br/>\nfuture heart attacks. &quot;<br/>\n<br/>\nI remember once we had a sled with a rope on the front of it so that <br/>\nyou could pull the sled (it came that way, we didn&#39;t put the rope on <br/>\nit).  Somehow in the course of play my daughter had the rope wrapped <br/>\naround her neck and was being strangled. I saw her and got the rope <br/>\noff of her neck.  I still shudder when I think of that.  I can <br/>\nremember another time when I walked into the room and found my son <br/>\nchoking on food and saved him from choking. <br/>\n<br/>\nBoth times I thought, &quot;OMG, what if I hadn&#39;t been there&quot;.  But the <br/>\nfact is that I was there, and when your daughter was hanging from the <br/>\nbed you were there, and I think that&#39;s the most important thing we <br/>\ncan do as parents to ensure our kids&#39; safety.  BE there.  <br/>\n<br/>\nSheila</div>","specialLinks":[]},{"userId":193844353,"authorName":"Nicole Willoughby","from":"Nicole Willoughby &lt;cncnawilloughby@...&gt;","profile":"cncnawilloughby","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"On the subject of video games and how do I keep from having a heart attack?!","postDate":"1109507042","msgId":104010,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwMjI3MTIyNDAyLjY0MTM1LnFtYWlsQHdlYjIxNDMwLm1haWwueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":104025,"prevInTime":104009,"nextInTime":104011,"topicId":104010,"numMessagesInTopic":0,"msgSnippet":"My daughter plays her v-smile a lot which all the games are geared towards learning . Hey I have noooo problem with that and no one forced her to sit there for","messageBody":"<div id=\"ygrps-yiv-1144081366\">My daughter plays her v-smile a lot which all the games are geared towards learning . Hey I have noooo problem with that and no one forced her to sit there for 4 hours today and play it :) <br/>\nWell she has expressed an intrest in playing some computer games so I went looking. Everything im finding for a 5 year old age range seems to be geared towards teaching them something and I thought it would be nice to have a game just for fun. Any suggestions?<br/>\n <br/>\nSo now the heart attack part......Today i find Courtney in the bedroom with one end of a scarve tired to the top rung of her bunkbed ladder and the other end around her waist. She lets go and says mom look Im an acrobat while hanging there by the scarve. I could help it I just blurted out oh my goodness you are going to fall! <br/>\nShe had tested things out by putting all her animals in a bag and hanging them first.....I had to gently explain that maybe her animals didnt weigh as much as her but what a great idea the testing was. Then she also tied her sister and made a pully system to get her up to the top bunk. That I had to put a stop to. <br/>\n <br/>\nAnyway someone put things into perspective for me and help prevent future heart attacks. <br/>\nWhen I was 5 I used to jump off the second story balcony with a sheet trying to parachute and Im still here ( the house was built on a hill so it wasnt that far down) and we wont talk about the fact that my parents discovered that I learned how to ride my bike but not how to use the breaks at the wrong time :) But I still freak when my kids try to do things. <br/>\n <br/>\nNicole<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\n Take Yahoo! Mail with you! Get it on your mobile phone.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":103913,"nextTopicId":104020}}