{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Moving forward... past learning disabilities, labels, damage done by schooling, etc.","postDate":"1264147746","msgId":49889,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY5MjI4My4yNjUyLnFtQHdlYjExMDQwNi5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PDRCNTkwNENFLjgwNzA2QHlhaG9vLmNhPg==","referencesHeader":"PDRCNTkwNENFLjgwNzA2QHlhaG9vLmNhPg=="},"prevInTopic":49883,"nextInTopic":0,"prevInTime":49888,"nextInTime":49890,"topicId":49880,"numMessagesInTopic":0,"msgSnippet":"***How can I continue to challenge his negative thinking about himself without having him think I m just saying that ? ***   I know you are talking about an","messageBody":"<div id=\"ygrps-yiv-1307262702\">***How can I continue to challenge his negative thinking about himself <br/>\nwithout having him think I&#39;m &#39;just saying that&#39;? ***<br/>\n <br/>\nI know you are talking about an adult, but I think it would apply the same if you were talking about a kid.  His story is a prime example and reason why labels do damage, especially within the school system.  He came out damaged, he&#39;s part of the percentage of kids that fail in school, the ones that the schools look at and dismiss any claim to have anything to do with.<br/>\n <br/>\nIf he was your kid, I&#39;d tell you to see what he DOES like doing and then go from there.  What IS he good at, and go from there.  One little step in the positive is one step away from the negative.  At this point, it&#39;s all up to him.  <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Moving forward... past learning disabilities, labels, damage done by schooling, etc.","postDate":"1264132494","msgId":49883,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdGQ0NCRUE3LTZDRDItNEZFMS1CQzMzLUJFQUY1MkMxMjEyREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDRCNTkwNENFLjgwNzA2QHlhaG9vLmNhPg==","referencesHeader":"PDRCNTkwNENFLjgwNzA2QHlhaG9vLmNhPg=="},"prevInTopic":49880,"nextInTopic":49889,"prevInTime":49882,"nextInTime":49884,"topicId":49880,"numMessagesInTopic":0,"msgSnippet":"-=-How can I continue to challenge his negative thinking about himself without having him think I m just saying that ? -=- What if you find a couple of","messageBody":"<div id=\"ygrps-yiv-819742376\">-=-How can I continue to challenge his negative thinking about himself<br/>\nwithout having him think I&#39;m &#39;just saying that&#39;? -=-<br/>\n<br/>\nWhat if you find a couple of opportunities to be alone with him and  <br/>\njust talk about how cool it would have been if things had been  <br/>\ndifferent when you were both little.  Like if you had been able to be  <br/>\nhome and do [watever] and if he had not had those school problems, and  <br/>\nif he could have taken his time to get into the academics instead of  <br/>\nthem pushing him by age.<br/>\n<br/>\nYou don&#39;t need to have a whole scenario prepared.  Just run it like a  <br/>\nfantasy.  Maybe he&#39;ll be into it and maybe he won&#39;t, but it would help  <br/>\nhim think that maybe his life could have gone a different way, and  <br/>\nthat likely much of his damage and frustration is because of school&#39;s  <br/>\ninterference and time tables and rules, not because of a failing in  <br/>\nhim, but of a failing in school.<br/>\n<br/>\nI have a more serious recommendation, too.  Don&#39;t do it face to face.   <br/>\nBe driving somewhere.  Be fishing.  Be doing something side by side.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/truck\">http://sandradodd.com/truck</a><br/>\n<br/>\n(more ideas are there)<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":251210887,"authorName":"Shira Rocklin","from":"Shira Rocklin &lt;shirarocklin@...&gt;","profile":"shirarocklin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Moving forward... past learning disabilities, labels, damage done by schooling, etc.","postDate":"1264125134","msgId":49880,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCNTkwNENFLjgwNzA2QHlhaG9vLmNhPg=="},"prevInTopic":0,"nextInTopic":49883,"prevInTime":49879,"nextInTime":49881,"topicId":49880,"numMessagesInTopic":0,"msgSnippet":"Hi everyone, I had an interesting discussion with my brother tonight and I was hoping to gain a bit more insight perhaps discussing a bit here.  Here is his ","messageBody":"<div id=\"ygrps-yiv-517690488\">Hi everyone,<br/>\n<br/>\nI had an interesting discussion with my brother tonight and I was hoping <br/>\nto gain a bit more insight perhaps discussing a bit here.  Here is his <br/>\nstory, as I understand it.  He is 25.  He has some pretty debilitating <br/>\nlearning disabilities (debilitating in the sense of how he was schooled <br/>\nand hurt and taught he was stupid, etc... not so much in that the <br/>\nlearning disabilities themselves should be whats debilitating).  He <br/>\ndoesn&#39;t know anything about unschooling, as I haven&#39;t approached my <br/>\nfamily much about it yet (kids being 3 and under so far, it hasn&#39;t one <br/>\nbeyond saying we&#39;re homeschooling yet).  He didn&#39;t really finish <br/>\nelementary school, he was switched into special ed classes pretty early <br/>\non (after the horrible 2nd grade teacher who told him he was a bad kid <br/>\nand stupid), and they never caught him up.  They spent lots of time <br/>\nassessing him.  My parents had their own assessments done as well, and <br/>\nfought to get him into the better programs, better schools, but I&#39;m <br/>\nbeginning to see that &#39;better&#39; was not &#39;best&#39; by any measure.  He was <br/>\nbumped up to high school with his class, still mostly in special ed, not <br/>\nhaving really finished elementary school stuff.  He dropped out of high <br/>\nschool twice, didn&#39;t go back at all after the age of 16 (compulsory <br/>\nschool ends at that age I think?).  He spent some years working <br/>\n&#39;dead-end&#39; jobs, grocery store, stock boy, etc... he wasn&#39;t happy doing <br/>\nit, and still isn&#39;t.  He expresses a desire to do more, but feels that <br/>\nhe has not had the experience to develop socially.  He hasn&#39;t made any <br/>\nnew friends since he was a child, and just has his two childhood <br/>\nfriends.  He feels inadequate, like he can&#39;t get anywhere without <br/>\nschool, but couldn&#39;t actually succeed when he tried college (which is <br/>\nnot university, similar to community college or trade school in the USA). <br/>\n<br/>\nI was thinking about what he&#39;s trying to go through.  Gain the <br/>\nconfidence to do something, finish something, in order to feel confident <br/>\nin his ability to do those things.  To move past his preconceptions <br/>\nabout education and being smart, learning disabilities and being smart, <br/>\nbeing smart and getting good jobs, etc.  Learn the cultural norms that <br/>\nexist around him so he can navigate.<br/>\n<br/>\nI had a few thoughts as we went through that discussion.  One was to <br/>\nwonder whether he&#39;d ever been assessed for more than learning <br/>\ndisabilities.  I know labels aren&#39;t always so helpful, but sometimes <br/>\nthey might be, in order to understand how we work, maybe?  He had a lot <br/>\nof sensory issues as a child, they&#39;ve faded in adulthood, but I <br/>\nrememeber.  When combined with his social issues, I wonder if perhaps <br/>\nhe&#39;s on the spectrum (do I even know how to use that word in the right <br/>\ncontext?).  I was thinking about a friend of mine who was diagnosed with <br/>\nAsperger&#39;s as a late teen.  And I was also thinking that a lot of what <br/>\nhe needs to work through, in his mind/heart/soul, is much like the <br/>\nprocess of deschooling.  He really needs to deschool every message that <br/>\nwas given to him in all his years of school.  I reflected back on when I <br/>\ntook a course in university for the sole purpose of learning how to get <br/>\na bad mark, and feel good about it... a practice in not being a <br/>\nperfectionist, and how liberating it was to get that D! <br/>\n<br/>\nSo I&#39;d love some thoughts on how to support him.  I&#39;d love for him to be <br/>\nable to find a path this time (rather than the ones he&#39;s tried in the <br/>\npast) that leads him out of the circles in his head.  So far my thoughts <br/>\nhave been about setting small goals, such as just doing a course at the <br/>\ncommunity center on anything thats even vaguely interesting, just for <br/>\nthe experience of finishing something, or quitting because you don&#39;t <br/>\nlike it, without guilt.  And I also thought that perhaps shadowing a few <br/>\npeople on their jobs, in areas that interest him, might be useful for him.<br/>\n<br/>\nHow can I continue to challenge his negative thinking about himself <br/>\nwithout having him think I&#39;m &#39;just saying that&#39;?  <br/>\n<br/>\nIs this too off topic for this list?<br/>\n<br/>\nThanks,<br/>\nShira</div>","specialLinks":[]}],"prevTopicId":49879,"nextTopicId":49870}}