{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":76589361,"authorName":"Angela","from":"&quot;Angela&quot; &lt;argwolff@...&gt;","profile":"argwolff","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: TV shows I really just don&#39;t like. Help.","postDate":"1318706352","msgId":63427,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo3Y21iZytkYzV1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo3YTczNitnZnBoQGVHcm91cHMuY29tPg=="},"prevInTopic":63406,"nextInTopic":0,"prevInTime":63426,"nextInTime":63428,"topicId":63304,"numMessagesInTopic":0,"msgSnippet":"... You re absolutely right. And, wouldn t you know that in the week or so that it took for there to be a response to this post, I realized yesterday that they","messageBody":"<div id=\"ygrps-yiv-2028858072\"><blockquote><span title=\"ireply\">&gt;&gt;&gt; It&#39;s really important to step away from the idea that there&#39;s an &quot;ultimate solution&quot;. In a year, your kids will be a year older and all the dynamics will have shifted - kids change, circumstances change, interests change. So stop looking for &quot;A&quot; solution at all. &lt;&lt;<br/>\n<br/>\n </span></blockquote>You&#39;re absolutely right. And, wouldn&#39;t you know that in the week or so that it took for there to be a response to this post, I realized yesterday that they haven&#39;t watched The Cleveland Show in a couple days. Not sure if they blew through all the episodes on Netflix or if they just moved on. But, yeah, I got myself worked up over something that was really, really short lived!<br/>\n<br/>\nAt first I was a little frustrated that there had been no responses to my post, but I think it&#39;s probably better that it took a while. (-:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;If they&#39;re using language to hurt each others&#39; feelings, work on that in other ways. Kids bring what they see in shows and movies into real life to see when and how it fits - it&#39;s not somehow bad to say &quot;no, that&#39;s not something you say to your sibling.&quot;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>and from later<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;The other thing to remember is that kids Do compare what they see to their real lives. So if your home is becoming a kinder, more supportive place overall, they&#39;ll see that &quot;dumb ass&quot; doesn&#39;t fit - most of the time. Trust that they Want a kinder, more supportive home overall - it will feel warmer and softer and more comfortable to them. &lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>You&#39;re right. This is what&#39;s really bothering me: The worry that they will act more like what they are seeing and hearing on TV/YouTube than how I want them to treat each other. The answer is certainly not to grouse at them or wince or grit my teeth every time they want to watch a show they enjoy. _That_ will come back to bite me in the butt!<br/>\n<br/>\nThanks,<br/>\nAngela in NJ</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: TV shows I really just don&#39;t like. Help.","postDate":"1318625190","msgId":63406,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo3YTczNitnZnBoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo2aHBlcisyN2lmQGVHcm91cHMuY29tPg=="},"prevInTopic":63378,"nextInTopic":63427,"prevInTime":63405,"nextInTime":63407,"topicId":63304,"numMessagesInTopic":0,"msgSnippet":"... ******************** It s really important to step away from the idea that there s an ultimate solution . In a year, your kids will be a year older and","messageBody":"<div id=\"ygrps-yiv-901538951\">&quot;Angela&quot; &lt;argwolff@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; For the moment I&#39;ve asked them not to watch with their youngest sister , but I don&#39;t think that&#39;s the ultimate solution.<br/>\n </span></blockquote>********************<br/>\n<br/>\nIt&#39;s really important to step away from the idea that there&#39;s an &quot;ultimate solution&quot;. In a year, your kids will be a year older and all the dynamics will have shifted - kids change, circumstances change, interests change. So stop looking for &quot;A&quot; solution at all. <br/>\n<br/>\nRight not, &quot;please don&#39;t watch with your little sister&quot; may be fine. I&#39;d still talk about other things - if they use language you find offensive, tell them. If they&#39;re using language to hurt each others&#39; feelings, work on that in other ways. Kids bring what they see in shows and movies into real life to see when and how it fits - it&#39;s not somehow bad to say &quot;no, that&#39;s not something you say to your sibling.&quot;<br/>\n<br/>\nEven if you&#39;re not watching with your kids, ask them what they like. I don&#39;t always want to watch what Mo watches, but she&#39;s usually happy to tell me about an episode, lay out the plot, tell me about the characters. Find out directly from your kids what&#39;s neat and fun and interesting to them. Sometimes that&#39;s helpful in finding a movie or show you Can watch together, something with elements you both enjoy. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;(I mentioned in a previous post we&#39;re already working on a negativity issue over here with things like them calling each other &quot;stupid&quot;, I don&#39;t really want them adding &quot;dumb ass&quot;, etc. to their repertoire.)<br/>\n </span></blockquote>*****************<br/>\n<br/>\nThe other thing to remember is that kids Do compare what they see to their real lives. So if your home is becoming a kinder, more supportive place overall, they&#39;ll see that &quot;dumb ass&quot; doesn&#39;t fit - most of the time. Trust that they Want a kinder, more supportive home overall - it will feel warmer and softer and more comfortable to them. Even people with warm, soft, comfortable lives like to watch and read dark and scary things sometimes, though - otherwise there wouldn&#39;t be ghost stories and horror movies and fairy tales where grandma gets eaten by a wolf. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] TV shows I really just don&#39;t like. Help.","postDate":"1318474302","msgId":63377,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTg0NzQzMDIuMjUwNjQuWWFob29NYWlsTmVvQHdlYjgxNTA0Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PENBTUhKS0w5Xy1IZl9jaDBlUEVjc1hqYUgxS2pGQ2o0eXB3NlF6c2sxZnhoUSs0ej1id0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGo2aHBlcisyN2lmQGVHcm91cHMuY29tPiA8Q0FNSEpLTDlfLUhmX2NoMGVQRWNzWGphSDFLakZDajR5cHc2UXpzazFmeGhRKzR6PWJ3QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":63374,"nextInTopic":63378,"prevInTime":63376,"nextInTime":63378,"topicId":63304,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1239755302\">&lt;&lt;&lt; I did say later on<br/>\n<br/>\nthat some cartoons are funnier for adults than for kids.  Again, kind of<br/>\nvague.  I would be interested in hearing what others think about this.&gt;&gt;&gt;<br/>\n-=-=-=-=-=-=-=<br/>\n<br/>\nNot necessarily. Gigi has liked Family Guys since she was 4 years old ( she is 5 now). What she gets from it is totally different than what her brother that is 9 years old does and what me and my husband do.<br/>\nI think Family Guy is great but I know not everyone likes that kind of satire.<br/>\nWhen MD was like 3 years old and started watching Thomas the Tank Engine I did not like it very much and I watched with him with  an open and I too fell in love<br/>\nwith Thomas and his friends. I still know most songs ! It was so much fun to play with Thomas and do all the Thomas stuff.<br/>\n IF you do not like a show I would make sure I watched at least a few with an open mind to understand  what it is about.<br/>\nWhen Gigi started watching DragonBall  I really thought it was blah. Then I watched a few and got the manga books to read to her and I am a HUGE DragonBall fan now!  Who would think I would fall in love with the show so much! <br/>\nSometimes to know is to love .  If you never get to like it that is fine too. But getting to know what is all about and the characters will enhance your relationship.<br/>\nSome show my kids like I don&#39;t really care to watch. I don&#39;t hate , or I don;t even not like them. But I did watch enough and asked enough question to know what is about so when they come share it with me I know what they are talking about.<br/>\nThat has been my experience,<br/>\nAlex Polikowksy<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":339837881,"authorName":"Damien","from":"&quot;Damien&quot; &lt;damienstrength@...&gt;","profile":"damienstrength","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: TV shows I really just don&#39;t like. Help.","postDate":"1318472682","msgId":63378,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo3NWk1YSs3ODU2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBTUhKS0w5Xy1IZl9jaDBlUEVjc1hqYUgxS2pGQ2o0eXB3NlF6c2sxZnhoUSs0ej1id0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":63377,"nextInTopic":63406,"prevInTime":63377,"nextInTime":63379,"topicId":63304,"numMessagesInTopic":0,"msgSnippet":"... I tell my 5 year old and 3 year old, Some shows/movies aren t appropriate for kids, and usually they accept that.  If they ask for a reason I tell them","messageBody":"<div id=\"ygrps-yiv-1916255550\">======  I did say later on<br/>\n<blockquote><span title=\"ireply\"> &gt; that some cartoons are funnier for adults than for kids.  Again, kind of<br/>\n&gt; vague.  I would be interested in hearing what others think about this.=====<br/>\n<br/>\n </span></blockquote>I tell my 5 year old and 3 year old, &quot;Some shows/movies aren&#39;t appropriate for kids,&quot; and usually they accept that.  If they ask for a reason I tell them (depending on what it is) that it is too violent/scary/crude/etc.  Only a few times have they pushed beyond that.  <br/>\n<br/>\nOne time was when my oldest was 4 and she was really into dinosaurs.  She saw the cover of the version of King Kong where he fights the dinosaur and she just HAD to see it.  So we got it and I sat with her and we skipped the scarier parts.  She had a blanket to cover her head if she needed too.  I explained some parts.  She watched it over and over and over for a while and then just stopped.  In the meantime I also found lots of other dinosaur things for her and pretty soon she was more interested in Land Before Time and the cartoon version of King Kong than the R rated version. <br/>\n<br/>\nSpiderman is also a big hit around here.  There are a few parts (like the horror movie esque part of the one with Doc Ock killing the doctors and nurses) that I skip for them, but other than that, they are ok with watching it.  If a movie seems questionable to me and we are in the middle of it, I will just ask if they are doing ok, do they want me to skip, or would they like to hide their heads.  <br/>\n<br/>\nMy husband watches some things like anime, Simpsons, etc that I just ask him to watch when the kids are asleep.  On the occasions that they have seen those things, the humor mostly goes so far over their heads that they just don&#39;t get it enough to even ask about it.<br/>\n<br/>\nEmily</div>","specialLinks":[]},{"userId":345817076,"authorName":"Sylvia Woodman","from":"Sylvia Woodman &lt;sylvia057@...&gt;","profile":"sylviawoodman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] TV shows I really just don&#39;t like. Help.","postDate":"1318466300","msgId":63374,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTUhKS0w5Xy1IZl9jaDBlUEVjc1hqYUgxS2pGQ2o0eXB3NlF6c2sxZnhoUSs0ej1id0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGo2aHBlcisyN2lmQGVHcm91cHMuY29tPg==","referencesHeader":"PGo2aHBlcisyN2lmQGVHcm91cHMuY29tPg=="},"prevInTopic":63304,"nextInTopic":63377,"prevInTime":63373,"nextInTime":63375,"topicId":63304,"numMessagesInTopic":0,"msgSnippet":"Did my computer eat the responses to this or did no one respond? Recently we had a similar experience when my 7 and 5 year old watched an episode of Family Guy","messageBody":"<div id=\"ygrps-yiv-743737442\">Did my computer eat the responses to this or did no one respond?<br/>\n<br/>\nRecently we had a similar experience when my 7 and 5 year old watched an<br/>\nepisode of Family Guy that would not have been my first choice for them to<br/>\nwatch.  I didn&#39;t say anything about not watching but did ask during a break<br/>\nif they were enjoying it.  We were also available to answer questions but<br/>\nsince they didn&#39;t ask any I didn&#39;t say, &quot;So did you understand what just<br/>\nhappened?&quot; either (which also didn&#39;t quite feel right.)  I did say later on<br/>\nthat some cartoons are funnier for adults than for kids.  Again, kind of<br/>\nvague.  I would be interested in hearing what others think about this.<br/>\n<br/>\nSylvia<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed, Oct 5, 2011 at 10:26 AM, Angela &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:argwolff@...\">argwolff@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I need some help. We do not restrict how much the kids watch TV, and for<br/>\n&gt; the most part try not to restrict *what* they watch, either. But we usually<br/>\n&gt; watch with them so we can answer any questions they have, be there if they<br/>\n&gt; need help through a scary part, put things in context if it seems needed,<br/>\n&gt; etc.<br/>\n&gt;<br/>\n&gt; But, I&#39;m not quite sure what to do about the kids watching shows that I<br/>\n&gt; just don&#39;t like, specifically ones I don&#39;t think they should be watching<br/>\n&gt; alone. At the moment they are watching &quot;The Cleveland Show.&quot;<br/>\n&gt; There are also a couple of YouTube &quot;shows&quot; I&#39;m having trouble with: Equals3<br/>\n&gt; and Smosh.<br/>\n&gt;<br/>\n&gt; This is the first time I&#39;m unable to watch with the kids and just find<br/>\n&gt; enjoyment in their enjoyment. Or that I&#39;ve been unable to find my own<br/>\n&gt; enjoyment in them.<br/>\n&gt;<br/>\n&gt; So do I let them watch alone, and just deal with any language, etc. that<br/>\n&gt; flows out of their mouths as a result? That doesn&#39;t feel right. (I mentioned<br/>\n&gt; in a previous post we&#39;re already working on a negativity issue over here<br/>\n&gt; with things like them calling each other &quot;stupid&quot;, I don&#39;t really want them<br/>\n&gt; adding &quot;dumb ass&quot;, etc. to their repertoire.) But neither does watching with<br/>\n&gt; them. With Cleveland, I could probably be in the room doing something else.<br/>\n&gt; But in the case of the YouTube shows, I find the tone of them so ugly and so<br/>\n&gt; grating that I don&#39;t think I could do that for very long. But telling them<br/>\n&gt; they *can&#39;t watch* does not seem right, either.<br/>\n&gt;<br/>\n&gt; For the moment I&#39;ve asked them not to watch with their youngest sister ,<br/>\n&gt; but I don&#39;t think that&#39;s the ultimate solution.<br/>\n&gt;<br/>\n&gt; Thoughts?<br/>\n&gt;<br/>\n&gt; Thanks,<br/>\n&gt; Angela in NJ<br/>\n&gt; with Joseph, 9; Hannah, 6; and Miriam, almost 4<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":76589361,"authorName":"Angela","from":"&quot;Angela&quot; &lt;argwolff@...&gt;","profile":"argwolff","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"TV shows I really just don&#39;t like. Help.","postDate":"1317824795","msgId":63304,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo2aHBlcisyN2lmQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":63374,"prevInTime":63303,"nextInTime":63305,"topicId":63304,"numMessagesInTopic":0,"msgSnippet":"I need some help. We do not restrict how much the kids watch TV, and for the most part try not to restrict *what* they watch, either. But we usually watch with","messageBody":"<div id=\"ygrps-yiv-802201378\">I need some help. We do not restrict how much the kids watch TV, and for the most part try not to restrict *what* they watch, either. But we usually watch with them so we can answer any questions they have, be there if they need help through a scary part, put things in context if it seems needed, etc.<br/>\n<br/>\nBut, I&#39;m not quite sure what to do about the kids watching shows that I just don&#39;t like, specifically ones I don&#39;t think they should be watching alone. At the moment they are watching &quot;The Cleveland Show.&quot; <br/>\nThere are also a couple of YouTube &quot;shows&quot; I&#39;m having trouble with: Equals3 and Smosh. <br/>\n<br/>\nThis is the first time I&#39;m unable to watch with the kids and just find enjoyment in their enjoyment. Or that I&#39;ve been unable to find my own enjoyment in them.<br/>\n<br/>\nSo do I let them watch alone, and just deal with any language, etc. that flows out of their mouths as a result? That doesn&#39;t feel right. (I mentioned in a previous post we&#39;re already working on a negativity issue over here with things like them calling each other &quot;stupid&quot;, I don&#39;t really want them adding &quot;dumb ass&quot;, etc. to their repertoire.) But neither does watching with them. With Cleveland, I could probably be in the room doing something else. But in the case of the YouTube shows, I find the tone of them so ugly and so grating that I don&#39;t think I could do that for very long. But telling them they *can&#39;t watch* does not seem right, either.<br/>\n<br/>\nFor the moment I&#39;ve asked them not to watch with their youngest sister , but I don&#39;t think that&#39;s the ultimate solution.<br/>\n<br/>\nThoughts?<br/>\n<br/>\nThanks,<br/>\nAngela in NJ<br/>\nwith Joseph, 9; Hannah, 6; and Miriam, almost 4</div>","specialLinks":[]}],"prevTopicId":63388,"nextTopicId":63385}}