{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":99944316,"authorName":"Nancy Wooton","from":"Nancy Wooton &lt;ikonstitcher@...&gt;","profile":"ikonstitcher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Stockholm syndrome was Re: [AlwaysLearning] Dress for Success\tor PUBLIC H...","postDate":"1030937251","msgId":9063,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI5OTgyOEIzLjI5REYxJWlrb25zdGl0Y2hlckBjb3gubmV0Pg==","inReplyToHeader":"PDcyLjIxZDQ3ZDc1LjJhYTQyYWU0QGFvbC5jb20+"},"prevInTopic":9061,"nextInTopic":0,"prevInTime":9062,"nextInTime":9064,"topicId":9061,"numMessagesInTopic":0,"msgSnippet":"... You understood the question, and I appreciate your answer ( right in your case ) In my case, third grade was also my downfall.  What is it about third","messageBody":"<div id=\"ygrps-yiv-1894973912\">on 9/1/02 7:45 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Dnowens@...\">Dnowens@...</a> at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Dnowens@...\">Dnowens@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So why do some kids get &quot;caught&quot; in school and never seem to get out and<br/>\n&gt; others are able to reject it all and come out strong? Somewhere, sometime<br/>\n&gt; there was someone in their life who had an impact on them, who stood up for<br/>\n&gt; them, did something to let them know that school wasn&#39;t all there was. Even<br/>\n&gt; if there wasn&#39;t someone like my dad in the equation, if it was just one<br/>\n&gt; person who did one small thing way back in third grade... it can and does<br/>\n&gt; make a difference.<br/>\n&gt; ~Nancy~ who hopes she somehow answered Nancy&#39;s question? (Did I get it<br/>\n&gt; right?) <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>You understood the question, and I appreciate your answer (&quot;right&quot; in your<br/>\ncase &lt;g&gt;)<br/>\n<br/>\nIn my case, third grade was also my downfall.  What is it about third grade<br/>\nteachers???  At that time, my parents tried very hard to make me go along<br/>\nwith the system; I&#39;m not sure they ever knew the teacher had pulled my desk<br/>\nup against hers, so she could hit my hand with her ruler if I looked out the<br/>\nwindow.  Anyone want to guess why I suck at math?<br/>\n<br/>\nIt wasn&#39;t until many years later my mom started to let her guard down, and<br/>\nreveal what she really felt about school.  She&#39;d flunked second grade, and,<br/>\nsince it was virtually a one-room schoolhouse, had to repeat with the same<br/>\nteacher who dug her long fingernails into children&#39;s flesh.  My mom couldn&#39;t<br/>\nread, but memorized the passage she&#39;d have to read aloud to escape this<br/>\nwoman and move up to third grade.  (My mom&#39;s grandparents and extended<br/>\nfamily spoke Norweigen, and the workers in the orange groves surrounding her<br/>\nhome spoke Spanish; she didn&#39;t have a good grasp of English in second<br/>\ngrade.)<br/>\n<br/>\nMom eventually got to the point where she&#39;d snipe openly about<br/>\n&quot;schoolteachers!&quot;  but until then she was a good enforcer of the school&#39;s<br/>\nstatus quo.  Once I got to high school and had a couple of liberal teachers<br/>\n(ones who insisted on being called by first names and furnished their<br/>\nclassrooms with couches, not desks &lt;horrors!&gt; and one who&#39;d even been to the<br/>\nSoviet Union!!!!) she changed her tune and harrangued all the time about the<br/>\nhorrible school.  <br/>\n<br/>\nI guess her hatred of school did me some good in the long run, though it<br/>\nmade me pretty unbearable to that teacher with the couches (I think he might<br/>\nhave been amused by me, come to think of it).  Mom has always been<br/>\nsupportive of homeschooling, anyway :-)<br/>\n<br/>\nNancy</div>","specialLinks":[]},{"userId":113028911,"authorName":"Dnowens@aol.com","from":"Dnowens@...","profile":"hsmominoz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Stockholm syndrome was Re: [AlwaysLearning] Dress for Success or PUBLIC H...","postDate":"1030934756","msgId":9061,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcyLjIxZDQ3ZDc1LjJhYTQyYWU0QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":9063,"prevInTime":9060,"nextInTime":9062,"topicId":9061,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/1/02 4:13:38 PM Central Daylight Time, ... I don t quite know how to answer this. I hope I know what you are asking. My dad taught me to","messageBody":"<div id=\"ygrps-yiv-1748878390\">In a message dated 9/1/02 4:13:38 PM Central Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ikonstitcher@...\">ikonstitcher@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My Dad asked<br/>\n&gt; &gt; him if he knew what the shirt meant, and the principal told him he didn&#39;t<br/>\n&gt; &gt; have to know what a shirt meant, to know it was wrong! &lt;g&gt; My Dad told me <br/>\n&gt; to<br/>\n&gt; &gt; wear it every day for a week (he washed it for me every night.) and that&#39;s<br/>\n&gt; &gt; how I got suspended.<br/>\n&gt; &gt; ~Nancy<br/>\n&gt; <br/>\n&gt; I wrote a post on another list last week which got no response at all, but<br/>\n&gt; I&#39;d love to discuss with *someone*!  Your dad may be the answer to the<br/>\n&gt; question I pose at the very end, although I&#39;m sure there are other answers.<br/>\n&gt; A hit-and-run poster with an addy which included &quot;charter.net&quot; posted,<br/>\n&gt; causing quite a stir; my reply follows: <br/>\n&gt; &lt;snip&gt;<br/>\n&gt; It takes only 3-4 days for the characteristic bond of the Stockholm syndrome<br/>\n&gt; to emerge when captor and captive are strangers. After that, research shows,<br/>\n&gt; the duration of captivity is no longer relevant.<br/>\n&gt; ***<br/>\n&gt; <br/>\n&gt; I realize children are not actually threatened with *death* in kindergarten,<br/>\n&gt; but consider the trauma of separation from the parent; those photos of<br/>\n&gt; children clinging to mommy as they are taken, crying, aboard a bus that<br/>\n&gt; first day of school are a regular feature of September newspapers, and<br/>\n&gt; something our society takes for granted as *normal,* a part of growing up.<br/>\n&gt; Kids get used to it, right?  (They can&#39;t escape.)  After a month or two,<br/>\n&gt; (with compliance from their parents, who continue the school&#39;s program by<br/>\n&gt; enforcing homework and sending them back every day) they love school, don&#39;t<br/>\n&gt; they?  <br/>\n&gt; &lt;snip&gt;<br/>\n&gt; The duration of captivity seems to continue into adulthood for some people.<br/>\n&gt; I wonder what makes the difference in those of us who reject school?<br/>\n&gt; <br/>\n&gt; Nancy<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I don&#39;t quite know how to answer this. I hope I know what you are asking.<br/>\n<br/>\nMy dad taught me to always be a leader and never a follower. And although I <br/>\nnever considered myself a leader, (I was somewhat of a geek in school. Wait! <br/>\nI WAS a geek in school. &lt;g&gt;) I never was a follower. My folks are very <br/>\nconservative, upper, upper, middle class, white... My dad made tons of money <br/>\nin 70&#39;s through oil. But, he was a naturalist at heart. For as long as I can <br/>\nremember, we hunted and fished, and had gardens on the scale of small farms. <br/>\nWe planted trees all over the land we had when I was a teenager, but cut down <br/>\ntrees to heat our home too. He taught me to take what I needed, nothing more, <br/>\nand put back twice that.<br/>\n<br/>\nMy point? Well, even though I went to public school I always *knew* I had <br/>\noptions. Not to say I could have come home and said *I&#39;m never going back, <br/>\nhows about you learn me at home?* But I knew that if there was a problem at <br/>\nschool, I could count on my dad to stick up for me, absolutely, positively, <br/>\nno matter what. I hated school, I was a loner, had few friends... but it was <br/>\nthe one area I never felt my dad just abandoned me in. My dad sticking up for <br/>\nme and my shirt wasn&#39;t the only time. My dad hated that shirt, it stood for <br/>\njust about everything he was against. He also hated my purple hair, my shaved <br/>\nhead, my earrings, my trench coat, my steel toed combat boots, most of my <br/>\nfriends, my music, my taste in literature... But he stood up for my rights to <br/>\nbe the person I was. And that included my right to not be a captive, a <br/>\nfollower, a public school drone. <br/>\n<br/>\nOnce, in third grade, the teacher tried to use this *positive reenforcement* <br/>\nthing with us. We got these big yellow cards and if she caught us being bad, <br/>\nshe wouldn&#39;t say anything, she would just walk over and punch a hole in it. <br/>\nIf there were so many punches, we had to sit at our desk with a three sided <br/>\ncardboard *cubicle* around us. No one was to talk to us while we had this <br/>\naround our desk. We couldn&#39;t see out, unless we looked behind us. Well, I had <br/>\none of these around my desk for almost a week. (I was really bad! &lt;g&gt;) and I <br/>\nwas bored. I couldn&#39;t participate in the class, I couldn&#39;t see the teacher or <br/>\nthe board, it was a mess. I was upset, and wrote all over the inside of the <br/>\nbox. I got caught and was made to stay inside for recess to write sentences <br/>\nabout not defacing school property. I had to go pee, and the teacher wouldn&#39;t <br/>\nlet me talk. I kept raising my hand, she ignored me, I stood up and spoke, <br/>\nshe yelled at me... finally I wet my pants. I was a mess, I was crying and <br/>\nvery embarrassed. The teacher was yelling about how come I didn&#39;t tell her I <br/>\nhad to use the bathroom. (HUH??) The kids all came back from recess, everyone <br/>\nsaw, everyone made fun. So my teacher took me to the office and called my <br/>\nhouse. My dad was home for lunch so he came to the school. He and that <br/>\nteacher were in the principals office for a long time. When they came out she <br/>\nwas in tears, and my dad took me home for the rest of the day. My dad didn&#39;t <br/>\nmake me ride the bus the next morning, he took me. On the ride to school he <br/>\nsaid two things to me, Never write or draw on something that isn&#39;t yours and <br/>\nnever ever raise your hand to go to the bathroom, if you have to go, you go. <br/>\nWhen I got to class, my teacher said I was excused from the work I had missed <br/>\nwhile the cubicle was around me. There were no more punch cards and I never <br/>\nsaw another cubicle around me or any other kid ever again. And I never raised <br/>\nmy hand to go to the bathroom ever again. <br/>\n<br/>\nSo why do some kids get &quot;caught&quot; in school and never seem to get out and <br/>\nothers are able to reject it all and come out strong? Somewhere, sometime <br/>\nthere was someone in their life who had an impact on them, who stood up for <br/>\nthem, did something to let them know that school wasn&#39;t all there was. Even <br/>\nif there wasn&#39;t someone like my dad in the equation, if it was just one <br/>\nperson who did one small thing way back in third grade... it can and does <br/>\nmake a difference. <br/>\n~Nancy~ who hopes she somehow answered Nancy&#39;s question? (Did I get it <br/>\nright?) <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":8594,"nextTopicId":9065}}