{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Are we deschooling?","postDate":"1240881493","msgId":44370,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU5MkMwQTJDLURCODAtNDlBQi05QTY0LThCM0E1QzNFQzRDREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGNiMS40MDlhMjQxYi4zNzI3OTUwNEBhb2wuY29tPg==","referencesHeader":"PGNiMS40MDlhMjQxYi4zNzI3OTUwNEBhb2wuY29tPg=="},"prevInTopic":44369,"nextInTopic":0,"prevInTime":44369,"nextInTime":44371,"topicId":44303,"numMessagesInTopic":0,"msgSnippet":"-=if she s taking a holiday in order to deschool, what do we do about music, which is a major holiday activity for her? -=- If that never was school to her,","messageBody":"<div id=\"ygrps-yiv-213533533\">-=if she&#39;s taking a holiday in order to deschool, what do<br/>\nwe do about music, which is a major holiday activity for her? -=-<br/>\n<br/>\nIf that never was school to her, don&#39;t worry about it.  If unschooling  <br/>\ngives her more time to play and listen to baroque music, good!  If  <br/>\nwe&#39;re ever in the same place, ask her to let me play with her.  I love  <br/>\nbaroque music.  I&#39;m down to one decent alto recorder these days, but  <br/>\nit&#39;s workable.   New Mexico&#39;s not ideal for recorders, it turns out.   <br/>\nAfter 25 or 30 years, they dry out, and the cork falls off, and  <br/>\nsometimes the wood cracks. &lt;g&gt;  I didn&#39;t know that until recently!<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62589750,"authorName":"JudithAnneMurphy@aol.com","from":"JudithAnneMurphy@...","profile":"shepherdlass","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Are we deschooling?","postDate":"1240873732","msgId":44369,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNiMS40MDlhMjQxYi4zNzI3OTUwNEBhb2wuY29tPg=="},"prevInTopic":44339,"nextInTopic":44370,"prevInTime":44368,"nextInTime":44370,"topicId":44303,"numMessagesInTopic":0,"msgSnippet":"Thaks to you all for your advice on this.  I ll do my best to take it  on board.  Sandra s comment about the dialectical way I was pitching one  way of ","messageBody":"<div id=\"ygrps-yiv-1366560997\">Thaks to you all for your advice on this.  I&#39;ll do my best to take it  on <br/>\nboard.  Sandra&#39;s comment about the dialectical way I was pitching one  way of <br/>\nthinking against another felt absolutely spot on - I just hope it  <br/>\ngradually becomes easier to go with the flow and not see things as stark  opposites.<br/>\n <br/>\nI would like to clarify the situation regarding &quot;classes&quot;.  The  workshops <br/>\nI was referring to were things that Jess said she wanted to attend  because <br/>\nher friends would be there and she wanted to spend some time with  them.  <br/>\nSome live quite far away from us and these were perhaps  the only mutually <br/>\nconvenient venues and dates for a few weeks.  I knew  that the actual content <br/>\nof one workshop would suit her (her words: she  &quot;couldn&#39;t wait to do creative <br/>\nwriting with a real author!&quot;) and  that the other might not, but it wasn&#39;t <br/>\nreally a question of offering to  take her to &quot;a class&quot;.  Rather than being <br/>\nabout &#39;educating&#39; her, it  was a chance to get out and about among people <br/>\nshe likes.  When she  wasn&#39;t enjoying the more &quot;schooly&quot; session and we <br/>\nrealized she didn&#39;t have much  chance to socialize there either, we came away.<br/>\n <br/>\nAs for the one-to-one music lessons... we talk a lot about music, we can  <br/>\nappreciate lots of things together  and she can share her  enthusiasms with <br/>\nme.  But, when it comes to developing the baroque  ornamentation, <br/>\narticulation and use of vibrato (and suchlike)  that she personally and of her own <br/>\nchoice, wants to master, then it&#39;s  nice for her to get to this by playing her <br/>\nmusic to an interested expert  observer who can then give her constructive <br/>\nfeedback and share their  understanding of what is a very specific technique.  <br/>\n We  could (and do) look this stuff up together, and we certainly enjoy  <br/>\nlistening to it together ... but she doesn&#39;t like playing it with me, as I&#39;m <br/>\ntoo  grounded in other styles, and it&#39;s great for her to spend time with <br/>\npeople  who&#39;ve done it for real. I know that Sandra and a couple of others were  <br/>\nasking if this interest is Jess&#39;s rather than something driven by a desire <br/>\nto  please the adults around her.  I think it is.  She does  it out of <br/>\nfascination and fun and because the music moves her.  She  does feel &quot;clever&quot; <br/>\nwhen she gets something new, but not in a &quot;top of the  class&quot; competitive kind <br/>\nof way.  Certainly, she doesn&#39;t feel - and is  not made to feel - that she <br/>\nshould do music because it&#39;s a potential  profession (probably the opposite, <br/>\nbecause she&#39;s seen what it&#39;s like to  have 2 out of work musos as parents!). <br/>\n But she likes to figure this stuff  out, and she has eventually (by <br/>\nprocess of elimination) found a couple  of inspirational adult mentors who help <br/>\nher to do this at her own pace and  to suit her own style.  Which was where my <br/>\nquery came from - if she&#39;s  taking a holiday in order to deschool, what do <br/>\nwe  do about music, which is a major holiday activity for  her?    <br/>\n <br/>\nSorry, this is another long post, but it does feel like the devil&#39;s in  the <br/>\ndetail.<br/>\n <br/>\nJude x<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Are we deschooling?","postDate":"1240803258","msgId":44339,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5RjUyN0JBLjkwMDAwMDVAbWFjLmNvbT4=","inReplyToHeader":"PEZDNDcyNjA2LTgwNjktNDVDNi04MDNDLUVEMzUyNUQxQUQ1REBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGd0MjhmYSsyZjlxQGVHcm91cHMuY29tPiA8RkM0NzI2MDYtODA2OS00NUM2LTgwM0MtRUQzNTI1RDFBRDVEQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":44319,"nextInTopic":44369,"prevInTime":44338,"nextInTime":44340,"topicId":44303,"numMessagesInTopic":0,"msgSnippet":"I d add - if their kid has an interest and the parents first response is to think of taking a class - then they should challenge themselves to think of a","messageBody":"<div id=\"ygrps-yiv-1841889435\">I&#39;d add - if their kid has an interest and the parents first response is <br/>\nto think of &quot;taking a class&quot; - then they should challenge themselves to <br/>\nthink of a half-dozen other ways that they could follow up on that <br/>\ninterest. And, &quot;get a book on it,&quot; can&#39;t be the only other option. And <br/>\none of the options might be being willing to listen to the kid talk <br/>\nabout it.<br/>\n<br/>\n-pam<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 4/26/2009 12:08 PM, Sandra Dodd wrote:<br/>\n&gt; -=-Knowing without a<br/>\n&gt; doubt that classes and educational activities are tools, one of but many<br/>\n&gt; different tools to learning things, will help to see it within the<br/>\n&gt; context of deschooling and real life learning.-=-<br/>\n&gt;<br/>\n&gt; Anyone who doesn&#39;t understand that statement probably should take a<br/>\n&gt; sabbatical from all class-like situations for six months or more.<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Are we deschooling?","postDate":"1240772891","msgId":44319,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZDNDcyNjA2LTgwNjktNDVDNi04MDNDLUVEMzUyNUQxQUQ1REBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGd0MjhmYSsyZjlxQGVHcm91cHMuY29tPg==","referencesHeader":"PGd0MjhmYSsyZjlxQGVHcm91cHMuY29tPg=="},"prevInTopic":44317,"nextInTopic":44339,"prevInTime":44318,"nextInTime":44320,"topicId":44303,"numMessagesInTopic":0,"msgSnippet":"-=-Knowing without a doubt that classes and educational activities are tools, one of but many different tools to learning things, will help to see it within","messageBody":"<div id=\"ygrps-yiv-627061061\">-=-Knowing without a<br/>\ndoubt that classes and educational activities are tools, one of but many<br/>\ndifferent tools to learning things, will help to see it within the<br/>\ncontext of deschooling and real life learning.-=-<br/>\n<br/>\nAnyone who doesn&#39;t understand that statement probably should take a  <br/>\nsabbatical from all class-like situations for six months or more.<br/>\n<br/>\nKelly Lovejoy touched on that in her stages of unschooling article.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/stages/\">http://sandradodd.com/stages/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Are we deschooling?","postDate":"1240769834","msgId":44317,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd0MjhmYSsyZjlxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGd0MDZxMCtqYTk4QGVHcm91cHMuY29tPg=="},"prevInTopic":44309,"nextInTopic":44319,"prevInTime":44316,"nextInTime":44318,"topicId":44303,"numMessagesInTopic":0,"msgSnippet":"... feel like it s supposed to be a full-scale sabbatical from all things deliberately educational. Do I have this wrong? Can deschooling effectively happen so","messageBody":"<div id=\"ygrps-yiv-453082597\"><blockquote><span title=\"ireply\">&gt;&gt;&gt; Which brings me back to my query: when deschooling is mentioned, I<br/>\n </span></blockquote>feel like it&#39;s supposed to be a full-scale sabbatical from all things<br/>\ndeliberately educational. Do I have this wrong? Can deschooling<br/>\neffectively happen so long as the few consciously educational activities<br/>\nthat a child is following are in pursuit of their most passionate<br/>\ninterests, and so long as there&#39;s a willingness to discard any<br/>\nactivities that pall?&gt;&gt;&gt;<br/>\n<br/>\nIt&#39;s about choice.  If your child really is choosing these activities<br/>\nfree to stop or change course, then your on the right path.<br/>\n<br/>\nOne of the really big things that I&#39;ve seen from unschoolers, is knowing<br/>\nhow to learn, that learning and teaching aren&#39;t the same thing.  One can<br/>\nchoose to take a class to learn something and indeed learn a great deal,<br/>\nbut the learning is about the learner, more than it is about the teacher<br/>\nimparting wisdom.<br/>\n<br/>\nClasses can be used as a crutch to real learning.  Classes can be<br/>\nextremely eye opening and world expanding.  It really depends on how the<br/>\nperson taking the class is experiencing the class.  Knowing without a<br/>\ndoubt that classes and educational activities are tools, one of but many<br/>\ndifferent tools to learning things, will help to see it within the<br/>\ncontext of deschooling and real life learning.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Are we deschooling?","postDate":"1240757658","msgId":44309,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM2ODA3QjJCLUU3OEEtNEUyNC1BNzRCLTQ5MjI2MzVGNDNCMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGd0MDZxMCtqYTk4QGVHcm91cHMuY29tPg==","referencesHeader":"PGd0MDZxMCtqYTk4QGVHcm91cHMuY29tPg=="},"prevInTopic":44303,"nextInTopic":44317,"prevInTime":44308,"nextInTime":44310,"topicId":44303,"numMessagesInTopic":0,"msgSnippet":"-=-I know that deschooling has been mentioned quite a bit over the last few days. And I gather that the principle is to deschool ourselves as parents as much","messageBody":"<div id=\"ygrps-yiv-848138961\">-=-I know that deschooling has been mentioned quite a bit over the  <br/>\nlast few days. And I gather that the principle is to deschool  <br/>\nourselves as parents as much (or more) than deschooling our children. - <br/>\n=-<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling\">http://sandradodd.com/deschooling</a><br/>\n<br/>\nThis is important.  Unschooling will never take without it.<br/>\n<br/>\n-=-What I&#39;d like to ask is how this process combines with ongoing  <br/>\n(semi-)structured activity that enables a child to pursue their own  <br/>\npassions. -=-<br/>\n<br/>\nIt depends on how structured, who chose it, and maybe who&#39;s driving  <br/>\nand what is said in the car.<br/>\n<br/>\nThat process doesn&#39;t combine with anything, though.   It is possible  <br/>\nto continue activities like dance classes or park days without it  <br/>\nbeing a problem.  It is possible for it to totally put the brakes on  <br/>\nit, because it&#39;s not the what so much as the why and how.<br/>\n<br/>\n-=-We&#39;ve since had a weekend that responds to her love of baroque  <br/>\nrecorder, going to hear the fabulous, iconoclastic group, Red Priest ( <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.piersadams.com/RedPriest/index.html\">http://www.piersadams.com/RedPriest/index.html</a> <br/>\n  ), and then taking her to play in a recorder orchestra concert.  <br/>\nWatching her smiling face, both while she listened to others and while  <br/>\nshe was playing, brought home to me how intensely she engages with  <br/>\nthis music. Developing in the way she wants and at the speed she wants  <br/>\nreally does seem to entail her attending specialist lessons. -=-<br/>\n<br/>\nIf it&#39;s something she wants and it&#39;s not pressure or requirement or  <br/>\nguilt-fed, I don&#39;t see a problem.  If adults around her give her  <br/>\nmessages indicating that at least she has one worthy pursuit, or that  <br/>\nmaybe she can find a career in music, you might want to interject that  <br/>\nshe&#39;s doing it for fun, and smile.<br/>\n<br/>\n-=-Which brings me back to my query: when deschooling is mentioned, I  <br/>\nfeel like it&#39;s supposed to be a full-scale sabbatical from all things  <br/>\ndeliberately educational. -=-   For the parent, especially, it should  <br/>\nbe a firebreak between the past life and the future--an effort to  <br/>\ncleanse one&#39;s thinking of ideas like what&#39;s &quot;educational.&quot;  If you can  <br/>\nhear the words you use aloud, at first, and then the phrases you  <br/>\nthink, you can see all the ways in which you (because of schooling,  <br/>\nbecause of the cultural norms and expectations) have divided the world  <br/>\nand categorized objects and activities into &quot;educational&quot; and &quot;just  <br/>\nfor fun&quot; (or whatever phrases come to you as you consider this).<br/>\n<br/>\n-=-Can deschooling effectively happen so long as the few consciously  <br/>\neducational activities that a child is following are in pursuit of  <br/>\ntheir most passionate interests, and so long as there&#39;s a willingness  <br/>\nto discard any activities that pall?-=-<br/>\n<br/>\nThe language of the question is stiff.   If you save it and look back  <br/>\non it after two or three years of unschooling, you&#39;ll know what I  <br/>\nmean.   All its edges seem solid.  It&#39;s filled with dichotomy and  <br/>\ndualistic walls and barriers.<br/>\n<br/>\nIf those ideas can become transparent, wispy, airy, the questions will  <br/>\ndisappear.<br/>\n<br/>\nIf you begin to make decisions based on what provides joy and  <br/>\nlearning, rather than what is educational or irritating, the very same  <br/>\nworld will look very different.  You won&#39;t need to &quot;discard  <br/>\nactivities&quot; if you see them for what they are rather than what they  <br/>\nwere advertised to be.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62589750,"authorName":"shepherdlass","from":"&quot;shepherdlass&quot; &lt;JudithAnneMurphy@...&gt;","profile":"shepherdlass","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Are we deschooling?","postDate":"1240702592","msgId":44303,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd0MDZxMCtqYTk4QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":44309,"prevInTime":44302,"nextInTime":44304,"topicId":44303,"numMessagesInTopic":0,"msgSnippet":"I know that deschooling has been mentioned quite a bit over the last few days.  And I gather that the principle is to deschool ourselves as parents as much (or","messageBody":"<div id=\"ygrps-yiv-263426095\">I know that deschooling has been mentioned quite a bit over the last few days.  And I gather that the principle is to deschool ourselves as parents as much (or more) than deschooling our children.  <br/>\n<br/>\nWhat I&#39;d like to ask is how this process combines with ongoing (semi-)structured activity that enables a child to pursue their own passions. <br/>\n<br/>\nThe last few days have been very interesting in this respect.  Certainly, Jess spends a lot more time on WoW/Sims/reading manga than ever.  But on Thursday, Jess and I went along to a home educators&#39; art workshop at a local art gallery.  When we got there we realized it was a fairly heavily structured mask-making activity.  Jess had done this at school ... several times!  So we left shortly after the session started and instead went shopping for manga books and some nice new pencils for Jess&#39;s own manga drawings.  I hope my suggestion that we take a look at the art workshop was in the spirit of &#39;strewing&#39; ... and at least the confidence with which I said &quot;Yes&quot; when she asked to leave feels like a sign of a small change in my thinking.<br/>\n<br/>\nOn Friday, we went to one of the local home ed groups that Jess has keenly wanted to become involved with: a creative writing workshop with a local author.  Although the session did seem fairly structured, Jess adored it - it helped her unlock some techniques to build a fantasy world that her characters can live in.  Almost immediately after the session, she voluntarily wrote some quite detailed background to this fascinating world and shared it with the online writing group. <br/>\n<br/>\nWe&#39;ve since had a weekend that responds to her love of baroque recorder, going to hear the fabulous, iconoclastic group, Red Priest ( <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.piersadams.com/RedPriest/index.html\">http://www.piersadams.com/RedPriest/index.html</a> ), and then taking her to play in a recorder orchestra concert.  Watching her smiling face, both while she listened to others and while she was playing, brought home to me how intensely she engages with this music.  Developing in the way she wants and at the speed she wants really does seem to entail her attending specialist lessons.  <br/>\n<br/>\nWhich brings me back to my query: when deschooling is mentioned, I feel like it&#39;s supposed to be a full-scale sabbatical from all things deliberately educational.  Do I have this wrong?  Can deschooling effectively happen so long as the few consciously educational activities that a child is following are in pursuit of their most passionate interests, and so long as there&#39;s a willingness to discard any activities that pall?<br/>\n<br/>\nJude x</div>","specialLinks":[]}],"prevTopicId":44365,"nextTopicId":44367}}