{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":78954203,"authorName":"warblwarbl@aol.com","from":"warblwarbl@...","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Frustrated swearing kids","postDate":"1063526598","msgId":80441,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4ZS4xZjllN2MwYS4yYzk1N2FjNkBhb2wuY29tPg=="},"prevInTopic":80410,"nextInTopic":0,"prevInTime":80440,"nextInTime":80442,"topicId":80397,"numMessagesInTopic":0,"msgSnippet":"Rages are way less of a problem now here with my 9 yo than when he was 8 and I m sure simply growing up a little had something to do with it.  I think we ","messageBody":"<div id=\"ygrps-yiv-2055033236\">Rages are way less of a problem now here with my 9 yo than when he was 8 and <br/>\nI&#39;m sure simply growing up a little had something to do with it.  I think we <br/>\nhelped though (and we were helped by folks here - thanks).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; In some families I&#39;ve known well enough to see the dynamics from the point <br/>\n&gt; of <br/>\n&gt; view of more than one person there, kids were frustrated without their <br/>\n&gt; parents&#39; awareness because of patterns the parents had of making jokes about <br/>\n&gt; them as <br/>\n&gt; if they weren&#39;t there, or teasing them in ways the parents thought were <br/>\n&gt; friendly, but the kids were perceiving as cruel or embarrassing, or that the <br/>\n&gt; kids <br/>\n&gt; interpreted as being dismissive of their opinions or emotions.  Then when <br/>\n&gt; the <br/>\n&gt; kid blew, the parents would express surprise that they had been being <br/>\n&gt; friendly <br/>\n&gt; and the kid blew for no reason.  But what the parents saw as &quot;friendly&quot; was <br/>\n&gt; a <br/>\n&gt; set of tiny bits of evidence that the kid was &quot;just a kid&quot; or a funny kid, <br/>\n&gt; or <br/>\n&gt; an irritating kid, or a kid who might be about to blow, and then the kid <br/>\n&gt; would <br/>\n&gt; blow.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>This is the stuff my husband has had to learn to stop doing.  He likes to <br/>\nlive life with an ironic commentary of ongoing events but that just doesn&#39;t work <br/>\nwith kids who haven&#39;t been bullied into &quot;toughing it out.&quot;  He&#39;s really <br/>\nlearned to use kind and gentle words, but sometimes still uses words when none are <br/>\nbetter (as do I sometimes).<br/>\n<br/>\n I think that the book The Explosive Child really helped me to learn that the <br/>\nexplosion is not a &quot;teachable moment&quot; and that our job at that time is just <br/>\nto help him out of the explosion.  I didn&#39;t find that book as helpful regarding <br/>\npreventing explosions, probably because it&#39;s based on the assumption of quite <br/>\na lot of control by parents over kids.<br/>\n<br/>\nWhat&#39;s been way more helpful is Non Violent Communication.  Even if I don&#39;t <br/>\nsay anything out loud using it, thinking through the parts helps me realize <br/>\nways I&#39;m coming across as judgemental or ways I&#39;m second guessing someone else&#39;s <br/>\nfeelings rather than acknowledging my own or ways I&#39;m demanding rather than <br/>\nrequesting.  It also puts me in touch with my own needs, such  as feeling safe, <br/>\nthat I may need to voice.  Somehow it makes us all human, no good guy, bad guy <br/>\nor power holder, power seeker dicotomies.  And that makes a huge difference <br/>\nto my children.  I&#39;m seeing them with more compassion and asking them to see me <br/>\nwith compassion.  <br/>\n<br/>\nSo in a case where there&#39;s name calling I&#39;ve expressed my sadness for myself <br/>\nor whoever was called the idiot and asked to have my need for respect met by <br/>\nhaving other words used to express frustration.  It sounds sort of hokey and <br/>\nstilted and 70s-ish, but somehow it&#39;s helped me really come from that place of <br/>\nwanting to connect rather than control.  And my kids really see that and <br/>\nrespond to it.<br/>\n<br/>\nI&#39;m just a novice at this stuff, but I&#39;d highly recommend Marshall <br/>\nRosenberg&#39;s book, Non Violent Communication.  There&#39;s a tape of a very introductory but <br/>\ninspiring session  about NVC from the HSC coference this past August too <br/>\n(hsc.org to order) .<br/>\n<br/>\nPam T.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Frustrated swearing kids","postDate":"1063475693","msgId":80410,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5Mi4xZmE4MjE3My4yYzk0YjNlZEBhb2wuY29tPg=="},"prevInTopic":80397,"nextInTopic":80441,"prevInTime":80409,"nextInTime":80411,"topicId":80397,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/13/03 10:45:23 AM, maryfhickman@jps.net writes: ","messageBody":"<div id=\"ygrps-yiv-1462202970\">In a message dated 9/13/03 10:45:23 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:maryfhickman@...\">maryfhickman@...</a> writes:<br/>\n<br/>\n&lt;&lt; Wow these kids exhaust us, but when things go well, like yesterday, I feel <br/>\nI have given him the gift of problem solving. He will always have struggles, <br/>\nknowing how to handle them is so important.  &gt;&gt;<br/>\n<br/>\nKirby used to have fits, but he doesn&#39;t now.<br/>\nNow, in retrospect, I remember the details of a few and how I could have <br/>\nhelped defuse them even sooner.   If I had a second chance with Kirby knowing what <br/>\nI know now, it wouldn&#39;t be as bad for him.<br/>\n<br/>\nIf a kid stays in the same place too long without breathing or coming up for <br/>\nreality, they can get into a bad place.  I think it&#39;s biochemical.  I think <br/>\nthey need input to ground them in their surroundings.  It can be reading, or <br/>\ndrawing, or working on Lego, or a movie, or a video game, but it helps if they <br/>\nhave &quot;reality check&quot; in the form of another person passing by and saying &quot;How&#39;s <br/>\nit going?&quot; or a window opened which had been closed, or a fan turned on, or a <br/>\ncat to pet, or a drink of water or juice... some clues and contacts.  If one <br/>\nis in the car, mesmerized by phone poles going by, he&#39;s going into his own <br/>\nworld and it might help to engage him in something, even very small.   &quot;Do you <br/>\nneed to stop, Kirby?&quot;  We did learn to specifically ask him if he needed the rest <br/>\nstop that was coming up.  It made him feel remembered, and important, and <br/>\nthat kind of reset his switches altogether each time.  Whether he needed to stop <br/>\nor not, we had let him have the power to say &quot;yes stop,&quot; or &quot;no, we can keep <br/>\ngoing&quot; (and if someone else needed to stop, that was okay too--but giving Kirby <br/>\nthe first refusal, as it were, made him feel especially real).<br/>\n<br/>\nIn some families I&#39;ve known well enough to see the dynamics from the point of <br/>\nview of more than one person there, kids were frustrated without their <br/>\nparents&#39; awareness because of patterns the parents had of making jokes about them as <br/>\nif they weren&#39;t there, or teasing them in ways the parents thought were <br/>\nfriendly, but the kids were perceiving as cruel or embarrassing, or that the kids <br/>\ninterpreted as being dismissive of their opinions or emotions.  Then when the <br/>\nkid blew, the parents would express surprise that they had been being friendly <br/>\nand the kid blew for no reason.  But what the parents saw as &quot;friendly&quot; was a <br/>\nset of tiny bits of evidence that the kid was &quot;just a kid&quot; or a funny kid, or <br/>\nan irritating kid, or a kid who might be about to blow, and then the kid would <br/>\nblow.<br/>\n<br/>\nIt might be revised and resent, but a moderator has returned a post in part <br/>\nbecause the writer called advice from one of the others here &quot;ludicrous.&quot;  <br/>\n<br/>\nAdvice from someone who used to have problems but doesn&#39;t now, offered to <br/>\nsomeone who has had problems and is still having them is not likely to be <br/>\n&quot;ludicrous.&quot;  It might not be the perfect fit for that other dyad/group/situation, <br/>\nbut suggestions from moms who have succeeded in having peaceful family relations <br/>\nare valuable and should be respected.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":117956499,"authorName":"maryfhickman@jps.net","from":"maryfhickman@...","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Frustrated swearing kids","postDate":"1063471487","msgId":80397,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI5OTcwNDE5LjEwNjM0NzE0ODgyMzAuSmF2YU1haWwucm9vdEBlcm5pZS5wc3AucGFzLmVhcnRobGluay5uZXQ+"},"prevInTopic":0,"nextInTopic":80410,"prevInTime":80396,"nextInTime":80398,"topicId":80397,"numMessagesInTopic":0,"msgSnippet":"Hi, My Rilley, age 6.5, will swear, scream, kick. I have been it that car when a game goes wrong and I am blamed for his troubles. I have had to pull over and","messageBody":"<div id=\"ygrps-yiv-440647894\">Hi,<br/>\n<br/>\nMy Rilley, age 6.5, will swear, scream, kick. I have been it that car when a game goes wrong and I am blamed for his troubles. I have had to pull over and sit outside and wait it out. I have asked him to leave rooms. I have held him safely while he raged. Once the police showed up he was so loud.<br/>\n<br/>\n Have you read the Explosive Child? It goes into what this stuff is coming out of them. The author calls it mental debris. It&#39;s all garbage, the swearing, the screaming, the rage and our job as parents is to help them before they go overboard. Easier said than done most times, but you get the idea. Now once overboard, what do you get to do? Stay calm, keep everyone safe, breathe, and breathe some more. Hold the child, or not depending on them and stay calm and breathe. <br/>\n<br/>\nI am glad you brought this up. Yesterday Riley&#39;s shin gaurd wasn&#39;t feeling right. He went right into it from calm to a rage in like 2 seconds. Full on shoe flinging, kicking, maniac, with cleats on! He loves practice and the thought of not going was fueling the rage. I left the room for a bit then went back in and this is our dialogue, &quot;Wow Riley, you really want new shin guards.&quot;<br/>\n&quot;yup, these ones suck,&quot;<br/>\n&quot;practice is in 10 minutes, it really would be impossible to get new ones for today&#39;s practice.&quot;<br/>\n&quot;I want new shin guards right now.&quot;<br/>\n&quot;Riley, can you think of some other way to solve this big problem?&quot;<br/>\n&quot;Wait a minute, I think this might work.&quot; He was red in the face trying to pull one shin guard off while smashing his foot down. He did come up with a solution but he still hated his shin guards. Both cleats were on now<br/>\n<br/>\nI helped him up, asked him to sweat it out because at practice when he kicks the ball he might not feel it anymore. He was still upset in the car, but ran out to his team and practiced for an hour and came back to me as if we never had a 30 minute rage about the feel of his shin guard. <br/>\n<br/>\nWow these kids exhaust us, but when things go well, like yesterday, I feel I have given him the gift of problem solving. He will always have struggles, knowing how to handle them is so important.  The Explosive Child has lots of good examples.<br/>\n<br/>\nOn treating people respectfully. I have made it clear that I am not to be sweared at, hit or hurt. They forget alot. I remind them or remove myself. I agree with Sandra that kids need to find better ways to let out that frustration which doesn&#39;t hurt them, someone else or property. I have a need to be safe in my house. We practice frustration release daily around here. We talk about what happened and 1 way we could have handled it differently which would not have caused more problems. I am now watching my 4 year old copy Riley&#39;s way of handling things. So we get to do this all over again, though she does not have the explosive temperment, she thinks rage/hitting is how problems are solved these days. I&#39;m getting lots of practice. <br/>\n<br/>\nPeace, Mary H.</div>","specialLinks":[]}],"prevTopicId":80229,"nextTopicId":80331}}