{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Question re introducing someone to unschooling","postDate":"1308947457","msgId":61744,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMDg5NDc0NTcuNDQxNDIuWWFob29NYWlsTmVvQHdlYjExMDQwNS5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PGl0dm9kbitwZmRhQGVHcm91cHMuY29tPg==","referencesHeader":"PGl0dm9kbitwZmRhQGVHcm91cHMuY29tPg=="},"prevInTopic":61742,"nextInTopic":61746,"prevInTime":61743,"nextInTime":61745,"topicId":61737,"numMessagesInTopic":0,"msgSnippet":"***I have a friend/acquaintance with an autistic child of about 11/12 who has been struggling with getting him services in public school and she reports that","messageBody":"<div id=\"ygrps-yiv-1120678134\">***I have a friend/acquaintance with an autistic child of about 11/12 who has been struggling with getting him services in public school and she reports that home and school life is painful for her child and for her with struggles over homework and the structure they feel it is necessary to impose on the child. ***<br/>\n<br/>\n<br/>\nI have an acquaintance that I used to see every couple of months, at the library or around town.  She has one severely autistic son and a younger son who isn&#39;t at all.  She put her autistic son in special school at age 4 just to get a break for a couple of hours, 3 times a week.  Every time I saw her she looked tired and she would say something about it, and about her distaste for the school.  Every time I would just tell her, &quot;you know, you could take him out and keep him home, it might be more peaceful for your whole family.&quot;<br/>\n<br/>\nThat went on for several years.  One day, she told me, &quot;I took him out and things are so much better!&quot;  That was the last time I saw her.  It was years ago.  I assume that things are still better!  If they aren&#39;t, she could still put him in school.  I think, for her, she had to come to a point where she felt that she had nothing to lose.  The fact that I reiterated to her that she had a choice, made all the difference.  I never went into details about &quot;how&quot; to homeschool, just that she didn&#39;t need to keep her son in school.  I live in an area that has a HUGE homeschooling population with multiple local online forums.  I&#39;m sure she found her niche even if she didn&#39;t unschool her children.  I&#39;m sure, for that family, homeschooling saved them.<br/>\n<br/>\nI believe unschooling is the very best way to raise a child, otherwise I wouldn&#39;t be doing it.  However, sometimes, just keeping a kid out of school is better no matter how one homeschools.  We used to be involved in the larger homeschool community as there just weren&#39;t other unschoolers.  We&#39;ve met a lot of really wonderful families, some of whom we still talk to and run into.  You can share little bits of what you do as an unschooler, but don&#39;t discount the wider homeschooling world for someone that will be new at it.  That can be especially true for a parent who has been told repeatedly that their special needs child NEEDS structure in order to function.  It will take a lot of dismantling of ideas to get to a place where &quot;structure&quot; doesn&#39;t look like schedules and homework.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":137356086,"authorName":"Miriam Mason","from":"Miriam Mason &lt;mimmason@...&gt;","profile":"anonimommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Question re introducing someone to unschooling","postDate":"1308945762","msgId":61746,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM3MDc1RkNCLTc5MTgtNDkxMC1BRkMyLTMwMjFCMjUyMTZBQ0Bjb21jYXN0Lm5ldD4=","inReplyToHeader":"PEVGNTVDQkI1LURBNEQtNDBGOS1BNDgzLUQxN0UxMUNCNkVBMkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGl0dm9kbitwZmRhQGVHcm91cHMuY29tPiA8NzQwMTdCNTUtMTgyNC00NEUyLThEMUEtMDVENDg2QzNGRUZGQGNvbWNhc3QubmV0PiA8RUY1NUNCQjUtREE0RC00MEY5LUE0ODMtRDE3RTExQ0I2RUEyQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":61744,"nextInTopic":61747,"prevInTime":61745,"nextInTime":61747,"topicId":61737,"numMessagesInTopic":0,"msgSnippet":"Ah, Sandra, I was thinking about the word authentic from the stand point of having been through the singsongy rewards-based goal oriented therapy sessions,","messageBody":"<div id=\"ygrps-yiv-198572723\">Ah, Sandra, I was thinking about the word &quot;authentic&quot; from the stand point of having been through the singsongy rewards-based goal oriented therapy sessions, that felt completely inauthentic to me.  But you are completely right, mindful is a much better fitting word for it.<br/>\n<br/>\nThank you for the links.  I especially enjoyed the &quot;self-sacrifice&quot; versus &quot;investment&quot; part.  I think it touches in a really key panic moment many parents moving into an understanding of unschooling.<br/>\n<br/>\nBest,<br/>\nMiriam<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jun 24, 2011, at 12:07 AM, Sandra Dodd wrote:<br/>\n<br/>\n&gt; Authentic&quot; is not a clear idea nor one that&#39;s used regularly on this list. It suggests that there is one &#39;real&#39; way of being and the other actions or thoughts are &quot;inauthentic.&quot; I can&#39;t defend that. So because the poster said (along with other useful things) to trust this list, I thought I&#39;d point that out. There are authors elsewhere and discussions elsewhere where &quot;authentic&quot; has been given a special meaning, but I think it leads away from clarity and not toward it.<br/>\n&gt; <br/>\n&gt; There might be things here that will help people who are confused about why I would object to &quot;authenticity&quot; as a term here. It&#39;s better for categorizing antiques or reproductions of objects.<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/being\">http://sandradodd.com/being</a><br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/clarity\">http://sandradodd.com/clarity</a><br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Question re introducing someone to unschooling","postDate":"1308938973","msgId":61742,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRFMDREMkRELjMwNzAzMDZAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PGl0dm9kbitwZmRhQGVHcm91cHMuY29tPg==","referencesHeader":"PGl0dm9kbitwZmRhQGVHcm91cHMuY29tPg=="},"prevInTopic":61741,"nextInTopic":61744,"prevInTime":61741,"nextInTime":61743,"topicId":61737,"numMessagesInTopic":0,"msgSnippet":"... Homeschooling the Child with ADD (or Other Special Needs): Your Complete Guide to Successfully Homeschooling the Child with Learning Differences.  It","messageBody":"<div id=\"ygrps-yiv-1507574457\">On 6/23/2011 9:08 AM, miriam wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Any suggestions for a website or book that would be directly related <br/>\n&gt; to unschooling and autistic children that might help her on the way to <br/>\n&gt; a less contentious life with her child? I would be interested in <br/>\n&gt; reading it myself. <br/>\n<br/>\n<br/>\n </span></blockquote>&quot;Homeschooling the Child with ADD (or Other Special Needs): Your <br/>\nComplete Guide to Successfully Homeschooling the Child with Learning <br/>\nDifferences.&quot;  It isn&#39;t really at all limited to ADD - that was the <br/>\ntitle the publishers thought would get it the most attention.<br/>\n<br/>\nThe author is Lenore Hayes&#39;s and her 26 yo son, who has Aspergers, was <br/>\nalways completely unschooled. Her book, as I recall, would be a pretty <br/>\ngentle way to introduce the ideas of unschooling to someone who is still <br/>\nthinking in conventional terms about learning disabilities and all that <br/>\nstuff.<br/>\n<br/>\nIt is available used on Amazon for $5 or $6.<br/>\n<br/>\n-pam<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/s/ref=ntt_athr_dp_sr_1?_encoding=UTF8&sort=relevancerank&search-alias=books&field-author=Lenore%20Colacion%20Hayes\">http://www.amazon.com/s/ref=ntt_athr_dp_sr_1?_encoding=UTF8&sort=relevancerank&search-alias=books&field-author=Lenore%20Colacion%20Hayes</a>&gt; <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/s/ref=ntt_athr_dp_sr_1?_encoding=UTF8&sort=relevancerank&search-alias=books&field-author=Lenore%20Colacion%20Hayes\">http://www.amazon.com/s/ref=ntt_athr_dp_sr_1?_encoding=UTF8&sort=relevancerank&search-alias=books&field-author=Lenore%20Colacion%20Hayes</a>&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":100950165,"authorName":"Cindy Miller","from":"Cindy Miller &lt;millerblend@...&gt;","profile":"millerblend","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Question re introducing someone to unschooling","postDate":"1308925248","msgId":61747,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMDg5MjUyNDguOTg5ODEuWWFob29NYWlsQ2xhc3NpY0B3ZWIxMzAxMjIubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":61746,"nextInTopic":0,"prevInTime":61746,"nextInTime":61748,"topicId":61737,"numMessagesInTopic":0,"msgSnippet":"I agree with Sandra about the word authentic.   It reminds me of when people ask me if I am our (adopted) sons real mom.  Yes, I m real and I m their","messageBody":"<div id=\"ygrps-yiv-2122740706\">I agree with Sandra about the word &quot;authentic.&quot;  It reminds me of when people ask me if I am our (adopted) sons &quot;real&quot; mom.  Yes, I&#39;m real and I&#39;m their mom.  What they mean is am I their &quot;biological mom&quot; i.e. did I give birth to them.  :-)<br/>\n<br/>\n<br/>\nCindy M.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":336246301,"authorName":"NCMama","from":"&quot;NCMama&quot; &lt;dharmamama1@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Question re introducing someone to unschooling","postDate":"1308925245","msgId":61741,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGl1MjZmdCt2ZmFjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGl0dm9kbitwZmRhQGVHcm91cHMuY29tPg=="},"prevInTopic":61740,"nextInTopic":61742,"prevInTime":61740,"nextInTime":61742,"topicId":61737,"numMessagesInTopic":0,"msgSnippet":"Before recommending a website or book, you might say, We ve found a way to be really happy without school, as have many folks we know. Would you like to hear","messageBody":"<div id=\"ygrps-yiv-5256629\">Before recommending a website or book, you might say, &quot;We&#39;ve found a way to be really happy without school, as have many folks we know. Would you like to hear more?&quot;  Which, ugh, sounds like a multi-level-marketing sales pitch.<br/>\n<br/>\nMy point is, to ask first if she&#39;d like to hear some ideas. And you can now, after reading Mirian&#39;s email, truthfully say you know of someone who parents kids with autism, and this way works for them. To offer without asking first might seem a little pushy.<br/>\n<br/>\npeace,<br/>\nCaren<br/>\n<br/>\n<br/>\n=-=I would love to help my friend see there is a more peaceful alternative to the constant struggle to get her autistic child doing grade-level work and learning how to behave in a classroom, but I don&#39;t want to be pushy. Any suggestions for a website or book that would be directly related to unschooling and autistic children that might help her on the way to a less contentious life with her child?=-=</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Question re introducing someone to unschooling","postDate":"1308899269","msgId":61740,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVGNTVDQkI1LURBNEQtNDBGOS1BNDgzLUQxN0UxMUNCNkVBMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDc0MDE3QjU1LTE4MjQtNDRFMi04RDFBLTA1RDQ4NkMzRkVGRkBjb21jYXN0Lm5ldD4=","referencesHeader":"PGl0dm9kbitwZmRhQGVHcm91cHMuY29tPiA8NzQwMTdCNTUtMTgyNC00NEUyLThEMUEtMDVENDg2QzNGRUZGQGNvbWNhc3QubmV0Pg=="},"prevInTopic":61739,"nextInTopic":61741,"prevInTime":61739,"nextInTime":61741,"topicId":61737,"numMessagesInTopic":0,"msgSnippet":"-=-initially I sent them to school, disappointed that I could not choose unschooling (see experts who told me so: ex-spirts more like).-=- -=-What I can say","messageBody":"<div id=\"ygrps-yiv-234705655\">-=-initially I sent them to school, disappointed that I could not choose unschooling (see &quot;experts&quot; who told me so: ex-spirts more like).-=-<br/>\n-=-What I can say is that we&#39;ve been unschooling now for about 6 years and that despite all the &quot;structure&quot; and &quot;interventions&quot; my children were supposed to have to be &quot;successful&quot; (by whose definition?), our family life is peaceful, supportive, authentic and my boys are flourishing in ways I never dreamed possible-=-<br/>\n-=-Those experts are clueless. -=-<br/>\n<br/>\nI think the definiton of success is based on school&#39;s requirements and ideas, and of a child being self-sufficient by 18 (or the school maintaining that illusion that they know how to guarantee that).   I don&#39;t think they&#39;re clueless about school and therapies.  They&#39;re clueless about unschooling and peaceful family relationships, but most people are.<br/>\n<br/>\n-=-our family life is peaceful, supportive, authentic ...-=-<br/>\n<br/>\n&quot;Authentic&quot; is not a clear idea nor one that&#39;s used regularly on this list.  It suggests that there is one &#39;real&#39; way of being and the other actions or thoughts are &quot;inauthentic.&quot;  I can&#39;t defend that.  So because the poster said (along with other useful things) to trust this list, I thought I&#39;d point that out.  There are authors elsewhere and discussions elsewhere where &quot;authentic&quot; has been given a special meaning, but I think it leads away from clarity and not toward it.<br/>\n<br/>\nThere might be things here that will help people who are confused about why I would object to &quot;authenticity&quot; as a term here.  It&#39;s better for categorizing antiques or reproductions of objects.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/being\">http://sandradodd.com/being</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/clarity\">http://sandradodd.com/clarity</a><br/>\n<br/>\nAnd I&#39;d say maybe trust this list as far as believing that there are ways to live more peacefully, but each person has to figure those out.  We can help, but we can&#39;t deliver the completed understanding.   Trust us that there are children whose lives are full of learning, but you need to rearrange your own life to help your own child have that.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":137356086,"authorName":"Miriam Mason","from":"Miriam Mason &lt;mimmason@...&gt;","profile":"anonimommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Question re introducing someone to unschooling","postDate":"1308894382","msgId":61739,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc0MDE3QjU1LTE4MjQtNDRFMi04RDFBLTA1RDQ4NkMzRkVGRkBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGl0dm9kbitwZmRhQGVHcm91cHMuY29tPg==","referencesHeader":"PGl0dm9kbitwZmRhQGVHcm91cHMuY29tPg=="},"prevInTopic":61737,"nextInTopic":61740,"prevInTime":61738,"nextInTime":61740,"topicId":61737,"numMessagesInTopic":0,"msgSnippet":"Hi Miriam, from another Miriam. Alas, I do not have such a book recommendation, but I do have a personal story. I have two kids who live with autism, and","messageBody":"<div id=\"ygrps-yiv-2136387246\">Hi Miriam, from another Miriam.<br/>\n<br/>\nAlas, I do not have such a book recommendation, but I do have a personal story. I have two kids who live with autism, and initially I sent them to school, disappointed that I could not choose unschooling (see &quot;experts&quot; who told me so: ex-spirts more like).  My boys soon became unhappy, especially my older, and I learned shortly there after that I&#39;m the only expert on my own children.  It takes time to see that, and it sounds like your friend has been struggling a long time.  I&#39;m not sure quite how to offer transitionary ideas except to lean on the people on this list, because autism or not, respecting a child is respecting a child, valuing the relationship most highly is valuing the relationship most highly.<br/>\n<br/>\nWhat I can say is that we&#39;ve been unschooling now for about 6 years and that despite all the &quot;structure&quot; and &quot;interventions&quot; my children were supposed to have to be &quot;successful&quot; (by whose definition?), our family life is peaceful, supportive, authentic and my boys are flourishing in ways I never dreamed possible.  No, they do not fit into every neurotypical idea of what they &quot;should&quot; be at a given age, and they might never and it&#39;s not an issue here. That&#39;s not what we&#39;re striving for. If I can pass on my excitement for life and learning and openness, they pick that up, and narrow as experts say autism is, I say they are wrong and it can be incredibly expansive within the passions of my children.<br/>\n<br/>\nIt&#39;s a journey from one paradigm into another for all of us.  And parents of kids on the spectrum are literally frightened (&quot;ex-spirted&quot;) out of believing that anything other than their rigid guidelines will work for their child.<br/>\n<br/>\nI&#39;m here to tell you and your friend that is as far from the truth as it could ever be.  Those experts are clueless.  I&#39;m happy to talk about this further, and I&#39;m also happy to have a discussion with your friend.  I have two.  Both are absolutely flourishing, are happy, the house is full of loud laughter and creative steam-engines that are my children.  They are 12 and 9 currently.<br/>\n<br/>\nBest,<br/>\nMiriam<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jun 23, 2011, at 9:08 AM, miriam wrote:<br/>\n<br/>\n&gt; I have only been unschooling for a little less than 2 years, but it has made a huge difference in the peace of my home and in preserving my relationship with my daughter. I have a friend/acquaintance with an autistic child of about 11/12 who has been struggling with getting him services in public school and she reports that home and school life is painful for her child and for her with struggles over homework and the structure they feel it is necessary to impose on the child. She is anticipating that next year will be even more difficult and I know she is curious about my homeschooling experience as I am so positive about it. We mostly email about our hobby (doll collecting) so I am hesitant to say much about what my daughter and I do other than to say it is nontraditional.I am cautious because I know if someone popped the concept of unschooling on me 3 years ago, I would have rejected it out of hand as ridiculous. After a lot of reading John Holt and John Taylor Gattos, ,and a very shortlived unsuccessful attempt at school at home I happened on Sandra&#39;s unschooling site and it felt like everything fell into place. But if I hadn&#39;t already been thinking and exploring ideas about why school itself was the problem, not my child and her &quot;learning disabilities&quot;, I may not have been ready for these ideas. I would love to help my friend see there is a more peaceful alternative to the constant struggle to get her autistic child doing grade-level work and learning how to behave in a classroom, but I don&#39;t want to be pushy. Any suggestions for a website or book that would be directly related to unschooling and autistic children that might help her on the way to a less contentious life with her child? I would be interested in reading it myself. <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":301550989,"authorName":"miriam","from":"&quot;miriam&quot; &lt;miriyum1@...&gt;","profile":"omahonygirl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Question re introducing someone to unschooling","postDate":"1308845303","msgId":61737,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGl0dm9kbitwZmRhQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":61739,"prevInTime":61736,"nextInTime":61738,"topicId":61737,"numMessagesInTopic":0,"msgSnippet":"I have only been unschooling for a little less than 2 years, but it has made a huge difference in the peace of my home and in preserving my relationship with","messageBody":"<div id=\"ygrps-yiv-1150795621\">I have only been unschooling for a little less than 2 years, but it has made a huge difference in the peace of my home and in preserving my relationship with my daughter. I have a friend/acquaintance with an autistic child of about 11/12 who has been struggling with getting him services in public school and she reports that home and school life is painful for her child and for her with struggles over homework and the structure they feel it is necessary to impose on the child. She is anticipating that next year will be even more difficult and I know she is curious about my homeschooling experience as I am so  positive about it. We mostly email about our hobby (doll collecting) so I am hesitant to say much about what my daughter and I do other than to say it is nontraditional.I am cautious because I know if someone popped the concept of unschooling on me 3 years ago, I would have rejected it out of hand as ridiculous. After a lot of reading John Holt and John Taylor Gattos, ,and a very shortlived unsuccessful attempt at school at home  I happened on Sandra&#39;s unschooling site and it felt like everything fell into place. But if I hadn&#39;t already been thinking and exploring ideas about why school itself was the problem, not my child and her &quot;learning disabilities&quot;, I may not have been ready for these ideas. I would love to help my friend see there is a more peaceful alternative to the constant struggle to get her autistic child doing grade-level work and learning how to behave in a classroom, but I don&#39;t want to be pushy. Any suggestions for a website or book that would be directly related to unschooling and autistic children that might help her on the way to a less contentious life with her child? I would be interested in reading it myself.</div>","specialLinks":[]}],"prevTopicId":61724,"nextTopicId":61748}}