{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":87,"messages":[{"userId":217568290,"authorName":"Laureen","from":"Laureen &lt;splashing@...&gt;","profile":"elementalgrrl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] input regarding sleep issues with 4 year old","postDate":"1242876536","msgId":45373,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM2NDM4ODRjMDkwNTIwMjAyOHIyYzMxYzI1Y3c1NmYxYzhiZTM0OWRhOTYyQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PEQzOEIxRjQ2N0QxNDQ3M0FCRTE3ODRFRTUwOTA0QjVGQExZTEFMQVAyPg==","referencesHeader":"PEQzOEIxRjQ2N0QxNDQ3M0FCRTE3ODRFRTUwOTA0QjVGQExZTEFMQVAyPg=="},"prevInTopic":45372,"nextInTopic":45374,"prevInTime":45372,"nextInTime":45374,"topicId":45331,"numMessagesInTopic":0,"msgSnippet":"Heya! I m chiming in a little late. I have a nearly 1 year old girl, a nearly 4 year old (next week!) and a nearly 7 year old. So same age gap, plus one more","messageBody":"<div id=\"ygrps-yiv-156131067\">Heya!<br/>\n<br/>\nI&#39;m chiming in a little late. I have a nearly 1 year old girl, a nearly 4<br/>\nyear old (next week!) and a nearly 7 year old. So same age gap, plus one<br/>\nmore active person in the mix.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed, May 20, 2009 at 10:56 AM, Lyla Wolfenstein &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lylaw@...\">lylaw@...</a>&gt;wrote:<br/>\n<br/>\n&gt; so, she has a 4 year old and a 1 year old.  for what it&#39;s worth, the 4 year<br/>\n&gt; old is highly &quot;spirited&quot;, &quot;intense&quot;, &quot;explosive&quot;  - whatever you want to<br/>\n&gt; call it to paint the picture of the ways in which he is prone to respond to<br/>\n&gt; limits, challenges, overstimulation, etc.<br/>\n<br/>\n<br/>\nGotcha. Same here.<br/>\n<br/>\n&gt;<br/>\n&gt; he has been staying up progressively later and later, and sleeping in later<br/>\n&gt; and later, or sometimes not even sleeping in - waking at 5am, after falling<br/>\n&gt; asleep after 1am or 2am, and then staying up all day and night til quite<br/>\n&gt; late, even so short on sleep, and feeling quite fragile/lashing out, etc. in<br/>\n&gt; exhaustion.<br/>\n<br/>\n<br/>\nFor Kestrel, (the 4 year old), if he does not nap during the day, it&#39;s very<br/>\ndifficult for him to wind down to sleep. Oddly, if he has napped, he&#39;ll even<br/>\nsuggest bedtime himself. If he has not, he will fight it with every ounce of<br/>\nhis being, even including laying down under the dome light and staring at<br/>\nit.<br/>\n<br/>\n&gt;<br/>\n&gt; the problem is, while he seems content to entertain himself in the middle<br/>\n&gt; of the night, he tends to disrupt his everyone else&#39;s sleep, coming and<br/>\n&gt; going in and out of the room, pounding the wall or the bed in frustration<br/>\n&gt; while on his  laptop, opening and closing doors, etc.  he also has been<br/>\n&gt; known to climb bookshelves (yes they could anchor them), get into the fridge<br/>\n&gt; and take out lots of food and not eat it, and even leave the house (never<br/>\n&gt; yet at night, but they are worried about that).<br/>\n<br/>\n<br/>\nI can&#39;t imagine turning Kes loose without one of the adults present. Maybe<br/>\nI&#39;m just helicoptering, but he needs *way* more input from us than that.<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; in addition to feeling confused about why he is staying up all night, they<br/>\n&gt; can&#39;t figure out how to make it work for them as a family to support his<br/>\n&gt; seeming need to explore his independence and freedom in this way - the dad<br/>\n&gt; has to get up early for work - 5am.  and he works a second job from home<br/>\n&gt; that takes til 11 or midnight.  the mom cannot seem to sleep during the day<br/>\n&gt; even if the baby sleeps, so switching her schedule completely just doesn&#39;t<br/>\n&gt; feel doable.<br/>\n<br/>\n<br/>\nTrying to time naps is so incredibly tough. Especially when you&#39;ve got one<br/>\nwho isn&#39;t a lover of sleep.<br/>\n<br/>\nWe talk it through. I ask Rowan (7) to help me put the littler ones down for<br/>\nnaptime. Once the baby (Aurora) is looking sleepy, we head down to<br/>\nsomebody&#39;s berth (mine or theirs, whichever is more comfy seeming on the<br/>\nday), and snuggle up together with books, a movie, whatever. I nurse the<br/>\nbaby, and let Kestrel &quot;twitch&quot; (he seems to need to toss and turn a certain<br/>\namount). Eventually, Aurora goes to sleep, and by then, Kes has settled down<br/>\nenough to cuddle more (he likes having an arm or leg around him, almost like<br/>\nhuman swaddling). I breathe with him, then breathe to slow down, and he<br/>\nusually is out in 10 minutes or so. Then Rowan can either get up and go have<br/>\nprivate time (which he utterly treasures), or he will have gone to sleep<br/>\nhimself. Kes hates sleeping if Rowan&#39;s already up, and Rowan sees that Kes<br/>\nneeds the help, so he helps me with naptime as his choice.<br/>\n<br/>\nSo... if we&#39;ve had a nap, bedtime is a non-issue. Dinner, movie or stories,<br/>\nbrushing teeth, pajamas, and another story/movie/episode/music, whatever,<br/>\nwhile I put the baby down in my bed. Then I get up, and escort the boys to<br/>\ntheir bed, tuck them in, and listen to whatever they want to say. We often<br/>\ntry to talk about &quot;the good stuff&quot;, to go to sleep on a good note.<br/>\n<br/>\nI don&#39;t think we&#39;ve ever discussed &quot;naptime&quot; or &quot;bedtime&quot; as arbitrary;<br/>\nthey&#39;re just sort of the rhythm in which things happen. After dinner comes<br/>\nentertainment of some form, after that comes teeth brushing, blah blah blah.<br/>\nIt&#39;s our pattern. If the boys are particularly excited about a movie, we set<br/>\nup one of the laptops so they can watch in bed, and inevitably they fall<br/>\nasleep. About half the time, Jason (DH) sleeps with them, and that seems to<br/>\nregulate them a whole lot. He goes to bed way after they do, but if they&#39;ve<br/>\nagreed that it&#39;s their turn for Papa, they trust that he&#39;ll show up, and not<br/>\nonly do they both sleep better, they sleep longer too.<br/>\n<br/>\nI may be lucky simply because we live on a boat, and the whole &quot;exhausted by<br/>\nwater&quot; thing is a definite phenomenon. They sleep better here than they did<br/>\non land. They also get a ton more exercise than most kids, just by virtue of<br/>\nthe fact that the car is a good 300 yards from the boat.<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; anyone else been there with such a young kid?  ideas on what might be going<br/>\n&gt; on for him?  ways to support whatever it is while making it workable for the<br/>\n&gt; rest of the family?  a new way to look at the situation that niether of us<br/>\n&gt; are seeing? (my kids were much older when we came to unschooling).<br/>\n<br/>\n<br/>\nI find rhythms and patterns to be really helpful. I also find discussing my<br/>\nown rhythms and patterns with them to be useful. We had a big talk about<br/>\nsiesta a while back; my normal body clock includes getting up at sunrise,<br/>\nworking like mad, and then taking a nap between 3 and 4, and getting up and<br/>\ngoing again. I&#39;m happiest that way. I let them know when I&#39;d like to be<br/>\nnapping, so it&#39;s not like napping is a thing I&#39;m making them do.<br/>\n<br/>\nFun aside... a few weeks ago, Aurora got sick and was up all night, so I was<br/>\nseriously dragging. We all laid down for naptime together, and Kestrel and I<br/>\nfell asleep almost instantly, but Aurora was up and running and just really<br/>\nnot interested in sleeping *at all*. So Rowan picked her up, and brought her<br/>\nupstairs (it&#39;s about three steps away from the room I&#39;m in) and played with<br/>\nher for about 20 minutes, so I could get some rest.<br/>\n<br/>\nSo my suggestions all revolve around sleep as a family pattern, lots of<br/>\ncosleeping in various combinations, and depowering it as much as possible.<br/>\n<br/>\n-- <br/>\n~~L!<br/>\n<br/>\ns/v Excellent Adventure<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.theexcellentadventure.com/\">http://www.theexcellentadventure.com/</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] input regarding sleep issues with 4 year old","postDate":"1242875464","msgId":45372,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3MzNBM0JELTA5REMtNDc4QS1BQTMwLUZENTRENUUyMjVCMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDAyZjIwMWM5ZDliOCQ0NDdiNDkzMCQ2NDBhYTlhOUBHb256bz4=","referencesHeader":"PEQzOEIxRjQ2N0QxNDQ3M0FCRTE3ODRFRTUwOTA0QjVGQExZTEFMQVAyPiA8NTAxQTkzMDMtOTYyRS00NzJBLUE5NjktODU2MjE4REEwODNFQFNhbmRyYWRvZGQuY29tPiA8MkNBM0I0REVCQ0UyNEY2N0JFNTgyQUExMjAzQ0IzRjFATFlMQUxBUDI+IDw1YjliZjk4ZGRjNjhlZjEyOGE5YzYxMDRhNTMzYmE1N0BnbWFpbC5jb20+IDw0QTE0OTI4Qi4zMDYwODAxQG1hYy5jb20+IDwwMmYyMDFjOWQ5YjgkNDQ3YjQ5MzAkNjQwYWE5YTlAR29uem8+"},"prevInTopic":45371,"nextInTopic":45373,"prevInTime":45371,"nextInTime":45373,"topicId":45331,"numMessagesInTopic":0,"msgSnippet":"-=-This got me smiling! Damon used to fall asleep watching the movie Curious George (with the music by Jack Johnson lulling him off). I used to put it on ","messageBody":"<div id=\"ygrps-yiv-1769744835\">-=-This got me smiling! Damon used to fall asleep watching the movie  <br/>\nCurious<br/>\nGeorge (with the music by Jack Johnson lulling him off). I used to put  <br/>\nit on<br/>\nduring the daytime when he was 3 and really needed a nap but was  <br/>\nresisting<br/>\nsleep and wanted to watch a movie. -=-<br/>\n<br/>\nMarty&#39;s movie was Dumbo.<br/>\n<br/>\n-=-This seems to condone letting the 4yo stay up as long as he&#39;s not  <br/>\nleaving<br/>\nthe house! Maybe people forget what it&#39;s like when your kid is 4.-=-<br/>\n<br/>\nI&#39;d put Kirby in a high chair when he was really little and he was  <br/>\nwide awake, but the deal even then was I would put cartoons on if he  <br/>\nwould be really quiet.  That was in the video tape days and we had a  <br/>\nfour or six hour cartoon tape he liked lots and he had hardly ever  <br/>\nseen the whole thing.  I told him if the tape ended he could call me,  <br/>\nbut he never did.  I would pad him up and give him a little pillow and  <br/>\na sippy cup or two and a little bowl of food.<br/>\n<br/>\nAs he got older, if he wanted to stay in the living room quietly and  <br/>\nthen either sleep on the couch or come back into the bed, he could.<br/>\n<br/>\nThis worked because he cooperated with us, and because he was glad to  <br/>\nbe up, or sorry to be awake when everyone else was sleepy, but willing  <br/>\nto have the option not to have to lie down just because everyone else  <br/>\nwas.<br/>\n<br/>\nHolly, especially, was really good about picking a movie and staying  <br/>\nin a bed on the floor.  We had folding futons (still do) and blankets  <br/>\nor sleeping bags or pillows--whatever she wanted.  We would create a  <br/>\ncomfortable place for her to be safe and warm.  She didn&#39;t have to  <br/>\nstay right there, but she did need to be quiet.<br/>\n<br/>\nI do remember having little kids.  I remember being exhausted because  <br/>\nI had three little kids and Keith worked a LOT, and when Holly was  <br/>\nfive he took a temporary job in Minneapolis that ended up lasting  <br/>\nnearly four years.   He was home ten days a month, and the other times  <br/>\nit was just me and the kids.  I did have adult friends who were  <br/>\nwilling to hang out with me here and they were helpful with the kids  <br/>\nsometimes, and gave me adults to talk to.<br/>\n<br/>\nI think the relationship with the kids was first.  Nursing, reasoning,  <br/>\nrespect, negotiating as much freedom and togetherness as they wanted  <br/>\nfrom the beginning, made the other things work.  They didn&#39;t happen  <br/>\nsuddenly.  They grew gradually.<br/>\n<br/>\nOther unschoolers have come to these things later, though, so it can  <br/>\nbe done--it&#39;s more than just theoretical, but it&#39;s also not guaranteed.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] input regarding sleep issues with 4 year old","postDate":"1242874289","msgId":45371,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY2ODBCQ0U5M0ZERTQ0NTdCMTU1ODcxNjdBQjQ3MEM5QExZTEFMQVAyPg==","inReplyToHeader":"PDRBMTQ5NDRELjgwNTA0MDRAbWFjLmNvbT4=","referencesHeader":"PEQzOEIxRjQ2N0QxNDQ3M0FCRTE3ODRFRTUwOTA0QjVGQExZTEFMQVAyPiA8ZmY5YTMyYWYzOTMwZGI4NDQ3MTA0MzA0NTBmNzYzZGVAZ21haWwuY29tPiA8MDI1ODAxYzlkOThlJGYyM2ZjYTIwJDY0MGFhOWE5QEdvbnpvPiA8NEExNDk0NEQuODA1MDQwNEBtYWMuY29tPg=="},"prevInTopic":45370,"nextInTopic":45372,"prevInTime":45370,"nextInTime":45372,"topicId":45331,"numMessagesInTopic":0,"msgSnippet":"I m sorry I m not explaining this well - I know what I mean, but I m having a little trouble finding the words. Activity can be relaxing. I think some kids","messageBody":"<div id=\"ygrps-yiv-2105766897\">I&#39;m sorry I&#39;m not explaining this well - I know what I mean, but I&#39;m <br/>\nhaving a little trouble finding the words. Activity can be relaxing. I <br/>\nthink some kids need a LOT of very relaxing but also very physical <br/>\nactivity in order to be good-natured and calm.<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>i totally get the difference and know just what you mean pam, thanks.<br/>\n<br/>\nLyla<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":208961162,"authorName":"Kim Zerbe","from":"&quot;Kim Zerbe&quot; &lt;kim.zerbe@...&gt;","profile":"zerbe2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] input regarding sleep issues with 4 year old","postDate":"1242871379","msgId":45369,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyZjIwMWM5ZDliOCQ0NDdiNDkzMCQ2NDBhYTlhOUBHb256bz4=","inReplyToHeader":"PDRBMTQ5MjhCLjMwNjA4MDFAbWFjLmNvbT4=","referencesHeader":"PEQzOEIxRjQ2N0QxNDQ3M0FCRTE3ODRFRTUwOTA0QjVGQExZTEFMQVAyPiA8NTAxQTkzMDMtOTYyRS00NzJBLUE5NjktODU2MjE4REEwODNFQFNhbmRyYWRvZGQuY29tPiA8MkNBM0I0REVCQ0UyNEY2N0JFNTgyQUExMjAzQ0IzRjFATFlMQUxBUDI+IDw1YjliZjk4ZGRjNjhlZjEyOGE5YzYxMDRhNTMzYmE1N0BnbWFpbC5jb20+IDw0QTE0OTI4Qi4zMDYwODAxQG1hYy5jb20+"},"prevInTopic":45367,"nextInTopic":45370,"prevInTime":45368,"nextInTime":45370,"topicId":45331,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-2002125866\">&lt;&lt;We always &quot;lowered the level&quot; of noise and light and activity - in the <br/>\nmain part of the house, as the evening progressed. Nowadays, Rosie puts <br/>\non the Gilmore Girls or some other tv series on dvd that she&#39;s watched <br/>\nrepeatedly - she often falls asleep in the first minute or two. When I <br/>\ncan&#39;t sleep, I listen to books on my ipod - sometimes I listen half the <br/>\nnight, sometimes I fall asleep within minutes.&gt;&gt;<br/>\n<br/>\nThis got me smiling! Damon used to fall asleep watching the movie Curious<br/>\nGeorge (with the music by Jack Johnson lulling him off). I used to put it on<br/>\nduring the daytime when he was 3 and really needed a nap but was resisting<br/>\nsleep and wanted to watch a movie. I would suggest Curious George (only<br/>\nworked if he had not seen it too recently) and close the blinds and snuggle<br/>\nup with him, and eventually he&#39;d be asleep on my lap. Nursing helped too,<br/>\nbut just knowing that there was this 1 movie that could work like magic was<br/>\nnice. I had actually forgotten about that bit of magic! I think I will bring<br/>\nthat DVD to the conference this weekend in case I need it. We have not spent<br/>\nnights at a conference before and I&#39;m not sure what the night scene is like<br/>\nat the hotel. Could be stimulating, but he could also end up wiped out at<br/>\nthe end of a day. <br/>\n<br/>\nThanks for the idea! :)<br/>\n<br/>\nKim<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://geo.yahoo.com/serv?s=97359714/grpId=4410250/grpspId=1705542111/msgId\">http://geo.yahoo.com/serv?s=97359714/grpId=4410250/grpspId=1705542111/msgId</a><br/>\n=45361/stime=1242862228/nc1=1/nc2=2/nc3=3&gt; <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":208961162,"authorName":"Kim Zerbe","from":"&quot;Kim Zerbe&quot; &lt;kim.zerbe@...&gt;","profile":"zerbe2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] input regarding sleep issues with 4 year old","postDate":"1242870836","msgId":45370,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyZWQwMWM5ZDliNyQwMGY0MWFkMCQ2NDBhYTlhOUBHb256bz4=","inReplyToHeader":"PEY5NkU5RTJCLTVCOTItNDc5My04QjE5LTE1NzQ3MUY0N0Q2MUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEQzOEIxRjQ2N0QxNDQ3M0FCRTE3ODRFRTUwOTA0QjVGQExZTEFMQVAyPiA8ZmY5YTMyYWYzOTMwZGI4NDQ3MTA0MzA0NTBmNzYzZGVAZ21haWwuY29tPiA8MDI1ODAxYzlkOThlJGYyM2ZjYTIwJDY0MGFhOWE5QEdvbnpvPiA8Rjk2RTlFMkItNUI5Mi00NzkzLThCMTktMTU3NDcxRjQ3RDYxQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":45369,"nextInTopic":45371,"prevInTime":45369,"nextInTime":45371,"topicId":45331,"numMessagesInTopic":0,"msgSnippet":"-=-(This is another topic, but Geoff is not completely on the same page I am with unschooling, plus I am still finding my way, and has mistaken my saying that","messageBody":"<div id=\"ygrps-yiv-1729850348\">-=-(This is another topic, but Geoff is not completely on the same page I<br/>\nam with unschooling, plus I am still finding my way, and has mistaken my<br/>\nsaying that Damon does not have a bedtime to mean that he gets to stay up as<br/>\nlong as he wants and do whatever he wants and does not initiate the bedtime<br/>\nroutine on his own-=-<br/>\n<br/>\nS:  How is it you get to say that Damon does not have a bedtime if your<br/>\nhusband isn&#39;t &quot;on the same page&quot;? <br/>\n <br/>\nOK, I hear ya, great way to talk about my husband! We have had many talks<br/>\nabout parenting and have agreed that there is no set bed TIME, but this came<br/>\nabout mostly because Damon would NOT go to bed before he was ready... for<br/>\nanyone! I did try for a short period when he was 2. He was staying up later<br/>\nand later and people around me kept saying he&#39;s only 2, he needs to be in<br/>\nbed by 8 o&#39;clock or some magic time. I got worried, read some books on<br/>\nsleep, and tried to calm him down and get him to bed by 9pm or even 10. I<br/>\nstarted adding baths to our routine &quot;to calm him down&quot; and music and lights<br/>\ndimmed and nursing and stories and the cd would end and I&#39;d start it again.<br/>\nMore nursing so I was then even more exhausted and wishing for sleep but he<br/>\nwas more energized and would run downstairs to see what Daddy was doing. It<br/>\ntook more than 2 hours to get this kid to sleep by 11 or 12pm (nursing 5<br/>\ntimes) and I was a wreck. Well, I didn&#39;t do that more than a week and said<br/>\nthis is NOT working for our family! People swore we had to get our kid in<br/>\nbed so we could have couple time, but it wasn&#39;t happening! Geoff was<br/>\ndownstairs watching movies alone while I was doing all this WORK! I decided<br/>\nit wasn&#39;t worth it and I wanted to enjoy my time with my son and not have to<br/>\nstress about bed time. Now we play wii together or watch a disney movie or<br/>\nplay a board game. Like I said, when I&#39;m on it, I can tell when he&#39;s ready<br/>\nfor sleep and we wind down and do our upstairs routine, however long that<br/>\ntakes. Maybe 9 stories, maybe 1.<br/>\n <br/>\n <br/>\nS: If you said &quot;no bedtime&quot; in ANY words, then why should Geoff, who doesn&#39;t<br/>\nagree, do what you&#39;d like to have done when you&#39;re asleep? <br/>\n <br/>\n(I&#39;m not asleep, just working in the basement, but I get what you are<br/>\nsaying, I&#39;m not there and hoping he&#39;ll do what I would do if I were there.)<br/>\nI guess I expect more of him than he is willing to do. He expects me to do<br/>\nalmost everything to do with parenting and he steps in once in a while when<br/>\nit&#39;s something fun or when I seem to really need a break. He works a<br/>\ntechnical job all day and is often tired and irritated when he comes home. I<br/>\nam with our son all day and working a job that I literally squeeze into odd<br/>\ntime slots which are mostly after dinner and into the evenings. I don&#39;t work<br/>\nevery night, but I am paying more attention to how things go and realizing a<br/>\nneed for ME to do something differently.<br/>\n <br/>\n-=-! I wasn&#39;t sure of the advice on this site for a while also, but I think<br/>\nit was mostly older kids who were allowed to stay up as late as they wanted.<br/>\nI think little ones do need some help. -=-<br/>\n<br/>\nS:  &quot;This site&quot;? This list?If you can find advice on letting four year olds<br/>\nstay up alone all night, I&#39;m curious about where you saw it. Letting<br/>\nchildren stay up a little later, letting them sleep in different places,<br/>\nbeing flexible about where and what and how is a world different from &quot;no<br/>\nbedtime.&quot; <br/>\n <br/>\nI did mean this list, sorry. In general I&#39;m thinking about the way people<br/>\nhere talk about letting their kids stay up and how they ask them to be quiet<br/>\nand maybe do things to keep them safe if they (the parents) choose to go to<br/>\nsleep and leave the child awake. I am sure the kids are older as your<br/>\n(Sandra&#39;s) advice has always been to gently prepare your child for sleep in<br/>\na respectful manner. Here is one reply I saw today in regards to this issue:<br/>\n <br/>\n&lt;&lt;If he is going to be up at night he needs to be safe, and everyone needs<br/>\nto feel confident that he is safe. I think that maybe if there is fear that<br/>\nhe will go out, if he has done, and this is interfering with everyone&#39;s<br/>\nserenity, some locks or other barriers need to be quietly put in place until<br/>\nhe isn&#39;t interested in sneaking out. &gt;&gt;<br/>\n <br/>\nThis seems to condone letting the 4yo stay up as long as he&#39;s not leaving<br/>\nthe house! Maybe people forget what it&#39;s like when your kid is 4. I<br/>\nappreciate the discussions that happen here, but I can see where things like<br/>\nthis can be misleading (or maybe she really means it&#39;s OK, then it&#39;s just<br/>\nbad advice). <br/>\n <br/>\nAlso I&#39;m sure Sandra has seen this way more times than most, that some<br/>\npeople jump into unschooling with both feet and abandon all logic! This was<br/>\na very recent topic I read with interest! You have a nice page about taking<br/>\nit slow and easy, it was a nice way to say SLOW DOWN! But even when we think<br/>\nwe are doing all the right things, there are things we have missed.<br/>\n(Obviously because the friend in question is the person who introduced ME to<br/>\nunschooling, so I thought she knew what she was doing!) Good thing I am not<br/>\njust following one friend, eh? I have this list and others and web sites and<br/>\nplaces to go and read and ask questions and learn. She is learning too, I&#39;m<br/>\nsure Lyla will share all of our responses with her very soon!!!<br/>\n <br/>\nKim<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"katherand@gmail.com","from":"katherand@...","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] input regarding sleep issues with 4 year old","postDate":"1242864055","msgId":45367,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM4OTllNTA0ODQ4OTM1YmNkZmFiNmRmN2RkMWZiNTc3QGdtYWlsLmNvbT4=","inReplyToHeader":"PDRBMTQ5NDRELjgwNTA0MDRAbWFjLmNvbT4=","referencesHeader":"PEQzOEIxRjQ2N0QxNDQ3M0FCRTE3ODRFRTUwOTA0QjVGQExZTEFMQVAyPiA8ZmY5YTMyYWYzOTMwZGI4NDQ3MTA0MzA0NTBmNzYzZGVAZ21haWwuY29tPiA8MDI1ODAxYzlkOThlJGYyM2ZjYTIwJDY0MGFhOWE5QEdvbnpvPiA8NEExNDk0NEQuODA1MDQwNEBtYWMuY29tPg=="},"prevInTopic":45366,"nextInTopic":45369,"prevInTime":45366,"nextInTime":45368,"topicId":45331,"numMessagesInTopic":0,"msgSnippet":"... much intense play, that much excitement, that much interaction. For Roxana, she d have had a harder time sleeping that night even if she was worn out,","messageBody":"<div id=\"ygrps-yiv-129095120\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt; Some kids are overstimulated by that<br/>\n </span></blockquote>much intense play, that much excitement, that much interaction. For<br/>\nRoxana, she&#39;d have had a harder time sleeping that night even if she was<br/>\nworn out, physically. &lt;&lt;&lt;&lt;<br/>\n<br/>\nSocial play, especially new social contacts, and new ideas exchanged <br/>\ndefinitely gives a child more to process mentally than just plain <br/>\nrunning around physical play.  Go play at the park swings and slides.  <br/>\nTake a picnic and some art scribbling activities or cars and play in <br/>\nthe dirt together.  Take dress up play clothes and talk about stories.  <br/>\nInteraction with a person like mom or dad who you know well isn&#39;t so <br/>\ncrazy exciting as playing with new kids and watching people open <br/>\npresents and then everybody eating cake and ice cream.<br/>\n<br/>\n~Katherine</div>","specialLinks":[]},{"userId":223803785,"authorName":"Su Penn","from":"Su Penn &lt;su@...&gt;","profile":"marie101365","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] input regarding sleep issues with 4 year old","postDate":"1242863828","msgId":45366,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMyMjY1QTNELUFBOEEtNDhGNS1BMzEzLTFBNTk1RjYzNDlDNkBzdXBlbm4uY29tPg==","inReplyToHeader":"PDRBMTQ5MUJELjcwNzA3MDVAbWFjLmNvbT4=","referencesHeader":"PEQzOEIxRjQ2N0QxNDQ3M0FCRTE3ODRFRTUwOTA0QjVGQExZTEFMQVAyPiA8NTAxQTkzMDMtOTYyRS00NzJBLUE5NjktODU2MjE4REEwODNFQFNhbmRyYWRvZGQuY29tPiA8MkNBM0I0REVCQ0UyNEY2N0JFNTgyQUExMjAzQ0IzRjFATFlMQUxBUDI+IDw0QTE0OTFCRC43MDcwNzA1QG1hYy5jb20+"},"prevInTopic":45365,"nextInTopic":45367,"prevInTime":45365,"nextInTime":45367,"topicId":45331,"numMessagesInTopic":0,"msgSnippet":"... Until you mentioned this, I had forgotten I used to do this with one of my boys when he wasn t ready to go to bed but wasn t comfortable being awake on his","messageBody":"<div id=\"ygrps-yiv-1155705747\">On May 20, 2009, at 7:26 PM, Pam Sorooshian wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; She could put on a dvd, in his room, and lie down on his bed with him<br/>\n&gt; and sleep while he watches it.<br/>\n<br/>\n </span></blockquote>Until you mentioned this, I had forgotten I used to do this with one  <br/>\nof my boys when he wasn&#39;t ready to go to bed but wasn&#39;t comfortable  <br/>\nbeing awake on his own in the house, either. I&#39;d start a movie for him  <br/>\nin the living room, then lie down and sleep on the couch. I am a  <br/>\nperson who can pretty much sleep wherever, and with lights and noise,  <br/>\nif I&#39;m tired, so for me that was a fine thing. My partner would not  <br/>\nhave been able to do it. We&#39;d get anything done that needed to be done  <br/>\n(peeing, changing clothes, etc) before I lay down, and then I&#39;d take  <br/>\nhim to bed when he was ready.<br/>\n<br/>\nSu</div>","specialLinks":[]},{"userId":265299176,"authorName":"katherand@gmail.com","from":"katherand@...","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] input regarding sleep issues with 4 year old","postDate":"1242863752","msgId":45365,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQxNjJkN2MyYjZiM2E1NWFiYjRlYzI5YjhkMjU2YjBiQGdtYWlsLmNvbT4=","inReplyToHeader":"PDkzOTgyNS42MDg1My5xbUB3ZWI4MTUwMS5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PEQzOEIxRjQ2N0QxNDQ3M0FCRTE3ODRFRTUwOTA0QjVGQExZTEFMQVAyPiA8ZmY5YTMyYWYzOTMwZGI4NDQ3MTA0MzA0NTBmNzYzZGVAZ21haWwuY29tPiA8MDI1ODAxYzlkOThlJGYyM2ZjYTIwJDY0MGFhOWE5QEdvbnpvPiA8Rjk2RTlFMkItNUI5Mi00NzkzLThCMTktMTU3NDcxRjQ3RDYxQFNhbmRyYWRvZGQuY29tPiA8MTBBOEJDNkYyNDA3NEFGNzgxQkQ0NzRERjIzRTZBNjVATFlMQUxBUDI+IDw5Mzk4MjUuNjA4NTMucW1Ad2ViODE1MDEubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":45363,"nextInTopic":45366,"prevInTime":45364,"nextInTime":45366,"topicId":45331,"numMessagesInTopic":0,"msgSnippet":"... is light no matter what. ","messageBody":"<div id=\"ygrps-yiv-1642303105\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt; Does he have a dark enough room. Some kids will wake up if there <br/>\n </span></blockquote>is light no matter what. &lt;&lt;&lt;&lt;<br/>\n<br/>\nLight effects waking hormone levels in the body.  Darkness effects <br/>\nsleep hormones.<br/>\n<br/>\n~Katherine</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] input regarding sleep issues with 4 year old","postDate":"1242862669","msgId":45362,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBMTQ5NDRELjgwNTA0MDRAbWFjLmNvbT4=","inReplyToHeader":"PDAyNTgwMWM5ZDk4ZSRmMjNmY2EyMCQ2NDBhYTlhOUBHb256bz4=","referencesHeader":"PEQzOEIxRjQ2N0QxNDQ3M0FCRTE3ODRFRTUwOTA0QjVGQExZTEFMQVAyPiA8ZmY5YTMyYWYzOTMwZGI4NDQ3MTA0MzA0NTBmNzYzZGVAZ21haWwuY29tPiA8MDI1ODAxYzlkOThlJGYyM2ZjYTIwJDY0MGFhOWE5QEdvbnpvPg=="},"prevInTopic":45361,"nextInTopic":45363,"prevInTime":45361,"nextInTime":45363,"topicId":45331,"numMessagesInTopic":0,"msgSnippet":"... An afternoon at a birthday party is really just not the same thing as a really relaxing long day at the beach or a park - or even with just one or two","messageBody":"<div id=\"ygrps-yiv-373667414\">On 5/20/2009 2:07 PM, Kim Zerbe wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; That is a good suggestion on the whole, but I know this family and we were<br/>\n&gt; at a birthday party yesterday where the kids were all running around in the<br/>\n&gt; back yard for 3 hrs, playing chase and fighting games. OK, they also ate<br/>\n&gt; cake and played inside a bit, but I thought the kids would all sleep well<br/>\n&gt; last night!<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>An afternoon at a birthday party is really just not the same thing as a <br/>\nreally relaxing long day at the beach or a park - or even with just one <br/>\nor two other kids in a backyard. Some kids are overstimulated by that <br/>\nmuch intense play, that much excitement, that much interaction. For <br/>\nRoxana, she&#39;d have had a harder time sleeping that night even if she was <br/>\nworn out, physically.<br/>\n<br/>\nSo - let me restate my &quot;he needs a lot more exercise&quot; advice - I think <br/>\nit is possible he needs a whole lot more outdoor physical activity that <br/>\ntakes place in a way that is more under his control - not frenzied <br/>\nactivity, but climbing and running and playing in very satisfying ways.<br/>\n<br/>\nI&#39;m sorry I&#39;m not explaining this well - I know what I mean, but I&#39;m <br/>\nhaving a little trouble finding the words. Activity can be relaxing. I <br/>\nthink some kids need a LOT of very relaxing but also very physical <br/>\nactivity in order to be good-natured and calm.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":265299176,"authorName":"katherand@gmail.com","from":"katherand@...","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] input regarding sleep issues with 4 year old","postDate":"1242862644","msgId":45363,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJmMmM5NmYxMGU0N2Q2NjRhMDQyMDhiYzY4M2M0ZDFlQGdtYWlsLmNvbT4=","inReplyToHeader":"PDEwQThCQzZGMjQwNzRBRjc4MUJENDc0REYyM0U2QTY1QExZTEFMQVAyPg==","referencesHeader":"PEQzOEIxRjQ2N0QxNDQ3M0FCRTE3ODRFRTUwOTA0QjVGQExZTEFMQVAyPiA8ZmY5YTMyYWYzOTMwZGI4NDQ3MTA0MzA0NTBmNzYzZGVAZ21haWwuY29tPiA8MDI1ODAxYzlkOThlJGYyM2ZjYTIwJDY0MGFhOWE5QEdvbnpvPiA8Rjk2RTlFMkItNUI5Mi00NzkzLThCMTktMTU3NDcxRjQ3RDYxQFNhbmRyYWRvZGQuY29tPiA8MTBBOEJDNkYyNDA3NEFGNzgxQkQ0NzRERjIzRTZBNjVATFlMQUxBUDI+"},"prevInTopic":45362,"nextInTopic":45365,"prevInTime":45362,"nextInTime":45364,"topicId":45331,"numMessagesInTopic":0,"msgSnippet":"... boy ends up only sleeping 2-4  hours sometimes.  when he sleeps in after being up most of the night, it makes sense, but why would he wake at 5 am after","messageBody":"<div id=\"ygrps-yiv-1056499171\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt; what is confusing to this family, and to me, is why/how this young <br/>\n </span></blockquote>boy ends up only sleeping 2-4  hours sometimes.  when he sleeps in <br/>\nafter being up most of the night, it makes sense, but why would he wake <br/>\nat 5 am after going to bed at 2? &lt;&lt;&lt;&lt;<br/>\n<br/>\nI don&#39;t know how in depth Kurchinka gets about sleep physiology.  I <br/>\nskimmed and think I got the gist of what she said.  It was how <br/>\nrelationships can influence stress either to subside (relaxation and <br/>\nsleep) or increase (tension and wakefulness).<br/>\n<br/>\nThe body does close to everything it needs according to messages sent <br/>\nto our nervous system via hormones.  Once a body gets tired and loses a <br/>\nlarge store and THEN doesn&#39;t have the chance to renew its store from <br/>\nlack of sleep, then it takes hanging with a kid preferably earlier than <br/>\npreferred bedtimes to encourage sleep, and maybe use some melatonin or <br/>\neven better warm up some milk after hanging out for a bit and bring it <br/>\nto the child.  I hope he&#39;s not hungry because that would stop him from <br/>\nsleeping.  It does Karl.<br/>\n<br/>\nOne of the things I also would like to emphasize is that a mom of 1 <br/>\nyear old may not have much one on one time with her older child and <br/>\nthis may be exasperating the situation, causing him to feel even less <br/>\nlike going to sleep.  For a while, I would stop making bedtime be about <br/>\nanybody but mom and the kids.  Evenings might go much better with more <br/>\ncalm presence (whoever that is, if not mom).  Just by the sheer <br/>\ninfluence of bodily being there to model sleep cues.. yawning, hemming, <br/>\ndrooping eyes, cuddly smiles, maybe mentioning how one feels a little <br/>\ncolder just before dropping off, or just offering a cute favored pillow <br/>\nand blankie, and so on.<br/>\n<br/>\nAnd if the child isn&#39;t in a bed during this wind down period, well in <br/>\nmy house that would be alright.  Getting more sleep would be my first <br/>\npriority.<br/>\n<br/>\n~Katherine</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] input regarding sleep issues with 4 year old","postDate":"1242862219","msgId":45361,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBMTQ5MjhCLjMwNjA4MDFAbWFjLmNvbT4=","inReplyToHeader":"PDViOWJmOThkZGM2OGVmMTI4YTljNjEwNGE1MzNiYTU3QGdtYWlsLmNvbT4=","referencesHeader":"PEQzOEIxRjQ2N0QxNDQ3M0FCRTE3ODRFRTUwOTA0QjVGQExZTEFMQVAyPiA8NTAxQTkzMDMtOTYyRS00NzJBLUE5NjktODU2MjE4REEwODNFQFNhbmRyYWRvZGQuY29tPiA8MkNBM0I0REVCQ0UyNEY2N0JFNTgyQUExMjAzQ0IzRjFATFlMQUxBUDI+IDw1YjliZjk4ZGRjNjhlZjEyOGE5YzYxMDRhNTMzYmE1N0BnbWFpbC5jb20+"},"prevInTopic":45360,"nextInTopic":45362,"prevInTime":45360,"nextInTime":45362,"topicId":45331,"numMessagesInTopic":0,"msgSnippet":"We always lowered the level of noise and light and activity - in the main part of the house, as the evening progressed. Nowadays, Rosie puts on the Gilmore","messageBody":"<div id=\"ygrps-yiv-960250482\">We always &quot;lowered the level&quot; of noise and light and activity - in the <br/>\nmain part of the house, as the evening progressed. Nowadays, Rosie puts <br/>\non the Gilmore Girls or some other tv series on dvd that she&#39;s watched <br/>\nrepeatedly - she often falls asleep in the first minute or two. When I <br/>\ncan&#39;t sleep, I listen to books on my ipod - sometimes I listen half the <br/>\nnight, sometimes I fall asleep within minutes.<br/>\n<br/>\n-pam<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 5/20/2009 1:54 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:katherand@...\">katherand@...</a> wrote:<br/>\n&gt; What about the<br/>\n&gt; mother starting the bedtime routine with soothing sounds and sights<br/>\n&gt; earlier before dad is off work since he gets off considerably later<br/>\n&gt; than is probably helpful to the routine going smoothly from that point?<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] input regarding sleep issues with 4 year old","postDate":"1242862166","msgId":45359,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk1MTdCQjQ0LUVBNzEtNDRBRS1BRDk4LUUyQjNBN0I4NDVGN0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEwQThCQzZGMjQwNzRBRjc4MUJENDc0REYyM0U2QTY1QExZTEFMQVAyPg==","referencesHeader":"PEQzOEIxRjQ2N0QxNDQ3M0FCRTE3ODRFRTUwOTA0QjVGQExZTEFMQVAyPiA8ZmY5YTMyYWYzOTMwZGI4NDQ3MTA0MzA0NTBmNzYzZGVAZ21haWwuY29tPiA8MDI1ODAxYzlkOThlJGYyM2ZjYTIwJDY0MGFhOWE5QEdvbnpvPiA8Rjk2RTlFMkItNUI5Mi00NzkzLThCMTktMTU3NDcxRjQ3RDYxQFNhbmRyYWRvZGQuY29tPiA8MTBBOEJDNkYyNDA3NEFGNzgxQkQ0NzRERjIzRTZBNjVATFlMQUxBUDI+"},"prevInTopic":45358,"nextInTopic":45360,"prevInTime":45358,"nextInTime":45360,"topicId":45331,"numMessagesInTopic":0,"msgSnippet":"-=-do you think there is ever a physiological/physical issue that creates sleep disruption like this? -=- I don t think it s disruption. If he used to have a","messageBody":"<div id=\"ygrps-yiv-709556221\">-=-do you think there is ever a physiological/physical issue that  <br/>\ncreates sleep disruption like this? -=-<br/>\n<br/>\nI don&#39;t think it&#39;s &quot;disruption.&quot;<br/>\nIf he used to have a bedtime and now he doesn&#39;t, I think there were  <br/>\nwords or deals made, or threats removed, and he&#39;s reacting to that.    <br/>\nIt seemed to me that unschooling ideas were being blamed.  If  <br/>\nunschooling fixes can&#39;t work, if she really thinks it&#39;s something  <br/>\nphysical, then she could look elsewhere.<br/>\n<br/>\n From experience, I think if the house is quieter at some point and  <br/>\nthe people speak more softly and if the lights are lower and the TV is  <br/>\nturned down it&#39;s a big signal that it&#39;s quiet time.  If he can&#39;t be  <br/>\nquiet, he shouldn&#39;t have the option to try.  He&#39;s very young and might  <br/>\nnot be safe up alone, either.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] input regarding sleep issues with 4 year old","postDate":"1242862121","msgId":45360,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkzOTgyNS42MDg1My5xbUB3ZWI4MTUwMS5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDEwQThCQzZGMjQwNzRBRjc4MUJENDc0REYyM0U2QTY1QExZTEFMQVAyPg==","referencesHeader":"PEQzOEIxRjQ2N0QxNDQ3M0FCRTE3ODRFRTUwOTA0QjVGQExZTEFMQVAyPiA8ZmY5YTMyYWYzOTMwZGI4NDQ3MTA0MzA0NTBmNzYzZGVAZ21haWwuY29tPiA8MDI1ODAxYzlkOThlJGYyM2ZjYTIwJDY0MGFhOWE5QEdvbnpvPiA8Rjk2RTlFMkItNUI5Mi00NzkzLThCMTktMTU3NDcxRjQ3RDYxQFNhbmRyYWRvZGQuY29tPiA8MTBBOEJDNkYyNDA3NEFGNzgxQkQ0NzRERjIzRTZBNjVATFlMQUxBUDI+"},"prevInTopic":45359,"nextInTopic":45361,"prevInTime":45359,"nextInTime":45361,"topicId":45331,"numMessagesInTopic":0,"msgSnippet":"what is confusing to this family, and to me, is why/how this young boy ends up only sleeping 2-4 hours sometimes. when he sleeps in after being up most of the","messageBody":"<div id=\"ygrps-yiv-1603491984\">what is confusing to this family, and to me, is why/how this young boy ends up only sleeping 2-4 hours sometimes. when he sleeps in after being up most of the night, it makes sense, but why would he wake at 5 am after going to bed at 2?<br/>\n<br/>\n-=-=-=-=-=-<br/>\nDoes he have a dark enough room. Some kids will wake up if there is light no matter what.<br/>\n<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n <br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] input regarding sleep issues with 4 year old","postDate":"1242862013","msgId":45358,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBMTQ5MUJELjcwNzA3MDVAbWFjLmNvbT4=","inReplyToHeader":"PDJDQTNCNERFQkNFMjRGNjdCRTU4MkFBMTIwM0NCM0YxQExZTEFMQVAyPg==","referencesHeader":"PEQzOEIxRjQ2N0QxNDQ3M0FCRTE3ODRFRTUwOTA0QjVGQExZTEFMQVAyPiA8NTAxQTkzMDMtOTYyRS00NzJBLUE5NjktODU2MjE4REEwODNFQFNhbmRyYWRvZGQuY29tPiA8MkNBM0I0REVCQ0UyNEY2N0JFNTgyQUExMjAzQ0IzRjFATFlMQUxBUDI+"},"prevInTopic":45355,"nextInTopic":45359,"prevInTime":45357,"nextInTime":45359,"topicId":45331,"numMessagesInTopic":0,"msgSnippet":"... She needs to be more imaginative, then. Along with tiring him out a LOT more. She could put on a dvd, in his room, and lie down on his bed with him and","messageBody":"<div id=\"ygrps-yiv-1127858286\">On 5/20/2009 1:15 PM, Lyla Wolfenstein wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; the problem is, she can&#39;t see how to pressure or persuade him to stay in bed, without force, which would need to be physical and would result in huge explosions.<br/>\n<br/>\n </span></blockquote>She needs to be more imaginative, then. Along with tiring him out a LOT <br/>\nmore.<br/>\n<br/>\nShe could put on a dvd, in his room, and lie down on his bed with him <br/>\nand sleep while he watches it.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":287815876,"authorName":"Robyn L. Coburn","from":"&quot;Robyn L. Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] input regarding sleep issues with 4 year old","postDate":"1242858777","msgId":45355,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU0NUVERkM3REQ0RDRBMURCNENENzNDQUJGODJGQjhCQFJvYnluUEM+","inReplyToHeader":"PDJDQTNCNERFQkNFMjRGNjdCRTU4MkFBMTIwM0NCM0YxQExZTEFMQVAyPg==","referencesHeader":"PEQzOEIxRjQ2N0QxNDQ3M0FCRTE3ODRFRTUwOTA0QjVGQExZTEFMQVAyPiA8NTAxQTkzMDMtOTYyRS00NzJBLUE5NjktODU2MjE4REEwODNFQFNhbmRyYWRvZGQuY29tPiA8MkNBM0I0REVCQ0UyNEY2N0JFNTgyQUExMjAzQ0IzRjFATFlMQUxBUDI+"},"prevInTopic":45354,"nextInTopic":45358,"prevInTime":45354,"nextInTime":45356,"topicId":45331,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1555076973\">&lt;&lt;&lt;&lt; the problem is, she can&#39;t see how to pressure or persuade him to stay <br/>\nin bed, without force, which would need to be physical and would result in <br/>\nhuge explosions.  he does not listen collaboratively problem solve yet, and <br/>\nhis response to perceived controls is quite strong.  but i think the <br/>\nperpetual state of overwhelm in their household is part of the issue <br/>\ntoo -it&#39;s hard to really focus on gentle persuasion. &gt;&gt;&gt;&gt;<br/>\n<br/>\nWhen I read the original post the first thing I thought was he&#39;s not getting <br/>\nenough focussed attention because Mom has the new baby and Dad has really <br/>\nlong hours, so he&#39;s looking for it at inappropriate times.<br/>\n<br/>\nThe baby nap times could become the little boy&#39;s special times with Mom. I <br/>\nconcur with the physical activity, but I would caution your friend to watch <br/>\nout for driving at the wrong time. A car nap can be a disaster for later <br/>\nsleeping. OTOH sometimes it is just what you want to get back onto a normal <br/>\ntimetable. Maybe a sitter could take him to the park or yard and play with <br/>\nhim vigorously a few days a week.<br/>\n<br/>\nIt was around about 4 years old I think that Jayn&#39;s unusual sleep pattern <br/>\nstarted to manifest itself. For a while it looked like her sleep was just <br/>\nerratic. It wasn&#39;t until I started actually writing down the waking and <br/>\nsleep hours on the calendar that I saw what her underlying pattern was, and <br/>\nstill is.<br/>\n<br/>\nMaybe recording some times would allow your friend to see any pattern that <br/>\nmight exist. Then perhaps it would allow everyone to work around a bit. <br/>\nMaybe Dad, hard working as he undoubtedly is, would be able to make an hour <br/>\nin the morning before work, if the little boy is really an early riser.<br/>\n<br/>\nIs he teething? Sometimes that causes disruptions in emotional states and <br/>\nphysical reactions that affect sleep, eating, everything. But that&#39;s <br/>\ntemporary.<br/>\n<br/>\nOther than nursing as an infant, I&#39;ve never been able to *make* Jayn go to <br/>\nsleep when she wasn&#39;t ready. But I have done whatever I needed to to ensure <br/>\nthat she wasn&#39;t disturbing other people - dh or our neighbors - at night. If <br/>\nwe had lived in a house rather than apartment that would have been easier. <br/>\nIf we had more than one bedroom that would have been easier. If I had a <br/>\nsecond baby it would have been much harder.<br/>\n<br/>\nThere was a week or so (really a very short time) when Jayn was I think a <br/>\nbit younger maybe 3, when she had first learnt how to open the front door <br/>\nlocks and thought it was OK to go outside without telling me. When I asked <br/>\nher to tell me that she wanted to go out, she reacted like I was planning on <br/>\nlocking her in the closet for ten years, some intolerable restriction. I was <br/>\nafraid that she would go out at night, what would be a joke in her mind, so <br/>\nI dragged a heavy chair in front of the door when we both went to bed. Too <br/>\nheavy for her to move. It wasn&#39;t punitive or done with a lot of explanation. <br/>\nIt was just there at night until the idea,or my fear, of her going out while <br/>\nI was sleeping faded away from both our minds. To me it was along the lines <br/>\nof anchoring the bookshelves, or putting pillows under the sofa when she <br/>\nclimbed along the back. Maybe there would have been another solution if I <br/>\nhad posted here about the dilemma at the time. I don&#39;t think she remembers <br/>\nit happening now.<br/>\n<br/>\nNow when I ask her to tell me if she and her friends want to play out the <br/>\nfront gate of the building, so I can go with them, she is perfectly pleasant <br/>\nand happy to do so. I really think it was an issue of maturity, and the <br/>\ndevelopment of some empathy, as well as a greater understanding of cause and <br/>\neffect.<br/>\n<br/>\nIn our case I&#39;ve explained a few things: kids playing outside during the day <br/>\ncould lead strangers to think they have snuck out of the nearby school and <br/>\nmake an unwanted phone call. They can get loud without realizing it and <br/>\nbother the lady who lives in front, who shouts at the kids and calls the <br/>\nlandlord. As unlikely as it is, there are bad guys in the world who could <br/>\ntake advantage of what look like unsupervised kids. So there are a lot of <br/>\nreasons to do with my comfort and serenity to go outside with her when she <br/>\nwants to go. I have made a committment to her that I will almost always do <br/>\nthat, rather than tell her she can&#39;t. It would have to be a very compelling <br/>\nreason why I couldn&#39;t leave the house (like vomiting incessantly or <br/>\nsomething). I can even take my excellent phone out the front and it still <br/>\nworks.<br/>\n<br/>\nIf he is going to be up at night he needs to be safe, and everyone needs to <br/>\nfeel confident that he is safe. I think that maybe if there is fear that he <br/>\nwill go out, if he has done, and this is interfering with everyone&#39;s <br/>\nserenity, some locks or other barriers need to be quietly put in place until <br/>\nhe isn&#39;t interested in sneaking out.<br/>\n<br/>\nAnd he should be taken out with a companion as much as possible when it is <br/>\nsafe during the day - or evening. Night walks with flashlights can be great <br/>\nfun.<br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.Iggyjingles.etsy.com<br/>\nwww.iggyjingles.blogspot.com<br/>\nwww.allthingsdoll.blogspot.com</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] input regarding sleep issues with 4 year old","postDate":"1242857970","msgId":45354,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwQThCQzZGMjQwNzRBRjc4MUJENDc0REYyM0U2QTY1QExZTEFMQVAyPg==","inReplyToHeader":"PEY5NkU5RTJCLTVCOTItNDc5My04QjE5LTE1NzQ3MUY0N0Q2MUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEQzOEIxRjQ2N0QxNDQ3M0FCRTE3ODRFRTUwOTA0QjVGQExZTEFMQVAyPiA8ZmY5YTMyYWYzOTMwZGI4NDQ3MTA0MzA0NTBmNzYzZGVAZ21haWwuY29tPiA8MDI1ODAxYzlkOThlJGYyM2ZjYTIwJDY0MGFhOWE5QEdvbnpvPiA8Rjk2RTlFMkItNUI5Mi00NzkzLThCMTktMTU3NDcxRjQ3RDYxQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":45353,"nextInTopic":45355,"prevInTime":45353,"nextInTime":45355,"topicId":45331,"numMessagesInTopic":0,"msgSnippet":"i agree sandra, and i think i neglected to make something clear in my original post: what is confusing to this family, and to me, is why/how this young boy","messageBody":"<div id=\"ygrps-yiv-1198787563\">i agree sandra, and i think i neglected to make something clear in my original post:<br/>\n<br/>\nwhat is confusing to this family, and to me, is why/how this young boy ends up only sleeping 2-4  hours sometimes.  when he sleeps in after being up most of the night, it makes sense, but why would he wake at 5 am after going to bed at 2?<br/>\n<br/>\nphysiologically, that just sounds &quot;off&quot; - i wonder what mary kurchinka has to say about that - i know she is a fan of &quot;the 7 oclock bedtime&quot; and not letting kids get past the point of tiredness, where they have renewed energy.  <br/>\n<br/>\ni also think it&#39;s really challenging to lay down with him with a 1 year old awake, (or asleep and needed/wanting to stay that way) and it can take hours of him laying there awake, etc.<br/>\n<br/>\nthey have, in the past, tried the extra phyical play/outlets during the day, swimming, etc., and nothing seems to have helped, but maybe they  just  need to keep trying.  <br/>\n<br/>\ndo you think there is ever a physiological/physical issue that creates sleep disruption like this?  <br/>\n<br/>\nLyla<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] input regarding sleep issues with 4 year old","postDate":"1242855906","msgId":45353,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY5NkU5RTJCLTVCOTItNDc5My04QjE5LTE1NzQ3MUY0N0Q2MUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDAyNTgwMWM5ZDk4ZSRmMjNmY2EyMCQ2NDBhYTlhOUBHb256bz4=","referencesHeader":"PEQzOEIxRjQ2N0QxNDQ3M0FCRTE3ODRFRTUwOTA0QjVGQExZTEFMQVAyPiA8ZmY5YTMyYWYzOTMwZGI4NDQ3MTA0MzA0NTBmNzYzZGVAZ21haWwuY29tPiA8MDI1ODAxYzlkOThlJGYyM2ZjYTIwJDY0MGFhOWE5QEdvbnpvPg=="},"prevInTopic":45352,"nextInTopic":45354,"prevInTime":45352,"nextInTime":45354,"topicId":45331,"numMessagesInTopic":0,"msgSnippet":"-=- (This is another topic, but Geoff is not completely on the same page I am with unschooling, plus I am still finding my way, and has mistaken my saying that","messageBody":"<div id=\"ygrps-yiv-35034360\">-=-<br/>\n(This is another topic, but Geoff is not completely on the same page I  <br/>\nam<br/>\nwith unschooling, plus I am still finding my way, and has mistaken my  <br/>\nsaying<br/>\nthat Damon does not have a bedtime to mean that he gets to stay up as  <br/>\nlong<br/>\nas he wants and do whatever he wants and does not initiate the bedtime<br/>\nroutine on his own-=-<br/>\n<br/>\nHow is it you get to say that Damon does not have a bedtime if your  <br/>\nhusband isn&#39;t &quot;on the same page&quot;?<br/>\n<br/>\n-=- So when I&#39;m working in the<br/>\nbasement, sometimes I don&#39;t know that Geoff has gone to bed upstairs  <br/>\n(our<br/>\nhouse has 3 levels) and Damon is alone with the TV. It&#39;s really hard  <br/>\nfor me<br/>\nwhen I emerge at 2, 3, 4am to head to bed and find a nodding off 4yo in<br/>\nfront of cartoons. -=-<br/>\n<br/>\nIf you said &quot;no bedtime&quot; in ANY words, then why should Geoff, who  <br/>\ndoesn&#39;t agree, do what you&#39;d like to have done when you&#39;re asleep?<br/>\n<br/>\n-=-. I guess I don&#39;t like that because he doesn&#39;t get his teeth<br/>\nbrushed and already has cavities and I prefer he not sleep in dirty  <br/>\nclothes,<br/>\nbut I can take those off.)-=-<br/>\n<br/>\nThese are side issues.  You could help him brush teeth and put on  <br/>\npajamas or loose clean clothes when you&#39;re tired yourself.  A long  <br/>\nwarm bath with toys might be a good way to get him sleepy.  Holly used  <br/>\nto listen to a CD and play in the bathtub nearly every night for a  <br/>\nyear or more.   She&#39;d listen to Barney, on a CD I&#39;d put into a CD  <br/>\nplayer on the bathroom counter, and she would call me when it was over  <br/>\nor she wasn&#39;t having fun anymore.<br/>\n<br/>\n-=-! I wasn&#39;t sure of the advice on this site for a while also,<br/>\nbut I think it was mostly older kids who were allowed to stay up as  <br/>\nlate as<br/>\nthey wanted. I think little ones do need some help. -=-<br/>\n<br/>\n&quot;This site&quot;?  This list?<br/>\nIf you can find advice on letting four year olds stay up alone all  <br/>\nnight, I&#39;m curious about where you saw it.<br/>\n<br/>\nLetting children stay up a little later, letting them sleep in  <br/>\ndifferent places, being flexible about where and what and how is a  <br/>\nworld different from &quot;no bedtime.&quot;<br/>\n<br/>\n-=-She is a good mother and always trying to do the right<br/>\nthing! I suspect she is caught up in not controlling her son and has  <br/>\ngiven<br/>\nway to letting her son have freedom above all else and she may need some<br/>\nmore tools in her toolbox to create inviting sleep. -=-<br/>\n<br/>\nI hope they live in a detached house and not an apartment.  If a  <br/>\nmillion unschoolers said &quot;don&#39;t control your son,&quot; it would not change  <br/>\nthe legal and societal requirements for parents to control their  <br/>\nchildren to some extent.  If he DOES leave the house in the middle of  <br/>\nthe night, they might not get him back.   If they explain to a social  <br/>\nworker that they leave him awake by himself until 4:00 in the morning,  <br/>\nthey might not get to raise him to adulthood.    Nobody has the right  <br/>\nto absolve a parent of taking care of a child (not one who&#39;s in their  <br/>\ncare and custody).<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [AlwaysLearning] input regarding sleep issues with 4 year old","postDate":"1242854775","msgId":45352,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlGODk4N0MwLTZDMTQtNDdBRC05RDg0LUZFRjg5RDA5Rjk4N0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEZBNjM3QUM5LUMxMjUtNEVCRi04NEE4LTM1QzBFODY1QkJBQUB2ZXJpem9uLm5ldD4=","referencesHeader":"PEQzOEIxRjQ2N0QxNDQ3M0FCRTE3ODRFRTUwOTA0QjVGQExZTEFMQVAyPiA8NTAxQTkzMDMtOTYyRS00NzJBLUE5NjktODU2MjE4REEwODNFQFNhbmRyYWRvZGQuY29tPiA8RkE2MzdBQzktQzEyNS00RUJGLTg0QTgtMzVDMEU4NjVCQkFBQHZlcml6b24ubmV0Pg=="},"prevInTopic":45351,"nextInTopic":45353,"prevInTime":45351,"nextInTime":45353,"topicId":45331,"numMessagesInTopic":0,"msgSnippet":"-=- http://joyfullyrejoycing.com/changing%20parenting/ifthencontracts.html-=- Thanks.  I added it to the sleeping page. I m frustrated that people only kind of","messageBody":"<div id=\"ygrps-yiv-692158775\">-=-<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/changing%20parenting/ifthencontracts.html-=-\">http://joyfullyrejoycing.com/changing%20parenting/ifthencontracts.html-=-</a><br/>\n<br/>\nThanks.  I added it to the sleeping page.<br/>\n<br/>\nI&#39;m frustrated that people only kind of read what we&#39;ve written, or  <br/>\nthey do what they read in passing, or heard someone say, and then  <br/>\ntheir families are unhappy and kids are crying and THEN they come to  <br/>\nread (or maybe send their friend to ask).<br/>\n<br/>\nShould there be a certification required to unschool!??  Probably  <br/>\nnot.  But should people figure that there are many things to know, and  <br/>\nthere are ways to make it work well and ways to screw it up?   YES.  I  <br/>\nthink they should know.   It&#39;s not free, it&#39;s not automatic, it takes  <br/>\ntime and thought and awareness and work.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [AlwaysLearning] input regarding sleep issues with 4 year old","postDate":"1242854446","msgId":45350,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1RTQ5QTJELTBEREUtNDVDMC1BODE0LUY3NDA1MzE5NjZCOEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEZBNjM3QUM5LUMxMjUtNEVCRi04NEE4LTM1QzBFODY1QkJBQUB2ZXJpem9uLm5ldD4=","referencesHeader":"PEQzOEIxRjQ2N0QxNDQ3M0FCRTE3ODRFRTUwOTA0QjVGQExZTEFMQVAyPiA8NTAxQTkzMDMtOTYyRS00NzJBLUE5NjktODU2MjE4REEwODNFQFNhbmRyYWRvZGQuY29tPiA8RkE2MzdBQzktQzEyNS00RUJGLTg0QTgtMzVDMEU4NjVCQkFBQHZlcml6b24ubmV0Pg=="},"prevInTopic":45348,"nextInTopic":45351,"prevInTime":45349,"nextInTime":45351,"topicId":45331,"numMessagesInTopic":0,"msgSnippet":"-=- http://joyfullyrejoycing.com/changing%20parenting/ifthencontracts.html-=- Thanks.  I added it to the sleeping page. I m frustrated that people only kind of","messageBody":"<div id=\"ygrps-yiv-1469284095\">-=-<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/changing%20parenting/ifthencontracts.html-=-\">http://joyfullyrejoycing.com/changing%20parenting/ifthencontracts.html-=-</a><br/>\n<br/>\nThanks.  I added it to the sleeping page.<br/>\n<br/>\nI&#39;m frustrated that people only kind of read what we&#39;ve written, or  <br/>\nthey do what they read in passing, or heard someone say, and then  <br/>\ntheir families are unhappy and kids are crying and THEN they come to  <br/>\nread (or maybe send their friend to ask).<br/>\n<br/>\nShould there be a certification required to unschool!??  Probably  <br/>\nnot.  But should people figure that there are many things to know, and  <br/>\nthere are ways to make it work well and ways to screw it up?   YES.  I  <br/>\nthink they should know.   It&#39;s not free, it&#39;s not automatic, it takes  <br/>\ntime and thought and awareness and work.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] input regarding sleep issues with 4 year old","postDate":"1242854070","msgId":45348,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM1Rjg4OURENzFGNzQ5MUM4QzhEMzk2OTA4QTVDNDI2QExZTEFMQVAyPg==","inReplyToHeader":"PDM4NjdBMTZFLUQ3N0YtNEIzOC04RDZFLTc4RTE3QkY0QjFEREBzdXBlbm4uY29tPg==","referencesHeader":"PEQzOEIxRjQ2N0QxNDQ3M0FCRTE3ODRFRTUwOTA0QjVGQExZTEFMQVAyPiA8NTAxQTkzMDMtOTYyRS00NzJBLUE5NjktODU2MjE4REEwODNFQFNhbmRyYWRvZGQuY29tPiA8Mzg2N0ExNkUtRDc3Ri00QjM4LThENkUtNzhFMTdCRjRCMUREQHN1cGVubi5jb20+"},"prevInTopic":45347,"nextInTopic":45350,"prevInTime":45347,"nextInTime":45349,"topicId":45331,"numMessagesInTopic":0,"msgSnippet":"thank you su, i neglected to say that they tried the melatonin, starting a few months ago, and it worked like a charm.  (my son is just as you describe, and","messageBody":"<div id=\"ygrps-yiv-2133041685\">thank you su,<br/>\n<br/>\ni neglected to say that they tried the melatonin, starting a few months ago, and it worked like a charm.  (my son is just as you describe, and always has been, with the racing mind, etc., and we recently started using melatonin too - it does work wonderfully.)  <br/>\n<br/>\nunfortunately, with this boy, it seems to have stopped working completely. :(  no idea why.<br/>\n<br/>\nLyla<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":208961162,"authorName":"Kim Zerbe","from":"&quot;Kim Zerbe&quot; &lt;kim.zerbe@...&gt;","profile":"zerbe2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] input regarding sleep issues with 4 year old","postDate":"1242853632","msgId":45351,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyNTgwMWM5ZDk4ZSRmMjNmY2EyMCQ2NDBhYTlhOUBHb256bz4=","inReplyToHeader":"PGZmOWEzMmFmMzkzMGRiODQ0NzEwNDMwNDUwZjc2M2RlQGdtYWlsLmNvbT4=","referencesHeader":"PEQzOEIxRjQ2N0QxNDQ3M0FCRTE3ODRFRTUwOTA0QjVGQExZTEFMQVAyPiA8ZmY5YTMyYWYzOTMwZGI4NDQ3MTA0MzA0NTBmNzYzZGVAZ21haWwuY29tPg=="},"prevInTopic":45350,"nextInTopic":45352,"prevInTime":45350,"nextInTime":45352,"topicId":45331,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-485113874\">&lt;&lt; My guess is that life during the day isn&#39;t very interactive or whole body<br/>\nstimulation for the older child while mom cares for the younger one.  &gt;&gt; <br/>\n <br/>\nThat is a good suggestion on the whole, but I know this family and we were<br/>\nat a birthday party yesterday where the kids were all running around in the<br/>\nback yard for 3 hrs, playing chase and fighting games. OK, they also ate<br/>\ncake and played inside a bit, but I thought the kids would all sleep well<br/>\nlast night!<br/>\n <br/>\nI do have almost the same sleep issues with my 4yo son (he will be 5 in 5<br/>\nweeks). I believe his body clock is like mine (and his daddy&#39;s) where we<br/>\nprefer activity in the late afternoon and evening and like sleeping in, but<br/>\nyou can look for sleepy signs and steer him to bed gently. It doesn&#39;t have<br/>\nto be a fight.<br/>\n <br/>\nI&#39;ve tried lots of things with him, some work well, some not so much. We<br/>\nhave allowed him to stay up and play wii, both with a parent and by himself,<br/>\nbut he&#39;ll play until 4am and totally resist going to bed. That doesn&#39;t feel<br/>\nhealthy or respectful, though may be fun in the moment. It seems to energize<br/>\nhim and he gets a second wind that is hard to fight (been there myself).<br/>\n <br/>\nIt is a good idea to work on a bedtime routine, though it may not happen at<br/>\nthe same time each night, and even for us that doesn&#39;t always work. I have<br/>\nto suggest it at the right moment, he doesn&#39;t often admit to being tired!<br/>\nI&#39;ve had success with letting him wind down AND letting him shake his<br/>\nsillies out during the days. In the evenings, we often play a family wii<br/>\ngame like MarioKart or Damon and his dad play Acme Arsenal or a Lego wii<br/>\ngame with either of us. Sometimes we watch a movie and don&#39;t get started<br/>\nwith the wii (for some reason, on those nights it is easier to begin the bed<br/>\nroutine). Anyway, on wii nights you have to play to a certain point in the<br/>\ngame where either there is a clear winner or the mission has gone awry and<br/>\nDamon is getting bored. Then you sense that moment and announce that YOU are<br/>\ntired of this game and want to quit. If all 3 of us are there it is easiest<br/>\nand we can stop the game and head to bed together. We are all involved in<br/>\nthe routine of putting on pajamas, peeing, and brushing our teeth together.<br/>\nThen we all go to the same bed and one of us parents will read a story while<br/>\nthe other usually reads his or her own book or maybe falls asleep (DH, not<br/>\nme!). Sometimes Damon names who will read and most often we comply (unless<br/>\nthat person is sick or really tired). And just so you know, this is usually<br/>\nhappening after midnight, possibly closer to 2am.  <br/>\n <br/>\nSometimes I work on my business in the late nights and Daddy plays wii or<br/>\nwatches TV with Damon. One thing that frustrates me is when Geoff (DH/Daddy)<br/>\ngoes to bed and leaves Damon on the couch playing wii or watching cartoons.<br/>\nHe&#39;ll say he invited Damon to bed and he didn&#39;t want to go (and he knew I<br/>\nwas downstairs and could bring him up), but if Damon is sleepy you can coax<br/>\nhim to bed by saying you&#39;ll him read stories. It&#39;s a nice way to fall asleep<br/>\nfirst with the pjs & brush teeth routine too. So when I&#39;m working in the<br/>\nbasement, sometimes I don&#39;t know that Geoff has gone to bed upstairs (our<br/>\nhouse has 3 levels) and Damon is alone with the TV. It&#39;s really hard for me<br/>\nwhen I emerge at 2, 3, 4am to head to bed and find a nodding off 4yo in<br/>\nfront of cartoons. If he is asleep, I just take him up. If he is near sleep,<br/>\nI have to be gentle in my approach, but can often pick him up and he&#39;ll go<br/>\nquietly. <br/>\n <br/>\n(This is another topic, but Geoff is not completely on the same page I am<br/>\nwith unschooling, plus I am still finding my way, and has mistaken my saying<br/>\nthat Damon does not have a bedtime to mean that he gets to stay up as long<br/>\nas he wants and do whatever he wants and does not initiate the bedtime<br/>\nroutine on his own. I know I am guilty of letting this happen too, when I go<br/>\nto work and leave them together. I never know what is going to happen. I<br/>\nhave done different things there too, like check on them, or put Damon to<br/>\nbed myself, acting like we are going together with pjs, brushing my teeth,<br/>\nreading him stories, then once he is asleep I go to work. Or I might find<br/>\nDamon asleep on the couch at 1am with Geoff watching TV and doing something<br/>\non his laptop. I guess I don&#39;t like that because he doesn&#39;t get his teeth<br/>\nbrushed and already has cavities and I prefer he not sleep in dirty clothes,<br/>\nbut I can take those off.)<br/>\n <br/>\nOnce I came up around 4am (honestly, it was so quiet I thought they had gone<br/>\nto bed together much earlier and enjoyed working later without the guilt of<br/>\nwonering if Damon was alone!) and was surprised to find Damon sitting there<br/>\nmesmerized by the endless string of cartoons that kept coming on (cartoon<br/>\nnetwork!) and looking worn out and near sleep but when I said I was going to<br/>\nbed, he did NOT want to go! He said he wanted to watch more cartoons. I<br/>\nthink he was overstimulated, or past the point of reason, not sure how to<br/>\nexplain, but he got hysterical when I said it was time for both of us to get<br/>\nsome sleep. I&#39;M NOT TIRED!!! I was very tired myself and turned off the TV,<br/>\nand picked him up. It was awful, he screamed at me that he needed to watch<br/>\nmore cartoons. I feared how late he would be up now that I&#39;ve riled him. If<br/>\nI hadn&#39;t touched him, he probably would have been asleep in 5 mins. But I<br/>\ntried to get him to brush his teeth and put on pajamas, but he was<br/>\nscreaming, crying, kicking, and hitting the whole time so I just took him<br/>\nback downstairs and turned the TV on and left. He was immediately quiet. I<br/>\nwaited for him to come to bed, but he never did. I fell alseep and woke up<br/>\nat 5:30 to SCREAMS from downstairs. He had woken up and was walking around<br/>\nthe living room, half-heartedly jumping on the trampoline, while crying and<br/>\nscreaming. I put him on the potty and he peed (having not done that before<br/>\ngoing to bed) and I carried him upstairs, still crying but with eyes closed.<br/>\nI laid him down next to me and he stopped crying and snuggled in and was<br/>\nasleep in 10 seconds.<br/>\n <br/>\nMy son is also the active kind and needs to run and play a LOT during the<br/>\nday. It is not always enough! Even yesterday when he played for 3 hours with<br/>\nother kids (mostly unschooled I believe!) he still stayed up past 1am. But I<br/>\nconsider it a good thing when we have that peaceful routine and we are all<br/>\nin bed by 2am! I wasn&#39;t sure of the advice on this site for a while also,<br/>\nbut I think it was mostly older kids who were allowed to stay up as late as<br/>\nthey wanted. I think little ones do need some help. My son does not<br/>\nrecognize when he is tired, but I do. He says he is not tired but once we<br/>\nlay down and I quietly read a story, he is asleep in 10 mins.<br/>\n <br/>\nSo while I&quot;m pretty flexible as a parent, I&quot;m not sure allowing a kid to<br/>\nstay up until 5am watching cartoons is the best thing we can do for him. I<br/>\nfeel like we do honor his desire/physical need to stay up later than most<br/>\npeople, but I also try to watch for the signs that he is tired and ready to<br/>\nwind down with us and move toward the routine of pee, pjs, brush teeth,<br/>\nstories. It doesn&#39;t matter to me when this happens, but it certainly helps<br/>\nhim to wind down. Now he won&#39;t always want to or go along with it, which is<br/>\nwhere we run into questioning how much we want to force bedtime, and it is<br/>\nway harder when both parents are too tired to deal with a fight, so that&#39;s<br/>\nwhere we run into a butting of heads. <br/>\n <br/>\nI did happen to talk to the friend in question about sleep yesterday, but I<br/>\nwill try to talk to her more about this soon. I am sure she just needs some<br/>\nhelp and ideas. She is a good mother and always trying to do the right<br/>\nthing! I suspect she is caught up in not controlling her son and has given<br/>\nway to letting her son have freedom above all else and she may need some<br/>\nmore tools in her toolbox to create inviting sleep. AND to help him get his<br/>\nenergy out. I will encourage her in person! Thanks for posting Lyla, we are<br/>\nalready getting some great advice from others on this! I can use it myself<br/>\ntoo!<br/>\n <br/>\nKim Z<br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223803785,"authorName":"Su Penn","from":"Su Penn &lt;su@...&gt;","profile":"marie101365","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] input regarding sleep issues with 4 year old","postDate":"1242853449","msgId":45347,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4NjdBMTZFLUQ3N0YtNEIzOC04RDZFLTc4RTE3QkY0QjFEREBzdXBlbm4uY29tPg==","inReplyToHeader":"PDUwMUE5MzAzLTk2MkUtNDcyQS1BOTY5LTg1NjIxOERBMDgzRUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEQzOEIxRjQ2N0QxNDQ3M0FCRTE3ODRFRTUwOTA0QjVGQExZTEFMQVAyPiA8NTAxQTkzMDMtOTYyRS00NzJBLUE5NjktODU2MjE4REEwODNFQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":45345,"nextInTopic":45348,"prevInTime":45346,"nextInTime":45348,"topicId":45331,"numMessagesInTopic":0,"msgSnippet":"For our son Eric, as we paid attention it seemed to us that a big part of his problem going to sleep was about making the transition. Sometimes he would say","messageBody":"<div id=\"ygrps-yiv-1676504709\">For our son Eric, as we paid attention it seemed to us that a big part  <br/>\nof his problem going to sleep was about making the transition.  <br/>\nSometimes he would say that when he lay down to try to sleep, his  <br/>\nbrain would just race and race and keep him awake. Transitions are  <br/>\nchallenging for him in general.<br/>\n<br/>\nWe have paid attention to things like his activity level during the  <br/>\nday, what he&#39;s eating, catching &quot;sleepiness&quot; clues before he gets too  <br/>\nwound up to settle. We also have a bedtime routine with him--which is  <br/>\npossible even for a kid who doesn&#39;t have a bedtime! Eric&#39;s includes a  <br/>\nwarm drink, a cuddle with his dad, being read to by one of his  <br/>\nparents, and his dad lying down with him until he is asleep, usually  <br/>\nonly a couple of minutes these days. It&#39;s usually his dad who says,  <br/>\n&quot;Ready to go up, Eric?&quot; but Eric agrees if he is tired. Eric&#39;s loft  <br/>\nbed is a very special place to him, with blankets he is especially  <br/>\nfond of, a pillow case I made him special, a large stuffed bear his  <br/>\nUncle Scott gave him, and usually a cat.<br/>\n<br/>\nAll of that said, though, the thing that made the most difference for  <br/>\nEric in managing that transition was a low dose of melatonin in the  <br/>\nevening. Melatonin is a hormone in the body that signals the need for  <br/>\nsleep (among other things). I have not researched it much because we  <br/>\nstarted using it on the advice of a beloved and trusted friend who is  <br/>\na medical professional and who researched it extensively before trying  <br/>\nit with her own son. I did notice a recently released study that found  <br/>\nno harmful effects in using it long term.<br/>\n<br/>\nFor a kid like Eric, for whom the _transition_ itself was problematic,  <br/>\nmelatonin has been almost miraculous in helping him get to sleep  <br/>\nefficiently and rest well.<br/>\n<br/>\nSu<br/>\n<br/>\nunschooling mom of Eric, 8; Carl, 5; Yehva, almost 2</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] input regarding sleep issues with 4 year old","postDate":"1242853333","msgId":45345,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhFOTVFODE2LUUwMjgtNDU0MS04OTQ3LUE0QzA4QkJDQjc3RkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDJDQTNCNERFQkNFMjRGNjdCRTU4MkFBMTIwM0NCM0YxQExZTEFMQVAyPg==","referencesHeader":"PEQzOEIxRjQ2N0QxNDQ3M0FCRTE3ODRFRTUwOTA0QjVGQExZTEFMQVAyPiA8NTAxQTkzMDMtOTYyRS00NzJBLUE5NjktODU2MjE4REEwODNFQFNhbmRyYWRvZGQuY29tPiA8MkNBM0I0REVCQ0UyNEY2N0JFNTgyQUExMjAzQ0IzRjFATFlMQUxBUDI+"},"prevInTopic":45344,"nextInTopic":45347,"prevInTime":45344,"nextInTime":45346,"topicId":45331,"numMessagesInTopic":0,"msgSnippet":"-=she usually IS the one to stay up with him, if he gets up, but can t stay up 24 hours per day...-=- Neither can he. -=-i think if his dad didn t have the","messageBody":"<div id=\"ygrps-yiv-367755576\">-=she usually IS the one to stay up with him, if he gets up, but can&#39;t  <br/>\nstay up 24 hours per day...-=-<br/>\n<br/>\nNeither can he.<br/>\n<br/>\n-=-i think if his dad didn&#39;t have the night job and could do evening/ <br/>\nearlier bedtime / quieting down stuff the son might get tired ealier,  <br/>\nand perhaps is getting overtired and amped from that and then gets  <br/>\n&quot;past the point of no return.&quot; -=-<br/>\n<br/>\nIt shouldn&#39;t matter which hours he&#39;s sleeping, but he&#39;ll be sleeping,  <br/>\neventually.<br/>\n<br/>\nIf the mom has lately started changing her parenting, she should go  <br/>\nmore gradually.   If she&#39;s always been letting him stay up, then it&#39;s  <br/>\nnothing to do with unschooling.    If he were in school how would she  <br/>\nget him to go to bed?   It really doesn&#39;t look like an unschooling  <br/>\nproblem to me.  It looks like a wishing-for-magic situation.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] input regarding sleep issues with 4 year old","postDate":"1242852876","msgId":45343,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZBNjM3QUM5LUMxMjUtNEVCRi04NEE4LTM1QzBFODY1QkJBQUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDUwMUE5MzAzLTk2MkUtNDcyQS1BOTY5LTg1NjIxOERBMDgzRUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEQzOEIxRjQ2N0QxNDQ3M0FCRTE3ODRFRTUwOTA0QjVGQExZTEFMQVAyPiA8NTAxQTkzMDMtOTYyRS00NzJBLUE5NjktODU2MjE4REEwODNFQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":45342,"nextInTopic":45344,"prevInTime":45342,"nextInTime":45344,"topicId":45331,"numMessagesInTopic":0,"msgSnippet":"... Here you go: If-then contracts http://joyfullyrejoycing.com/changing%20parenting/ifthencontracts.html Joyce","messageBody":"<div id=\"ygrps-yiv-23167000\">On May 20, 2009, at 4:01 PM, Sandra Dodd wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Somewhere on Joyce&#39;s site, and I can&#39;t find it searching, is something<br/>\n&gt; about the conditions we had for my kids staying up late when they were<br/>\n&gt; little.<br/>\n<br/>\n </span></blockquote>Here you go:<br/>\n<br/>\nIf-then contracts<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/changing%20parenting/ifthencontracts.html\">http://joyfullyrejoycing.com/changing%20parenting/ifthencontracts.html</a><br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":265299176,"authorName":"katherand@gmail.com","from":"katherand@...","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] input regarding sleep issues with 4 year old","postDate":"1242852862","msgId":45344,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDViOWJmOThkZGM2OGVmMTI4YTljNjEwNGE1MzNiYTU3QGdtYWlsLmNvbT4=","inReplyToHeader":"PDJDQTNCNERFQkNFMjRGNjdCRTU4MkFBMTIwM0NCM0YxQExZTEFMQVAyPg==","referencesHeader":"PEQzOEIxRjQ2N0QxNDQ3M0FCRTE3ODRFRTUwOTA0QjVGQExZTEFMQVAyPiA8NTAxQTkzMDMtOTYyRS00NzJBLUE5NjktODU2MjE4REEwODNFQFNhbmRyYWRvZGQuY29tPiA8MkNBM0I0REVCQ0UyNEY2N0JFNTgyQUExMjAzQ0IzRjFATFlMQUxBUDI+"},"prevInTopic":45343,"nextInTopic":45345,"prevInTime":45343,"nextInTime":45345,"topicId":45331,"numMessagesInTopic":0,"msgSnippet":"... stay in bed, without force, which would need to be physical and would result in huge explosions.  he does not listen collaboratively problem solve yet, and","messageBody":"<div id=\"ygrps-yiv-1782560232\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt; the problem is, she can&#39;t see how to pressure or persuade him to <br/>\n </span></blockquote>stay in bed, without force, which would need to be physical and would <br/>\nresult in huge explosions.  he does not listen collaboratively problem <br/>\nsolve yet, and his response to perceived controls is quite strong.  but <br/>\ni think the perpetual state of overwhelm in their household is part of <br/>\nthe issue too -it&#39;s hard to really focus on gentle persuasion. &lt;&lt;&lt;&lt;<br/>\n<br/>\nIt sounds to me like everyone in the household is tired and once <br/>\nproactive steps are taken things will start to look up.  What about the <br/>\nmother starting the bedtime routine with soothing sounds and sights <br/>\nearlier before dad is off work since he gets off considerably later <br/>\nthan is probably helpful to the routine going smoothly from that point?<br/>\n<br/>\n~Katherine</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] input regarding sleep issues with 4 year old","postDate":"1242850552","msgId":45342,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJDQTNCNERFQkNFMjRGNjdCRTU4MkFBMTIwM0NCM0YxQExZTEFMQVAyPg==","inReplyToHeader":"PDUwMUE5MzAzLTk2MkUtNDcyQS1BOTY5LTg1NjIxOERBMDgzRUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEQzOEIxRjQ2N0QxNDQ3M0FCRTE3ODRFRTUwOTA0QjVGQExZTEFMQVAyPiA8NTAxQTkzMDMtOTYyRS00NzJBLUE5NjktODU2MjE4REEwODNFQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":45341,"nextInTopic":45343,"prevInTime":45341,"nextInTime":45343,"topicId":45331,"numMessagesInTopic":0,"msgSnippet":"thank you sandra, pam, and katherine, i totally agree with the need for more activity.  and the issue with giing unschooling a bad name i totally get too.  she","messageBody":"<div id=\"ygrps-yiv-1717377959\">thank you sandra, pam, and katherine,<br/>\n<br/>\ni totally agree with the need for more activity.  and the issue with giing unschooling a bad name i totally get too.  she was certain that i would say, and you all would say &quot;just let him stay up&quot;.  i told her that wasn&#39;t the case!<br/>\n<br/>\nthe problem is, she can&#39;t see how to pressure or persuade him to stay in bed, without force, which would need to be physical and would result in huge explosions.  he does not listen collaboratively problem solve yet, and his response to perceived controls is quite strong.  but i think the perpetual state of overwhelm in their household is part of the issue too -it&#39;s hard to really focus on gentle persuasion.<br/>\n<br/>\nshe usually IS the one to stay up with him,  if he gets up, but can&#39;t stay up 24 hours per day....and is just totally exhausted.<br/>\n<br/>\nbut he has gotten used to his dad snuggling h im to bed, and so waits for the n ight job to end, and then does stay in bed with dad and uses a laptop, watches a movie, etc.  dad wears earplugs and this sometimes works - but recently he&#39;s been staying up later and later and culminated in the all nighter last night.  and she fell asleep...and he was up and about.  <br/>\n<br/>\ni think if his dad didn&#39;t have the night job and could do evening/earlier bedtime / quieting down stuff the son  might get tired ealier, and perhaps is getting overtired and amped from that and then gets &quot;past the point of no return.&quot;  <br/>\n<br/>\nthe baby is not sleepy/sleeping at the same time, and that&#39;s challanging too. <br/>\n<br/>\ni have forwarded her the links, thanks!  i think it&#39;s just good for her to hear that it&#39;s not &quot;recommended:&quot; to just &quot;let&quot; him do his thing, no  matter the impact.<br/>\n<br/>\nLyla <br/>\n<br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] input regarding sleep issues with 4 year old","postDate":"1242849677","msgId":45341,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUwMUE5MzAzLTk2MkUtNDcyQS1BOTY5LTg1NjIxOERBMDgzRUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEQzOEIxRjQ2N0QxNDQ3M0FCRTE3ODRFRTUwOTA0QjVGQExZTEFMQVAyPg==","referencesHeader":"PEQzOEIxRjQ2N0QxNDQ3M0FCRTE3ODRFRTUwOTA0QjVGQExZTEFMQVAyPg=="},"prevInTopic":45339,"nextInTopic":45342,"prevInTime":45340,"nextInTime":45342,"topicId":45331,"numMessagesInTopic":0,"msgSnippet":"-=-anyone else been there with such a young kid?-=- No young child should be up alone at night.  If a parent can t stay up with him, he needs to be persuaded","messageBody":"<div id=\"ygrps-yiv-1408533792\">-=-anyone else been there with such a young kid?-=-<br/>\n<br/>\nNo young child should be up alone at night.  If a parent can&#39;t stay up  <br/>\nwith him, he needs to be persuaded or pressed to stay in the bed.<br/>\n<br/>\nNothing in anything any longtime unschoolers have ever written has  <br/>\nsuggested there is no purpose to going to bed and being quiet.  That  <br/>\nrumor and problem has a life of its own.<br/>\n<br/>\nMaybe he could watch a DVD (one with no jump scenes and no loud or  <br/>\nscary scenes, preferably one with music that he&#39;s seen a lot) in his  <br/>\nbed.  Maybe he could play gameboy in his bed.  Maybe the mom could  <br/>\nsleep with him rather than with the dad to protect the dad&#39;s sleep.<br/>\n<br/>\nNot only are such doings as you described disruptive to the family,  <br/>\nthey will give unschooling an undeserved bad name.<br/>\n<br/>\nMaybe send her these:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/gradualchange\">http://sandradodd.com/gradualchange</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/balance\">http://sandradodd.com/balance</a><br/>\n<br/>\nThe &quot;opposite&quot; of having a bed time isn&#39;t the ideal situation here.   <br/>\nIt&#39;s not have an *arbitrary* bedtime.<br/>\nTo live in opposition of the old rules is just to have a set of new  <br/>\nrules instead of living by principles.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/principles\">http://sandradodd.com/principles</a><br/>\n<br/>\nNeither the parent should be harsh and demanding, nor should the child  <br/>\nbe harsh and demanding.<br/>\n<br/>\nSomewhere on Joyce&#39;s site, and I can&#39;t find it searching, is something  <br/>\nabout the conditions we had for my kids staying up late when they were  <br/>\nlittle.<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] input regarding sleep issues with 4 year old","postDate":"1242849126","msgId":45339,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBMTQ1RjY2LjkwMTAzQG1hYy5jb20+","inReplyToHeader":"PGZmOWEzMmFmMzkzMGRiODQ0NzEwNDMwNDUwZjc2M2RlQGdtYWlsLmNvbT4=","referencesHeader":"PEQzOEIxRjQ2N0QxNDQ3M0FCRTE3ODRFRTUwOTA0QjVGQExZTEFMQVAyPiA8ZmY5YTMyYWYzOTMwZGI4NDQ3MTA0MzA0NTBmNzYzZGVAZ21haWwuY29tPg=="},"prevInTopic":45333,"nextInTopic":45341,"prevInTime":45338,"nextInTime":45340,"topicId":45331,"numMessagesInTopic":0,"msgSnippet":"... The mom is sounding kind of unreasonably inflexible in terms of not sleeping when the baby is sleeping - I mean, if she expects her son to be able to sleep","messageBody":"<div id=\"ygrps-yiv-1315122840\">On 5/20/2009 11:17 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:katherand@...\">katherand@...</a> wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; My guess is that life during the day isn&#39;t very interactive or whole<br/>\n&gt; body stimulation for the older child while mom cares for the younger<br/>\n&gt; one.  Hopefully she takes the child to a nearby park to run and play.<br/>\n&gt; I used to do that twice a day with Karl if I could.  Sometimes I just<br/>\n&gt; couldn&#39;t but I tried.  And I only had one.<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>The mom is sounding kind of unreasonably inflexible in terms of not <br/>\nsleeping when the baby is sleeping - I mean, if she expects her son to <br/>\nbe able to sleep when other people want him to, why shouldn&#39;t she hold <br/>\nherself to the same standard?<br/>\n<br/>\nBut more likely the kid isn&#39;t getting enough exercise - he probably has <br/>\nmuch greater needs for large body activity than his (tired) mom can <br/>\nimagine. Hours and hours and hours of big muscle movement are what some <br/>\nkids to keep their emotions on a relatively even keel. I&#39;d pack up the <br/>\nlittle one and him and go to a park every day for at least 2 or 3 hours, <br/>\nminimum. Plus - water play can work wonders - really truly WONDERS!! <br/>\nDon&#39;t doubt me on this - I&#39;ve had personal experience.<br/>\n<br/>\nSwimming for a few hours during the day does absolute wonders for sleep. <br/>\nAny kind of outdoor water play is awesome - there is something both <br/>\nsoothing and exhausting about playing with/in water. Even just playing <br/>\nwith a hose or a sprinkler is good. If you really can&#39;t make that work <br/>\n(and I would make HUGE efforts to put water play into every late <br/>\nafternoon) then indoor water play is nice, too. Be really creative about <br/>\nhow to create fun playtime in the bathtub - fingerpainting with pudding <br/>\nwas something my kids loved. They also loved &quot;making potions&quot; which <br/>\nstarted with me giving them the old spices and herbs from my cupboard, <br/>\nbut I would buy big containers of things like cinnamon at places like <br/>\nBig Lots and the 99 cent store, too. Fun kitchen gadgets are cool - <br/>\nthose egg beaters that you turn the handle on are super. Corn starch is <br/>\nreally fun to play with - just make it slightly damp - explore it. <br/>\nTurkey basters - fun. Etc.  Also, Slip-n-slides are really good too - <br/>\nnonstop running, sliding, and water all in one!<br/>\n<br/>\nA mini-trampoline in front of the tv can be good, too.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":265299176,"authorName":"katherand@gmail.com","from":"katherand@...","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] input regarding sleep issues with 4 year old","postDate":"1242843423","msgId":45333,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZmOWEzMmFmMzkzMGRiODQ0NzEwNDMwNDUwZjc2M2RlQGdtYWlsLmNvbT4=","inReplyToHeader":"PEQzOEIxRjQ2N0QxNDQ3M0FCRTE3ODRFRTUwOTA0QjVGQExZTEFMQVAyPg==","referencesHeader":"PEQzOEIxRjQ2N0QxNDQ3M0FCRTE3ODRFRTUwOTA0QjVGQExZTEFMQVAyPg=="},"prevInTopic":45331,"nextInTopic":45339,"prevInTime":45332,"nextInTime":45334,"topicId":45331,"numMessagesInTopic":0,"msgSnippet":"I would just suggest a little reading (and it really doesn t take much to get the idea of the book) on the physiology of sleep (Sleepless in America by Mary","messageBody":"<div id=\"ygrps-yiv-995482381\">I would just suggest a little reading (and it really doesn&#39;t take much <br/>\nto get the idea of the book) on the physiology of sleep (Sleepless in <br/>\nAmerica by Mary Sheedy Kurchinka .. cheap at Amazon).  Some good ideas <br/>\nand strategies there to encourage sleep.<br/>\n<br/>\nMy guess is that life during the day isn&#39;t very interactive or whole <br/>\nbody stimulation for the older child while mom cares for the younger <br/>\none.  Hopefully she takes the child to a nearby park to run and play.  <br/>\nI used to do that twice a day with Karl if I could.  Sometimes I just <br/>\ncouldn&#39;t but I tried.  And I only had one.<br/>\n<br/>\n~Katherine</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"input regarding sleep issues with 4 year old","postDate":"1242842179","msgId":45331,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQzOEIxRjQ2N0QxNDQ3M0FCRTE3ODRFRTUwOTA0QjVGQExZTEFMQVAyPg=="},"prevInTopic":0,"nextInTopic":45333,"prevInTime":45330,"nextInTime":45332,"topicId":45331,"numMessagesInTopic":0,"msgSnippet":"i am posting this for a friend  - hopefully that is ok, as i think the topic will be of general interest, and this list is about priniciples and ideas, rather","messageBody":"<div id=\"ygrps-yiv-2136734550\">i am posting this for a friend  - hopefully that is ok, as i think the topic will be of general interest, and this list is about priniciples and ideas, rather than individual people.<br/>\n<br/>\nso, she has a 4 year old and a 1 year old.  for what it&#39;s worth, the 4 year old is highly &quot;spirited&quot;, &quot;intense&quot;, &quot;explosive&quot;  - whatever you want to call it to paint the picture of the ways in which he is prone to respond to limits, challenges, overstimulation, etc.<br/>\n<br/>\nhe has been staying up progressively later and later, and sleeping in later and later, or sometimes not even sleeping in - waking at 5am, after falling asleep after 1am or 2am, and then staying up all day and night til quite late, even so short on sleep, and feeling quite fragile/lashing out, etc. in exhaustion.<br/>\n<br/>\nlast night he actually stayed up until 7 or 8 am this morning, and then fell asleep.  <br/>\n<br/>\nthe problem is, while he seems content to entertain himself in the middle of the night, he tends to disrupt his everyone else&#39;s sleep, coming and going in and out of the room, pounding the wall or the bed in frustration while on his  laptop, opening and closing doors, etc.  he also has been known to climb bookshelves (yes they could anchor them), get into the fridge and take out lots of food and not eat it, and even leave the house (never yet at night, but they are worried about that).  <br/>\n<br/>\nin addition to feeling confused about why he is staying up all night, they can&#39;t figure out how to make it work for them as a family to support his seeming need to explore his independence and freedom in this way - the dad has to get up early for work - 5am.  and he works a second job from home that takes til 11 or midnight.  the mom cannot seem to sleep during the day even if the baby sleeps, so switching her schedule completely just doesn&#39;t feel doable. <br/>\n<br/>\nanyone else been there with such a young kid?  ideas on what might be going on for him?  ways to support whatever it is while making it workable for the rest of the family?  a new way to look at the situation that niether of us are seeing? (my kids were much older when we came to unschooling).  <br/>\n<br/>\nthanks,<br/>\n<br/>\nLyla<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":45981,"nextTopicId":45985}}