{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"teens, paths, volunteering, confidence...","postDate":"1063041464","msgId":80080,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNS4yNGMzOGI4Ni4yYzhlMTNiOEBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":80079,"nextInTime":80081,"topicId":80080,"numMessagesInTopic":0,"msgSnippet":"This is an amalgam of several recent comments. Kirby and Marty never used to have a plan about what they wanted to be when they grew up, but lately (last","messageBody":"<div id=\"ygrps-yiv-1549431690\">This is an amalgam of several recent comments.<br/>\n<br/>\nKirby and Marty never used to have a plan about what they &quot;wanted to be&quot; when <br/>\nthey grew up, but lately (last winter) they finally expressed possibilities.  <br/>\n   It hasn&#39;t changed their lives much, except that *I* notice when they <br/>\nnotice those things, and I&#39;m more likely to bring topics, articles, shows or <br/>\nwhatever to their attention.<br/>\n<br/>\nIf a boy doesn&#39;t have a path, he can still have a meaningful life.  If they <br/>\nfind responsibilities, to clubs or groups of friends, or volunteer work, or <br/>\nsports, or ANYthing, they&#39;re doing something then and there, not just building up <br/>\nto doing something when they&#39;re older.   And I think it&#39;s important to thank <br/>\nthem for real things they do in real ways.<br/>\n<br/>\nMarty helped Keith put posts in concrete a couple of days.  It was hard work. <br/>\n We could have said, &quot;There, Marty, that will prepare you to do concrete work <br/>\nwhen you&#39;re grown.&quot;  But he had just DONE concrete, real, hard-as-rock <br/>\n(almost), and so what we said was, &quot;Thanks!  Those are going to last a long time <br/>\nthere.&quot;<br/>\n<br/>\nWhen he&#39;s grown and sees them, he&#39;ll know he did real work to put them there.<br/>\n<br/>\nIt&#39;s a minor adjustment, but I think it will make a real difference in the <br/>\nway people see their older kids and in the way the kids see themselves, too, if <br/>\ntheir efforts and deeds are recognized in the present.<br/>\n<br/>\nKirby filled out his job application just for the files, after they offered <br/>\nhim a job.  They offered him the job because he was hanging around the store <br/>\nand being helpful.  He helped generously, honestly and efficiently.  He wasn&#39;t <br/>\ntrying to get a job.  He had no idea anyone under 16 COULD get a job.  He was <br/>\ndoing what he liked to do, and being helpful.<br/>\n<br/>\nI&#39;ve talked with some other parents about their kids finding jobs that way <br/>\ntoo, or through contacts--recommendations from people they know through other <br/>\nactivities.  Kirby helps with a comic book and anime shop, not where he works, <br/>\nbut where the anime club works.  They&#39;ve gotten him into science fiction <br/>\nconventions to man their booth/room.  He&#39;s not an employee, but if he ever did need <br/>\na job, every employ there would put out the word because they know him and <br/>\nthey trust him.<br/>\n<br/>\nThat can&#39;t work with every kind of job, nor with every kind of person, but it <br/>\nCAN work with quite a few.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":15341,"nextTopicId":80059}}