{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":197445047,"authorName":"AngelOvFaith@aol.com","from":"AngelOvFaith@...","profile":"angelovfaith","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Differing Parenting Style Question/Concern but for differen","postDate":"1324394078","msgId":64570,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZjMGMxLjczMTU0YmIzLjNjMjIwMDVlQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":64569,"nextInTime":64571,"topicId":64570,"numMessagesInTopic":0,"msgSnippet":" Yep, my divorce began this September. I had felt like the b/f from 11 years ago was","messageBody":"<div id=\"ygrps-yiv-1569619687\">&lt;&lt;&lt;THIS September? You mean the other day, two or three months  ago?&gt;&gt;&gt;<br/>\n <br/>\nYep, my divorce began this September. I had felt like the b/f from 11 years <br/>\n ago was &quot;sent&quot; to us by fate or guardian angels or whatever, and i was <br/>\nfeeling  vulnerable, alone, and the knight on the white horse rode up at the <br/>\nright time.  I immersed myself into the new relationship. Definitely never <br/>\nplanned it. My  normal support networks were gone due to many circumstances <br/>\nthat happened with  my ex-husband. <br/>\n<br/>\n&lt;&lt;&lt;I would go more slowly, put your daughter first, don&#39;t get  involved in <br/>\nthe other business, raise your kids &quot;in parallel play&quot; for a bit,  and see <br/>\nwhat comparisons naturally arise.&gt;&gt;&gt;<br/>\n<br/>\nAfter this weekend, we have chosen to keep out visits to one day a weekend. <br/>\n Im sad, but relieved at once. Someone else mentioned about that&#39;s why <br/>\nthese  types of intimate close connections are saved til marriage, & i agree <br/>\nwith  part because i am feeling that separation from the person, but longed for <br/>\nmore  productive time with my daughter. I didn&#39;t get involved with the <br/>\nbusiness of the  other child this weekend, for the first time, and while i had <br/>\nmy daughter bring  her own toys, books, etc, the little boy still was jumping <br/>\nall her with joy for  some attention. She has no space, had given up on <br/>\ntrying to show or discuss  things with him. It seems impossible to parallel <br/>\nplay, she has tried. the son  enjoys her, but she grows weary of his <br/>\nbreakdowns. Being only 8, i cant blame  her for not having that much patience anymore. <br/>\n <br/>\n <br/>\n&lt;&lt;&lt;That could change after a while, when the kids miss them or  situations <br/>\nchange. It could happen.&gt;&gt;&gt; <br/>\n <br/>\nNeither parent in both situation got even supervised visitation, its  <br/>\nprobably healthier in both cases if neither sees the other abusive parent again.  <br/>\nThe court&#39;s call. Things could change, but not in the forseeable future, <br/>\nboth  have PFA&#39;s of 3 & 5 years. <br/>\n <br/>\n&lt;&lt;&lt;Also having an impact on your daughter, whether she&#39;ll admit it  or <br/>\nrealize it or not. Your unschooling can&#39;t thrive in the sad shadow of another  <br/>\nkid&#39;s sorrow, and it&#39;s not your responsibility to keep the other child happy <br/>\nif  it&#39;s at your daughter&#39;s expense.&gt;&gt;&gt;<br/>\n <br/>\nI agree. I&#39;ve done enough, and &quot;robbed Peter to pay Paul&quot; as the saying  <br/>\ngoes. My daughter&#39;s time has been compromised. We even took him to and picked  <br/>\nhim up from school a few times, where they played in the playground after <br/>\nthere  for a bit, but my daughter felt compelled to look after the boy, as <br/>\nshe seemed  to get along well with the children there, and the boy was crying <br/>\nconstantly  over something. <br/>\n<br/>\n&lt;&lt;&lt;Maybe the best thing you can do for that boy is to step aside a  way and <br/>\nshow what unschooling can look like. But even you can&#39;t see what it will  <br/>\nlook like if you&#39;re embroiled in school-fueled sorrow.&gt;&gt;&gt;<br/>\n <br/>\nThank you, and I feel I had tried such, and it seems everything i try to  <br/>\nset a subtle example, causes chaos and upsets the father because his son is  <br/>\nthrown off a schedule by playing too long and &quot;getting cranky after bedtime&quot; <br/>\nor  other such- hate to say it, but silly myths. <br/>\n <br/>\n&lt;&lt;&lt;His grandmother isn&#39;t her grandmother. I wouldn&#39;t stay there.  Visit, <br/>\nbut don&#39;t live there. If your house is peaceful and his is increasingly  not, <br/>\nyou will be a lure. If you stay there, you just keep THEIR house from being  <br/>\npeaceful. No peace for anybody.&gt;&gt;&gt;<br/>\n <br/>\nOur house is in turmoil right now as we are preparing to move, and also  <br/>\nfilled with my exes stuff that he left behind so its not the most comfortable  <br/>\nsetting. I admit, i used his place as a refuge for my own peace for a bit, <br/>\nbut  the honeymoon stage is blowing over, and the grandmother&#39;s opinions are <br/>\nstarting  to have an impact on me. She once referred to my daughter as her <br/>\nnew  granddaughter, this made me happy and afraid all at once. What i went <br/>\nthrough  with my own mother to understand our choice to unschool was enough. <br/>\n<br/>\n&lt;&lt;&lt;The first part seems right. The middle part, maybe not even a  full <br/>\nschool year. the last part!? MY ALARM WENT Woop/Woop/Woop. Don&#39;t justify  your <br/>\nromance with it being good for your daughter. I don&#39;t know (don&#39;t need to  <br/>\nknow) details, but he might be a relatively positive male role model, but he&#39;s <br/>\n recently divorced and is letting his mother persuade him to do old-timey,  <br/>\nsorrow-inducing things to his own child. Perhaps some distance is in order <br/>\nwhile  you consider how positive it all is.&gt;&gt;&gt;<br/>\n <br/>\nI agree also on these points. My desire to have a real &quot;family&quot; was winning <br/>\n over my logical and enjoyable everyday life with my daughter. We are free <br/>\nfrom  the abusive marriage i was in, but while he agreed with unschooling, <br/>\nit was not  healthy. This boyfriend, while helping us through the healing <br/>\npart of the  fallout, & not physically abusive, isnt seeming to adhere or any  <br/>\nlonger to our lifestyle or allowing us the time to enjoy or freedom.  <br/>\nTherefore could be just as emotionally damaging. <br/>\n<br/>\n&lt;&lt;&lt;Not your responsibility.<br/>\nHe can&#39;t look up to her if she&#39;s  being a faker about bedtimes, and hiding <br/>\nfood.&gt;&gt;&gt;<br/>\n <br/>\nTrue, the answer used to be &quot;because she&#39;s older&quot;, not now. <br/>\n<br/>\n&lt;&lt;&lt;It would sure make his life easier, for a week or so, if  you would put <br/>\nyour daughter in school, wouldn&#39;t it? And honestly, if your  daughter DOES <br/>\nreally like the guy, and she wouldn&#39;t mind school, and if this  could lead to <br/>\nmarriage and the guy could support you all, maybe it&#39;s worth  considering. <br/>\nPracticalities are real.&gt;&gt;&gt;<br/>\n<br/>\nYep, make his life easier, not mine. not hers. She and i had talked about  <br/>\nthe possibilities of the future, and briefed over these. This time last <br/>\nmonth he  & i were discussing living together in New Jersey, (we are in PA) and  <br/>\nnext year looking at bigger plans, and i admit the school his son attends <br/>\nis  much different than ANY ive seen or witnessed in my experience. But time <br/>\nand  stress over things lately have cancelled out his father asking us to <br/>\nlive  there. So we are currently looking for a place nearby, where he even <br/>\nsaid way  back, &quot;i would never put my son into the Philadelphia school system, <br/>\nno wonder  you dont do school!&quot; <br/>\n <br/>\n&lt;&lt;&lt;We can&#39;t change the situation for you. I can tell you, though,  for <br/>\nsure, that if you allow that negativity to poison your daughter&#39;s happiness,  <br/>\nand your relationship with her, you aren&#39;t being a very good partner to your  <br/>\ndaughter.&gt;&gt;&gt;<br/>\n <br/>\nI appreciate just having a group to bounce the stuff around that&#39;s in  my <br/>\nhead. No unschooling friends or networks near me. Thank you. I had hoped  <br/>\ncoming here for words get me back in a clear place with some perspective.  <br/>\nSometimes i wonder if its me, &quot;treating her like a 20 year old rather than a  <br/>\nkid&quot;, yes that was said to me by a so-called friend i no longer talk with.  <br/>\n<br/>\n&lt;&lt;&lt;You can still love them, just from a little greater  distance, maybe.<br/>\nYou could tell him that he seems to be hurting his son, and  you&#39;re not <br/>\ninterested in expanding that hurt to your  daughter.<br/>\nSandra&gt;&gt;&gt;<br/>\n <br/>\nthank you. I feel he&#39;s really struggling right now and at one time i  may <br/>\nhave seemed like a good gentle step mother material for them both, to help  <br/>\nout, but now i think he realizes without me saying it that theres something <br/>\nelse  more here with his son that needs addressing with his acting out and i <br/>\nwont be  adding anymore advice anytime soon. <br/>\n <br/>\nYour inputs so appreciated! -Lynne<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":64535,"nextTopicId":64536}}