{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1512150,"authorName":"Peggy","from":"Peggy &lt;peggy@...&gt;","profile":"waptia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"New York Times: More Schools Rely on Tests, but Study Raises Doubts","postDate":"1041830095","msgId":11486,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFMTkxMENGLjcxQzM3QUEyQGxpbm1heC5zYW8uYXJpem9uYS5lZHU+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":11485,"nextInTime":11487,"topicId":11486,"numMessagesInTopic":0,"msgSnippet":"from: http://www.nytimes.com/2002/12/28/education/28EXAM.html?todaysheadlines=&pagewanted=print&position=top December 28, 2002 More Schools Rely on Tests, but","messageBody":"<div id=\"ygrps-yiv-597139810\">from:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nytimes.com/2002/12/28/education/28EXAM.html?todaysheadlines=&pagewanted=print&position=top\">http://www.nytimes.com/2002/12/28/education/28EXAM.html?todaysheadlines=&pagewanted=print&position=top</a><br/>\n<br/>\nDecember 28, 2002<br/>\n<br/>\nMore Schools Rely on Tests, but Study Raises Doubts<br/>\n<br/>\nBy GREG WINTER<br/>\n<br/>\n    Rigorous testing that decides whether students graduate, teachers win<br/>\nbonuses and schools are shuttered, an approach already in place in more than<br/>\nhalf the nation, does little to improve achievement and may actually worsen<br/>\nacademic performance and dropout rates, according to the largest study ever on<br/>\nthe issue.<br/>\n<br/>\nWith calls for accountability in public education mounting, such make-or-break<br/>\nexams have become<br/>\ncornerstones in at least 28 states in the drive to improve public schools. The<br/>\nidea is that by tying test scores to great consequences, the learning process<br/>\nwill be taken that much more seriously and tangible progress will be all the<br/>\nmore likely. <br/>\n<br/>\nThe approach is also central to some of President Bush&#39;s sweeping education<br/>\noverhaul, lending even greater momentum to the movement known as &quot;high stakes&quot;<br/>\ntesting. <br/>\n<br/>\nBut the study, performed by researchers at Arizona State University and<br/>\nfinanced by teachers&#39; unions that have expressed skepticism about such tests,<br/>\nfound that while students show consistent improvement on these state exams,<br/>\nthe opposite is typically true of their performance on other, independent<br/>\nmeasures of academic achievement.<br/>\n<br/>\nFor example, after adopting such exams, twice as many states slipped against<br/>\nthe national average on the SAT and the ACT as gained on it. The same held<br/>\ntrue for elementary-school math scores on the National Assessment of<br/>\nEducational Progress, an exam overseen by the United States Department of<br/>\nEducation. <br/>\n<br/>\nTrends on Advanced Placement tests were also worse than the national average<br/>\nin 57 percent of those states, while movement in elementary-school reading<br/>\nscores was evenly split  better than the national average in half the states,<br/>\nworse in the other half. The only category in which most of the states gained<br/>\nground was middle-school math, with 63 percent of them bettering the national<br/>\ntrend.<br/>\n<br/>\n&quot;Teachers are focusing so intently on the high-stakes tests that they are<br/>\nneglecting other things that are ultimately more important,&quot; said Audrey<br/>\nAmrein, the study&#39;s lead author, who says she supported high-stakes tests<br/>\nbefore conducting her research. &quot;In theory, high-stakes tests should work,<br/>\nbecause they advance the notions of high standards and accountability. But<br/>\nstudents are being trained so narrowly because of it, they are having a hard<br/>\ntime branching out and understanding general problem-solving.&quot; <br/>\n<br/>\nThe study was commissioned by the Great Lakes Center for Education Research<br/>\nand Practice, a Midwestern group of six state affiliates of the National<br/>\nEducation Association, which has opposed using any one test to determine when<br/>\nstudents graduate, schools get more money and teachers are replaced. The<br/>\nresearch is sure to be a subject of fierce debate among educators, and its<br/>\nmethodology has already drawn some criticism, though an independent panel of<br/>\nresearchers at other universities has concluded that the findings are valid.<br/>\n<br/>\nPerhaps most controversial, the study found that once states tie standardized<br/>\ntests to graduation, fewer students tend to get diplomas. After adopting such<br/>\nmandatory exit exams, twice as many states had a graduation rate that fell<br/>\nfaster than the national average as those with a rate that fell slower. Not<br/>\nsurprisingly, then, dropout rates worsened in 62 percent of the states,<br/>\nrelative to the national average, while enrollment of young people in programs<br/>\noffering equivalency diplomas climbed.<br/>\n<br/>\nThe reason for this is not solely that struggling students grow frustrated and<br/>\nultimately quit, the study concluded. In an echo of the findings of other<br/>\nresearchers, the authors asserted that administrators, held responsible for<br/>\nraising tests scores at a school or in an entire district, occasionally<br/>\npressure failing students to drop out.<br/>\n<br/>\nIn lawsuits, educators have testified that students were held back rather than<br/>\npromoted to a grade in which high-stakes tests were administered, and that<br/>\nothers were expelled en masse shortly before testing days. But neither those<br/>\nwitnesses nor this study has been able to quantify that circumstance<br/>\nnationally, or prove that it has substantially influenced dropout rates. <br/>\n<br/>\nAs the popularity of do-or-die exams has increased, educators have vehemently<br/>\nargued their merits and drawbacks, focusing mainly on individual states, like<br/>\nTexas and Massachusetts, where their adoption has spurred the most<br/>\ncontroversy. <br/>\n<br/>\nBut this study is the first to have looked at the issue nationally. The study<br/>\nexamined graduation rates and scores from a variety of tests in more than two<br/>\ndozen states that have turned to do-or-die exams over the last two decades in<br/>\nhopes of raising academic performance.<br/>\n<br/>\n&quot;This is not research by press release, this is serious work,&quot; said Sherman<br/>\nDorn, a historian of education at the University of South Florida who reviewed<br/>\nit. &quot;What&#39;s very clear is that the study challenges the conventional wisdom<br/>\nthat high-stakes testing improves academic achievement and does not have<br/>\nunwanted consequences beyond that.&quot; <br/>\n<br/>\nThe study has drawn its share of detractors, in no small part because one of<br/>\nits authors, David Berliner, has been a critic of school vouchers and other<br/>\neducation proposals often championed by conservatives.<br/>\n<br/>\n&quot;I&#39;ve gotten this reputation of being outspoken,&quot; Mr. Berliner said. &quot;Some<br/>\ncall it ideological; I call it honest. Either way, the data speaks for<br/>\nitself.&quot; <br/>\n<br/>\nSoundness of the data aside, some of Mr. Berliner&#39;s critics question whether<br/>\nsuch tests are to blame for the poor showings. <br/>\n<br/>\n&quot;You almost never have a pure cause-and-effect relationship,&quot; said Chester E.<br/>\nFinn, assistant secretary of education in the Reagan administration. &quot;Yes,<br/>\nyou&#39;re introducing high-stakes tests, but maybe you&#39;re also changing the way<br/>\nyou license teachers, or extending the school day, or changing textbooks.<br/>\nThere&#39;s always a lot of things going on concurrently, so you really cannot peg<br/>\neverything to the high-stakes tests.&quot;<br/>\n<br/>\nOther skeptics challenged the fairness of holding up the SAT, the ACT,<br/>\nAdvanced Placement tests and the national math and reading exams as indicators<br/>\nof academic performance, even if they are the only nationally administered<br/>\ntests with which to measure one state against another. <br/>\n<br/>\nFor example, the National Assessment of Educational Progress test,<br/>\nadministered every four years, &quot;gives us a nice eyeball assessment, but the<br/>\nproblem is it&#39;s given infrequently,&quot; said Jay P. Greene, a senior fellow at<br/>\nthe Manhattan Institute who is working on a similar though more limited study.<br/>\n<br/>\n&quot;And the college entrance tests are very bad at judging learning,&quot; he said,<br/>\n&quot;because only a modest number of students actually take the test.&quot;<br/>\n<br/>\nThe criticism notwithstanding, many researchers said the study fell within the<br/>\nbounds of what was already known about make-or-break exams. Educators have<br/>\nlong complained that the threat of serious consequences means that teachers<br/>\nfocus on little else, sometimes building their lesson plans entirely around<br/>\nthe contents of the test. <br/>\n<br/>\nThat would not necessarily be a problem if the state exams were based on a<br/>\ncomprehensive curriculum, said Eva Baker, co-director of the National Center<br/>\nfor Research on Evaluation, Standards and Student Testing at U.C.L.A. But as<br/>\noften as not, the state exams are given in the absence of such a framework,<br/>\nleaving teachers to fill in the gaps on their own, sometimes with an<br/>\noverzealous reliance on test-taking drills. <br/>\n<br/>\n&quot;The most perverse problem with high-stakes tests,&quot; Ms. Baker said, &quot;is that<br/>\nthey have become a substitute for the curriculum instead of simply a measure<br/>\nof it.&quot;<br/>\n<br/>\nSome researchers suggested that the study might have actually understated the<br/>\nconsequences of high-stakes tests, particularly for dropout rates, because it<br/>\nrelied on government statistics. &quot;Officially reported dropout statistics are<br/>\npretty suspect in a lot of places,&quot; said Walter Haney, a professor at the<br/>\nLynch School of Education at Boston College, pointing out that students who<br/>\nleave school to get a G.E.D. are not always counted as dropouts. &quot;The real<br/>\nresults are probably worse.&quot;<br/>\n<br/>\nA larger question raised by the study is what effect, if any, it will have on<br/>\nthe public debate over high-stakes testing. While many educators will most<br/>\nlikely hold it up as proof that such exams are flawed, largely because they<br/>\nappear to offer inadvertent encouragement to schools to constrain the<br/>\ncurriculum and squeeze out underachievers, others see the issue as more<br/>\nopen-ended.<br/>\n<br/>\n&quot;Should we just make better tests,&quot; asked Anthony G. Rud Jr., associate<br/>\nprofessor of education at Purdue University, or &quot;is there something<br/>\nfundamentally wrong with testing in this matter?&quot;<br/>\n<br/>\n<br/>\nCopyright 2002 The New York Times Company | Permissions | Privacy Policy</div>","specialLinks":[]}],"prevTopicId":11462,"nextTopicId":11488}}