{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":135843572,"authorName":"24hrmom","from":"&quot;24hrmom&quot; &lt;24hrmom@...&gt;","profile":"learn2day2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Question about strewing","postDate":"1095775884","msgId":99729,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA0MmYwMWM0OWZlNCRlMGJiYTQxMCQwMjAwYThjMEBUaW5rZXJiZWxsPg==","referencesHeader":"PDEzZi4xZDVhNmZmLjJlODEwMTlkQGFvbC5jb20+"},"prevInTopic":99717,"nextInTopic":0,"prevInTime":99728,"nextInTime":99730,"topicId":99706,"numMessagesInTopic":0,"msgSnippet":" That s how I imagined","messageBody":"<div id=\"ygrps-yiv-885556557\">&lt;&lt; I liked the bike story especially.  It could be pretty nice to fall on<br/>\nautumn leaves and soft dirt instead of year-round concrete. &gt;&gt;<br/>\n<br/>\nThat&#39;s how I imagined it too. LOL!  In reality, no leaves had fallen yet and<br/>\nhe found the grass too hard to pedal on so he opted for the gravelly dirt<br/>\nroad.  After a few tumbles he happily went for long pants and the helmet and<br/>\nknee pads we brought.  By the next day he had scrapped his hands a few<br/>\ntimes, and his brother was getting a blister on his hand from changing gears<br/>\n(something new he learned about) so Rocco drove into town and picked up some<br/>\nbike gloves for both of them.  They had a great time until their butts were<br/>\ntoo sore to ride!  ;-)<br/>\n<br/>\nStill a nice story!<br/>\n<br/>\nPam L<br/>\nwww.livingjoyfully.ca</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Question about strewing","postDate":"1095739293","msgId":99717,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzZi4xZDVhNmZmLjJlODEwMTlkQGFvbC5jb20+"},"prevInTopic":99713,"nextInTopic":99729,"prevInTime":99716,"nextInTime":99718,"topicId":99706,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/20/04 6:19:08 PM, 24hrmom@sympatico.ca writes: ","messageBody":"<div id=\"ygrps-yiv-233549177\">In a message dated 9/20/04 6:19:08 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:24hrmom@...\">24hrmom@...</a> writes:<br/>\n<br/>\n&lt;&lt; Pam L<br/>\n<br/>\nwww.livingjoyfully.ca<br/>\n<br/>\n<br/>\nPS  I hope that helps ... why can I never write a short email!?!?! &gt;&gt;<br/>\n<br/>\n<br/>\nHow can you tell exciting strewing stories in a short e-mail!?<br/>\nI liked the bike story especially.  It could be pretty nice to fall on autumn <br/>\nleaves and soft dirt instead of year-round concrete.<br/>\n<br/>\nJoyce took us to the National Science Museum a couple of weeks ago, and we <br/>\nsaw a floating pig thing.    I wanted one but they didn&#39;t have any for sale.   I <br/>\nwrote down the webpage thinking it would be an easy thing to get later.<br/>\n<br/>\nNot so easy.  The company doesn&#39;t come out and say how to get one.  Maybe <br/>\nthey only sell wholesale.  So I googled it and found ONE (1) place offering it <br/>\nfor sale, so i ordered one ($32 plus shipping).  It arrived while I was in <br/>\nChicago, but the kids opened it, and showed it to Kirby. <br/>\n<br/>\nEvery person who has come over since (except Mo, darn it, who came to borrow <br/>\nchain mail for a history class she teaches; I forgot) has been shown the pig.  <br/>\n And Holly discovered that if you shine a laser light at the pig, even though <br/>\nit&#39;s not there (you can&#39;t touch it), the light does not pass through it.  And <br/>\nif you look down into the chamber at the REAL pig (brace yourselves, <br/>\nnon-optic-physicists), the real pig has a laser pointing at him too.   OOOOH it&#39;s so <br/>\nvery wonderful.<br/>\n<br/>\nAnd I&#39;m not finding the online site, and I threw the box away.<br/>\n<br/>\nIt&#39;s like a little black flying-saucer looking thing about 8&quot; across, and the <br/>\ntop has a hole in the middle and can come off.   <br/>\n<br/>\nTher&#39;e a little pink rubber pig about 1&quot; long.   You set him in the bottom, <br/>\nput the top on, and a ghostly projection-pig appears above the open hole.  And <br/>\nright under him is a relflection of HIM, as though he&#39;s standing on a mirror.  <br/>\nAnd he looks real enough to grab, so people try to grab him.<br/>\n<br/>\nIf I can find a photo I&#39;ll send the link.<br/>\n<br/>\nThe laser business really surprised us.<br/>\n<br/>\n Kirby returned from a three-day trip to an anime convention in Denver, and <br/>\none of the first things we said was &quot;Shine a laser on the pig!&quot;  He just did <br/>\nit, without any other questions.<br/>\n<br/>\nI can&#39;t find a picture of it, can&#39;t find the papers, don&#39;t remember the <br/>\ncompany name.  Darn it.<br/>\n<br/>\nI&#39;ll look later.  <br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":135843572,"authorName":"24hrmom","from":"&quot;24hrmom&quot; &lt;24hrmom@...&gt;","profile":"learn2day2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Question about strewing","postDate":"1095725855","msgId":99713,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAzMGMwMWM0OWY3MCQ2NTM4ZWVjMCQwMjAwYThjMEBUaW5rZXJiZWxsPg==","referencesHeader":"PGNpbmwwaCtkZDk2QGVHcm91cHMuY29tPg=="},"prevInTopic":99708,"nextInTopic":99717,"prevInTime":99712,"nextInTime":99714,"topicId":99706,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1798126245\">&lt;&lt; Can anyone give some recent concrete examples of strewing? Does strewing<br/>\ninclude<br/>\nreading aloud, suggesting stuff, arranging outings, planning events? Or is<br/>\nit more subtle? &gt;&gt;<br/>\n<br/>\nI think strewing can involve any of those things as long as the child is a<br/>\nwilling recipient.  The child may show an immediate interest in something<br/>\nyou&#39;ve strewn about / suggested, or may ignore it for now but bring it up<br/>\nlater, or may show no interest ever!  I don&#39;t think it necessarily needs to<br/>\nbe &quot;subtle&quot;, if by that you mean not even mentioned but just left about ...<br/>\nthey may never notice it.  I do think it&#39;s important not to be invested in<br/>\nthe outcome though.<br/>\n<br/>\nI have a few examples from the past week.  Two that sparked something and<br/>\none that still might. :-)<br/>\n<br/>\nOne involves my youngest who&#39;s 7.  Michael&#39;s been a bit concerned lately<br/>\nthat he&#39;s not yet reading though his schooled cousin (she&#39;s 6 months older)<br/>\nhas been for at least a year.  I have been playing with words and sounds<br/>\nwith him ... not really as games but as they come up in his life and he&#39;s<br/>\nbeen picking it up well.  Anyway, I have a phonics &quot;kit&quot; I picked up many<br/>\nyears ago and haven&#39;t touched that has a some tapes, easy reader books,<br/>\ngames and so on.  I brought it out a few months ago and we had some fun<br/>\nmaking short rhyming words with the letters.  He hadn&#39;t asked to use it<br/>\nagain and I just left it in his closet where he would see it from time to<br/>\ntime.<br/>\n<br/>\nThe other day he was in his room fishing for something to do and I pulled it<br/>\nout.  It turned into a wonderful spontaneous hour.  His sister (she&#39;s 10 and<br/>\nstarted reading at 9) dropped in and told him about the dumb little books<br/>\nshe used to have to read at school (she came home in grade 2) and how she<br/>\ndidn&#39;t read until she found something interesting (Harry Potter).  She<br/>\nstarted reading the easy reader books to him and they howled with laughter<br/>\nat the *weak* storylines!  They played with a couple of the games.<br/>\n<br/>\nI got a chance to mention to them the idea that at school it&#39;s important to<br/>\nthe teachers that the kids learn to read early so they can read the<br/>\nworksheets and so on on their own.  But that right now Michael loves numbers<br/>\nand reminded both of them how a couple weeks ago when we played Monopoly<br/>\nwith his cousin she was quite lost dealing with the money while it was easy<br/>\nfor him.  It was a great chance for them to see unschooling in action ...<br/>\nthat they can follow what they are interested in.  That he can pick up more<br/>\nreading now over the next months (or years), and his cousin will pick up<br/>\nmore math as well over time.<br/>\n<br/>\nI initially strewed the phonics kit around my son when he expressed an<br/>\ninterest in learning to read but when it did spark something I was much less<br/>\ninterested in the learning-to-read aspect of it and more in the way I could<br/>\nease his fears about not yet reading!<br/>\n<br/>\nIn another &quot;strewing incident&quot; (LOL!) we went camping on the weekend and dh<br/>\nand I decided to strew / bring along the boys&#39; bicycles.  Michael has<br/>\nexpressed a bit of an interest in learning to ride it but not on the<br/>\nsidewalk in front of our house.  Too many spectators!  And Joseph has not<br/>\nbeen interested in riding for the last couple of years.  If we asked them<br/>\nI&#39;m pretty sure they&#39;d have said no, leave them at home.  Anyway we just<br/>\nbrought them, along with dh&#39;s bike, because we thought they *may* be<br/>\ninterested but we agreed not to be at all frustrated if the bikes were left<br/>\nuntouched.  Well, surprise!  They were the most used items we brought.  And<br/>\nalthough Michael took many tumbles he kept on trying and can now, after 3<br/>\ndays, ride quite confidently.<br/>\n<br/>\nAnd lastly, my daughter has been making a number of connections regarding<br/>\nAlbert Einstein lately.  She&#39;s enjoyed some of his quotes strewn around our<br/>\nlocal Science Centre, a reference to his thoughts on time travel in the<br/>\nmovie Paycheck, my recent Discover mag devoted an issue to him and she<br/>\nlooked through the pictorial presentation of his ideas, and so on.  Many<br/>\nconnections.  A couple days ago at the library I came across a tape of a<br/>\nNOVA show about his life and ideas and picked it up.  I mentioned it to her,<br/>\nI&#39;ve left it in the TV room, and maybe she&#39;ll watch it.  Or maybe I will put<br/>\nit on and watch it and 1, 2, or 3 kids may join me ... or not. ;-)<br/>\n<br/>\nI&#39;ve found that if I strew something that makes connections to other things<br/>\nthey are already interested I really just need to leave it around and<br/>\nprobably mention it to them so they know it&#39;s there.  If there&#39;s something<br/>\nnew that I think they may enjoy, new as in it really has no relation or<br/>\nconnection to something they already are interested in, I&#39;m much more likely<br/>\nto get a response if I start doing it, reading it, watching it etc myself.<br/>\nIf I just mention it to them and leave it laying around they are much less<br/>\nlikely to try it out.  But they&#39;ll likely come check it out and join me if<br/>\nthey are interested.<br/>\n<br/>\nPam L<br/>\nwww.livingjoyfully.ca<br/>\n<br/>\nPS  I hope that helps ... why can I never write a short email!?!?!</div>","specialLinks":[]},{"userId":149995806,"authorName":"catherine aceto","from":"&quot;catherine aceto&quot; &lt;aceto3@...&gt;","profile":"cat4cat15217","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Question about strewing","postDate":"1095719500","msgId":99708,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyMTkwMWM0OWY2MSQ5OTcyODVjMCQ3ZjAyYThjMEAyMDAyZGVza3RvcD4=","referencesHeader":"PGNpbmwwaCtkZDk2QGVHcm91cHMuY29tPg=="},"prevInTopic":99707,"nextInTopic":99713,"prevInTime":99707,"nextInTime":99709,"topicId":99706,"numMessagesInTopic":0,"msgSnippet":"Erhh... I didn t coin the term and don t pretend to define it,  but I think of it as creating a rich environment with cool things that I know about and that my","messageBody":"<div id=\"ygrps-yiv-1069070257\">Erhh...<br/>\n<br/>\nI didn&#39;t coin the term and don&#39;t pretend to define it,  but I think of it as creating a rich environment with cool things that I know about and that my children wouldn&#39;t know about to ask for.  <br/>\n<br/>\nIn the last week, for example, I have carted home some plastic tubes that are tuned so that if you whack them on something they have a pitch (they come in a set of 8 for an octave), a book on simple origami, a translation of the Egyptian Book of the Dead showig the heiroglyphs and the translation under them, a plastic board version of the game traffic jam, that we have enjoyed playing online, and a &quot;drinking bird.&quot;  <br/>\n<br/>\nI don&#39;t consider it &quot;strewing&quot; that we have paper and markers and pens and art supplies and plastic test tubes and child-friendly chemicals to mix in them and stuff to climb on and stuff to build with.  Those I just consider the basics that every house should have. <br/>\n<br/>\nI don&#39;t consider it strewing that we went to the toy store and got a Blinkie that my daughter saw a commercial for and wanted to see. <br/>\n<br/>\nI guess I do consider it strewing that before buying the Blinkie, I showed her the existence of online review of toys,  and at her request read her a few to see whether we could find out whether the toy was as cool as it looked like it would be based on the commercial.  <br/>\n  <br/>\nYeah, for me, the &quot;strewing&quot; is the cool, quirky odd thing that I see that I think they would like -- not what I consider the basics that all children should have access to and not what they see or hear about and ask me for. <br/>\n<br/>\n-Cat <br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Julie Bogart <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a> <br/>\n  Sent: Monday, September 20, 2004 6:18 PM<br/>\n  Subject: [UnschoolingDiscussion] Question about strewing<br/>\n<br/>\n<br/>\n  Can anyone give some recent concrete examples of strewing? Does strewing include <br/>\n  reading aloud, suggesting stuff, arranging outings, planning events? Or is it more subtle?<br/>\n<br/>\n  Julie B<br/>\n   <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":141102765,"authorName":"Mary","from":"&quot;Mary&quot; &lt;mummy124@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Question about strewing","postDate":"1095719305","msgId":99707,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDcwMWM0OWY2MSQyNTg5MGY4MCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+","referencesHeader":"PGNpbmwwaCtkZDk2QGVHcm91cHMuY29tPg=="},"prevInTopic":99706,"nextInTopic":99708,"prevInTime":99706,"nextInTime":99708,"topicId":99706,"numMessagesInTopic":0,"msgSnippet":"From: Julie Bogart  ... include ... it more subtle? All those things are great but one can still do even more. I find that sometimes","messageBody":"<div id=\"ygrps-yiv-179467801\">From: &quot;Julie Bogart&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:julie@...\">julie@...</a>&gt;<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Can anyone give some recent concrete examples of strewing? Does strewing<br/>\n </span></blockquote>include<br/>\n<blockquote><span title=\"ireply\"> &gt; reading aloud, suggesting stuff, arranging outings, planning events? Or is<br/>\n </span></blockquote>it more subtle?<br/>\n<br/>\n<br/>\n<br/>\nAll those things are great but one can still do even more. I find that<br/>\nsometimes when I suggest things that I know my kids are interested in, they<br/>\nstill say no to them. It seems that my timing is off from theres. And what<br/>\nnormally would interest them just doesn&#39;t at the time.<br/>\n<br/>\nSo instead of asking, I just place things out and around of interest.<br/>\nAnything from books, movies and games to baking stuff like cookie cutters<br/>\nand rolling pin. Sometimes just the look suggests so much more to the child<br/>\nthan the words. Some parents cycle toys too. Boxing some up and putting out<br/>\nones that have been boxed.<br/>\n<br/>\nLeaving out artsy stuff within eyesight is good too. Not just crayons and<br/>\npaper but yarn, glue, paints, playdoh, buttons, material, etc.<br/>\n<br/>\nI find that talking about my interests to the children is like strewing too.<br/>\nIt can get them started on similar things or a whole new path.<br/>\n<br/>\nMary B</div>","specialLinks":[]},{"userId":77522235,"authorName":"Julie Bogart","from":"&quot;Julie Bogart&quot; &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Question about strewing","postDate":"1095718736","msgId":99706,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNpbmwwaCtkZDk2QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":99707,"prevInTime":99705,"nextInTime":99707,"topicId":99706,"numMessagesInTopic":0,"msgSnippet":"Can anyone give some recent concrete examples of strewing? Does strewing include reading aloud, suggesting stuff, arranging outings, planning events? Or is it","messageBody":"<div id=\"ygrps-yiv-1868943395\">Can anyone give some recent concrete examples of strewing? Does strewing include <br/>\nreading aloud, suggesting stuff, arranging outings, planning events? Or is it more subtle?<br/>\n<br/>\nJulie B</div>","specialLinks":[]}],"prevTopicId":99699,"nextTopicId":99732}}