{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":10,"messages":[{"userId":150527288,"authorName":"Ren","from":"Ren &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"morality question","postDate":"1060307616","msgId":15969,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwODA3LjIxNTM0Mi44NjMwLjg2MzM3NEB3ZWJtYWlsMTgubnljLnVudGQuY29tPg=="},"prevInTopic":15966,"nextInTopic":0,"prevInTime":15968,"nextInTime":15970,"topicId":15943,"numMessagesInTopic":0,"msgSnippet":"I for one am not into rewards such as this and would give all the kids candy for doing their own best. How about a candy whenever they want one and forget","messageBody":"<div id=\"ygrps-yiv-1948400086\">&quot;I for one am not into rewards such as this and would give all the<br/>\n kids candy for doing their own best.&quot;<br/>\n<br/>\nHow about a candy whenever they want one and forget about rewarding for any kind of behavior?<br/>\nRead &quot;punished by rewards&quot;, I think it really helps open the mind to how our society is backwards that way! Why not come up with some cooperative games that don&#39;t require anyone winning? And give him the candy regardless ....instead of making him jump through some hoop. If it&#39;s someone else doing it, just tell him you&#39;ll buy him candy and he doesn&#39;t have to do anything for them to get anything!! Crazy.<br/>\nSounds like he&#39;s pretty honest, he told YOU the truth.<br/>\n<br/>\nRen</div>","specialLinks":[]},{"userId":2300774,"authorName":"Betsy","from":"Betsy &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] morality question","postDate":"1060300922","msgId":15966,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGMzJFODdBLjgwMDA3MDJAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PDE0Mi4xNmQ1YTVjZS4yYzYzZmE3OEBhb2wuY29tPg=="},"prevInTopic":15964,"nextInTopic":15969,"prevInTime":15965,"nextInTime":15967,"topicId":15943,"numMessagesInTopic":0,"msgSnippet":"**If he does something wrong, he accepts the blame (instead of saying, I didn t to that )** I think this quality has really got to spring from parents who","messageBody":"<div id=\"ygrps-yiv-862825936\">**If he does something wrong, he accepts<br/>\nthe blame (instead of saying, &quot;I didn&#39;t to that&quot;)**<br/>\n<br/>\nI think this quality has really got to spring from parents who honestly <br/>\nadmit when they have made a mistake.  (I don&#39;t remember if Sandra was <br/>\ntalking about that here or on unschooling-discussion, but I&#39;m connecting <br/>\nthis desirable kid quality to her recommended desirable parent quality.)<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":143939629,"authorName":"Kris","from":"&quot;Kris&quot; &lt;louisa@...&gt;","profile":"louisam1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] morality question","postDate":"1060287156","msgId":15964,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyNWEwMWMzNWQyMCQzZjU2ZGRlMCQxYmJjYTNjZUBiY3Q+"},"prevInTopic":15963,"nextInTopic":15966,"prevInTime":15963,"nextInTime":15965,"topicId":15943,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1758959066\">&lt;&lt;Hi all,<br/>\n<br/>\nMy 6.5 year old son enjoys telling fibs, like my dad is a pro baseball<br/>\nplayer, which Tim is not. He also loves stealing things from his sister,<br/>\nlike her trophies or special cards.He had taken gum from the stores and<br/>\nmoney from tip jars, pens from the art center. Yesterday at swim practice,<br/>\nthe kids who could swim under the lanes without coming up for air were<br/>\nrewarded with a candy bar. Riley told me he gets a candy bar, but then told<br/>\nme he really did not swim the whole length of the pool. So, I&#39;m thinking I<br/>\nneed to help him be honest. Winning for Riley is very important. I could<br/>\ninduce a major meltdown pushing this issue. I for one am not into rewards<br/>\nsuch as this and would give all the kids candy for doing their own best. So,<br/>\nany opinions out there how to help guide Riley to speak honestly.<br/>\n<br/>\nMary H&gt;&gt;<br/>\n<br/>\nWhen Lanora was 3 I caught her in a lie and she asked if she was in trouble.<br/>\nI told her that I would never punish her for lying because no one could make<br/>\nher tell the truth.  &quot;If you want people to believe you then you will be<br/>\nhonest.&quot;<br/>\n<br/>\nObviously, it didn&#39;t take completely then but over the next few years it<br/>\ndid.  A friend recently said that they liked spending time with her because<br/>\nshe is honest, I don&#39;t think she knew anyone else her own age who was.<br/>\n<br/>\nAs for me, this was my first lesson in how punishment stunts progress, keeps<br/>\nchildren from internalizing morality.  As usual, I learned as much as she<br/>\ndid.<br/>\n<br/>\nOf course, Jonathan may be another story but so far he seems to be quite<br/>\nhonest.<br/>\n<br/>\nKris</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] morality question","postDate":"1060282488","msgId":15963,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0Mi4xNmQ1YTVjZS4yYzYzZmE3OEBhb2wuY29tPg=="},"prevInTopic":15962,"nextInTopic":15964,"prevInTime":15962,"nextInTime":15964,"topicId":15943,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/7/2003 2:35:20 PM Eastern Daylight Time, ... Cameron s in the same spot (except not so long at this job, his first). He s been working at","messageBody":"<div id=\"ygrps-yiv-1570323784\">In a message dated 8/7/2003 2:35:20 PM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It gave me a good opportunity to discuss something I&#39;ve tried to discuss <br/>\n&gt; with <br/>\n&gt; him in the past and he had no way to understand it.   <br/>\n&gt; <br/>\n&gt; He&#39;s worked there for three years now, since he turned 14.  That&#39;s the <br/>\n&gt; second <br/>\n&gt; time he has overslept in all that time.  He has been too sick twice--once to <br/>\n&gt; <br/>\n&gt; sick for his own shift, and once too sick to take another person&#39;s shift.  <br/>\n&gt; That&#39;s one absence from illness, in three years.<br/>\n&gt; <br/>\n&gt; When his drawer was short once, he was not suspected at all.  When there <br/>\n&gt; were <br/>\n&gt; things missing during his shift no one even began to suspect that he had <br/>\n&gt; been <br/>\n&gt; irresponsible (or worse, involved in the theft).<br/>\n&gt; <br/>\n&gt; He&#39;s seen others be let go for missing cash or items.<br/>\n&gt; <br/>\n&gt; So I was able to tell him that people earn points with other people, and <br/>\n&gt; those who don&#39;t believe it and don&#39;t bother are the ones who will be let go <br/>\n&gt; for <br/>\n&gt; one offense.  If people do just barely what&#39;s required of them, they have no <br/>\n&gt; <br/>\n&gt; &quot;credit&quot; with the other person, but if they do more than necessary (in any <br/>\n&gt; way), <br/>\n&gt; they&#39;ll never be fired for one minor failure.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Cameron&#39;s in the same spot (except not so long at this job, his first). He&#39;s <br/>\nbeen working at Hooligan&#39;s Deli for six months. His bosses, Ivan & Gris, come <br/>\nout often to tell ME how well he&#39;s doing and how pleased they are with his <br/>\nwork. They tell him almost every day. <br/>\n<br/>\nA few weeks ago, Ben asked what *exactly* was so good about what he was <br/>\ndoing. They said that he was always on time, that he&#39;s happy to be there (not <br/>\nalways true, but he doesn&#39;t let on that he&#39;d rather be somewhere else), that he <br/>\ngoes above & beyond what they expect: he&#39;ll see something that needs to be done <br/>\nand do it rather than walk by and &quot;not see&quot; it. He likes things clean and <br/>\norderly and is happy to make them that way. If he does something wrong, he accepts <br/>\nthe blame (instead of saying, &quot;I didn&#39;t to that&quot;) and asks what he can do to <br/>\ncorrect it: &quot;if you tell me how you want it done, I&#39;ll do it that way.&quot; They <br/>\ncan call him in when others don&#39;t show, and he is the first one they call for <br/>\noptional &quot;extra&quot; hours.<br/>\n<br/>\nHe got his first raise last paycheck. Only .25/hour more, but it was a boost, <br/>\nand he appreciated it. They also gave him his choice of hours now that the <br/>\nschool kids are back in school. He wants 11:30-3or4 Mon-Fri. Done deal.<br/>\n<br/>\nHe asked why he was getting so much attention---they don&#39;t shower all the <br/>\nother kids this way. I told him that they&#39;ve found him to be a trustworthy, <br/>\nhonest, dependable worker with a good work-ethic. That kind of employee is hard to <br/>\nfind. Someone who does *just* a little bit more and doesn&#39;t try to skate by <br/>\nfor a paycheck.<br/>\n<br/>\nWe were almost late yesterday (wound up on the dot, but he was scared of <br/>\nbeing late). I told him not to worry---that Ivan and Gris KNOW he&#39;s dependable and <br/>\nwould never be late if it were remotely avoidable. They wouldn&#39;t fire him for <br/>\na minor transgression with his track record.<br/>\n<br/>\nI&#39;ll forward him your e-mail too---so he can see he&#39;s not the only one! &lt;G&gt;<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] morality question","postDate":"1060281142","msgId":15962,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwNy4yNWJkYWExZi4yYzYzZjUzNkBhb2wuY29tPg=="},"prevInTopic":15961,"nextInTopic":15963,"prevInTime":15961,"nextInTime":15963,"topicId":15943,"numMessagesInTopic":0,"msgSnippet":"I m just back from taking Kirby to work.   Yesterday he overslept and arrived at 12:17 when he was supposed to have been there at 11:30 to open the store at","messageBody":"<div id=\"ygrps-yiv-689278199\">I&#39;m just back from taking Kirby to work.   Yesterday he overslept and arrived <br/>\nat 12:17 when he was supposed to have been there at 11:30 to open the store <br/>\nat noon.   There were others in the back, and when they realized he wasn&#39;t <br/>\nthere, they opened at 12:15.<br/>\n<br/>\nHe was really afraid yesterday he would be fired.  I wasn&#39;t the least bit <br/>\nworried about that.<br/>\n<br/>\nToday on the way he said &quot;I&#39;m the first person who&#39;s ever gone in that late <br/>\nand not been fired on the spot.&quot;<br/>\n<br/>\nIt gave me a good opportunity to discuss something I&#39;ve tried to discuss with <br/>\nhim in the past and he had no way to understand it.   <br/>\n<br/>\nHe&#39;s worked there for three years now, since he turned 14.  That&#39;s the second <br/>\ntime he has overslept in all that time.  He has been too sick twice--once to <br/>\nsick for his own shift, and once too sick to take another person&#39;s shift.  <br/>\nThat&#39;s one absence from illness, in three years.<br/>\n<br/>\nWhen his drawer was short once, he was not suspected at all.  When there were <br/>\nthings missing during his shift no one even began to suspect that he had been <br/>\nirresponsible (or worse, involved in the theft).<br/>\n<br/>\nHe&#39;s seen others be let go for missing cash or items.<br/>\n<br/>\nSo I was able to tell him that people earn points with other people, and <br/>\nthose who don&#39;t believe it and don&#39;t bother are the ones who will be let go for <br/>\none offense.  If people do just barely what&#39;s required of them, they have no <br/>\n&quot;credit&quot; with the other person, but if they do more than necessary (in any way), <br/>\nthey&#39;ll never be fired for one minor failure.<br/>\n<br/>\nAnd so it is with being truthful.<br/>\n<br/>\nI have friends who have lied to me or to others, and so I don&#39;t trust their <br/>\nstories or their promises or their accounts of what happened.  I have friends <br/>\nwho have not only NOT lied that I know of, but when they&#39;ve just been mistaken <br/>\nin a detail about something, they&#39;ll come back later and correct it.   When <br/>\nthose two friends give conflicting accounts of something, I&#39;ll believe the <br/>\nsecond one over the first one.<br/>\n<br/>\nThat&#39;s what integrity is about.<br/>\n<br/>\nAnd yes, six year old are too little to even begin to understand that.  And <br/>\nKirby was seventeen and a week before he had cause to get the concept.<br/>\n<br/>\nBut there ARE ways to communicate a little of that to litte children, in <br/>\nlittle-kid terms, and it&#39;s worth doing.  The story of the boy who cried &#39;wolf&#39; <br/>\nexists for that very purpose.<br/>\n<br/>\nIt IS a morality problem, ultimately.   <br/>\n<br/>\nI have a friend who came to truthfulness in his 30&#39;s.  Before that he was <br/>\nmore attached to his mother&#39;s method and habits, and that was she lied.  She lied <br/>\nto cover herself and she lied to make her children &quot;right.&quot;  If someone had <br/>\ncome and said &quot;Your kid was throwing rocks,&quot; she would have said &quot;No, he was <br/>\nhome&quot; without a glance to left or right, because her need to look good was <br/>\ngreater than her desire for objective truth.   They instructed their children what <br/>\nto lie about and how to lie and when and to whom.<br/>\n<br/>\nAs he got older (and hung around with me, and some other people who honestly <br/>\ndid care what was true and what was not) he changed.  He clung to his old ways <br/>\nfor several years, justifying little lies, justifying saying you weren&#39;t home <br/>\nif you were, but he no longer feels that way and I&#39;ve heard him telling his <br/>\nyounger friends and his children that truth is important.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":109501676,"authorName":"Retta Fontana","from":"Retta Fontana &lt;rettafontana@...&gt;","profile":"rettafontana","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"morality question","postDate":"1060266092","msgId":15961,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwODA3MTQyMTMyLjg3NjkzLnFtYWlsQHdlYjE0MjA4Lm1haWwueWFob28uY29tPg=="},"prevInTopic":15956,"nextInTopic":15962,"prevInTime":15960,"nextInTime":15962,"topicId":15943,"numMessagesInTopic":0,"msgSnippet":"I really don t think this is a morality question. My son around age 2.5, used to run up to any little girl he saw and hit her with a fist in the face.  He had","messageBody":"<div id=\"ygrps-yiv-1300814533\">I really don&#39;t think this is a morality question.  <br/>\n <br/>\nMy son around age 2.5, used to run up to any little girl he saw and hit her with a fist in the face.  He had never been hit or slapped, had never seen it on tv or anywhere to my knowledge.  Every time he did this I was mortified.  This went on for about six months.  Today he&#39;s 15 and won&#39;t even kill spiders &quot;because they&#39;re defenseless.&quot;  So his acts of aggression said nothing about his character.  It must have been something he saw somewhere and he needed to work out.  I talked to him over and over about it, but his understanding wasn&#39;t there.  They aren&#39;t capable of empathy or intellectual thought until much later.  In &quot;The Magical Child&quot; they explain that learning only takes place through action in youngsters.  In that situation the only thing I could do was keep my eyes open and jump in before he made contact.<br/>\n <br/>\nI think if he were going through what you describe at 6.5 yrs, I would invite him to make up the most fantasic story he could and I&#39;d type it up on the computer, put it together with pictures, embelish it as much as possible and bind it to make a book.  I would encourage his magical thinking in a conspiratorial way.  For instance, the pool incident?  I&#39;d say, ooooh!  You&#39;re feeling creative again!  Is it time to write another story?<br/>\n <br/>\nIf we resist a behavior, they will continue it.  One thing the Waldorf philosophy espouses is to meet the child where they&#39;re at.  This situation is really no different, other than the comfort level of the mother!!  I know I&#39;d be pretty stressed about it.  I&#39;d constantly have to remind myself of the child&#39;s basic goodness, that he just doesn&#39;t understand the norms.<br/>\n <br/>\nDo let us know how you make out.<br/>\n <br/>\nFondly,<br/>\n <br/>\nRetta<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nYahoo! SiteBuilder - Free, easy-to-use web site design software<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2294225,"authorName":"freeform@juno.com","from":"freeform@...","profile":"freeform_ca","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] morality question","postDate":"1060205982","msgId":15956,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwODA2LjE0NDAzOC4xNjMxNS4xMDk3MTU5QHdlYm1haWwwMi5sYXgudW50ZC5jb20+"},"prevInTopic":15955,"nextInTopic":15961,"prevInTime":15955,"nextInTime":15957,"topicId":15943,"numMessagesInTopic":0,"msgSnippet":"... I agree that it s pretty typical 6 stuff. Also, I ve told Rain that whenever she s in a situation where they offer a prize like that, just let me know","messageBody":"<div id=\"ygrps-yiv-1672452309\">--- <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:maryfhickman@...\">maryfhickman@...</a> wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;Yesterday at swim practice, the kids who could swim under the lanes without coming up for air were rewarded with a candy bar. Riley told me he gets a candy bar, but then told me he really did not swim the whole length of the pool.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I agree that it&#39;s pretty typical 6 stuff. Also, I&#39;ve told Rain that whenever she&#39;s in a situation where they offer a prize like that, just let me know afterwards and I&#39;ll buy her whatever the prize was. And if she&#39;d like to share that knowledge with the instructors, that&#39;s fine with me. It came up at a theater workshop she was doing in Woodland this summer, where they were offering prizes to the kids who decorated their folders &quot;best&quot;. :-P<br/>\n<br/>\nDar</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] morality question","postDate":"1060205371","msgId":15955,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzOS4yMzdmZDRiNi4yYzYyY2QzYkBhb2wuY29tPg=="},"prevInTopic":15954,"nextInTopic":15956,"prevInTime":15954,"nextInTime":15956,"topicId":15943,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/6/03 2:59:13 PM, gehrkes@yahoo.com writes: ","messageBody":"<div id=\"ygrps-yiv-2134053569\">In a message dated 8/6/03 2:59:13 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:gehrkes@...\">gehrkes@...</a> writes:<br/>\n<br/>\n&lt;&lt; When I was a child I was the queen of story telling.<br/>\nThe bigger the better and now I am sometimes more<br/>\nhonest than I should be for my own protection.  &gt;&gt;<br/>\n<br/>\nIf you have a story like that, of Kathleen&#39;s, maybe you could tell it in kid <br/>\nterms.<br/>\n<br/>\nMarty was my fantasy-spinning kid, and a few times I had a serious <br/>\nconversation with him about it, in private, and as kindly as I could.<br/>\n<br/>\nI remember once telling him that it was okay to be full of those stories and <br/>\nideas but that it was really important that he was clear with others about <br/>\nwhat TRULY happened and what he thinks would be cool.  That if he says &quot;Wouldn&#39;t <br/>\nit be fun if...&quot; he&#39;ll be telling the truth, but if he starts with &quot;One time <br/>\nI...&quot; then it becomes a lie.<br/>\n<br/>\nWhat I&#39;ve told my kids about lying is that some people do it a little and <br/>\nsome people do it a lot, and it&#39;s important to try to do it not at all, because <br/>\nthe people they most like and respect will not want to be friends with them and <br/>\nwon&#39;t trust them if they can&#39;t rely on them to say what is true.  And I&#39;ve <br/>\nsaid too that I want to ALWAYS believe what they say, so it&#39;s important to their <br/>\nrelationship with me, and to their self image and self knowledge, that <br/>\nthey&#39;re careful to separate wish from reality.<br/>\n<br/>\nI&#39;ve used odds and turd-in-the-lemonade analogies to help them see that if a <br/>\nperson lies just ten percent of the time, the other 90 percent isn&#39;t worth <br/>\nmuch, because each statement is likely to be a lie.  With odds that, it&#39;s a GOOD <br/>\nbet, and when it&#39;s a good bet someone is lying, soon people won&#39;t even have an <br/>\ninterest in talking to him.  If there&#39;s a turd in the lemonade, where do you <br/>\nwant to stick the dipper so that you get clean lemonade?<br/>\n<br/>\nIf you say &quot;don&#39;t lie because it&#39;s wrong&quot; that means little to a child, but <br/>\nif you say something directly about his relationships right now, today, with <br/>\nhis family and friends, that will be more helpful, I think.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":140885507,"authorName":"Kathleen and David Gehrke","from":"Kathleen and David Gehrke &lt;gehrkes@...&gt;","profile":"gehrkes","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] morality question","postDate":"1060203380","msgId":15954,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwODA2MjA1NjIwLjI4MDQ2LnFtYWlsQHdlYjIxMzA4Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDc5MDYyMzIuMTA2MDE4MjI5ODYxNS5KYXZhTWFpbC5ub2JvZHlAZm96emllLnBzcC5wYXMuZWFydGhsaW5rLm5ldD4="},"prevInTopic":15943,"nextInTopic":15955,"prevInTime":15953,"nextInTime":15955,"topicId":15943,"numMessagesInTopic":0,"msgSnippet":"Hi Mary, I think sometimes the world of a six and a half year old has pretend very close to reality. I know sometimes my plans are very unconventional but my","messageBody":"<div id=\"ygrps-yiv-1084574984\">Hi Mary,<br/>\nI think sometimes the world of a six and a half year<br/>\nold has pretend very close to reality. I know<br/>\nsometimes my plans are very unconventional but my idea<br/>\nis play it through.Like go with it,&quot; it would be soo<br/>\ncool if dad was a pro baseball player,. Lets<br/>\npretend.....&quot; Taking things that do not belong is just<br/>\nrepetition and returning and reminding compassion.<br/>\nWith all eight of mine we have returned items,<br/>\nespecially around that age. And then discussed how we<br/>\nfeel is someone takes our stuff.. Yuck. <br/>\nWhen I was a child I was the queen of story telling.<br/>\nThe bigger the better and now I am sometimes more<br/>\nhonest than I should be for my own protection. Maybe<br/>\nhis imagination is in overdrive.. not such a bad<br/>\nthing.. Try feeding that creativity for pretend in<br/>\nother ways..<br/>\nIf none of this fits.. disregard it and good luck/<br/>\nKathleen  <br/>\n--- <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:maryfhickman@...\">maryfhickman@...</a> wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Hi all,<br/>\n&gt; <br/>\n&gt; My 6.5 year old son enjoys telling fibs, like my dad<br/>\n&gt; is a pro baseball player, which Tim is not. He also<br/>\n&gt; loves stealing things from his sister, like her<br/>\n&gt; trophies or special cards.He had taken gum from the<br/>\n&gt; stores and money from tip jars, pens from the art<br/>\n&gt; center. Yesterday at swim practice, the kids who<br/>\n&gt; could swim under the lanes without coming up for air<br/>\n&gt; were rewarded with a candy bar. Riley told me he<br/>\n&gt; gets a candy bar, but then told me he really did not<br/>\n&gt; swim the whole length of the pool. So, I&#39;m thinking<br/>\n&gt; I need to help him be honest. Winning for Riley is<br/>\n&gt; very important. I could induce a major meltdown<br/>\n&gt; pushing this issue. I for one am not into rewards<br/>\n&gt; such as this and would give all the kids candy for<br/>\n&gt; doing their own best. So, any opinions out there how<br/>\n&gt; to help guide Riley to speak honestly.<br/>\n&gt; <br/>\n&gt; Mary H.<br/>\n&gt; <br/>\n&gt; And I will be coordinating the children&#39;s playroom<br/>\n&gt; at the Home=Ed conference in Sac. next weekend. So<br/>\n&gt; there I will be playing on the floor with all the<br/>\n&gt; little ones.<br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>__________________________________<br/>\nDo you Yahoo!?<br/>\nYahoo! SiteBuilder - Free, easy-to-use web site design software<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sitebuilder.yahoo.com\">http://sitebuilder.yahoo.com</a></div>","specialLinks":[]},{"userId":117956499,"authorName":"maryfhickman@jps.net","from":"maryfhickman@...","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"morality question","postDate":"1060182296","msgId":15943,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5MDYyMzIuMTA2MDE4MjI5ODYxNS5KYXZhTWFpbC5ub2JvZHlAZm96emllLnBzcC5wYXMuZWFydGhsaW5rLm5ldD4="},"prevInTopic":0,"nextInTopic":15954,"prevInTime":15942,"nextInTime":15944,"topicId":15943,"numMessagesInTopic":0,"msgSnippet":"Hi all, My 6.5 year old son enjoys telling fibs, like my dad is a pro baseball player, which Tim is not. He also loves stealing things from his sister, like","messageBody":"<div id=\"ygrps-yiv-1199496209\">Hi all,<br/>\n<br/>\nMy 6.5 year old son enjoys telling fibs, like my dad is a pro baseball player, which Tim is not. He also loves stealing things from his sister, like her trophies or special cards.He had taken gum from the stores and money from tip jars, pens from the art center. Yesterday at swim practice, the kids who could swim under the lanes without coming up for air were rewarded with a candy bar. Riley told me he gets a candy bar, but then told me he really did not swim the whole length of the pool. So, I&#39;m thinking I need to help him be honest. Winning for Riley is very important. I could induce a major meltdown pushing this issue. I for one am not into rewards such as this and would give all the kids candy for doing their own best. So, any opinions out there how to help guide Riley to speak honestly.<br/>\n<br/>\nMary H.<br/>\n<br/>\nAnd I will be coordinating the children&#39;s playroom at the Home=Ed conference in Sac. next weekend. So there I will be playing on the floor with all the little ones.</div>","specialLinks":[]}],"prevTopicId":15968,"nextTopicId":15941}}