{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":31,"messages":[{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: The Case Against Spanking also Should We Interfere?","postDate":"1297361580","msgId":59638,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGk9SHhzWEItUHQ0WEErNVhSNSt2ZVZYc3hXOW1GSjRmVy1rLXNhZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGlqMTM5NitudWplQGVHcm91cHMuY29tPg==","referencesHeader":"PDFDRTBCM0JELTk2MzEtNEYzNi1BMUE4LUE5MDFDMzE1OEYwM0BTYW5kcmFkb2RkLmNvbT4JPGlqMTM5NitudWplQGVHcm91cHMuY29tPg=="},"prevInTopic":59637,"nextInTopic":59642,"prevInTime":59637,"nextInTime":59639,"topicId":59601,"numMessagesInTopic":0,"msgSnippet":"... her kids and they said yes, but it s getting worse lately.  In the end, I decided that if the moms who knew her and welcomed her weren t going to say ","messageBody":"<div id=\"ygrps-yiv-928449657\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;Later I asked some of the other moms if she was always that rough with<br/>\n </span></blockquote>her kids and they said &quot;yes, but it&#39;s getting worse lately.&quot;  In the end, I<br/>\ndecided that if the moms who knew her and welcomed her weren&#39;t going to say<br/>\nanything, and they were willing to tolerate that sort of behavior by the<br/>\nmom, we just weren&#39;t going to go anymore.  We have much better things to do<br/>\nwith our time than to be shocked and stressed by someone who is so<br/>\nunpleasant.&lt;&lt;&lt;<br/>\n<br/>\nSame here Kristi. We&#39;ve seen some parents like that but only joined one<br/>\nplaygroup like that (of course we haven&#39;t joined a lot of those because it&#39;s<br/>\njust easier at toddler ages to go to the park whenever instead of at preset<br/>\ntimes). Went once time to the yucky playgroup with 2 problem parents, and<br/>\neasily opted right back out. Karl and I have had much fun by ourselves or<br/>\nplaying with whoever happens to show up that Karl finds fun. We have a<br/>\ncouple favorite parks that tend to have a lot of kids, especially on<br/>\nweekends.<br/>\n<br/>\nWe don&#39;t stick with playgroups necessarily.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":240358028,"authorName":"kristi_beguin","from":"&quot;kristi_beguin&quot; &lt;foehn_jye@...&gt;","profile":"kristi_beguin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: The Case Against Spanking also Should We Interfere?","postDate":"1297354854","msgId":59637,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqMTM5NitudWplQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFDRTBCM0JELTk2MzEtNEYzNi1BMUE4LUE5MDFDMzE1OEYwM0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":59636,"nextInTopic":59638,"prevInTime":59636,"nextInTime":59638,"topicId":59601,"numMessagesInTopic":0,"msgSnippet":"... When my youngest was 3 and 4 we went to a Mommy and Me gymnastics class each week.  There were 2 sets of parents there who bothered the be-jeeberz out of","messageBody":"<div id=\"ygrps-yiv-1512382092\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;When we were at McDonald&#39;s or some other public place and another parent was just kind of irritating, I would be extra sweet to my kids.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>When my youngest was 3 and 4 we went to a Mommy and Me gymnastics class each week.  There were 2 sets of parents there who bothered the be-jeeberz out of me.  Each of them had 2/3 year olds who had a lot of energy, were in daycare all day long, and then the parents would pick the child up from daycare and come to gymnastics class.  Each of these parents spent the entire class trying to calm their kids down enough to &quot;pay attention,&quot; &quot;listen to the teacher,&quot; &quot;come back over here and do what you&#39;re supposed to do,&quot; &quot;quit running around,&quot; etc. <br/>\n<br/>\nI felt so sad for these kids who hadn&#39;t seen their Mommies or Daddies all day, and who then were brought to this awesome gym with all kinds of fun equipment and stuff to do, and yet they were being reprimanded the whole time.  If they didn&#39;t want to do something, the Moms or Dads would force them by actually picking them up and taking them to the beam, or wrapping their little hands around the bar, etc.  <br/>\n<br/>\nI figured, since I wasn&#39;t the instructor, it wasn&#39;t my place to say anything to these parents, so I was super, extra attentive and sweet to my dd.  If she didn&#39;t want to do something, I would tell the instructor, &quot;she just wants to sit this one out,&quot; and I would hold her and rub her back and just be sweet.  Invariably she would jump up and run to do the activity.  When these other little ones were forced into an activity, it always ended in tears, frustration, and threats.  Sometimes, if the parent looked too stressed out, I would comment, &quot;it&#39;s just for fun...it&#39;s an introduction to all this fun equipment!&quot;  in a happy and engaging way, and they often relaxed at that reminder.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;I put the most energy into my own family, and extra energy into making information available to others, but not people who didn&#39;t want to know.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I had to grapple with the concept of intervening after meeting a really aggressive, unpleasant mom at a playgroup recently.  In the course of an hour she had spanked her 2-yr old over 4 times, and yelled at her numerous times for climbing on things and getting herself into a situation where she couldn&#39;t get down.  I was the newbie at the playgroup, which had been meeting for over 2 years.  My kids were obviously shocked by the mom, so, again, I just held them, hugged them, kissed them, and was gentle and sweet to them while we were there.  The mom would yell at her kid for climbing on a play structure, but refused to get up and help her little one down. In an effort to save the girl a spanking, I helped her to get down, and spotted her for a while.<br/>\n<br/>\nLater I asked some of the other moms if she was always that rough with her kids and they said &quot;yes, but it&#39;s getting worse lately.&quot;  In the end, I decided that if the moms who knew her and welcomed her weren&#39;t going to say anything, and they were willing to tolerate that sort of behavior by the mom, we just weren&#39;t going to go anymore.  We have much better things to do with our time than to be shocked and stressed by someone who is so unpleasant.</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: The Case Against Spanking also Should We Interfere?","postDate":"1297352694","msgId":59636,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqMTE1bStnYWh1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlpdjFpYytlNzdhQGVHcm91cHMuY29tPg=="},"prevInTopic":59635,"nextInTopic":59637,"prevInTime":59635,"nextInTime":59637,"topicId":59601,"numMessagesInTopic":0,"msgSnippet":"... ************* Rather than intervene -vs- not it could help to think of ways to offer more kindness and compassion - and at best help another parent be","messageBody":"<div id=\"ygrps-yiv-986010436\">&quot;JustSayin&quot; &lt;mfcappella@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I am still going to work on this, maybe not with my little cards, but maybe try to figure out how to use a softer approach as some have mentioned.  <br/>\n&gt; <br/>\n&gt; I have been one who does not intervene, but I find I don&#39;t like myself much for it.<br/>\n </span></blockquote>*************<br/>\n<br/>\nRather than intervene -vs- not it could help to think of ways to offer more kindness and compassion - and at best help another parent be calmer, maybe see that there are other options. Most people who spank don&#39;t have a lot of tools! So saying &quot;don&#39;t spank&quot; is less than helpful. Robin&#39;s description of what Sandra did - offering compassion and insight - that&#39;s something different. I&#39;ve done things like that without thinking of it in terms of intervention - made suggestions to other parents, offered to play with a child or help in some other way, suggested a book on parenting or made a comment about child development. The other day I was talking with a grandma about potty-training and reassuring her that its perfectly normal for a 2yo boy not to be ready to use a potty independently. She seemed reassured, if only for the moment, and I think that&#39;s a good thing. <br/>\n<br/>\nIt can also be helpful to comment about the fact that parenting involves learning a set of skills. Many people don&#39;t realize that - they think its all instinctive (and some of that is tied in with old sexist ideas - a good mother isn&#39;t smart she has a big womb...er, heart). Knowing that parenting skills are things to be learned can help people question ideas about what it means to be a &quot;good&quot; parent - its something to work toward rather than throw up one&#39;s hands and say &quot;oh well, did my best, I guess I just don&#39;t have it&quot;. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":472480490,"authorName":"sheeboo2","from":"&quot;sheeboo2&quot; &lt;brmino@...&gt;","profile":"sheeboo2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: The Case Against Spanking also Should We Interfere?","postDate":"1297349355","msgId":59635,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqMHR0YitsZmg0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlqMGxjZyticTVoQGVHcm91cHMuY29tPg=="},"prevInTopic":59633,"nextInTopic":59636,"prevInTime":59634,"nextInTime":59636,"topicId":59601,"numMessagesInTopic":0,"msgSnippet":"... And bubbles!  You can get tiny (sealed) containers of bubbles, for weddings, at lots of craft stores. They re wonderful in store lines, airports,","messageBody":"<div id=\"ygrps-yiv-1096589170\">----Carry balloons.------<br/>\n<br/>\nAnd bubbles!  You can get tiny (sealed) containers of bubbles, for weddings, at lots of craft stores. They&#39;re wonderful in store lines, airports, airplanes.....<br/>\n<br/>\nBrie</div>","specialLinks":[]},{"userId":246186758,"authorName":"Sarah","from":"&quot;Sarah&quot; &lt;yahoo@...&gt;","profile":"sarahlexis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: The Case Against Spanking also Should We Interfere?","postDate":"1297340624","msgId":59633,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqMGxjZyticTVoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQzMDkyLjMwODUxLnFtQHdlYjg2MjA1Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":59632,"nextInTopic":59635,"prevInTime":59632,"nextInTime":59634,"topicId":59601,"numMessagesInTopic":0,"msgSnippet":"Carry balloons. I ve always got a couple in my bags, ever since one trip to the supermarket. We were waiting for my husband and a guy who was redoing a display","messageBody":"<div id=\"ygrps-yiv-1028832722\">Carry balloons. I&#39;ve always got a couple in my bags, ever since one trip to the supermarket. <br/>\n<br/>\nWe were waiting for my husband and a guy who was redoing a display asked me if Jack and Charlie wanted some balloons. We said yes please and he went off for a while bringing back about eight slightly saggy helium balloons from the old display.<br/>\n<br/>\nIt seemed to be a bad day for kids that day at the supermarket, lots of sadness, and there was this dad with young twin boys, maybe about two years old. He was looking really stressed and they were screaming. We kept passing him and eventually my husband said to Jack &#39;shall we see if they&#39;d like a balloon?&#39;. Jack thought that was a good idea and went with me to offer. We said it quietly to the dad because we didn&#39;t want to make things worse, by offering and then taking them away if he said no. He said yes and they were delighted. We saw them laughing and playing with the balloons round the shop after that.<br/>\n<br/>\nEncouraged by this, Jack wanted to offer another to a little girl who was crying to be bought ice-cream, but her mum said &#39;no&#39;. Jack was a bit sad about that, he couldn&#39;t understand why. I think she was making a point about the ice-cream and didn&#39;t want the girl distracted from it.<br/>\n<br/>\nAnyway, a couple of balloons are almost as small as cards, and much more likely to diffuse a difficult situation.<br/>\n<br/>\nSarah<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Schuyler &lt;s.waynforth@...&gt; wrote:<br/>\nRather than cards carry a bunch of toys in your bag to use to brighten up a moment when folks need a break. </span></blockquote></div>","specialLinks":[]},{"userId":67727291,"authorName":"wtexans","from":"&quot;wtexans&quot; &lt;wtexans@...&gt;","profile":"wtexans","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: The Case Against Spanking also Should We Interfere?","postDate":"1297340454","msgId":59631,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqMGw3NitpZ2poQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQzMDkyLjMwODUxLnFtQHdlYjg2MjA1Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":59630,"nextInTopic":59632,"prevInTime":59630,"nextInTime":59632,"topicId":59601,"numMessagesInTopic":0,"msgSnippet":"===Rather than cards carry a bunch of toys in your bag to use to brighten up a moment when folks need a break.=== I normally prefer to carry only a wallet or a","messageBody":"<div id=\"ygrps-yiv-1690266513\">===Rather than cards carry a bunch of toys in your bag to use to brighten up a moment when folks need a break.===<br/>\n<br/>\nI normally prefer to carry only a wallet or a small purse with just enough room for my wallet and keys. But a couple months ago I upgraded to a bigger purse, one that has room for my wallet and keys but also for little inexpensive toys that I can loan to kids who are getting antsy out in public and whose parents or caregivers would prefer to say &quot;sit still and be quiet&quot; than to engage the child, or for diffusing the tension right before or right after a parent&#39;s about to gripe out their child in public. <br/>\n<br/>\nI have a little sketchpad kit I made that has a mini sketchpad + mini colored pencils, and I&#39;ve already put that to use on several occasions -- it brought a smile to my face to be able to share that with bored kids, and it brought thanks (and sometimes smiles) from the adults they were with.<br/>\n<br/>\nI have some loose change in my bag. That&#39;s good for putting on a tabletop or countertop and flicking, to start the coins spinning.<br/>\n<br/>\nI have a little mirror. That&#39;s good for making faces into.<br/>\n<br/>\nI&#39;d like to pick up a few more inexpensive, lightweight toys to keep in there. I think Sandra had mentioned last year Holly dug around in her purse and found a little magnifying glass that she let a little boy play with in the post office line. Little toys like that are what I&#39;m on the lookout for. <br/>\n<br/>\nWith the exception of the sketchbook kit (it&#39;s something I sewed up, that has a slot for the sketchpad and slots for the colored pencils, and has personal meaning for me), everything else are things that I don&#39;t mind giving away if it seems returning the item back to me will result in tears on the part of the child I&#39;ve loaned something to.<br/>\n<br/>\nOh, I also keep gum in my purse. It&#39;s good for sharing, if the child&#39;s parent doesn&#39;t mind, but it&#39;s also great for blowing BIG bubbles, and blowing them bigger and bigger and bigger until they pop. Kids seem to think it&#39;s a really funny thing for an adult to blow a gum bubble so big that when it pops it covers up most of their face [g]. <br/>\n<br/>\nI don&#39;t like confronting angry adults. I&#39;ve done it before, but I&#39;m usually not calm either by that point, so it&#39;s not a calming interaction if I get involved. I would love to be able to calmly confront someone, but until I&#39;m able to do so my &quot;bag of tricks&quot; is how I attempt to diffuse situations that are quickly approaching derailment or which are on the backside of derailment (the parents are done yelling at their kids and their kids are sad). <br/>\n<br/>\nGlenda</div>","specialLinks":[]},{"userId":177967425,"authorName":"teresa","from":"&quot;teresa&quot; &lt;treesock@...&gt;","profile":"treesock","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: The Case Against Spanking also Should We Interfere?","postDate":"1297337466","msgId":59632,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqMGk5cStqbTgxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFDRTBCM0JELTk2MzEtNEYzNi1BMUE4LUE5MDFDMzE1OEYwM0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":59631,"nextInTopic":59633,"prevInTime":59631,"nextInTime":59633,"topicId":59601,"numMessagesInTopic":0,"msgSnippet":"So, do y all frame these situations for your own kids after the fact, if they seem affected by it? Do you bring it up casually? Wait for your kids to bring it","messageBody":"<div id=\"ygrps-yiv-1918722775\">So, do y&#39;all frame these situations for your own kids after the fact, if they seem affected by it? Do you bring it up casually? Wait for your kids to bring it up? <br/>\n<br/>\nWhen we saw one mom being particularly grabby and snappy with her daughter a few weeks ago, my 5 year old got very still and watchful. Afterward, I said something to him. (I forget exactly what, but probably something generic, along the lines of, &quot;that mom seemed pretty angry.&quot;) Anyway, no conversation followed that, but I was trying to open the door.  <br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; -=-So a question I have, and maybe it&#39;s not for this group (and that&#39;s OK), but as parents that tend (or try) to respect their kids, do we have any obligation to try to &quot;enlighten&quot; other parents?-=-<br/>\n&gt; <br/>\n&gt; No.<br/>\n&gt; <br/>\n&gt; No more than you appreciate missionaries coming to the door and trying to enlighten you about salvation, or beggars coming and trying to lighten your wallet.<br/>\n&gt; <br/>\n&gt; -=-He almost looked like he was doing this because he thought he should, rather than any real innate meanness. I know that sounds weird, but that&#39;s what it s-=-<br/>\n&gt; <br/>\n&gt; Probably most people are strict with their kids because of that they think other parents (present or imagined) would think about them or their kids.<br/>\n&gt; <br/>\n&gt; -=-Maybe I need to carry a little stack of business cards that say &quot;It&#39;s ok to be nice to your kid&quot; and some &quot;easy reading&quot; web addresses about peaceful parenting. Just thought of that....not a bad idea..-=-<br/>\n&gt; <br/>\n&gt; Not a great idea, though.<br/>\n&gt; <br/>\n&gt; When we were at McDonald&#39;s or some other public place and another parent was just kind of irritating, I would be extra sweet to my kids.  Sometimes extra sweet involved playing with them, or taking them to another part of the building or playground for a little while.   Sometimes we left to do something else.<br/>\n&gt; <br/>\n&gt; Being nice to our own children makes the world better (if our kids aren&#39;t going crazy and making the world worse).  When people are unschooling peacefully and their kids are happy and reasonably polite in public, then they&#39;re setting a good example for other families.  But to the original question, whether we have an obligation to &quot;enlighten&quot; other parents, no.  We&#39;re going against the prevailing culture.  I put the most energy into my own family, and extra energy into making information available to others, but not people who didn&#39;t want to know.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: The Case Against Spanking also Should We Interfere?","postDate":"1297330425","msgId":59630,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzMDkyLjMwODUxLnFtQHdlYjg2MjA1Lm1haWwuaXJkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGlpdjFpYytlNzdhQGVHcm91cHMuY29tPg==","referencesHeader":"PGlpdjFpYytlNzdhQGVHcm91cHMuY29tPg=="},"prevInTopic":59629,"nextInTopic":59631,"prevInTime":59629,"nextInTime":59631,"topicId":59601,"numMessagesInTopic":0,"msgSnippet":"I have a monster purse created by Dagny Kream that moved a child from unhappiness to engaged long enough for his mom to breathe and let go of her tension. And","messageBody":"<div id=\"ygrps-yiv-1800743109\">I have a monster purse created by Dagny Kream that moved a child from <br/>\nunhappiness to engaged long enough for his mom to breathe and let go of her <br/>\ntension. And I have Ronnie Maier pull lots of different engaging little toys out <br/>\nof her bag that work better than anything to get a moment beyond tense. Rather <br/>\nthan cards carry a bunch of toys in your bag to use to brighten up a moment when <br/>\nfolks need a break. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n-------------<br/>\nI am still going to work on this, maybe not with my little cards, but maybe try <br/>\nto figure out how to use a softer approach as some have mentioned.  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":430148316,"authorName":"whatismyusername@ymail.com","from":"&quot;whatismyusername@...&quot; &lt;whatismyusername@...&gt;","profile":"whatismyusername@ymail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: The Case Against Spanking also Should We Interfere?","postDate":"1297320147","msgId":59629,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqMDFjaisxam91QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlpdWZqZCtiNDNxQGVHcm91cHMuY29tPg=="},"prevInTopic":59628,"nextInTopic":59630,"prevInTime":59628,"nextInTime":59630,"topicId":59601,"numMessagesInTopic":0,"msgSnippet":"just want to add my gratitude to Sandra. When I mentioned my spanking my children was not real spanking, because it didn t hurt. Sandra cut me off right away,","messageBody":"<div id=\"ygrps-yiv-1751762261\">just want to add my gratitude to Sandra.<br/>\n<br/>\nWhen I mentioned my spanking my children was not real spanking, because it didn&#39;t hurt. Sandra cut me off right away, spanking is spanking! You should never do that. I was shocked by her directness.<br/>\n<br/>\nI continued spanking practice after the conversation, because I couldn&#39;t control myself when things happened fast. I also didn&#39;t feel it was a big deal.<br/>\n<br/>\nNow I know what I know. I am no longer able to spank. It is so shameful for me even to think about what I did. Actually the other day, my ds5 said I should spank little sister who is 2, because she didn&#39;t listen. I looked into my ds5&#39;s eyes and I said, I apologize for spanking you before. I was wrong. Now I will not spank and we don&#39;t allow anyone in the family to hit each other either. <br/>\n<br/>\nHe was a little bit surprised. The way he treats his little sister is a mirror image of how I interacted with him before. <br/>\n<br/>\nI am really grateful for Sandra&#39;s directness and guidance.<br/>\n<br/>\nNo more spanking<br/>\n<br/>\nJoy</div>","specialLinks":[]},{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: The Case Against Spanking also Should We Interfere?","postDate":"1297319872","msgId":59628,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDRDk3MDQyRDAzQzY0Ri1GODAtRDNBQ0B3ZWJtYWlsLW0wOTguc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PGlpdjFpYytlNzdhQGVHcm91cHMuY29tPg==","referencesHeader":"PGlpdjFpYytlNzdhQGVHcm91cHMuY29tPg=="},"prevInTopic":59622,"nextInTopic":59629,"prevInTime":59627,"nextInTime":59629,"topicId":59601,"numMessagesInTopic":0,"msgSnippet":"... to figure out how to use a softer approach as some have mentioned. ","messageBody":"<div id=\"ygrps-yiv-1931805567\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;I am still going to work on this, maybe not with my little cards, but maybe try <br/>\n </span></blockquote>to figure out how to use a softer approach as some have mentioned. &lt;&lt;&lt;&lt;&lt; <br/>\n<br/>\n<br/>\n<br/>\n-=-=-=-=-=-=-=-=-<br/>\n<br/>\n<br/>\nI sell a bumper sticker you might be interested in:<br/>\n<br/>\n<br/>\nWORLD PEACE BEGINS AT HOME<br/>\n    BE NICER TO YOUR KIDS<br/>\n<br/>\n<br/>\nI get a lot of smiles for that one.<br/>\n<br/>\n<br/>\n ~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\n&quot;There is no single effort more radical in its potential for saving the world than a transformation of the way we raise our children.&quot; Marianne Williamson<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: The Case Against Spanking also Should We Interfere?","postDate":"1297308474","msgId":59622,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGk9NGZVVWVFNFYzTHZzM3g3RVFNRUV2c2pvenUzOFl4SjJfeThfNUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGlpdXM5MCsxMDNlYUBlR3JvdXBzLmNvbT4=","referencesHeader":"PDI5MDMzNTA4LjEyOTcyNzk5NDcwMjQuSmF2YU1haWwucm9vdEB3YW11aS1qdW5lLmF0bC5zYS5lYXJ0aGxpbmsubmV0Pgk8aWl1czkwKzEwM2VhQGVHcm91cHMuY29tPg=="},"prevInTopic":59620,"nextInTopic":59628,"prevInTime":59621,"nextInTime":59623,"topicId":59601,"numMessagesInTopic":0,"msgSnippet":"Lots of people are so far from no-spank ideas and words being of a positive good to them. As to belittling or shaming the parents who are rough on their","messageBody":"<div id=\"ygrps-yiv-386593879\">Lots of people are so far from no-spank ideas and words being of a positive<br/>\ngood to them.<br/>\n<br/>\nAs to belittling or shaming the parents who are rough on their kids--- that<br/>\nis something they do all by themselves. That&#39;s why it&#39;s so iffy to intervene<br/>\nif you are unprepared for the diverse reactions you might get from your<br/>\nintervention. Don&#39;t go in blind.<br/>\n<br/>\nPeople who are in the throes of &quot;interacting&quot; angrily with a child are in<br/>\ndefense mode: and sometimes it&#39;s not because of the child but someone else<br/>\nand the child is a convenient target for some other rage. In their minds<br/>\nit&#39;s defense mode, nonetheless. Some are more aware than others of the fact<br/>\nthat they&#39;re scary. Some don&#39;t care or are perfectly calm about scaring<br/>\ntheir child and any others in the vicinity. With those who aren&#39;t aware that<br/>\nthey are scary, it&#39;s behavior they aren&#39;t seeing very clearly, if they&#39;re<br/>\nseeing it at all.<br/>\n<br/>\nSpeaking of going in blindly, adrenaline provides an instant set of<br/>\nblinders, and people being rough are in the midst of an adrenaline rush,<br/>\nwhere thinking is close to nil. This can happen to someone who intervenes<br/>\ntoo. Heightened adrenaline can cut short their perceptiveness as well as<br/>\ntheir effectiveness.<br/>\n<br/>\nSometimes I distract people with some off-topic comment, just to lighten<br/>\nthings up. Unless they&#39;re too livid. I don&#39;t always hear what&#39;s going on<br/>\naround me well enough to pull off a good distraction. And eye-contact or<br/>\nlack thereof as well as my own body language is not so easy for me to pull<br/>\noff either.<br/>\n<br/>\nI do way better when I know the people involved.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":287815876,"authorName":"dezignarob","from":"&quot;dezignarob&quot; &lt;dezigna@...&gt;","profile":"dezignarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: The Case Against Spanking also Should We Interfere?","postDate":"1297291139","msgId":59620,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlpdjUyMytxaWp1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDMyODg1RDJBLUE1MUQtNEFDMy1CNTlGLTc3OUM1Q0UzOEI3NEBjb21jYXN0Lm5ldD4="},"prevInTopic":59619,"nextInTopic":59622,"prevInTime":59619,"nextInTime":59621,"topicId":59601,"numMessagesInTopic":0,"msgSnippet":"I really like that story. It s ironic in a way that talking like that actually takes the frustrated mom s attention off what the child is doing right this","messageBody":"<div id=\"ygrps-yiv-366647375\">I really like that story. It&#39;s ironic in a way that talking like that actually takes the frustrated mom&#39;s attention off what the child is doing right this second, and allows her to have a moment of someone else&#39;s attention on her.<br/>\n<br/>\nI see a lot of fed up kids and frustrated moms in Michaels. Typically the kids and parents are either coming in together to get supplies for school projects - and there is quite a lot of anxiety around it, or the mom is there on what she evidently hopes will be a leisurely shopping trip and her little one gets antsy. <br/>\n<br/>\nI carry a hand puppet in my apron pocket and have used it many times to break up a crying/angry situation by interacting with the kid. Peek-a-boo works well. The parents are grateful. Sometimes I grab one of our really inexpensive soft toys (like $1) and ask if the toddler would like to borrow my bear for a little while. <br/>\n<br/>\nAlso I will talk to the mom about how Michaels really isn&#39;t much fun for little kids a lot of the time. Bright lights, too much color, too much stuff they can&#39;t really have, too many people, loud music and noise. It&#39;s not really a kids&#39; store despite having some kids&#39; products. Sometimes I just say, &quot;Oh no. Michaels is a happy place.&quot; <br/>\n<br/>\nSometimes there are stern parents who say &quot;Don&#39;t touch anything&quot; and want them to stand still. I usually say something about all the tempting stuff, and definitely try to help them find all they need as quickly as possible. Sometimes, if it seems like it might help, I will mention that there are some toy items (so cheap that we pretty much expect a certain level of damage) that the kids are welcome to play with while they shop, but sometimes I think the parents are trying to teach obedience, and mentioning the toys can be counterproductive because the parents just look like even worse villains to the kids. <br/>\n<br/>\nOnce some boys were so bored they were using rolled up posters as swords. Their parents were invisible. I called out &quot;Hey! Dudes, we have foam swords&quot; then went and took the posters from them. One was scared and ran off alarmed, but the other guy seemed really surprised, and grateful when I offered to show them to him.<br/>\n <br/>\nOnce when the store seemed just crazy full of cranky parents and ansty kids, I went to the manager and said, &quot;Let&#39;s do a make and take. There are too many bored kids here.&quot; He agreed, and I set up the table and some little holiday foamy thing craft - and so there was something for many of the kids to do while the parents shopped.<br/>\n<br/>\nThere&#39;s never been anyone actually trying to spank their kid in my presence. At the risk of my job, I hope I would step in, and I would use the authority of &quot;this is My Workplace and we don&#39;t have violence here&quot; as the start.<br/>\n<br/>\nRobyn L. Coburn</div>","specialLinks":[]},{"userId":283530155,"authorName":"JustSayin","from":"&quot;JustSayin&quot; &lt;mfcappella@...&gt;","profile":"mfcappella","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: The Case Against Spanking also Should We Interfere?","postDate":"1297287564","msgId":59618,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlpdjFpYytlNzdhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFDRTBCM0JELTk2MzEtNEYzNi1BMUE4LUE5MDFDMzE1OEYwM0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":59617,"nextInTopic":59619,"prevInTime":59617,"nextInTime":59619,"topicId":59601,"numMessagesInTopic":0,"msgSnippet":"I liked this: **No more than you appreciate missionaries coming to the door and trying to enlighten you about salvation, or beggars coming and trying to","messageBody":"<div id=\"ygrps-yiv-712794576\">I liked this:<br/>\n<br/>\n**No more than you appreciate missionaries coming to the door and trying to enlighten you about salvation, or beggars coming and trying to lighten your wallet.**<br/>\n<br/>\nBut it bothers me a lot to just sit there and watch it happen, and I think to myself if I could just say something so clever it will save one little kid from his Dad being so unecessarily mean to him and allow him to keep a little of that joy (he still had some joy in him, you could tell.  His older sibs, not so much). <br/>\n<br/>\nAnd the reason people even bother to come to your door with their pamphlets is because of that one person in a thousand that actually reads it and it makes sense to them and potentially changes their thinking. <br/>\n<br/>\nI am still going to work on this, maybe not with my little cards, but maybe try to figure out how to use a softer approach as some have mentioned.  <br/>\n<br/>\nI have been one who does not intervene, but I find I don&#39;t like myself much for it.<br/>\n<br/>\n--Melissa</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] The Case Against Spanking also Should We Interfere?","postDate":"1297286899","msgId":59617,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMyMjIyOEQ0LTk4NEYtNDUwNi1BMzUxLTk2N0YyMUYxMEQxNUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEE0M0Q1MDQwLTBENDctNDkzNC04MTcyLUJFOEMxMTdBMjBFNEBjb21jYXN0Lm5ldD4=","referencesHeader":"PDI5MDMzNTA4LjEyOTcyNzk5NDcwMjQuSmF2YU1haWwucm9vdEB3YW11aS1qdW5lLmF0bC5zYS5lYXJ0aGxpbmsubmV0PiA8NjFDQjM2M0MtNEM3Ny00NkRGLTgwMjEtRjcxRDA5NkI2QUQyQGNvbWNhc3QubmV0PiA8MUIzMENENzAtNzgxMy00NEUxLUI3RjctNkVENDg4MEJFNTE5QFNhbmRyYWRvZGQuY29tPiA8QTQzRDUwNDAtMEQ0Ny00OTM0LTgxNzItQkU4QzExN0EyMEU0QGNvbWNhc3QubmV0Pg=="},"prevInTopic":59616,"nextInTopic":59618,"prevInTime":59616,"nextInTime":59618,"topicId":59601,"numMessagesInTopic":0,"msgSnippet":"-=-Yeah, I might never intervene in the way I might aspire to . But seeing it in action was uplifting.-=- Thanks. :-) [Non-text portions of this message","messageBody":"<div id=\"ygrps-yiv-517098761\">-=-Yeah, I might never intervene in the way I might aspire to &lt;g&gt;. But <br/>\nseeing it in action was uplifting.-=-<br/>\n<br/>\nThanks. :-)<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] The Case Against Spanking also Should We Interfere?","postDate":"1297286153","msgId":59616,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE0M0Q1MDQwLTBENDctNDkzNC04MTcyLUJFOEMxMTdBMjBFNEBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDFCMzBDRDcwLTc4MTMtNDRFMS1CN0Y3LTZFRDQ4ODBCRTUxOUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDI5MDMzNTA4LjEyOTcyNzk5NDcwMjQuSmF2YU1haWwucm9vdEB3YW11aS1qdW5lLmF0bC5zYS5lYXJ0aGxpbmsubmV0PiA8NjFDQjM2M0MtNEM3Ny00NkRGLTgwMjEtRjcxRDA5NkI2QUQyQGNvbWNhc3QubmV0PiA8MUIzMENENzAtNzgxMy00NEUxLUI3RjctNkVENDg4MEJFNTE5QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":59615,"nextInTopic":59617,"prevInTime":59615,"nextInTime":59617,"topicId":59601,"numMessagesInTopic":0,"msgSnippet":"... Yeah, I might never intervene in the way I might aspire to . But seeing it in action was uplifting. Robin B.","messageBody":"<div id=\"ygrps-yiv-873699722\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; I think it&#39;s fine for people to never intervene.<br/>\n&gt;<br/>\n&gt; Not everyone has the temperament to save other people.  That&#39;s okay.<br/>\n<br/>\n </span></blockquote>Yeah, I might never intervene in the way I might aspire to &lt;g&gt;. But  <br/>\nseeing it in action was uplifting.<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] The Case Against Spanking also Should We Interfere?","postDate":"1297286007","msgId":59614,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVFNTgxRjAzLTIwQTItNERFNy1BNjIzLUFFRjg4MkFBRDUzQkBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDI1ODc5NDY1LjEyOTcyODQ2OTkxODcuSmF2YU1haWwucm9vdEB3YW11aS1qdW5lLmF0bC5zYS5lYXJ0aGxpbmsubmV0Pg==","referencesHeader":"PDI1ODc5NDY1LjEyOTcyODQ2OTkxODcuSmF2YU1haWwucm9vdEB3YW11aS1qdW5lLmF0bC5zYS5lYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":59613,"nextInTopic":59615,"prevInTime":59613,"nextInTime":59615,"topicId":59601,"numMessagesInTopic":0,"msgSnippet":"... I think that s an important point, saying I ve lost my temper and regretted it. It suggests that there can be a different way of looking at what s","messageBody":"<div id=\"ygrps-yiv-1656883082\"><blockquote><span title=\"ireply\">&gt;   I&#39;ll just start a conversation, maybe mention that I&#39;ve lost my  <br/>\n&gt; temper and regretted it, etc.<br/>\n<br/>\n </span></blockquote>I think that&#39;s an important point, saying &quot;I&#39;ve lost my temper and  <br/>\nregretted it.&quot; It suggests that there can be a different way of  <br/>\nlooking at what&#39;s happening.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;ve seen tension just lift off of mothers and see them be sweeter  <br/>\n&gt; to their kids after those conversations.<br/>\n<br/>\n </span></blockquote>Yes. Sometimes, I&#39;ve engaged the child with smile or a peek-a-boo and  <br/>\nthat shift in energy can help the mom.<br/>\n<br/>\nIt&#39;s the situations like I described where Sandra took charge that  <br/>\nhave flummoxed me. The active meanness to a 2-year-old that didn&#39;t go  <br/>\naway with some gentle talk (other than to distract the mom for a  <br/>\nmoment).<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":112891150,"authorName":"michmag5@earthlink.net","from":"michmag5@...","profile":"michelle_baum","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] The Case Against Spanking also Should We Interfere?","postDate":"1297285646","msgId":59615,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI1Mjg1MTUuMTI5NzI4NTY0Njc4Ny5KYXZhTWFpbC5yb290QHdhbXVpLWp1bmUuYXRsLnNhLmVhcnRobGluay5uZXQ+"},"prevInTopic":59614,"nextInTopic":59616,"prevInTime":59614,"nextInTime":59616,"topicId":59601,"numMessagesInTopic":0,"msgSnippet":"... Reading this, I realize it sounds a whole lot like talking about someone without actually saying it.  Which is manipulative and irritating. ; ) I was","messageBody":"<div id=\"ygrps-yiv-1994547746\">I wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Like what you just said to me above, about not using &quot;we&quot; instead of &quot;I.&quot;  Because you said it to me like you did, with a joke at the end, I can hear it.  I got your point and didn&#39;t feel like a jerk. <br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Reading this, I realize it sounds a whole lot like talking about someone without actually saying it.  Which is manipulative and irritating. ; )<br/>\n<br/>\nI was initially taken aback by how Sandra replied to me in this thread, but taking a few moments, realize that it&#39;s not personal, etc.  I did feel like a jerk reading what you&#39;d written, Sandra, but I&#39;ll live.  It&#39;s certainly not your job to ease me into anything. ; )<br/>\n<br/>\nMichelle<br/>\n<br/>\n<br/>\nWife to Bob<br/>\nMomma to George (12), Theo (9), Eli (6), and Oliver (18 mo)<br/>\n<br/>\nIf my life wasn&#39;t funny, it would just be true, and that&#39;s unacceptable.<br/>\n                                                            -- Carrie Fisher</div>","specialLinks":[]},{"userId":112891150,"authorName":"michmag5@earthlink.net","from":"michmag5@...","profile":"michelle_baum","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] The Case Against Spanking also Should We Interfere?","postDate":"1297284698","msgId":59613,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI1ODc5NDY1LjEyOTcyODQ2OTkxODcuSmF2YU1haWwucm9vdEB3YW11aS1qdW5lLmF0bC5zYS5lYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":59612,"nextInTopic":59614,"prevInTime":59612,"nextInTime":59614,"topicId":59601,"numMessagesInTopic":0,"msgSnippet":"... Well, what the hell is wrong with them???  ; ) Okay, I get it.  I ll try very hard not to do that again!  I, I, I. ... I m not sure that it s mutually","messageBody":"<div id=\"ygrps-yiv-697345286\">-----Original Message-----<br/>\n<blockquote><span title=\"ireply\"> &gt;From: Robin Bentley &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robin.bentley@...\">robin.bentley@...</a>&gt;<br/>\n<br/>\n<br/>\n&gt;I understand what you&#39;re saying, but I really feel uncomfortable with  <br/>\n&gt;the phrase &quot;I think we can all agree...&quot; Some people who have joined  <br/>\n&gt;this list recently might not agree, at least not yet &lt;g&gt;.<br/>\n<br/>\n </span></blockquote>Well, what the hell is wrong with them???  ; )<br/>\n<br/>\nOkay, I get it.  I&#39;ll try very hard not to do that again!  I, I, I.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;&gt; we don&#39;t do it by shaming or belittling. We can extend that to  <br/>\n&gt;&gt; adults too.<br/>\n&gt;&gt;<br/>\n&gt;This is a sentiment that is often used by new list members to stop  <br/>\n&gt;people in this group from being straight with them: &quot;You people  <br/>\n&gt;advocate being kind to your kids. You should be kind to me, too. If  <br/>\n&gt;you aren&#39;t, I&#39;m not going to listen to you.&quot;<br/>\n<br/>\n </span></blockquote>I&#39;m not sure that it&#39;s mutually exclusive, though, kindness and straightforwardness.  Is it?  Kindness doesn&#39;t mean saying, &quot;It&#39;s okay what you&#39;re doing,&quot; but it doesn&#39;t have to be devoid of any empathy at all.<br/>\n<br/>\nLike what you just said to me above, about not using &quot;we&quot; instead of &quot;I.&quot;  Because you said it to me like you did, with a joke at the end, I can hear it.  I got your point and didn&#39;t feel like a jerk. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;In person, with people who have not come to you for advice, the  <br/>\n&gt;approach is admittedly different. As in my example of Sandra&#39;s mastery  <br/>\n&gt;of the situation, the child was given a break, the mom was not shamed  <br/>\n&gt;or belittled, but neither was she told &quot;it&#39;s okay what you&#39;re doing.  <br/>\n&gt;We all have bad days.&quot; That says that the meanness/frustration/anger  <br/>\n&gt;foisted upon their kids might be okay the next time and the next.<br/>\n<br/>\n </span></blockquote>I don&#39;t think I&#39;m advocating saying &quot;it&#39;s okay what you&#39;re doing.&quot;  Just my experience that I never do better when I&#39;m directly criticized without a little bonding first. My experience, me me me.  In those kinds of situations with other parents, I don&#39;t ever say, &quot;Man, your kid *is* a pain in the butt. I don&#39;t blame you for being mad.&quot;  I&#39;ll just start a conversation, maybe mention that I&#39;ve lost my temper and regretted it, etc.  I&#39;ve seen tension just lift off of mothers and see them be sweeter to their kids after those conversations.<br/>\n<br/>\nMichelle<br/>\n<br/>\n<br/>\n<br/>\nWife to Bob<br/>\nMomma to George (12), Theo (9), Eli (6), and Oliver (18 mo)<br/>\n<br/>\nIf my life wasn&#39;t funny, it would just be true, and that&#39;s unacceptable.<br/>\n                                                            -- Carrie Fisher</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] The Case Against Spanking also Should We Interfere?","postDate":"1297283799","msgId":59612,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFCMzBDRDcwLTc4MTMtNDRFMS1CN0Y3LTZFRDQ4ODBCRTUxOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDYxQ0IzNjNDLTRDNzctNDZERi04MDIxLUY3MUQwOTZCNkFEMkBjb21jYXN0Lm5ldD4=","referencesHeader":"PDI5MDMzNTA4LjEyOTcyNzk5NDcwMjQuSmF2YU1haWwucm9vdEB3YW11aS1qdW5lLmF0bC5zYS5lYXJ0aGxpbmsubmV0PiA8NjFDQjM2M0MtNEM3Ny00NkRGLTgwMjEtRjcxRDA5NkI2QUQyQGNvbWNhc3QubmV0Pg=="},"prevInTopic":59611,"nextInTopic":59613,"prevInTime":59611,"nextInTime":59613,"topicId":59601,"numMessagesInTopic":0,"msgSnippet":"-=- It wasn t obviously shaming or belittling. It was matter of fact, though. -=-That s the kind of intervention I aspire to.-=- I think it s fine for people","messageBody":"<div id=\"ygrps-yiv-931319118\">-=-<br/>\nIt wasn&#39;t obviously shaming or belittling. It was matter of fact, <br/>\nthough.<br/>\n<br/>\n-=-That&#39;s the kind of intervention I aspire to.-=-<br/>\n<br/>\nI think it&#39;s fine for people to never intervene.<br/>\n<br/>\nMy friend Cathyn and I broke up a fight once, and ended up going to court twice, without even needing to be IN court--but still had to go downtown, pay to park, go through the security to get into the courthouse (no cellphones), wait...    The first time, the guy didn&#39;t show up.  The second time he showed up, saw us, and decided to plead guilty, so we were let go home before the hearing.   But it was a pain.  Cathyn had to take off work twice.  I had to find people to stay with my kids.<br/>\n<br/>\nNot everyone has the temperament to save other people.  That&#39;s okay.<br/>\nSome people might think they would be doing a good service by saving some of our kids from the horror of being unschooled, so too much justification of the interference of others could bite us in the butt.  In many ways and in some places, spanking a child is more legal than taking a laid-back point of view about a kid learning cursive penmanship.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] The Case Against Spanking also Should We Interfere?","postDate":"1297283046","msgId":59611,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYxQ0IzNjNDLTRDNzctNDZERi04MDIxLUY3MUQwOTZCNkFEMkBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDI5MDMzNTA4LjEyOTcyNzk5NDcwMjQuSmF2YU1haWwucm9vdEB3YW11aS1qdW5lLmF0bC5zYS5lYXJ0aGxpbmsubmV0Pg==","referencesHeader":"PDI5MDMzNTA4LjEyOTcyNzk5NDcwMjQuSmF2YU1haWwucm9vdEB3YW11aS1qdW5lLmF0bC5zYS5lYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":59610,"nextInTopic":59612,"prevInTime":59610,"nextInTime":59612,"topicId":59601,"numMessagesInTopic":0,"msgSnippet":"... I understand what you re saying, but I really feel uncomfortable with the phrase I think we can all agree... Some people who have joined this list","messageBody":"<div id=\"ygrps-yiv-1490279729\"><blockquote><span title=\"ireply\">&gt; I think we all agree that when we&#39;re looking to improve behavior in  <br/>\n&gt; a child, we don&#39;t do it by shaming or belittling.<br/>\n<br/>\n </span></blockquote>I understand what you&#39;re saying, but I really feel uncomfortable with  <br/>\nthe phrase &quot;I think we can all agree...&quot; Some people who have joined  <br/>\nthis list recently might not agree, at least not yet &lt;g&gt;.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; we don&#39;t do it by shaming or belittling. We can extend that to  <br/>\n&gt; adults too.<br/>\n&gt;<br/>\n </span></blockquote>This is a sentiment that is often used by new list members to stop  <br/>\npeople in this group from being straight with them: &quot;You people  <br/>\nadvocate being kind to your kids. You should be kind to me, too. If  <br/>\nyou aren&#39;t, I&#39;m not going to listen to you.&quot;<br/>\n<br/>\nChildren are only children for a short time. Parents only have a short  <br/>\ntime to &quot;get it&quot;. That&#39;s why long-time list members are direct in  <br/>\nsaying &quot;this is what you should do, this is what you shouldn&#39;t do if  <br/>\nyou want the kind of relationship with your kids that you say you want.&quot;<br/>\n<br/>\nIn person, with people who have not come to you for advice, the  <br/>\napproach is admittedly different. As in my example of Sandra&#39;s mastery  <br/>\nof the situation, the child was given a break, the mom was not shamed  <br/>\nor belittled, but neither was she told &quot;it&#39;s okay what you&#39;re doing.  <br/>\nWe all have bad days.&quot; That says that the meanness/frustration/anger  <br/>\nfoisted upon their kids might be okay the next time and the next.<br/>\n<br/>\nI remembered something Sandra had said once upon a time and I went to  <br/>\ncheck on her site. It was in a chat about a year and a half ago:<br/>\n<br/>\n~~~~~~~<br/>\nSandraDodd: A mom with a little girl was threatening her about not  <br/>\nacting better, and saying she would spank her. The girl was crying,  <br/>\nbut not hard or loud, just sad and bored and confused. I went over and  <br/>\nsaid softly to the woman that if a man were threatening to hit her,  <br/>\nsomeone would call the police, and she should be nice to her.<br/>\n<br/>\nSandraDodd: I guess she thought about it a while, and then came and  <br/>\nsaid full voice (whereas I had spoken just to her) that now her child  <br/>\nwas afraid the police were going to come, and that I should mind my  <br/>\nown business and something...<br/>\n<br/>\nSandraDodd: She said she wasn&#39;t talking about HITTING her, just a  <br/>\nlittle spank, and I didn&#39;t know what I was talking about. I said I had  <br/>\nthree children and I did know what I was talking about. The other  <br/>\npeople in line and the checker were more alarmed than I was, for sure.<br/>\n<br/>\n~~~~~~~<br/>\n<br/>\nIt wasn&#39;t obviously shaming or belittling. It was matter of fact,  <br/>\nthough.<br/>\n<br/>\nThat&#39;s the kind of intervention I aspire to.<br/>\n<br/>\nRobin B.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: The Case Against Spanking also Should We Interfere?","postDate":"1297282647","msgId":59610,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ4RDkyQjFBLTE0QUMtNDlFNi05MTg2LTdGMjg4MkNDQkI1M0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlpdW11NitibjZsQGVHcm91cHMuY29tPg==","referencesHeader":"PGlpdW11NitibjZsQGVHcm91cHMuY29tPg=="},"prevInTopic":59609,"nextInTopic":59611,"prevInTime":59609,"nextInTime":59611,"topicId":59601,"numMessagesInTopic":0,"msgSnippet":"-=- If you did it in a pre-meditated, deliberate way, how could you justify that? ************ -=-I was actually helped by advice to never spank in anger - it","messageBody":"<div id=\"ygrps-yiv-1009156110\">-=-&gt;&gt;If you did it in a pre-meditated, deliberate way, how could you justify that? <br/>\n************<br/>\n<br/>\n-=-I was actually helped by advice to never spank in anger - it seemed like a reasonable goal, to me, because I wasn&#39;t interested in being abusive. I saw spanking as a tool for behavior modification - classical conditioning - and didn&#39;t question the ethics of it because I believed I was acting with respect to the child&#39;s future self. I was working to create a better adult.-=-<br/>\n<br/>\nMy mom was that way.  She felt she had moved beyond her parents by being clinical and careful and using small things to spank with and not large things.<br/>\n<br/>\nFor her, it was progress.<br/>\n<br/>\nIt&#39;s easily justified when people feel they have a mandate from God.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] The Case Against Spanking also Should We Interfere?","postDate":"1297282506","msgId":59609,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFDRTBCM0JELTk2MzEtNEYzNi1BMUE4LUE5MDFDMzE1OEYwM0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlpdWZqZCtiNDNxQGVHcm91cHMuY29tPg==","referencesHeader":"PGlpdWZqZCtiNDNxQGVHcm91cHMuY29tPg=="},"prevInTopic":59608,"nextInTopic":59610,"prevInTime":59608,"nextInTime":59610,"topicId":59601,"numMessagesInTopic":0,"msgSnippet":"-=-So a question I have, and maybe it s not for this group (and that s OK), but as parents that tend (or try) to respect their kids, do we have any obligation","messageBody":"<div id=\"ygrps-yiv-1648441146\">-=-So a question I have, and maybe it&#39;s not for this group (and that&#39;s OK), but as parents that tend (or try) to respect their kids, do we have any obligation to try to &quot;enlighten&quot; other parents?-=-<br/>\n<br/>\nNo.<br/>\n<br/>\nNo more than you appreciate missionaries coming to the door and trying to enlighten you about salvation, or beggars coming and trying to lighten your wallet.<br/>\n<br/>\n-=-He almost looked like he was doing this because he thought he should, rather than any real innate meanness. I know that sounds weird, but that&#39;s what it s-=-<br/>\n<br/>\nProbably most people are strict with their kids because of that they think other parents (present or imagined) would think about them or their kids.<br/>\n<br/>\n-=-Maybe I need to carry a little stack of business cards that say &quot;It&#39;s ok to be nice to your kid&quot; and some &quot;easy reading&quot; web addresses about peaceful parenting. Just thought of that....not a bad idea..-=-<br/>\n<br/>\nNot a great idea, though.<br/>\n<br/>\nWhen we were at McDonald&#39;s or some other public place and another parent was just kind of irritating, I would be extra sweet to my kids.  Sometimes extra sweet involved playing with them, or taking them to another part of the building or playground for a little while.   Sometimes we left to do something else.<br/>\n<br/>\nBeing nice to our own children makes the world better (if our kids aren&#39;t going crazy and making the world worse).  When people are unschooling peacefully and their kids are happy and reasonably polite in public, then they&#39;re setting a good example for other families.  But to the original question, whether we have an obligation to &quot;enlighten&quot; other parents, no.  We&#39;re going against the prevailing culture.  I put the most energy into my own family, and extra energy into making information available to others, but not people who didn&#39;t want to know.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":196677035,"authorName":"Tina Tarbutton","from":"Tina Tarbutton &lt;tina.tarbutton@...&gt;","profile":"dravensmomhome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] The Case Against Spanking also Should We Interfere?","postDate":"1297282241","msgId":59619,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlteWYxTmp1aWJaTDJqa2dldD1FRzZpUWtCU3hPSk1ULXlQcUhGS0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGlpdWZqZCtiNDNxQGVHcm91cHMuY29tPg==","referencesHeader":"PGlpdWZqZCtiNDNxQGVHcm91cHMuY29tPg=="},"prevInTopic":59618,"nextInTopic":59620,"prevInTime":59618,"nextInTime":59620,"topicId":59601,"numMessagesInTopic":0,"msgSnippet":"... This has always confused me as well.  My mother rarely spanked, but when she did it was always after the fact, when she was calm.  I remember every single","messageBody":"<div id=\"ygrps-yiv-747332471\">On Wed, Feb 9, 2011 at 11:32 AM, JustSayin &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mfcappella@...\">mfcappella@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I remembered a comment from the posts about never spanking in anger that<br/>\n&gt; really bothered me. I could not fathom this, how could you get calm and<br/>\n&gt; peaceful and then hit your child?!?<br/>\n&gt;<br/>\n&gt;<br/>\n </span></blockquote>This has always confused me as well.  My mother rarely spanked, but when she<br/>\ndid it was always after the fact, when she was calm.  I remember every<br/>\nsingle spanking I ever got from her because it was typically &quot;You&#39;re going<br/>\nto get a spanking for this, but I need to calm down first, go to your room<br/>\nand wait for me&quot; which gave me, what felt like ages, to wait for the<br/>\ninevitable.  I can remember every transgression that earned me a spanking.<br/>\n<br/>\nMy father on the other hand spanked more often, but it was always in the<br/>\nheat of the moment.  I can&#39;t remember a single event surrounding a spanking,<br/>\nI honestly don&#39;t remember him spanking me, although I know he did.<br/>\n<br/>\nI was a spanking mom, however it was only in instances of danger.  Draven<br/>\nbroke free from me while crossing a street and took off running.  In<br/>\nhindsight I could have handled it much much better, but at the time my<br/>\nreaction was to spank him for it, using my mother&#39;s reasoning &quot;I&#39;d rather<br/>\nspank my child then have him get hit by a car the next time.&quot;  I no longer<br/>\nspank, and with future children I have no plans of doing it even at a young<br/>\nage.<br/>\n<br/>\nTina<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":283530155,"authorName":"JustSayin","from":"&quot;JustSayin&quot; &lt;mfcappella@...&gt;","profile":"mfcappella","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: The Case Against Spanking also Should We Interfere?","postDate":"1297282144","msgId":59608,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlpdXM5MCsxMDNlYUBlR3JvdXBzLmNvbT4=","inReplyToHeader":"PDI5MDMzNTA4LjEyOTcyNzk5NDcwMjQuSmF2YU1haWwucm9vdEB3YW11aS1qdW5lLmF0bC5zYS5lYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":59607,"nextInTopic":59609,"prevInTime":59607,"nextInTime":59609,"topicId":59601,"numMessagesInTopic":0,"msgSnippet":"... I totally agree.  And in this situation I might have gone in with the wrong attitude (righteousness), so I did hold myself back.  I will say I did try to","messageBody":"<div id=\"ygrps-yiv-2067465029\"><blockquote><span title=\"ireply\">&gt;I think we all agree that when we&#39;re looking to improve behavior in a child, we don&#39;t do it by shaming or belittling. We can extend that to adults too.&lt;<br/>\n<br/>\n </span></blockquote>I totally agree.  And in this situation I might have gone in with the wrong attitude (righteousness), so I did hold myself back.  I will say I did try to smile at the family and not scowl or anything, but I didn&#39;t offer to help either, and maybe I could have done that in a non-threatening way.  <br/>\n<br/>\nI have pondered these things since I was a teen (many moons ago) - how are we ever going to get to a place of peace (in ourselves or in the world) if we treat our own kids so badly?  No easy answers I guess. <br/>\n<br/>\nThanks for the feedback.  Throwing away my little stack of cards before they even got created ;&gt;<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, michmag5@... wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; -----Original Message-----<br/>\n&gt; &gt;From: JustSayin &lt;mfcappella@...&gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; &gt;Maybe I need to carry a little stack of business cards that say &quot;It&#39;s ok to be nice to your kid&quot; and some &quot;easy reading&quot; web addresses about peaceful parenting.  Just thought of that....not a bad idea..<br/>\n&gt; &gt;<br/>\n&gt; <br/>\n&gt; Truthfully, if I were on the receiving end of that, all I&#39;d feel was ashamed and angry, not receptive. <br/>\n&gt; <br/>\n&gt; What I&#39;ve tried to do (and what&#39;s helped *me* when I&#39;ve been crabby in public with my kids) is kindness and compassion and empathy from another adult.  What I&#39;ve done when I&#39;ve seen someone else having trouble with a kid in a playland or whatever is just start talking with the mom or dad about how hard it can be, try to make a joke, talk about how I can see their kid is really enjoying the xyz...or I ask my child to start playing with the kid.  Whatever.<br/>\n&gt; <br/>\n&gt; You can&#39;t know what burdens may be on another person in any given moment.  A parent may be losing their temper because they&#39;ve got money worries or marriage worries or anything else that weighs on a person.  <br/>\n&gt; <br/>\n&gt; I think we all agree that when we&#39;re looking to improve behavior in a child, we don&#39;t do it by shaming or belittling.  We can extend that to adults too. <br/>\n&gt; <br/>\n&gt; Michelle<br/>\n&gt; <br/>\n&gt; Wife to Bob<br/>\n&gt; Momma to George (12), Theo (9), Eli (6), and Oliver (18 mo)<br/>\n&gt; <br/>\n&gt; If my life wasn&#39;t funny, it would just be true, and that&#39;s unacceptable.<br/>\n&gt;                                                             -- Carrie Fisher<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: The Case Against Spanking also Should We Interfere?","postDate":"1297281601","msgId":59607,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMyODg1RDJBLUE1MUQtNEFDMy1CNTlGLTc3OUM1Q0UzOEI3NEBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGlpdW11NitibjZsQGVHcm91cHMuY29tPg==","referencesHeader":"PGlpdW11NitibjZsQGVHcm91cHMuY29tPg=="},"prevInTopic":59606,"nextInTopic":59608,"prevInTime":59606,"nextInTime":59608,"topicId":59601,"numMessagesInTopic":0,"msgSnippet":"... While I think parents can be resistant because they think others just don t understand, I was present when Sandra made a difference to a child s life. ","messageBody":"<div id=\"ygrps-yiv-1548011741\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; As someone who used to spank, I can say that wouldn&#39;t have changed  <br/>\n&gt; my perspective only reinforced it. Any kind of tips or advice or  <br/>\n&gt; pressure from parents who had *never* spanked only served to  <br/>\n&gt; confirm, in my mind, that they had &quot;easy kids&quot; - so they couldn&#39;t  <br/>\n&gt; possibly understand me or my life.<br/>\n<br/>\n </span></blockquote>While I think parents can be resistant because they think others &quot;just  <br/>\ndon&#39;t understand,&quot; I was present when Sandra made a difference to a  <br/>\nchild&#39;s life.<br/>\n<br/>\nWhen I was in Albuquerque for the ACE Festival, I went into the  <br/>\nrestroom at the Explora Museum. As I walked in, I heard a mother  <br/>\nsaying in an angry voice &quot;you&#39;ll stay right there until I tell you you  <br/>\ncan get up.&quot; Her little girl was crying.I turned on my heel and walked  <br/>\nout, practically hyperventilating, in tears. I went to tell Sandra  <br/>\nwhat I&#39;d heard, saying I didn&#39;t know what to do, and she followed me in.<br/>\n<br/>\nBy this time, the mother and 2 year old daughter were out of the  <br/>\nstall. Sandra said something conversational like: &quot;It can be an  <br/>\noverwhelming place for little ones, here.&quot; The mom went on to say that  <br/>\nher daughter had to pee and wouldn&#39;t leave to go to the restroom. You  <br/>\ncould hear the frustration and anger in her voice. Sandra was calm and  <br/>\nturned things around by talking about how young she was and how much  <br/>\nfun she must have been having. The mom got defensive more than once,  <br/>\ntalking about how smart her daughter was and that she should know  <br/>\nbetter (&quot;she&#39;s almost 3 and she&#39;s very smart!&quot;). Sandra talked to her  <br/>\nabout her daughter being 2, actually. And being unable to shift her  <br/>\nattention in such a situation. (There may have been something else  <br/>\nSandra said - maybe she can flesh it out).<br/>\n<br/>\nI was impressed and now have an example in my head of what to do if  <br/>\nI&#39;m in that situation again. I have had trouble being that direct. But  <br/>\nSandra had given the little girl a break by engaging the mom. She  <br/>\ntalked about abilities a child might or might not have. She was on the  <br/>\nchild&#39;s side, but also trying to help the mom to shift her attention.  <br/>\nShe was calm and matter of fact.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It isn&#39;t the sort of thing you can teach to someone who doesn&#39;t want  <br/>\n&gt; to learn - and parents will resist the information the same way kids  <br/>\n&gt; resist teaching that doesn&#39;t appeal to them.<br/>\n<br/>\n </span></blockquote>I got a chance to pee while this was going on (hooray) and we talked  <br/>\nas we walked out. Sandra said that maybe the mom wouldn&#39;t change, not  <br/>\nright away, but what she had said might make the mom think again in  <br/>\nthe future.<br/>\n<br/>\nThe chance that that might happen would be worth it to me.<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: The Case Against Spanking also Should We Interfere?","postDate":"1297281071","msgId":59606,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlrZ3BDTVVudTFSMzZ3aXh1UXZ0OVJiTzlvcGFkZnVwZVN2S0JCVEBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGlpdW11NitibjZsQGVHcm91cHMuY29tPg==","referencesHeader":"PGlpdWZqZCtiNDNxQGVHcm91cHMuY29tPgk8aWl1bXU2K2JuNmxAZUdyb3Vwcy5jb20+"},"prevInTopic":59605,"nextInTopic":59607,"prevInTime":59605,"nextInTime":59607,"topicId":59601,"numMessagesInTopic":0,"msgSnippet":"... learn - and parents will resist the information the same way kids resist teaching that doesn t appeal to them.","messageBody":"<div id=\"ygrps-yiv-2010022416\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;It isn&#39;t the sort of thing you can teach to someone who doesn&#39;t want to<br/>\n </span></blockquote>learn - and parents will resist the information the same way kids resist<br/>\nteaching that doesn&#39;t appeal to them.&lt;&lt;&lt;<br/>\n<br/>\nThat&#39;s true, Meredith. And at the same time, with all the opportunity to<br/>\nmeet and know people who use spanking to condition their kid&#39;s future selves<br/>\nthat I have here in the Southern U.S. where spanking is commonly accepted, I<br/>\nstill find myself unable to countenance it. I try to be quiet and that works<br/>\nmost of the time. Still my face gives me away sometimes. I tell Brian that<br/>\nI&#39;ve been living under a comfy rock the last few years.<br/>\n<br/>\nRight, most people don&#39;t care. But a handful care because they were<br/>\nacquainted with me from years back and they&#39;re surprised at how I feel.<br/>\nConditioning children is the norm. A very good thing is I&#39;ve made friends in<br/>\nother circles so I also know some people in the area who would never think<br/>\nto hit children, and even there it can be sad (pretty frequently) because<br/>\nmost use other ways to mold children into conformity. School being the big<br/>\none, even though they don&#39;t have to make their children do things just<br/>\nbecause schools says to. Some things are choices even in school. And I<br/>\nmention that, sometimes in front of the kids (which lets them know that<br/>\nchoices do exist and may open up negotiations for children who truly don&#39;t<br/>\nwant something the schools say is a must).<br/>\n<br/>\nHitting children is a conditioning that adds an extra umphh because it is<br/>\ndirectly from parents rather than through school or some other thing<br/>\nexpected of children. On top of that, roughly half of the U.S. still legally<br/>\nallows corporal punishment on children while in school, including my own<br/>\nstate. I don&#39;t hear anything about it when it happens. I&#39;m not in that loop,<br/>\nthank goodness. And just because it IS legal that doesn&#39;t mean that schools<br/>\nor parents must use those means to condition and control the behavior of<br/>\nchildren.<br/>\n<br/>\nI don&#39;t know but I think people are getting away from hitting children. Even<br/>\nin some Christian circles. One lady I know quoted me the verse, &quot;He that<br/>\nspareth his rod hateth his son: but he that loveth him chasteneth him<br/>\nbetimes.&quot; (Proverbs 13) She has a daughter she says she&#39;s never hit. I asked<br/>\nher if that means she doesn&#39;t love her daughter and she said there&#39;s no need<br/>\nto spank if the child hasn&#39;t done anything to be spanked about. I said that<br/>\nlogic applies to the other two of her children as well because the things<br/>\nthey do don&#39;t require being hit either. This was about a month ago. She has<br/>\nsince brought up the topic and seems to be modifying her thinking about<br/>\nhitting children. And her son seems pretty grateful that his mother is<br/>\nchanging her mind about this stuff. Finally. She is realizing that it&#39;s not<br/>\nonly possible but better to reason with children. She also says spanking<br/>\ndoesn&#39;t work as well when they get older. I pointed out that it didn&#39;t work<br/>\nwhen they were younger either because the children can&#39;t understand and<br/>\ntherefore they can&#39;t be held responsible. Her comment when I said the same<br/>\nthing a month ago was that kids understand more than I (mother of one child<br/>\nwho never &quot;needed&quot; spanking) think. My face said I wasn&#39;t convinced. I hope<br/>\nshe has rethought that idea too but at this point she doesn&#39;t have to since<br/>\nher kids are all 9 and older.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] The Case Against Spanking also Should We Interfere?","postDate":"1297280888","msgId":59605,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBNTI2MDE0LUJCOTAtNDM3Qy1BNkY2LTg0OTVBMjkzOUZCMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDI5MDMzNTA4LjEyOTcyNzk5NDcwMjQuSmF2YU1haWwucm9vdEB3YW11aS1qdW5lLmF0bC5zYS5lYXJ0aGxpbmsubmV0Pg==","referencesHeader":"PDI5MDMzNTA4LjEyOTcyNzk5NDcwMjQuSmF2YU1haWwucm9vdEB3YW11aS1qdW5lLmF0bC5zYS5lYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":59603,"nextInTopic":59606,"prevInTime":59604,"nextInTime":59606,"topicId":59601,"numMessagesInTopic":0,"msgSnippet":"-=- I think we all agree that when we re looking to improve behavior in a child, we don t do it by shaming or belittling. We can extend that to adults too. -=-","messageBody":"<div id=\"ygrps-yiv-705161875\">-=-<br/>\nI think we all agree that when we&#39;re looking to improve behavior in a child, we don&#39;t do it by shaming or belittling. We can extend that to adults too. -=-<br/>\n<br/>\nI think we don&#39;t all need to agree, and saying &quot;I think we can all agree that...&quot; is manipulative, rhetorically speaking.  It is in itself somewhat shaming and belittling.  It suggests that anyone who hesitates is not as sweet and good as those who immediately nod and agree.<br/>\n<br/>\nI haven&#39;t even read the rest of the thread, and I&#39;m already a little irritated by the line above.<br/>\n<br/>\nPlease say &quot;I&quot; and not &quot;We all&quot; and &quot;We can.&quot;  If you could rephrase your statement in terms of your own believe and actions, that would be more helpful.  Thanks.<br/>\n<br/>\nNow I&#39;m going to go and read the full thread.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":112891150,"authorName":"michmag5@earthlink.net","from":"michmag5@...","profile":"michelle_baum","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] The Case Against Spanking also Should We Interfere?","postDate":"1297279946","msgId":59603,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI5MDMzNTA4LjEyOTcyNzk5NDcwMjQuSmF2YU1haWwucm9vdEB3YW11aS1qdW5lLmF0bC5zYS5lYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":59602,"nextInTopic":59605,"prevInTime":59602,"nextInTime":59604,"topicId":59601,"numMessagesInTopic":0,"msgSnippet":"... Truthfully, if I were on the receiving end of that, all I d feel was ashamed and angry, not receptive. What I ve tried to do (and what s helped *me* when","messageBody":"<div id=\"ygrps-yiv-1458247131\">-----Original Message-----<br/>\n<blockquote><span title=\"ireply\"> &gt;From: JustSayin &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mfcappella@...\">mfcappella@...</a>&gt;<br/>\n<br/>\n<br/>\n&gt;Maybe I need to carry a little stack of business cards that say &quot;It&#39;s ok to be nice to your kid&quot; and some &quot;easy reading&quot; web addresses about peaceful parenting.  Just thought of that....not a bad idea..<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Truthfully, if I were on the receiving end of that, all I&#39;d feel was ashamed and angry, not receptive. <br/>\n<br/>\nWhat I&#39;ve tried to do (and what&#39;s helped *me* when I&#39;ve been crabby in public with my kids) is kindness and compassion and empathy from another adult.  What I&#39;ve done when I&#39;ve seen someone else having trouble with a kid in a playland or whatever is just start talking with the mom or dad about how hard it can be, try to make a joke, talk about how I can see their kid is really enjoying the xyz...or I ask my child to start playing with the kid.  Whatever.<br/>\n<br/>\nYou can&#39;t know what burdens may be on another person in any given moment.  A parent may be losing their temper because they&#39;ve got money worries or marriage worries or anything else that weighs on a person.  <br/>\n<br/>\nI think we all agree that when we&#39;re looking to improve behavior in a child, we don&#39;t do it by shaming or belittling.  We can extend that to adults too. <br/>\n<br/>\nMichelle<br/>\n<br/>\nWife to Bob<br/>\nMomma to George (12), Theo (9), Eli (6), and Oliver (18 mo)<br/>\n<br/>\nIf my life wasn&#39;t funny, it would just be true, and that&#39;s unacceptable.<br/>\n                                                            -- Carrie Fisher</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: The Case Against Spanking also Should We Interfere?","postDate":"1297276678","msgId":59602,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlpdW11NitibjZsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlpdWZqZCtiNDNxQGVHcm91cHMuY29tPg=="},"prevInTopic":59601,"nextInTopic":59603,"prevInTime":59601,"nextInTime":59603,"topicId":59601,"numMessagesInTopic":0,"msgSnippet":"... **************** As someone who used to spank, I can say that wouldn t have changed my perspective only reinforced it. Any kind of tips or advice or","messageBody":"<div id=\"ygrps-yiv-350603449\">&quot;JustSayin&quot; &lt;mfcappella@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Maybe I need to carry a little stack of business cards that say &quot;It&#39;s ok to be nice to your kid&quot; and some &quot;easy reading&quot; web addresses about peaceful parenting.  Just thought of that....not a bad idea..<br/>\n </span></blockquote>****************<br/>\n<br/>\nAs someone who used to spank, I can say that wouldn&#39;t have changed my perspective only reinforced it. Any kind of tips or advice or pressure from parents who had *never* spanked only served to confirm, in my mind, that they had &quot;easy kids&quot; - so they couldn&#39;t possibly understand me or my life. <br/>\n<br/>\nRecommending books like Raising your Spirited Child or The Out of Sync Child would be better, if you feel compelled to recommend something. The titles alone can give parents a sense that you &quot;get it&quot; - that you can see that they are struggling to do the best they can with the tools they have - and the Spirited Child book, in particular, is well within the grasp of most parents worldview.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;If you did it in a pre-meditated, deliberate way, how could you justify that? <br/>\n </span></blockquote>************<br/>\n<br/>\nI was actually helped by advice to never spank in anger - it seemed like a reasonable goal, to me, because I wasn&#39;t interested in being abusive. I saw spanking as a tool for behavior modification - classical conditioning - and didn&#39;t question the ethics of it because I believed I was acting with respect to the child&#39;s future self. I was working to create a better adult. I&#39;m not justifying that ;) but it might be helpful to understand the reasons people have for making the choice to spank. <br/>\n<br/>\nI also didn&#39;t really have any *other* tools. Those parents I met who didn&#39;t spank either had easy going kids or used other means of control that didn&#39;t seem any kinder (withholding food, for instance) or more effective.<br/>\n<br/>\nAnyway, one of the things I discovered was that I needed to learn a different set of skills for handling stressful situations with kids. I didn&#39;t want to be one of those parents who let kids get away with things in the moment and then spank them later - I saw that as ineffective - so in the moment I needed a better set of strategies than threatening and hitting. Those strategies eventually led me to parenting peacefully - I mean that figuring out how to prevent &quot;bad behavior&quot; and how to respond thoughfully in the moment set me up to question the efficacy of spanking At All. I no longer saw a need for that tool and realized what a lousy tool it had been all along. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;do we have any obligation to try to &quot;enlighten&quot; other parents? <br/>\n<br/>\n </span></blockquote>It isn&#39;t the sort of thing you can teach to someone who doesn&#39;t want to learn - and parents will resist the information the same way kids resist teaching that doesn&#39;t appeal to them. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":283530155,"authorName":"JustSayin","from":"&quot;JustSayin&quot; &lt;mfcappella@...&gt;","profile":"mfcappella","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"The Case Against Spanking also Should We Interfere?","postDate":"1297269165","msgId":59601,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlpdWZqZCtiNDNxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":59602,"prevInTime":59600,"nextInTime":59602,"topicId":59601,"numMessagesInTopic":0,"msgSnippet":"We had a thread about spanking on this group a while ago - sorry I m a day late and a dollar short (typical of me ; ), but I wanted to share something I came","messageBody":"<div id=\"ygrps-yiv-265682124\">We had a thread about spanking on this group a while ago - sorry I&#39;m a day late and a dollar short (typical of me ;&gt;), but I wanted to share something I came across recently:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nospank.net/pt2007.htm\">http://www.nospank.net/pt2007.htm</a><br/>\n<br/>\nI remembered a comment from the posts about never spanking in anger that really bothered me.  I could not fathom this, how could you get calm and peaceful and then hit your child?!?   <br/>\n<br/>\nAnyway an excerpt from the article related to that idea:<br/>\n<br/>\n&quot;Some defenders of spanking caution that spanking, to be done correctly, must be done methodically and with deliberation. &quot;Never spank in anger,&quot; they say. The implicit message here is that it&#39;s quite all right to hurt another person on condition that one does it calmly. (Sadists enthusiastically endorse this formula.) But it is highly unlikely that anyone being abused - child or adult - notices or cares about the abuser&#39;s frame of mind.&quot; <br/>\n<br/>\nIMHO it would be worse to hit in an eerily calm way - at least if you hit because you &quot;lost it&quot; you could MAYBE explain that you lost it and you were wrong to do so (of course I am not even close to advocating it under ANY circumstance).  If you did it in a pre-meditated, deliberate way, how could you justify that? <br/>\n<br/>\nThe rest of the article is quite good too.  I would have liked to have handed it to a Dad I saw &quot;interacting&quot; with is little boy the other day.  Though he did not &quot;spank&quot; (meaning he did not hit him on his butt), there was significant grabbing, pulling, yelling and meanness directed at this curly-blond-headed little 2 to 3 year old who was trying so hard just to enjoy himself, if even just a little.<br/>\n<br/>\nHow this child&#39;s eyes lit up when he got away from the Dad for a few minutes and saw me smiling at him when I noticed his joy. It didn&#39;t last long (big tough Daddy came along and put an end to THAT real quick). The mom was texting the whole time and they had two other kids (11 and 12-ish) who just sat there stone faced the entire time (we were there for about an hour and a half).  This was at a McDonald&#39;s play place and none of the kids were even allowed to play on the equipment! I&#39;m not sure why they were there if they weren&#39;t going to let their kids play.<br/>\n<br/>\nSo a question I have, and maybe it&#39;s not for this group (and that&#39;s OK), but as parents that tend (or try) to respect their kids, do we have any obligation to try to &quot;enlighten&quot; other parents?  I said nothing in this situation because I thought he would just get really mad (at me and the boy).  But I wondered later if he might have appreciated (if not right then) someone telling him it was all right to be nice to his kid. He almost looked like he was doing this because he thought he should, rather than any real innate meanness.  I know that sounds weird, but that&#39;s what it seemed like.  Anyway the whole scene bothered me, and obviously still is. <br/>\n<br/>\nMaybe I need to carry a little stack of business cards that say &quot;It&#39;s ok to be nice to your kid&quot; and some &quot;easy reading&quot; web addresses about peaceful parenting.  Just thought of that....not a bad idea..<br/>\n<br/>\n--Melissa</div>","specialLinks":[]}],"prevTopicId":59563,"nextTopicId":59129}}