{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":49,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: help needed with my reaction","postDate":"1286034785","msgId":57598,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUzOEVDREUyLTI5NUQtNEZBOS05NjRGLUZDQzcwMEIzMkNGM0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGk4Nmllcis3cTR0QGVHcm91cHMuY29tPg==","referencesHeader":"PGk4Nmllcis3cTR0QGVHcm91cHMuY29tPg=="},"prevInTopic":57597,"nextInTopic":57599,"prevInTime":57597,"nextInTime":57599,"topicId":57546,"numMessagesInTopic":0,"msgSnippet":"This is beautiful: -=-The thing I like to always remind myself of is that growing up and learning about life is a journey and that I have a responsibility to ","messageBody":"<div id=\"ygrps-yiv-733880601\">This is beautiful:<br/>\n<br/>\n-=-The thing I like to always remind myself of is that growing up and  <br/>\nlearning about life is a journey and that I have a responsibility to  <br/>\nmy child, due to my choices of attachment parenting and radical  <br/>\nunschooling, to make life interesting and to pay attention to my sons  <br/>\nneeds all the time. Let your journey be a happy one.-=-<br/>\n<br/>\nNo one has ever been court ordered to unschool.  It&#39;s a choice every  <br/>\nsingle time.  Jennifer has described wonderfully what it means in  <br/>\nterms of choices after the unschooling decision is made.<br/>\n<br/>\nUnschooling badly isn&#39;t a good option for anyone.  That can lead to  <br/>\ncourt orders to put kids in school.   So if people are going to do it,  <br/>\nthey should really do it.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/doit\">http://sandradodd.com/doit</a><br/>\n<br/>\n-=-I have learned over time that when I go above and beyond for my son  <br/>\nand his seemingly simple needs (we adults think of a lolly or a cookie  <br/>\nas something to dismiss, sometimes), I am repaid in thankfulness and I  <br/>\nalso feel very good. Helping my son navigate the world makes me  <br/>\nfull...by making him full, I am full, you see. We need to keep our  <br/>\nchildren full and not dismiss their needs and desires. -=-<br/>\n<br/>\nMy middle child, Marty, has a girlfriend.  He&#39;s 21.  She&#39;s 24.  She  <br/>\nwas at the Santa Fe unschooling symposium I sponsored last January.  I  <br/>\npassed by as she was talking to one of the unschooling moms and heard  <br/>\nher say &quot;He treats me like a princess.&quot;<br/>\n<br/>\nI wrote this last week, and what Jennifer wrote about being full  <br/>\nreminded me of it:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://justaddlightandstir.blogspot.com/2010/09/overflowing.html\">http://justaddlightandstir.blogspot.com/2010/09/overflowing.html</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":432657691,"authorName":"sheeboo2","from":"&quot;sheeboo2&quot; &lt;naturewalkersinfo@...&gt;","profile":"sheeboo2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: help needed with my reaction","postDate":"1286034508","msgId":57597,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk4N2s4YytvcXFsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk4N2o2YSttN2ZlQGVHcm91cHMuY29tPg=="},"prevInTopic":57596,"nextInTopic":57598,"prevInTime":57596,"nextInTime":57598,"topicId":57546,"numMessagesInTopic":0,"msgSnippet":"... It is also interesting to note when adults, in the guise of teaching their children that they can t always have what they want, are actually trying to get","messageBody":"<div id=\"ygrps-yiv-336259334\">---------It&#39;s a sort of strange fallacy to think that it&#39;s somehow possible to Always get what one wants!--------------<br/>\n<br/>\nIt is also interesting to note when adults, in the guise of teaching their children that they can&#39;t always have what they want, are actually trying to get exactly what it is s/he (the adult) wants, be it spending less money, avoiding &quot;wasting&quot; time.....<br/>\n<br/>\nBrie</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [AlwaysLearning] Re: help needed with my reaction","postDate":"1286034382","msgId":57596,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIxNzU3MzBGLTUyRDItNDI3QS04OTIyLUM3RjEzMjhDMDcwN0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDg5MzYxMS44NDA5My5xbUB3ZWI4NjIwNC5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PGk4NmYwNSttNHZhQGVHcm91cHMuY29tPiA8ODkzNjExLjg0MDkzLnFtQHdlYjg2MjA0Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":57595,"nextInTopic":57597,"prevInTime":57595,"nextInTime":57597,"topicId":57546,"numMessagesInTopic":0,"msgSnippet":"-=- I ve had both Simon and Linnaea regularly turn things down that I ve offered to buy them. It amazes me every time. I m fully willing to buy them something","messageBody":"<div id=\"ygrps-yiv-2093595928\">-=- I&#39;ve had both Simon and Linnaea<br/>\nregularly turn things down that I&#39;ve offered to buy them. It amazes me  <br/>\nevery<br/>\ntime. I&#39;m fully willing to buy them something and they turn it down  <br/>\nbecause it<br/>\nisn&#39;t something that they want. -=-<br/>\n<br/>\nThe thing that struck me most about what my kids would turn down was  <br/>\neating out.  If we were on errands, I would (still do, and still get  <br/>\nturned down half the time or more) say &quot;Do you want to eat  <br/>\n[wherever]?&quot;  Or &quot;Do you want me to drive through somewhere?&quot;<br/>\n<br/>\nWhen they were little and they wanted the toy, they would want fast  <br/>\nfood kid meals.  If they didn&#39;t want the toy, they didn&#39;t want the meal.<br/>\n<br/>\nWhen they got older, they were often happier to come home and eat  <br/>\nsomething I made than to eat something out.  Sometimes they said it  <br/>\nwasn&#39;t worth the money, and sometimes they said they just liked my  <br/>\nfood better.<br/>\n<br/>\nI never liked my mom&#39;s food better.  It was all tainted with years of  <br/>\nmeanness, and I knew she slammed around resentfully when she cooked,  <br/>\nwhich soured the whole thing, too.  It wasn&#39;t a gift, it was &quot;here&#39;s  <br/>\nyour damned food&quot; with a lingering tone of &quot;and I hope you choke on  <br/>\nit.&quot;  Though if I had choked on it, she would have yelled at me for  <br/>\nnot chewing right, for not swallowing right.<br/>\n<br/>\nThe opposite of that is making food for a child and learning not to be  <br/>\nwhiney or petulant if the child doesn&#39;t want that thing, or isn&#39;t  <br/>\nhungry.  My children don&#39;t eat what they don&#39;t want.  How healthy is  <br/>\nthat!?  I would eat just to eat, because food outside my house had a  <br/>\njoy and niceness that I needed.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: help needed with my reaction","postDate":"1286034058","msgId":57595,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU0NTkwMTdDLTBBODItNEY2My04MDE4LTE2NDUyQTdFN0RFM0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDg5MzYxMS44NDA5My5xbUB3ZWI4NjIwNC5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PGk4NmYwNSttNHZhQGVHcm91cHMuY29tPiA8ODkzNjExLjg0MDkzLnFtQHdlYjg2MjA0Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":57594,"nextInTopic":57596,"prevInTime":57594,"nextInTime":57596,"topicId":57546,"numMessagesInTopic":0,"msgSnippet":"-=-I was happy to buy them for them, but they both wanted to pay for them, and they used their saved allowances to do so. They are not particularly frivolous,","messageBody":"<div id=\"ygrps-yiv-1868680328\">-=-I was happy to buy them for<br/>\nthem, but they both wanted to pay for them, and they used their saved  <br/>\nallowances<br/>\nto do so. They are not particularly frivolous, but they are generous.  <br/>\nThey are<br/>\nrarely broke. -=-<br/>\n<br/>\nMy kids were that way with allowances too.  Sometimes they would buy  <br/>\nsomething that I would rather have bought for them so they could save  <br/>\ntheir allowance.  I hadn&#39;t foreseen that they were learning about  <br/>\nmoney in ways I had never predicted. I would *never* have spent my  <br/>\nmeagre allowance on practicalities.  My mother showed me selfishness  <br/>\nand limits, and she was NOT getting any of my money.<br/>\n<br/>\nWhen I was little and had received money gifts when I was too young to  <br/>\nspend them, my mom didn&#39;t save them for me; she spent them.  When my  <br/>\nkids were too little and would get a card from the other grandparents  <br/>\nwith money in it ($2 for a two year old, $3 for a three year old...),  <br/>\nI would leave the money in the card sometimes, and leave it in a  <br/>\nfolder of things for that child.  When they were older, on some slack  <br/>\nday with not much to do, or if they asked about handwriting or grandma  <br/>\nand grandpa, or whatever it was, I would get that folder (different  <br/>\nfor each child, different times, casual) and look through things and  <br/>\nthey would discover excitedly that they had money they hadn&#39;t known  <br/>\nabout.<br/>\n<br/>\nI did that to honor the little girl I had been whose &quot;property&quot; and  <br/>\ngifts were not respected or maintained, but were coveted and resented  <br/>\nby my mother.  (My dad was a sweet man who didn&#39;t cross my mother much  <br/>\nabout the children.)  But in doing what I thought was right and good,  <br/>\nI became a person who was conscious of making decisions in my child&#39;s  <br/>\nfavor.  Once I BECAME that person, I wasn&#39;t having to think very hard  <br/>\nto make those decisions.  It&#39;s harder at first, when other people&#39;s  <br/>\nvoices are in your head saying &quot;You fed him and bought him clothes;  <br/>\nkeep that money,&quot; or &quot;He&#39;s just a child; he doesn&#39;t know what he&#39;s  <br/>\ntalking about,&quot; or &quot;He might *want* that but he doesn&#39;t *NEED* it.&quot;   <br/>\nWhen you try to hear those voices and identify which parent,  <br/>\ngrandparent, aunt, neighbor, friend it is, you can say to that  <br/>\nrecording in your head &quot;Enough; no more.&quot;  And the next time you start  <br/>\nto hear it, realize that is not your thoughts, that&#39;s a tape of  <br/>\nsomething that was said that made you feel embarrassment or shame or  <br/>\nto think you were wrong or small.<br/>\n<br/>\nEveryone has those message in them, I think.  And probably some nice,  <br/>\npositive ones, too.  In Freudian terms, that&#39;s the superego, where  <br/>\nrules are, where &quot;should&quot; lives.  Don&#39;t try to get rid of it, just be  <br/>\naware that it collects odd things and doesn&#39;t identify the quotes when  <br/>\nthey come pouring out.  Just clean the superego closet when you find  <br/>\nsomething that&#39;s harmful to you or your child.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: help needed with my reaction","postDate":"1286033418","msgId":57594,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk4N2o2YSttN2ZlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGlrZ0RwYytWYkc9a3hSSEU9eEhjWEtpOHFjSFRkc0xxa1R1cEdxaEBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":57593,"nextInTopic":57595,"prevInTime":57593,"nextInTime":57595,"topicId":57546,"numMessagesInTopic":0,"msgSnippet":"... It s a sort of strange fallacy to think that it s somehow possible to Always get what one wants! About three weeks ago I got some kites - they were on","messageBody":"<div id=\"ygrps-yiv-1817918159\">Marina DeLuca-Howard &lt;delucahoward@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I have a fourteen, seven, and ten year old and they don&#39;t always get what<br/>\n&gt; they want.<br/>\n<br/>\n </span></blockquote>It&#39;s a sort of strange fallacy to think that it&#39;s somehow possible to Always get what one wants!<br/>\n<br/>\nAbout three weeks ago I got some kites - they were on clearance and I figured I&#39;d stock up - and ever since Mo has wanted to fly a kite. Well, the wind has not cooperated! It has been light and erratic and not very good for kite flying. We&#39;ve tried a few different places: the neighbors mown hillside, a local park that&#39;s often a perfect spot for kites, a field outside my workplace. Not much luck, alas. The One thing my 9yo would dearly love right now, and she can&#39;t have it. <br/>\n<br/>\nShe&#39;s used to the idea that she *can&#39;t* always get what she wants, but also to the idea that I and her dad will try to help her get what she wants when we can. She&#39;s made do by racing up and down the driveway with the kite on a short string so the speed of the run will create enough lift to keep the kite afloat. Its pretty adorable. <br/>\n<br/>\nIn conventional parenting &quot;you can&#39;t always get what you want&quot; is an end game. In unschooling its just another challenge to problem solve around. But it Gets to be &quot;just another challenge&quot; because of parents&#39; willingness to try do whatever they can. Grab every easy Yes you can and be glad its an easy one! Life will throw enough challenges in your path that you don&#39;t ever have to add a single one. <br/>\n<br/>\n---Meredith (Mo 9, Ray 17)</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: help needed with my reaction","postDate":"1286032051","msgId":57593,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk4N2hyaitsaGhiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk4NmYwNSttNHZhQGVHcm91cHMuY29tPg=="},"prevInTopic":57592,"nextInTopic":57594,"prevInTime":57592,"nextInTime":57594,"topicId":57546,"numMessagesInTopic":0,"msgSnippet":"... **************** Were they lavished with love and care and let me help you as children? Every adult I know who is demanding in that way heard a whole lot","messageBody":"<div id=\"ygrps-yiv-1316484791\">&quot;Lisa&quot; &lt;lisa@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I know adults who are nasty and think everyone owes them something and don&#39;t think twice about taking, taking, taking from others.  How do I know that this is not what my son will end up being like?<br/>\n </span></blockquote>****************<br/>\n<br/>\nWere they lavished with love and care and &quot;let me help you&quot; as children? Every adult I know who is demanding in that way heard a whole lot of &quot;no&quot; as a child, or was given things in place of affection. The adults I know who have been in prison did not come from homes where care was lavished on them. They did come from homes where they heard a lot of &quot;you can&#39;t always get what you want&quot;.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My mom didn&#39;t ever deny me a lollipop, because I wouldn&#39;t have dared to ask for one.  I was downright beaten by mother and step-father<br/>\n </span></blockquote>*******************<br/>\n<br/>\nAnd so its natural for you to want &quot;your turn&quot; at being the one to say no - its wonderful that you&#39;re trying to do it more kindly! But you can go beyond that. Be the kindness and compassion you would have wanted from your own parents. Not only will your child benefit, you will too! Give Yourself the gift of being the kind, gentle compassionate mother you wanted and re-parent yourself. That&#39;s one of the wonderful parts of unschooling, it lets you heal your own hurts in addition to keeping you from passing them on to your kids. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":217568290,"authorName":"Laureen","from":"Laureen &lt;splashing@...&gt;","profile":"elementalgrrl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: help needed with my reaction","postDate":"1286031748","msgId":57592,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlrTSs9N2NjTmtqQ0dFNVRaWlRYVzFSPWNRb0NXZnVHM1c4RWtlMUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGk4NmYwNSttNHZhQGVHcm91cHMuY29tPg==","referencesHeader":"PERGQTUyRkIxLUIyRkMtNDlBMS05NTgzLTU4MkM1QTExNTY4MUBTYW5kcmFkb2RkLmNvbT4JPGk4NmYwNSttNHZhQGVHcm91cHMuY29tPg=="},"prevInTopic":57591,"nextInTopic":57593,"prevInTime":57591,"nextInTime":57593,"topicId":57546,"numMessagesInTopic":0,"msgSnippet":"Heya! ... This is really important. Go get a cup of tea or something and take some time to really sit with this. Because this right here is where you need to ","messageBody":"<div id=\"ygrps-yiv-1371007655\">Heya!<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Fri, Oct 1, 2010 at 10:12 PM, Lisa &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lisa@...\">lisa@...</a>&gt; wrote:<br/>\n<br/>\n&gt; I am not stomping my feet.  I am trying to understand.  How can a child who<br/>\n&gt; gets every wish fulfilled if possible, whose parents bend over backwards to<br/>\n&gt; try to help them and give them everything they want - how can that child not<br/>\n&gt; grow up thinking they are entitled to everything they want, and entitled to<br/>\n&gt; have other people get it for them?<br/>\n&gt;<br/>\n<br/>\nThis is really important. Go get a cup of tea or something and take some<br/>\ntime to really sit with this. Because this right here is where you need to<br/>\nunkink your think, and depart from our culture.<br/>\n<br/>\nOur culture leads you to believe that at base children are bad and require<br/>\ncorrection. The moment you realize, deep in your gut, that at base, they&#39;re<br/>\nawesome and require love, the whole thing just shifts over.<br/>\n<br/>\nI found that reading Polly Berends really helped. I also found Continuum<br/>\nConcept to be useful. But honestly? Just thinking about it, and watching my<br/>\nown kids, was what really turned the corner for me. You don&#39;t have to stop<br/>\nthem from being evil and entitled. You have to recognize that they&#39;re<br/>\ninherently spectacular, and all you have to do is love and support and<br/>\nencourage them, and they blossom. And in the act of learning how to do that,<br/>\nyou&#39;ll discover along the way that you blossom too.<br/>\n<br/>\nI too had bits of my childhood that were pretty horrific. For me, taking<br/>\neach bit out and examining it was way way way too much for me to deal with.<br/>\nSo I locked most of that junk up in a pretty box labeled &quot;unfortunate<br/>\ncircumstance&quot; and put it on a shelf. It neither defines me, nor informs my<br/>\ncurrent actions.<br/>\n<br/>\nSay yes. Choose love. Get on with making your corner of the world as<br/>\nwonderful as possible. Let the rest sort itself out.<br/>\n<br/>\n-- <br/>\n~~L!<br/>\n<br/>\ns/v Excellent Adventure<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.theexcellentadventure.com/\">http://www.theexcellentadventure.com/</a><br/>\n<br/>\n&quot;I can’t understand why people are frightened of new ideas. I’m frightened<br/>\nof the old ones.&quot;<br/>\n~~John Cage<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":321729783,"authorName":"Angela Shaw","from":"&quot;Angela Shaw&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [AlwaysLearning] Re: help needed with my reaction","postDate":"1286028606","msgId":57591,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWNiNjIzYiQ4NDViOWNhMCQ4ZDEyZDVlMCRAY29tPg==","inReplyToHeader":"PDg5MzYxMS44NDA5My5xbUB3ZWI4NjIwNC5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PGk4NmYwNSttNHZhQGVHcm91cHMuY29tPiA8ODkzNjExLjg0MDkzLnFtQHdlYjg2MjA0Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":57589,"nextInTopic":57592,"prevInTime":57590,"nextInTime":57592,"topicId":57546,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-138177279\">&lt;Being able to see that the reason they can turn things down is because they<br/>\nhave <br/>\nbeen given the things they want is a big way of examining my own<br/>\nrelationship <br/>\nwith buying and needing things&gt;<br/>\n<br/>\nI&#39;ve been reading about unschooling and putting it into practice since my<br/>\noldest was 5.  She&#39;s 15 now.  They know that we will always do our best to<br/>\nget them what they want.  They are and never have been those bratty kind of<br/>\nkids who want EVERYTHING.  Those are the kids who don&#39;t feel loved and are<br/>\ntrying to fill the void with stuff.  It will never be enough because what<br/>\nthey want is love an acceptance and what they are getting is stuff.<br/>\n<br/>\nMoney is tight for us this year. Between medical bills and less overtime we<br/>\nare going to have to tighten our belts for a while.  We&#39;ve talked about it<br/>\nwith the girls.  My oldest offered to pay for all her riding lessons because<br/>\nshe can work them off at the barn.<br/>\n<br/>\n I asked my youngest the other day what she would like for Christmas so I<br/>\ncan start shopping now and pick up things when I find sales.  She told me<br/>\nshe&#39;d really like a pair of shipping boots (for her horse and they are about<br/>\n$60) but that she couldn&#39;t really think of anything else she &quot;needed.&quot;  She<br/>\nsaid she&#39;d think about it.  Despite her very difficult year (and that&#39;s the<br/>\nunderstatement of the year), her cup is pretty full and she doesn&#39;t feel<br/>\nlike she &quot;needs&quot; anything for Christmas.  It&#39;s because she feels LOVED!<br/>\n<br/>\n <br/>\n<br/>\nAngela<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":301108410,"authorName":"Marina DeLuca-Howard","from":"Marina DeLuca-Howard &lt;delucahoward@...&gt;","profile":"matedgirl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: help needed with my reaction","postDate":"1286026538","msgId":57589,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlrZ0RwYytWYkc9a3hSSEU9eEhjWEtpOHFjSFRkc0xxa1R1cEdxaEBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGk4NXZqOSthcW5sQGVHcm91cHMuY29tPg==","referencesHeader":"PGk4NDF1bytjYjgxQGVHcm91cHMuY29tPgk8aTg1dmo5K2FxbmxAZUdyb3Vwcy5jb20+"},"prevInTopic":57588,"nextInTopic":57591,"prevInTime":57588,"nextInTime":57590,"topicId":57546,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-872399385\">&lt;&lt;I&#39;ll be honest with you.<br/>\nI did not WANT to go in the bank though. I wanted to use the ATM and get him<br/>\na lolliop somewhere else.&gt;&gt;<br/>\nand<br/>\n&lt;&lt;I don&#39;t like the whining&gt;&gt; wrote Lisa, yet, the whole tone of your email<br/>\nis *whine*.   I am sorry to break it to you but the way you describe your<br/>\nson in demeaning terms, when he is expressing distress is a sign you need to<br/>\nre-think your relationship.<br/>\n<br/>\n Most of the &quot;whiney adults&quot; I know cannot stand it in others especially<br/>\nchildren.  They use their adult power to judge and to shut down disempowered<br/>\nchildren, rather than empathize with them.<br/>\n<br/>\n  Here&#39;s how is sounded from your child&#39;s perspective:<br/>\nI wanted a lollipop.  My mother offered me a different lollipop. She then<br/>\nbecame more irrational about how to get me a lollipop and  her banking needs<br/>\nsomehow cancelled my lollipop needs, just because she didn&#39;t want to go in a<br/>\nbank.  She was completely distracted by her own &quot;playing&quot; to deal with my<br/>\nserious request for a lollipop.<br/>\n<br/>\n&lt;&lt;Do you guys always do exactly what your children want when they want it?<br/>\nIs every request to be fulfilled? Is there never a time when you say &quot;It<br/>\nwould be easier for me to do it this way and that&#39;s how I am going to do it&quot;<br/>\n.. ?<br/>\n<br/>\nAlso, I think that whining and crying everytime you don&#39;t get your way and<br/>\ndon&#39;t get what you want is behavior that should be discouraged. &gt;&gt;<br/>\n<br/>\nI have a fourteen, seven, and ten year old and they don&#39;t always get what<br/>\nthey want.  Some time they have conflicting needs/desires/ideas.  We do a<br/>\nlot of talking, discussing and arguing.  As the parent you hold yourself to<br/>\nhigher standards of patience because you have more resources or at least<br/>\n*most* parents  on this list do this and that allows them to embrace<br/>\nchildren who are upset, rather than rant, rave and have an email *meltdown*,<br/>\nwhere they present themselves as injured by a child&#39;s request and subsequent<br/>\ndisappointment.<br/>\n<br/>\nMarina<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: help needed with my reaction","postDate":"1286015726","msgId":57588,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGluYmFRTTRKTTk3OXpPRXNRdjhuajRvSnNSRkU2WWpnenEzcHRfNUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEFBTkxrVGltemJGQ18reitSb01QODI1bjJnQmNzUFNtdGtkMzg9N2J3M1hoaEBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGk4NmYwNSttNHZhQGVHcm91cHMuY29tPgk8NjM0MDI5MTAtMUE4My00RDk2LTgwRDQtMThGQzkwRDQ1QjVBQFNhbmRyYWRvZGQuY29tPgk8MDc4NTk4QzgtREVBRi00NkJFLTg1MjQtRTA1ODc2NDA4QThBQFNhbmRyYWRvZGQuY29tPgk8QUFOTGtUaW16YkZDXyt6K1JvTVA4MjVuMmdCY3NQU210a2QzOD03YnczWGhoQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":57587,"nextInTopic":57589,"prevInTime":57587,"nextInTime":57589,"topicId":57546,"numMessagesInTopic":0,"msgSnippet":"... yourself.","messageBody":"<div id=\"ygrps-yiv-691310399\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;You would have<br/>\n </span></blockquote>yourself.&lt;&lt;&lt;<br/>\n<br/>\nThat too. But I meant to say: you would have it yourself.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 10/2/10, k &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:katherand@...\">katherand@...</a>&gt; wrote:<br/>\n&gt;&gt;&gt;&gt;&quot;Read a little, try a little, wait a while, watch.&quot;<br/>\n&gt; You can&#39;t get to it by writing about it.&lt;&lt;&lt;<br/>\n&gt;<br/>\n&gt; I tried to. For a while.<br/>\n&gt;<br/>\n&gt; But I had the best luck when, through the encouragement of words on<br/>\n&gt; this list and the Unschooling Discussion list, I let go and tried some<br/>\n&gt; of the things suggested. And they turned out to be good ideas.<br/>\n&gt;<br/>\n&gt; For me the key was (and is) to watch for the smiles and relaxed<br/>\n&gt; posture. If your reaction has been mostly forbidding or &quot;no&quot; for a<br/>\n&gt; while, it will take time for trust to grow into relaxing and being<br/>\n&gt; happy. And I needed time anyway to get better at spotting my child&#39;s<br/>\n&gt; much milder more subtle body language when happy as compared with the<br/>\n&gt; more obvious drama of complaints. I also needed to gain sensitivity to<br/>\n&gt; what, at one time, was barely noticed sadness at my insensitivities.<br/>\n&gt;<br/>\n&gt; I&#39;ve always prided myself on knowing body language because I don&#39;t<br/>\n&gt; hear well and read lips and that kind of thing, but there were things<br/>\n&gt; I had learned to ignore in body language which I had thought were<br/>\n&gt; convenient since they freed me from being too sensitive to just<br/>\n&gt; any-and-everyone&#39;s whim. But that turned out not to be a good thing<br/>\n&gt; with my child or his dad.<br/>\n&gt;<br/>\n&gt; Another key to getting why doing what others wish when possible is<br/>\n&gt; that it feels good and nurtures that starved for love inner child that<br/>\n&gt; can often still be sorrowing and in need of my care.<br/>\n&gt;<br/>\n&gt; I have a blogpost on that inner child bit and since I&#39;m on my PDA I<br/>\n&gt; may post the link later.<br/>\n&gt;<br/>\n&gt; I can&#39;t tell you how much better what I&#39;m doing is now. But you could<br/>\n&gt; try it yourself and not need to hear it from me. You would have<br/>\n&gt; yourself.<br/>\n&gt;<br/>\n&gt; ~Katherine<br/>\n&gt;<br/>\n&gt; On 10/2/10, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n&gt;&gt; It&#39;s late and I should be sleeping, so I&#39;m not typing well.    I&#39;ve<br/>\n&gt;&gt; repaired that second line.<br/>\n&gt;&gt;<br/>\n&gt;&gt; &quot;Read a little, try a little, wait a while, watch.&quot;<br/>\n&gt;&gt; You can&#39;t get to it by writing about it.<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt; Sorry I bungled it the first time.  I hope some of you read through<br/>\n&gt;&gt; without noticing I was fumble-fingered.<br/>\n&gt;&gt;<br/>\n&gt;&gt; Sandra<br/>\n&gt;&gt;<br/>\n&gt;&gt; [Non-text portions of this message have been removed]<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt; ------------------------------------<br/>\n&gt;&gt;<br/>\n&gt;&gt; Yahoo! Groups Links<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: help needed with my reaction","postDate":"1286015130","msgId":57586,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGltemJGQ18reitSb01QODI1bjJnQmNzUFNtdGtkMzg9N2J3M1hoaEBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDA3ODU5OEM4LURFQUYtNDZCRS04NTI0LUUwNTg3NjQwOEE4QUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGk4NmYwNSttNHZhQGVHcm91cHMuY29tPgk8NjM0MDI5MTAtMUE4My00RDk2LTgwRDQtMThGQzkwRDQ1QjVBQFNhbmRyYWRvZGQuY29tPgk8MDc4NTk4QzgtREVBRi00NkJFLTg1MjQtRTA1ODc2NDA4QThBQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":57585,"nextInTopic":57587,"prevInTime":57585,"nextInTime":57587,"topicId":57546,"numMessagesInTopic":0,"msgSnippet":"... You can t get to it by writing about it.","messageBody":"<div id=\"ygrps-yiv-1346265698\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&quot;Read a little, try a little, wait a while, watch.&quot;<br/>\n </span></blockquote>You can&#39;t get to it by writing about it.&lt;&lt;&lt;<br/>\n<br/>\nI tried to. For a while.<br/>\n<br/>\nBut I had the best luck when, through the encouragement of words on<br/>\nthis list and the Unschooling Discussion list, I let go and tried some<br/>\nof the things suggested. And they turned out to be good ideas.<br/>\n<br/>\nFor me the key was (and is) to watch for the smiles and relaxed<br/>\nposture. If your reaction has been mostly forbidding or &quot;no&quot; for a<br/>\nwhile, it will take time for trust to grow into relaxing and being<br/>\nhappy. And I needed time anyway to get better at spotting my child&#39;s<br/>\nmuch milder more subtle body language when happy as compared with the<br/>\nmore obvious drama of complaints. I also needed to gain sensitivity to<br/>\nwhat, at one time, was barely noticed sadness at my insensitivities.<br/>\n<br/>\nI&#39;ve always prided myself on knowing body language because I don&#39;t<br/>\nhear well and read lips and that kind of thing, but there were things<br/>\nI had learned to ignore in body language which I had thought were<br/>\nconvenient since they freed me from being too sensitive to just<br/>\nany-and-everyone&#39;s whim. But that turned out not to be a good thing<br/>\nwith my child or his dad.<br/>\n<br/>\nAnother key to getting why doing what others wish when possible is<br/>\nthat it feels good and nurtures that starved for love inner child that<br/>\ncan often still be sorrowing and in need of my care.<br/>\n<br/>\nI have a blogpost on that inner child bit and since I&#39;m on my PDA I<br/>\nmay post the link later.<br/>\n<br/>\nI can&#39;t tell you how much better what I&#39;m doing is now. But you could<br/>\ntry it yourself and not need to hear it from me. You would have<br/>\nyourself.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 10/2/10, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n&gt; It&#39;s late and I should be sleeping, so I&#39;m not typing well.    I&#39;ve<br/>\n&gt; repaired that second line.<br/>\n&gt;<br/>\n&gt; &quot;Read a little, try a little, wait a while, watch.&quot;<br/>\n&gt; You can&#39;t get to it by writing about it.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Sorry I bungled it the first time.  I hope some of you read through<br/>\n&gt; without noticing I was fumble-fingered.<br/>\n&gt;<br/>\n&gt; Sandra<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: help needed with my reaction","postDate":"1286008853","msgId":57585,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg5MzYxMS44NDA5My5xbUB3ZWI4NjIwNC5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PGk4NmYwNSttNHZhQGVHcm91cHMuY29tPg==","referencesHeader":"PGk4NmYwNSttNHZhQGVHcm91cHMuY29tPg=="},"prevInTopic":57584,"nextInTopic":57586,"prevInTime":57584,"nextInTime":57586,"topicId":57546,"numMessagesInTopic":0,"msgSnippet":"... Because what the child is seeing and experiencing is generosity and love and kindness. The more you are kind to your child the more they will know","messageBody":"<div id=\"ygrps-yiv-1354461346\"><blockquote><span title=\"ireply\">&gt;&gt;&quot;I am not stomping my feet.  I am trying to understand.  How can a child who <br/>\n&gt;&gt;gets every wish fulfilled if possible, whose parents bend over backwards to try <br/>\n&gt;&gt;to help them and give them everything they want - how can that child not grow up <br/>\n&gt;&gt;thinking they are entitled to everything they want, and entitled to have other <br/>\n&gt;&gt;people get it for them?&quot;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Because what the child is seeing and experiencing is generosity and love and <br/>\nkindness. The more you are kind to your child the more they will know kindness. <br/>\nThe more you are generous with him the more generous he will know how to be. It <br/>\nisn&#39;t entitlement that they grow up knowing, it is kindness and care and love. <br/>\n<br/>\nWhen Linnaea was little, and Simon was like this a bit, it felt like she wanted <br/>\neverything. But she didn&#39;t. She wanted some things. Learning to come up with <br/>\nways to get her those things, bouncy balls from a vending machine every time we <br/>\nwent swimming, stuffed animals from the zoo every time we went to the zoo, dolls <br/>\nevery time we went to the toy store, and so on, has helped her to grow into a <br/>\nchild who is fairly discerning in what she gets. I wouldn&#39;t have predicted that <br/>\nwhen I was trying to fight my tendency to say no. In full justification of the <br/>\nnos I might have said I could have talked about entitlement and about how these <br/>\naren&#39;t things she needs and how she wouldn&#39;t play with them for long and on and <br/>\non. But what the yesses gave her was a sense of being valued, of being listened <br/>\nto, of having her choices and desires supported. She knows that David and I are <br/>\nwilling to work to meet her needs and aren&#39;t going to sit in judgement on which <br/>\nof her needs is the one we&#39;ll choose to support. <br/>\n<br/>\nIt was hard to say yes in the beginning and so I gave both she and Simon an <br/>\nallowance so that they could use their money when I was too whatever to use my <br/>\nown. Too grouchy, too hungry, too worried about money, too whatever. It also <br/>\ngave them the power to save for something. And they do. We went to Hamley&#39;s in <br/>\nLondon on Tuesday and they bought Yugioh cards. I was happy to buy them for <br/>\nthem, but they both wanted to pay for them, and they used their saved allowances <br/>\nto do so. They are not particularly frivolous, but they are generous. They are <br/>\nrarely broke. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&quot;You say examine old memories with adult awareness ... how?  How do I do <br/>\n&gt;&gt;this?&quot;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I can remember getting things I didn&#39;t necessarily want simply because my <br/>\nparents offered to buy them. There was a broom from Pioneer Village in Minden, <br/>\nNebraska. It was a small broom, and it was made there, and I wanted it because I <br/>\ncould have it. There were the acid washed papers of the Gettysburg Address from <br/>\na trip to Gettysburg and the Constitution in similarly prematurely aged form, I <br/>\ndidn&#39;t really want them, but they were within the things my parents would get <br/>\nme, so I was excited to get them. I got a bunch of books on marine biology <br/>\nbecause my mom thought that was an okay interest to support, but I really wanted <br/>\nbooks on Alastair Crowley, which she didn&#39;t think were things I should be <br/>\nreading. I bought a cardigan once that I still have, it&#39;s my cautionary <br/>\ncardigan, because David told me I could have it. I don&#39;t particularly like it, <br/>\nbut I was allowed to have it, so I wanted it. I&#39;ve had both Simon and Linnaea <br/>\nregularly turn things down that I&#39;ve offered to buy them. It amazes me every <br/>\ntime. I&#39;m fully willing to buy them something and they turn it down because it <br/>\nisn&#39;t something that they want. <br/>\n<br/>\nBeing able to see that the reason they can turn things down is because they have <br/>\nbeen given the things they want is a big way of examining my own relationship <br/>\nwith buying and needing things. Seeing how supporting them and what they are <br/>\ninterested in has helped them to feel fuller and bigger and more sated and less <br/>\nneedy and small and unheard has been a powerful instrument in looking at my own <br/>\nneed for reassurance and permission to buy something. <br/>\n<br/>\nIt isn&#39;t entitlement that comes from being loving and kind, it is an overflowing <br/>\ncup of love and kindness. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":331885657,"authorName":"Jennifer Schuelein","from":"&quot;Jennifer Schuelein&quot; &lt;fairiedust66@...&gt;","profile":"jenfromtx6","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: help needed with my reaction","postDate":"1285999899","msgId":57587,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk4Nmllcis3cTR0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDUwNTRFQjU1OTEzNDRFNzFCMjQ4QjU1MUYyOEYwRTIwQGd4Mjgwc3NmM2ZjMGZlPg=="},"prevInTopic":57586,"nextInTopic":57588,"prevInTime":57586,"nextInTime":57588,"topicId":57546,"numMessagesInTopic":0,"msgSnippet":"I have learned over time that when I go above and beyond for my son and his seemingly simple needs (we adults think of a lolly or a cookie as something to","messageBody":"<div id=\"ygrps-yiv-836255295\">I have learned over time that when I go above and beyond for my son and his seemingly simple needs (we adults think of a lolly or a cookie as something to dismiss, sometimes), I am repaid in thankfulness and I also feel very good. Helping my son navigate the world makes me full...by making him full, I am full, you see. We need to keep our children full and not dismiss their needs and desires. You might try asking yourself if the thing he is asking will hurt him or anyone around. If not, then do it! Also, if something so simple can make a child very happy then well, it&#39;s always my attitude to make it happen. Don&#39;t take those little moments for granted. <br/>\n<br/>\nMy mother was a single mom and left me alone a great deal. I had an ok childhood, but it wasn&#39;t anything near as wonderful as what I am giving my child. I strive to give him everything I lacked, to keep him full and happy. In the end, when he is older, I am confident he will be a loving, joyful, considerate, caring person that goes above and beyond for his loved ones. He, too, had the &quot;gimmies&quot; as I call them (where he whined and begged for things). He went through a demanding phase and a phase where he seemed spoiled. We rode the wave and focused on reminding him of more pleasant behaviors. Also, distraction is a great tool. If you have to disappoint, fill the void with something else, but make it equally as interesting (which can be a simple thing like looking at a dog across the street or counting how many people are wearing blue on the sidewalk - silly, fun things).<br/>\n<br/>\nThe thing I like to always remind myself of is that growing up and learning about life is a journey and that I have a responsibility to my child, due to my choices of attachment parenting and radical unschooling, to make life interesting and to pay attention to my sons needs all the time. Let your journey be a happy one.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Jason & Stephanie&quot; &lt;jay_steph93@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Tonight I was at Publix for 2 items. My son who is 8 and doesn&#39;t let me go anywhere without him asked if the deli was still open. It was after 9 and at Kroger it would be closed. I said I&#39;m not sure but we&#39;ll see.<br/>\n&gt; <br/>\n&gt; Well I got my items and went to the checkout and in the checkout he asked again because he wanted a cookie.<br/>\n&gt; <br/>\n&gt; I totally forgot just in those few minutes. I asked the clerk if it was open because he wants a cookie. They told me it was, so after I paid for the items we went to the bakery area. nobody was there, we waited a few minutes, then I went to the deli counter and asked them. They went and got the person at the bakery and gave my son a cookie.<br/>\n&gt; <br/>\n&gt; It really was no big deal and only took a few minutes :)<br/>\n&gt; <br/>\n&gt; Stephanie in TN<br/>\n&gt; <br/>\n&gt; www.learningthroughliving-stephanie.blogspot.com<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://familyrun.ning.com/profile/Stephanie\">http://familyrun.ning.com/profile/Stephanie</a><br/>\n&gt; <br/>\n&gt; &quot;Children do not need to be made to learn to be better, told what to do or shown how. If they are given access to enough of the world, they will see clearly enough what things are truly important to themselves and to others, and they will make for themselves a better path into that world then anyone else could make for them.&quot; <br/>\n&gt; ~John Holt <br/>\n&gt;                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":458624268,"authorName":"dola dasgupta-banerji","from":"dola dasgupta-banerji &lt;doladg@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: help needed with my reaction","postDate":"1285999548","msgId":57584,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlrc2t2Qk5MdVhwUC1WcU56dHh4VjQ4MXo4dzVrSDNyZ1d6N0tnZkBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGk4NmYwNSttNHZhQGVHcm91cHMuY29tPg==","referencesHeader":"PERGQTUyRkIxLUIyRkMtNDlBMS05NTgzLTU4MkM1QTExNTY4MUBTYW5kcmFkb2RkLmNvbT4JPGk4NmYwNSttNHZhQGVHcm91cHMuY29tPg=="},"prevInTopic":57583,"nextInTopic":57585,"prevInTime":57583,"nextInTime":57585,"topicId":57546,"numMessagesInTopic":0,"msgSnippet":"**********My mom didn t ever deny me a lollipop, because I wouldn t have dared to ask for one. I was downright beaten by mother and step-father until I was","messageBody":"<div id=\"ygrps-yiv-1196214446\">**********My mom didn&#39;t ever deny me a lollipop, because I wouldn&#39;t have<br/>\ndared to ask for one. I was downright beaten by mother and step-father until<br/>\nI was bigger than my mom and even after that I was still threatened with<br/>\nextreme physical harm by my step-father who was bigger than me.<br/>\n<br/>\nI can&#39;t even begin to tell you the horror that was my childhood. And I can<br/>\nbe grateful for that because it led me to unschooling and to a good<br/>\nrelationship with my son now, but I still can&#39;t get over that hurdle of the<br/>\nway people TREAT ME and the way people behave around me.***************<br/>\n<br/>\n<br/>\nI deeply feel for your childhood. And always remember if you too feel deeply<br/>\nfor your &quot;inner child&quot;, that is &quot;you&quot; at whatever age you were traumatized,<br/>\nthen you will stop right now what you are doing with your son.<br/>\n<br/>\nThe only way to heal the scars of your childhood is by being &quot;now&quot; exactly<br/>\nthe way you wish your childhood &quot;had been&quot;.<br/>\n<br/>\nEvery time &quot;your response&quot; is the same as that of &quot;your moms or stepdad&#39;s&quot;<br/>\nyou are only perpetuating the same pattern of anger and violence.<br/>\n<br/>\nPlease be kind to your &quot;inner child&quot; love her, comfort her, praise her, hold<br/>\nher. Indulge her the way you wished your mom and stepfather had, and see how<br/>\nyour response to your son changes miraculously.<br/>\n<br/>\nWith every new response from you your confidence in yourself will grow by<br/>\nleaps and bounds and your near and dear ones will also grow in love.<br/>\n<br/>\nCan you see a little &quot;now&quot; how it was never about your son. The root is<br/>\nalways the self and not the other.<br/>\n<br/>\n<br/>\nDola<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sat, Oct 2, 2010 at 10:42 AM, Lisa &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lisa@...\">lisa@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I am not stomping my feet. I am trying to understand. How can a child who<br/>\n&gt; gets every wish fulfilled if possible, whose parents bend over backwards to<br/>\n&gt; try to help them and give them everything they want - how can that child not<br/>\n&gt; grow up thinking they are entitled to everything they want, and entitled to<br/>\n&gt; have other people get it for them?<br/>\n&gt;<br/>\n&gt; I know adults who are nasty and think everyone owes them something and<br/>\n&gt; don&#39;t think twice about taking, taking, taking from others. How do I know<br/>\n&gt; that this is not what my son will end up being like?<br/>\n&gt;<br/>\n&gt; I know you are right Sandra, I do, but I&#39;m just not sure how to get on the<br/>\n&gt; other side of the fence I am on.<br/>\n&gt;<br/>\n&gt; After I read my post, I could see that it was more about my response to his<br/>\n&gt; response than it was about the lollipop, and that the lollipop could have<br/>\n&gt; been a non-issue .... but I still can&#39;t figure out how to get past that<br/>\n&gt; hurdle.<br/>\n&gt;<br/>\n&gt; My mom didn&#39;t ever deny me a lollipop, because I wouldn&#39;t have dared to ask<br/>\n&gt; for one. I was downright beaten by mother and step-father until I was bigger<br/>\n&gt; than my mom and even after that I was still threatened with extreme physical<br/>\n&gt; harm by my step-father who was bigger than me.<br/>\n&gt;<br/>\n&gt; I can&#39;t even begin to tell you the horror that was my childhood. And I can<br/>\n&gt; be grateful for that because it led me to unschooling and to a good<br/>\n&gt; relationship with my son now, but I still can&#39;t get over that hurdle of the<br/>\n&gt; way people TREAT ME and the way people behave around me.<br/>\n&gt;<br/>\n&gt; I want to be happy and confident too. And I&#39;m not sure how to get there<br/>\n&gt; from here. I&#39;m a lot happier and a lot more confident than I used to be, but<br/>\n&gt; nowhere near what I want to be and I don&#39;t know where to go and what to do<br/>\n&gt; now.<br/>\n&gt;<br/>\n&gt; You say examine old memories with adult awareness ... how? How do I do<br/>\n&gt; this?<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":431583163,"authorName":"Jason & Stephanie","from":"&quot;Jason & Stephanie&quot; &lt;jay_steph93@...&gt;","profile":"mom_to_kbcj","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: help needed with my reaction","postDate":"1285998269","msgId":57583,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUwNTRFQjU1OTEzNDRFNzFCMjQ4QjU1MUYyOEYwRTIwQGd4Mjgwc3NmM2ZjMGZlPg==","referencesHeader":"PGk4NmYwNSttNHZhQGVHcm91cHMuY29tPiA8NjM0MDI5MTAtMUE4My00RDk2LTgwRDQtMThGQzkwRDQ1QjVBQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":57582,"nextInTopic":57584,"prevInTime":57582,"nextInTime":57584,"topicId":57546,"numMessagesInTopic":0,"msgSnippet":"Tonight I was at Publix for 2 items. My son who is 8 and doesn t let me go anywhere without him asked if the deli was still open. It was after 9 and at Kroger","messageBody":"<div id=\"ygrps-yiv-1012133235\">Tonight I was at Publix for 2 items. My son who is 8 and doesn&#39;t let me go anywhere without him asked if the deli was still open. It was after 9 and at Kroger it would be closed. I said I&#39;m not sure but we&#39;ll see.<br/>\n<br/>\nWell I got my items and went to the checkout and in the checkout he asked again because he wanted a cookie.<br/>\n<br/>\nI totally forgot just in those few minutes. I asked the clerk if it was open because he wants a cookie. They told me it was, so after I paid for the items we went to the bakery area. nobody was there, we waited a few minutes, then I went to the deli counter and asked them. They went and got the person at the bakery and gave my son a cookie.<br/>\n<br/>\nIt really was no big deal and only took a few minutes :)<br/>\n<br/>\nStephanie in TN<br/>\n<br/>\nwww.learningthroughliving-stephanie.blogspot.com<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://familyrun.ning.com/profile/Stephanie\">http://familyrun.ning.com/profile/Stephanie</a><br/>\n<br/>\n&quot;Children do not need to be made to learn to be better, told what to do or shown how. If they are given access to enough of the world, they will see clearly enough what things are truly important to themselves and to others, and they will make for themselves a better path into that world then anyone else could make for them.&quot; <br/>\n~John Holt <br/>\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: help needed with my reaction","postDate":"1285998047","msgId":57582,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA3ODU5OEM4LURFQUYtNDZCRS04NTI0LUUwNTg3NjQwOEE4QUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDYzNDAyOTEwLTFBODMtNEQ5Ni04MEQ0LTE4RkM5MEQ0NUI1QUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGk4NmYwNSttNHZhQGVHcm91cHMuY29tPiA8NjM0MDI5MTAtMUE4My00RDk2LTgwRDQtMThGQzkwRDQ1QjVBQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":57581,"nextInTopic":57583,"prevInTime":57581,"nextInTime":57583,"topicId":57546,"numMessagesInTopic":0,"msgSnippet":"It s late and I should be sleeping, so I m not typing well.    I ve repaired that second line. Read a little, try a little, wait a while, watch. You can t","messageBody":"<div id=\"ygrps-yiv-1905060433\">It&#39;s late and I should be sleeping, so I&#39;m not typing well.    I&#39;ve  <br/>\nrepaired that second line.<br/>\n<br/>\n&quot;Read a little, try a little, wait a while, watch.&quot;<br/>\nYou can&#39;t get to it by writing about it.<br/>\n<br/>\n<br/>\n<br/>\nSorry I bungled it the first time.  I hope some of you read through  <br/>\nwithout noticing I was fumble-fingered.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: help needed with my reaction","postDate":"1285997655","msgId":57581,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYzNDAyOTEwLTFBODMtNEQ5Ni04MEQ0LTE4RkM5MEQ0NUI1QUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGk4NmYwNSttNHZhQGVHcm91cHMuY29tPg==","referencesHeader":"PGk4NmYwNSttNHZhQGVHcm91cHMuY29tPg=="},"prevInTopic":57580,"nextInTopic":57582,"prevInTime":57580,"nextInTime":57582,"topicId":57546,"numMessagesInTopic":0,"msgSnippet":"-=-I know adults who are nasty and think everyone owes them something and don t think twice about taking, taking, taking from others. -=- Were they unschooled?","messageBody":"<div id=\"ygrps-yiv-1825864899\">-=-I know adults who are nasty and think everyone owes them something  <br/>\nand don&#39;t think twice about taking, taking, taking from others. -=-<br/>\n<br/>\nWere they unschooled?<br/>\n<br/>\n-=-I know you are right Sandra, I do, but I&#39;m just not sure how to get  <br/>\non the other side of the fence I am on.-=-<br/>\n<br/>\n&quot;Read a little, try a little, wait a while, watch.&quot;<br/>\nYou can&#39;t get to it be writing, about it.  You need to get to it by  <br/>\nmaking choices about interactions with your son.<br/>\n<br/>\nIf you haven&#39;t listened to this talk, it has good examples about  <br/>\nchoices.  It&#39;s at the bottom of this page:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/parentingpeacefully\">http://sandradodd.com/parentingpeacefully</a><br/>\n<br/>\n-=-You say examine old memories with adult awareness ... how? How do I  <br/>\ndo this? -=-<br/>\n<br/>\nGradually.  When a memory comes, try not to go with the emotion of it,  <br/>\nbut with something that could have gone differently.  Just imagine a  <br/>\ntime when you were afraid to ask and think what it might have been  <br/>\nlike if your mom had been different and you had asked and she had said  <br/>\nyes.  That would be enough for one &quot;session.&quot;<br/>\n<br/>\nMaybe think back to what you might know of your mother&#39;s childhood.   <br/>\nWhat if that had been different?  Sometimes just let your mind go to  <br/>\nthat place, but don&#39;t try to stay there and make up a big story, just  <br/>\na little peek, with a &quot;what if&quot; thought.<br/>\n<br/>\n-=-I can&#39;t even begin to tell you the horror that was my childhood.-=-<br/>\n<br/>\nDon&#39;t.  And don&#39;t continue to review it in your mind.  It messed up  <br/>\nyour early life.  Do not allow it to mess up this year, or next year.   <br/>\nDO NOT allowe it to mess up your son&#39;s life.<br/>\n<br/>\n-=- And I can be grateful for that because it led me to unschooling  <br/>\nand to a good relationship with my son now, but I still can&#39;t get over  <br/>\nthat hurdle of the way people TREAT ME and the way people behave  <br/>\naround me.-=-<br/>\n<br/>\nMany children grow up limited and deprived and cannot WAIT for their  <br/>\npromised &quot;turn,&quot; when they finally &quot;can do anything they want to,&quot; and  <br/>\nlike fraternity or military hazing, they turn on their children (or  <br/>\nother people&#39;s children) and limit and deprive them, because it is  <br/>\ntheir turn.  And they accepted the idea that children are and SHOULD  <br/>\nBE powerless, that children are not important, adults are; that  <br/>\nchildren&#39;s desires are not important, adults&#39; are.   And by doing  <br/>\nthat, the cycle is not broken.<br/>\n<br/>\nSomeone has to decide to forego that turn to &quot;be big&quot; at the expense  <br/>\nof younger human beings.    Someone has to NOT do to others as was  <br/>\ndone to her, or that family legacy will continue.<br/>\n<br/>\nIf you want to be different, you can&#39;t keep being the same way.<br/>\n<br/>\nThere are some wonderfully ambiguous lyrics in a song by Sister  <br/>\nHazel.  It was used as the closing song of a movie called Bedazzled,  <br/>\nwhich comes across as a comedy but is one of those rare movies that&#39;s  <br/>\nall about philosophy and spiritual issues.   The chorus is<br/>\n<br/>\nIf you want to be somebody else<br/>\nIf you&#39;re tired of fighting battles with yourself<br/>\nIf you want to be somebody else<br/>\nChange your mind.<br/>\n<br/>\nEither way you interpret the last line makes deep sense.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=Y944YxuE1OU\">http://www.youtube.com/watch?v=Y944YxuE1OU</a><br/>\nI really love that song.<br/>\n<br/>\nSandra</div>","specialLinks":[{"url":"http://www.youtube.com/embed/Y944YxuE1OU?wmode=opaque","type":"VIDEO"}]},{"userId":185586397,"authorName":"lylaw","from":"&quot;lylaw&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: help needed with my reaction","postDate":"1285996951","msgId":57580,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYyQTZBQTM4NDFDNDRGNjlBNzE4NENBOEY1ODc2NDhEQEx5bGFQQz4=","inReplyToHeader":"PGk4NmYwNSttNHZhQGVHcm91cHMuY29tPg==","referencesHeader":"PGk4NmYwNSttNHZhQGVHcm91cHMuY29tPg=="},"prevInTopic":57579,"nextInTopic":57581,"prevInTime":57579,"nextInTime":57581,"topicId":57546,"numMessagesInTopic":0,"msgSnippet":"From: Lisa Sent: Friday, October 01, 2010 10:12 PM To: AlwaysLearning@yahoogroups.com Subject: [AlwaysLearning] Re: help needed with my reaction I am not","messageBody":"<div id=\"ygrps-yiv-1870295133\">From: Lisa <br/>\nSent: Friday, October 01, 2010 10:12 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\nSubject: [AlwaysLearning] Re: help needed with my reaction<br/>\n<br/>\n<br/>\n  <br/>\nI am not stomping my feet. I am trying to understand. How can a child who gets every wish fulfilled if possible, whose parents bend over backwards to try to help them and give them everything they want - how can that child not grow up thinking they are entitled to everything they want, and entitled to have other people get it for them?<br/>\n<br/>\nI know adults who are nasty and think everyone owes them something and don&#39;t think twice about taking, taking, taking from others. How do I know that this is not what my son will end up being like? &gt;&gt;<br/>\n<br/>\n+++++++++++++++++++++++++++++<br/>\n<br/>\nimagine for a moment what those nasty adults with a sense of entitlement likely experienced as children...just sit with it and imagine. is it easier for you to imagine that they had a bounty of their needs met, readily and lovingly, as children, or that they did not - and instead were deprived of even the right to FEEL desires without reprimand...for me it is abundantly obvious that it is the latter.<br/>\n<br/>\nlyla<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":170380942,"authorName":"Lisa","from":"&quot;Lisa&quot; &lt;lisa@...&gt;","profile":"cslisacs","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: help needed with my reaction","postDate":"1285996357","msgId":57579,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk4NmYwNSttNHZhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PERGQTUyRkIxLUIyRkMtNDlBMS05NTgzLTU4MkM1QTExNTY4MUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":57570,"nextInTopic":57580,"prevInTime":57578,"nextInTime":57580,"topicId":57546,"numMessagesInTopic":0,"msgSnippet":"I am not stomping my feet.  I am trying to understand.  How can a child who gets every wish fulfilled if possible, whose parents bend over backwards to try to","messageBody":"<div id=\"ygrps-yiv-445183049\">I am not stomping my feet.  I am trying to understand.  How can a child who gets every wish fulfilled if possible, whose parents bend over backwards to try to help them and give them everything they want - how can that child not grow up thinking they are entitled to everything they want, and entitled to have other people get it for them?<br/>\n<br/>\nI know adults who are nasty and think everyone owes them something and don&#39;t think twice about taking, taking, taking from others.  How do I know that this is not what my son will end up being like? <br/>\n<br/>\nI know you are right Sandra, I do, but I&#39;m just not sure how to get on the other side of the fence I am on.<br/>\n<br/>\nAfter I read my post, I could see that it was more about my response to his response than it was about the lollipop, and that the lollipop could have been a non-issue ....  but I still can&#39;t figure out how to get past that hurdle.<br/>\n<br/>\nMy mom didn&#39;t ever deny me a lollipop, because I wouldn&#39;t have dared to ask for one.  I was downright beaten by mother and step-father until I was bigger than my mom and even after that I was still threatened with extreme physical harm by my step-father who was bigger than me.  <br/>\n<br/>\nI can&#39;t even begin to tell you the horror that was my childhood.  And I can be grateful for that because it led me to unschooling and to a good relationship with my son now, but I still can&#39;t get over that hurdle of the way people TREAT ME and the way people behave around me.<br/>\n<br/>\nI want to be happy and confident too.  And I&#39;m not sure how to get there from here.  I&#39;m a lot happier and a lot more confident than I used to be, but nowhere near what I want to be and I don&#39;t know where to go and what to do now.<br/>\n<br/>\nYou say examine old memories with adult awareness ... how?  How do I do this?</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: help needed with my reaction","postDate":"1285981894","msgId":57570,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERGQTUyRkIxLUIyRkMtNDlBMS05NTgzLTU4MkM1QTExNTY4MUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGk4NXZqOSthcW5sQGVHcm91cHMuY29tPg==","referencesHeader":"PGk4NXZqOSthcW5sQGVHcm91cHMuY29tPg=="},"prevInTopic":57569,"nextInTopic":57579,"prevInTime":57569,"nextInTime":57571,"topicId":57546,"numMessagesInTopic":0,"msgSnippet":"-=-I did not WANT to go in the bank though. I wanted to use the ATM and get him a lolliop somewhere else.-=- It seems you re stamping your feet now because we","messageBody":"<div id=\"ygrps-yiv-1045801064\">-=-I did not WANT to go in the bank though. I wanted to use the ATM  <br/>\nand get him a lolliop somewhere else.-=-<br/>\n<br/>\nIt seems you&#39;re stamping your feet now because we didn&#39;t defend your  <br/>\nstamping your feet that day.<br/>\n<br/>\nThere is always a genetic component in biological children, and  <br/>\npsychologists/psychiatrists have said for 100 years or more that  <br/>\nparents are sometimes sharply bothered by behaviors in their children  <br/>\nthat are the most like their own bad traits.  Partly, and especially  <br/>\nwith unschooling, it could be, it&#39;s because of a deep, subconscious  <br/>\njealousy that our child is getting what we didn&#39;t get, or a vague  <br/>\nearly memory of having gotten in trouble for doing that same thing the  <br/>\nchild is doing.<br/>\n<br/>\nIf your mother EVER said no to you about a lollipop or anything  <br/>\nsimilar, consider that you might not have cleaned early-childhood  <br/>\nhouse, and that&#39;s affecting your happiness and that of your son.  If  <br/>\nso, that&#39;s probably affecting the happiness of your marriage and  <br/>\nlarger family, too.  Each bit of memory you can dredge up, turn over,  <br/>\nand let dry in the sun of adult awareness will clear out space for you  <br/>\nto patient and loving with yourself, your inner child, and your  <br/>\noffspring.<br/>\n<br/>\n-=-Do you guys always do exactly what your children want when they  <br/>\nwant it?-=-<br/>\n<br/>\n&quot;We guys&quot; cannot answer as a group.  For me, I do not now and did not  <br/>\nthen &quot;do exactly what your children want when they want it,&quot; and  <br/>\nunless I&#39;m misreading you, there&#39;s an insult there.  If we say &quot;yes,&quot;  <br/>\nthen we&#39;re something.  Doormats?  Pushovers?  If we say &quot;no,&quot; then you  <br/>\nmight think &quot;WELL then; I was right.&quot;<br/>\n<br/>\nNeither of those is right or good.  Neither extreme is balance.<br/>\n<br/>\n-=-Do you guys always do exactly what your children want when they  <br/>\nwant it?-=-<br/>\n<br/>\nI did when my children were younger and I do now that they are 18, 21  <br/>\nand 24, do what my children want if I can, and as soon as I can, if  <br/>\nit&#39;s something useful, non-harmful, fun and that leads to learning,  <br/>\nespecially.  I *always* pause and make sure I&#39;m not being selfish if I  <br/>\nfeel a whine or objection building up in me.  It took a few years to  <br/>\nget solidly there, but I started intentionally getting there when  <br/>\nKirby was a baby and only child.  If people had fed me the traditional  <br/>\n&quot;they&#39;re just kids; you&#39;re the adult&quot; stuff when they were young, we  <br/>\nwouldn&#39;t have the relationship we have today.<br/>\n<br/>\n-=- Is every request to be fulfilled?-=-<br/>\n<br/>\nIf it&#39;s simple and reasonable, why not?  If you can afford it, why  <br/>\nnot?  A free lollipop would only have cost you time and a little  <br/>\npatience, and it would be good practice for you to do something  <br/>\nselfless that involves patience; it will make it easier the next time,  <br/>\nand even easier the third time, and soon you will lose track of  <br/>\ncounting how many times you were soft and calm and patient.<br/>\n<br/>\n-=- Is there never a time when you say &quot;It would be easier for me to  <br/>\ndo it this way and that&#39;s how I am going to do it&quot; .. ?-=-<br/>\n<br/>\nNever.  Not in those terms.  Not &quot;and that&#39;s how I am going to do  <br/>\nit.&quot;  Not to someone I love.  Not to my husband, not to my kids.  I  <br/>\nmight explain why I think another way would be easier, and because I  <br/>\nhave been patient countless times, they&#39;re very likely to be patient  <br/>\nand accepting (soft and calm and selfless) with me.<br/>\n<br/>\n-=-Also, I think that whining and crying everytime you don&#39;t get your  <br/>\nway and don&#39;t get what you want is behavior that should be discouraged- <br/>\n=-<br/>\n<br/>\nClearly you do.  And you want us all to think so, too, even though our  <br/>\nchildren aren&#39;t whining and crying as much as yours is (possibly).<br/>\n<br/>\n-=-I read stuff from Sandra all the time that says that she  <br/>\ndiscouraged certain behaviour in her children - so where is that line?  <br/>\nHow do I know what behaviors should be discouraged and what behaviours  <br/>\nshouldn&#39;t be so that unschooling can work.-=-<br/>\n<br/>\nIt seems you didn&#39;t really read the other responses.  At the bottom of  <br/>\nthis e-mail in the fine print from yahoo will be a link that says  <br/>\nMessages in this topic.<br/>\nPlease, not for the good of me or the list, but for the good of your  <br/>\nson, read every one of them again slowly, breathing calmly, thinking  <br/>\nperhaps you missed something the first time.  The suggestion was made  <br/>\nseveral times that perhaps you were wrong and your son was right.    <br/>\nWhining and crying is no worse than a mom saying no when a yes was  <br/>\nimmediately at hand.<br/>\n<br/>\nI have and still do &quot;discourage certain behavior&quot; in my children, but  <br/>\nwe have long been at the very-fine-tuning stages of that.<br/>\n<br/>\nThis example is evidence on MY side, though.  Notes below.<br/>\n<br/>\n====================<br/>\n<br/>\nHere is an example. This is a quote from Sandra on a past post. I see  <br/>\nwhining and crying when you don&#39;t get your way right up there with  <br/>\nthrowing a fit when you lose a game or gloating when you win.<br/>\n<br/>\n++++_____++++++ There&#39;s a young adult in my life (friend of my kids,  <br/>\nnot one of mine)<br/>\nand I forgot that I intended to avoid playing with her. She isn&#39;t fun<br/>\nanymore if it looks like she&#39;s not going to win. She&#39;s nowhere near<br/>\nfour years old. I don&#39;t need &quot;creative ways for multiple [people]<br/>\nto win; I need to avoid being at the gaming table with her. Maybe<br/>\nshe&#39;ll change, but I won&#39;t. I don&#39;t like to be made to feel guilty,<br/>\nand I would rather throw the game than deal with a childish<br/>\nreaction. The problem with some people like that is if you throw the<br/>\ngame they get just as angry as if you legitimately win. The only way<br/>\nfor ME to win is either to work hard to win, but lose and accept the<br/>\ngloating.<br/>\n<br/>\nThat behavior should&#39;ve been discouraged years ago, by someone besides<br/>\nme. All I can do is avoid the games.<br/>\n+++++++++++++---------++++++++++<br/>\n<br/>\n================================================<br/>\n<br/>\nThat wasn&#39;t an unschooler.  That wasn&#39;t one of my children.  That is  <br/>\nsomeone who spends more time at my house than at her parents&#39; house.   <br/>\nThat is someone who is not honest with her parents and stopped being  <br/>\nhonest with them a dozen years or more ago.  Her parents tease her and  <br/>\ncriticize her.    I gave that as a bad example.<br/>\n<br/>\nIf you want to continue being critical of your son and defensive of  <br/>\nyour selfish stance, you&#39;re headed toward that girl&#39;s life, not my  <br/>\nchildren&#39;s lives.<br/>\n<br/>\nYour relationship with your son should be more important than which  <br/>\nlollipop is which.  You and he are not the same age.  You don&#39;t have  <br/>\nthe same awareness or responsibility.  If you are a team (which is  <br/>\nwhat you need to work toward for unschooling to work as it&#39;s described  <br/>\non this list), then you *will* do most of the work and the bending and  <br/>\nfetching for a while.  And when he&#39;s older, IF you&#39;re a team, he will  <br/>\nbegin to do more.  If when he gets older you are not a team, it will  <br/>\nbe too late to get him that lollipop when he was seven.<br/>\n<br/>\nIf you re-read the earlier posts in this topic, I think you will see  <br/>\nthose same things said in different ways by other people already.<br/>\n<br/>\nI know there are people on this list who never post here, but do post  <br/>\non another list or two, that they invite people over there when they  <br/>\nare &quot;attacked&quot; here.  So if you consider this an attack on you,  <br/>\nbecause people didn&#39;t sooth and &quot;support,&quot; I have no doubt you will  <br/>\nget a side invitation to another list where they don&#39;t discuss  <br/>\nunschooling so much as they badmouth other people.  I also know many  <br/>\npeople are shocked when they write to a group of women and those women  <br/>\ndon&#39;t commiserate and say &quot;It is SO HARD having kids, isn&#39;t it?  We&#39;re  <br/>\nall doing the best we can.&quot;<br/>\n<br/>\nI have zero interest in investing my time and energy in that, past  <br/>\nthis collection where I put those statements when I find them:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/support\">http://sandradodd.com/support</a><br/>\n<br/>\nThis list exists to support the potential of your son being unschooled  <br/>\nby a happy and confident mom.  We&#39;re on his side.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":170380942,"authorName":"Lisa","from":"&quot;Lisa&quot; &lt;lisa@...&gt;","profile":"cslisacs","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: help needed with my reaction","postDate":"1285980611","msgId":57569,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk4NXZrMyt0ZDl1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk4NDF1bytjYjgxQGVHcm91cHMuY29tPg=="},"prevInTopic":57568,"nextInTopic":57570,"prevInTime":57568,"nextInTime":57570,"topicId":57546,"numMessagesInTopic":0,"msgSnippet":"I appreciate everone s responses, and I know that your responses are true and I know that my attitude needs adjusting also.  However I did not WANT to go in","messageBody":"<div id=\"ygrps-yiv-844460981\">I appreciate everone&#39;s responses, and I know that your responses are true and I know that my attitude needs adjusting also.  However<br/>\n<br/>\nI did not WANT to go in the bank though.  I wanted to use the ATM and get him a lolliop somewhere else.<br/>\n<br/>\nDo you guys always do exactly what your children want when they want it?  Is every request to be fulfilled?  Is there never a time when you say &quot;It would be easier for me to do it this way and that&#39;s how I am going to do it&quot; .. ?<br/>\n<br/>\nAlso, I think that whining and crying everytime you don&#39;t get your way and don&#39;t get what you want is behavior that should be discouraged. <br/>\n<br/>\nI read stuff from Sandra all the time that says that she discouraged certain behaviour in her children - so where is that line?  How do I know what behaviors should be discouraged and what behaviours shouldn&#39;t be so that unschooling can work.<br/>\n<br/>\nHere is an example.  This is a quote from Sandra on a past post.  I see whining and crying when you don&#39;t get your way right up there with throwing a fit when you lose a game or gloating when you win.<br/>\n<br/>\n++++_____++++++  There&#39;s a young adult in my life (friend of my kids, not one of mine)<br/>\nand I forgot that I intended to avoid playing with her. She isn&#39;t fun<br/>\nanymore if it looks like she&#39;s not going to win. She&#39;s nowhere near<br/>\nfour years old. I don&#39;t need &quot;creative ways for multiple [people]<br/>\nto win; I need to avoid being at the gaming table with her. Maybe<br/>\nshe&#39;ll change, but I won&#39;t. I don&#39;t like to be made to feel guilty,<br/>\nand I would rather throw the game than deal with a childish<br/>\nreaction. The problem with some people like that is if you throw the<br/>\ngame they get just as angry as if you legitimately win. The only way<br/>\nfor ME to win is either to work hard to win, but lose and accept the<br/>\ngloating.<br/>\n<br/>\nThat behavior should&#39;ve been discouraged years ago, by someone besides<br/>\nme. All I can do is avoid the games.<br/>\n+++++++++++++---------++++++++++</div>","specialLinks":[]},{"userId":170380942,"authorName":"Lisa","from":"&quot;Lisa&quot; &lt;lisa@...&gt;","profile":"cslisacs","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: help needed with my reaction","postDate":"1285980585","msgId":57568,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk4NXZqOSthcW5sQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk4NDF1bytjYjgxQGVHcm91cHMuY29tPg=="},"prevInTopic":57555,"nextInTopic":57569,"prevInTime":57567,"nextInTime":57569,"topicId":57546,"numMessagesInTopic":0,"msgSnippet":"I appreciate everone s responses, and I know that your responses are true and I know that my attitude needs adjusting also.  However I did not WANT to go in","messageBody":"<div id=\"ygrps-yiv-1195640089\">I appreciate everone&#39;s responses, and I know that your responses are true and I know that my attitude needs adjusting also.  However<br/>\n<br/>\nI did not WANT to go in the bank though.  I wanted to use the ATM and get him a lolliop somewhere else.<br/>\n<br/>\nDo you guys always do exactly what your children want when they want it?  Is every request to be fulfilled?  Is there never a time when you say &quot;It would be easier for me to do it this way and that&#39;s how I am going to do it&quot; .. ?<br/>\n<br/>\nAlso, I think that whining and crying everytime you don&#39;t get your way and don&#39;t get what you want is behavior that should be discouraged. <br/>\n<br/>\nI read stuff from Sandra all the time that says that she discouraged certain behaviour in her children - so where is that line?  How do I know what behaviors should be discouraged and what behaviours shouldn&#39;t be so that unschooling can work.<br/>\n<br/>\nHere is an example.  This is a quote from Sandra on a past post.  I see whining and crying when you don&#39;t get your way right up there with throwing a fit when you lose a game or gloating when you win.<br/>\n<br/>\n++++_____++++++  There&#39;s a young adult in my life (friend of my kids, not one of mine)<br/>\nand I forgot that I intended to avoid playing with her. She isn&#39;t fun<br/>\nanymore if it looks like she&#39;s not going to win. She&#39;s nowhere near<br/>\nfour years old. I don&#39;t need &quot;creative ways for multiple [people]<br/>\nto win; I need to avoid being at the gaming table with her. Maybe<br/>\nshe&#39;ll change, but I won&#39;t. I don&#39;t like to be made to feel guilty,<br/>\nand I would rather throw the game than deal with a childish<br/>\nreaction. The problem with some people like that is if you throw the<br/>\ngame they get just as angry as if you legitimately win. The only way<br/>\nfor ME to win is either to work hard to win, but lose and accept the<br/>\ngloating.<br/>\n<br/>\nThat behavior should&#39;ve been discouraged years ago, by someone besides<br/>\nme. All I can do is avoid the games.<br/>\n+++++++++++++---------++++++++++</div>","specialLinks":[]},{"userId":458624268,"authorName":"dola dasgupta-banerji","from":"dola dasgupta-banerji &lt;doladg@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] help needed with my reaction","postDate":"1285949108","msgId":57555,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGluaUxaS3FZb1g4RTRyMXNSaG94UmdwZzdaVXg1cEdpQVdhWmY3U0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGk4NDF1bytjYjgxQGVHcm91cHMuY29tPg==","referencesHeader":"PGk4NDF1bytjYjgxQGVHcm91cHMuY29tPg=="},"prevInTopic":57553,"nextInTopic":57568,"prevInTime":57554,"nextInTime":57556,"topicId":57546,"numMessagesInTopic":0,"msgSnippet":"***********I get a bit irritated when he doesn t trust me to help get him what he wants. His knee-jerk reaction is to cry and maybe whine.*********** I like to","messageBody":"<div id=\"ygrps-yiv-1144788315\">***********I get a bit irritated when he doesn&#39;t trust me to help get him<br/>\nwhat he wants. His knee-jerk reaction is to cry and maybe whine.***********<br/>\n<br/>\n<br/>\nI like to share something about this trust thing. Long before I became a<br/>\nunschooling parent I was a regular &quot;control freak always saying NO first&quot;<br/>\nparent. My daughter who is now 9 years old faced my ugly parenting for<br/>\nalmost four years. It has been five years since I have been changing my ways<br/>\nand always try to say and do affirmative things and avoid &quot;NO&quot;.<br/>\n<br/>\nYet the reaction &quot;NO&quot; is so damaging that even today I see her hesitating<br/>\nbefore asking for something as simple as an ice cream.  It shatters my heart<br/>\nto look at her face.<br/>\n<br/>\nThe power of NO is very hard to wear off. But if we practice YES, the child<br/>\nbecomes self assured, confident and secure human being.<br/>\n<br/>\nThe choice is for you to make. YES or NO.<br/>\n<br/>\nFor older kids you can try and say &quot;sure baby I will get it for you or do it<br/>\nfor you, but it would be great if we could wait till....&quot;<br/>\n<br/>\nBut to get there, try and say YES as much as you can now.....<br/>\n<br/>\nDola<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Fri, Oct 1, 2010 at 12:47 PM, Lisa &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lisa@...\">lisa@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; My son is 7.<br/>\n&gt;<br/>\n&gt; So, today at the bank, I was just doing an atm withdrawal and I didn&#39;t need<br/>\n&gt; to go inside. My son said he wanted a lollipop. I said that I didn&#39;t have<br/>\n&gt; anything to go inside for and I offered him the lollipop I had in my bag.<br/>\n&gt;<br/>\n&gt; He didn&#39;t like the flavor and was a little nasty about it. Like I was<br/>\n&gt; offering him something yucky.<br/>\n&gt;<br/>\n&gt; I offered to take him home and get a lollipop. He said he didn&#39;t want to go<br/>\n&gt; home. I thought in my head &quot;how can I get him a lollipop?&quot; and while I was<br/>\n&gt; thinking this, he starts whining and crying.<br/>\n&gt;<br/>\n&gt; I&#39;ll be honest with you. I don&#39;t like the whining, I don&#39;t like the<br/>\n&gt; crying, and I get a bit irritated when he doesn&#39;t trust me to help get him<br/>\n&gt; what he wants. His knee-jerk reaction is to cry and maybe whine.<br/>\n&gt;<br/>\n&gt; I responded in an angry way that I&#39;d rather not repeat, but I&#39;m at a loss<br/>\n&gt; as for what to replace it with and I would really appreciate your views.<br/>\n&gt;<br/>\n&gt; thank you. Lisa<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] help needed with my reaction","postDate":"1285944074","msgId":57553,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJEOTM2NzAyLTgzNEUtNDdDOC1CRTgyLUQ1NUY2RDgxNTNCNEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDM5QUQyQzQzLTQyQjQtNDgzQS1CMEY1LThBRTIxMzUzMkI5NkB2ZXJpem9uLm5ldD4=","referencesHeader":"PGk4NDF1bytjYjgxQGVHcm91cHMuY29tPiA8MzlBRDJDNDMtNDJCNC00ODNBLUIwRjUtOEFFMjEzNTMyQjk2QHZlcml6b24ubmV0Pg=="},"prevInTopic":57552,"nextInTopic":57555,"prevInTime":57552,"nextInTime":57554,"topicId":57546,"numMessagesInTopic":0,"msgSnippet":"-=- I ll be honest with you. I don t like the whining, I don t like the ... I missed that little detail in the first reading. I get a bit irritated when he","messageBody":"<div id=\"ygrps-yiv-1134560016\">-=-&gt; I&#39;ll be honest with you. I don&#39;t like the whining, I don&#39;t like the<br/>\n<blockquote><span title=\"ireply\">  &gt; crying, and I get a bit irritated when he doesn&#39;t trust me to help<br/>\n &gt; get him what he wants.-=-<br/>\n<br/>\n </span></blockquote>I missed that little detail in the first reading.<br/>\n<br/>\n&quot;I get a bit irritated when he doesn&#39;t trust me to help get him what  <br/>\nhe wants.&quot;<br/>\n<br/>\nYou just explained to us that you did NOT help him get what he wanted-- <br/>\na lollipop from the bank. And you were still (I presume) right outside  <br/>\nthe bank, or in the parking lot.<br/>\nPerhaps you have defined your actions in ways that protect your own  <br/>\nfeelings, at the expense of your child&#39;s feelings.   You were right,  <br/>\nand he should have trusted that you DO help him get what he wants, you  <br/>\nseem to be saying.<br/>\n<br/>\nBut the story itself, as you told it, showed that you were not  <br/>\ntrustworthy, and should not have been irritated with him.<br/>\n<br/>\nWhat it shows is a lack of partnership.  Antagonism was there.  You  <br/>\nwere irritated.  He was MORE irritated.  Your team lost.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/partners/child\">http://sandradodd.com/partners/child</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] help needed with my reaction","postDate":"1285942789","msgId":57552,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA3QzFCQzI0LUQ3MjAtNDI2RS1BM0IwLTFDQzU5QUE0NDU1OEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGk4NDF1bytjYjgxQGVHcm91cHMuY29tPg==","referencesHeader":"PGk4NDF1bytjYjgxQGVHcm91cHMuY29tPg=="},"prevInTopic":57551,"nextInTopic":57553,"prevInTime":57551,"nextInTime":57553,"topicId":57546,"numMessagesInTopic":0,"msgSnippet":"-=-I thought in my head how can I get him a lollipop? and while I was thinking this, he starts whining and crying.-=- You could have taken him into the bank,","messageBody":"<div id=\"ygrps-yiv-41129538\">-=-I thought in my head &quot;how can I get him a lollipop?&quot; and while I  <br/>\nwas thinking this, he starts whining and crying.-=-<br/>\n<br/>\nYou could have taken him into the bank, if they have lollipops, and  <br/>\nasked for one.<br/>\n<br/>\n-=-So, today at the bank, I was just doing an atm withdrawal and I  <br/>\ndidn&#39;t need to go inside. My son said he wanted a lollipop. I said  <br/>\nthat I didn&#39;t have anything to go inside for and I offered him the  <br/>\nlollipop I had in my bag. -=-<br/>\n<br/>\nYou could have gone inside for a lollipop.<br/>\nIf there was a drive-through, maybe you could have used that instead  <br/>\nof the ATM, and asked for a lollipop there.<br/>\n<br/>\nIf you were outside a place that sold cold drinks and you wanted one,  <br/>\nand your husband or friend (that would be soon-to-be-EX-friend, I  <br/>\nthink) offered you a bottle of warm water that was already in the car,  <br/>\nor an old half a bottle of juice or soda from their backpack, I don&#39;t  <br/>\nthink you would feel loved.  You might even whine and cry.  But you  <br/>\nwould be old enough to get out of the car and go in and get your own  <br/>\ncold drink.  Your son is not, yet.<br/>\n<br/>\nYou asked for help with your reaction, but I think backing up more to  <br/>\nyour action (which would have prevented your child&#39;s reaction AND your  <br/>\nreaction) is more important.<br/>\n<br/>\nVery often people come to discussions such as this one asking what to  <br/>\ndo in response to a child&#39;s unreasonable actions, but seen in the  <br/>\nlight of radical unschooling, the child&#39;s actions were perfectly  <br/>\nsensible responses to something arbitrary the parent was trying to  <br/>\nenforce for leftover reasons.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] help needed with my reaction","postDate":"1285937702","msgId":57551,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5QUQyQzQzLTQyQjQtNDgzQS1CMEY1LThBRTIxMzUzMkI5NkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGk4NDF1bytjYjgxQGVHcm91cHMuY29tPg==","referencesHeader":"PGk4NDF1bytjYjgxQGVHcm91cHMuY29tPg=="},"prevInTopic":57550,"nextInTopic":57552,"prevInTime":57550,"nextInTime":57552,"topicId":57546,"numMessagesInTopic":0,"msgSnippet":"... They ll give you a lollipop even if you aren t using their lines. Even, I d bet, if you aren t a customer of theirs. (Can you imagine a bank with a policy","messageBody":"<div id=\"ygrps-yiv-1171406820\">On Oct 1, 2010, at 3:17 AM, Lisa wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So, today at the bank, I was just doing an atm withdrawal and I  <br/>\n&gt; didn&#39;t need to go inside. My son said he wanted a lollipop. I said  <br/>\n&gt; that I didn&#39;t have anything to go inside for and I offered him the  <br/>\n&gt; lollipop I had in my bag.<br/>\n<br/>\n </span></blockquote>They&#39;ll give you a lollipop even if you aren&#39;t using their lines.  <br/>\nEven, I&#39;d bet, if you aren&#39;t a customer of theirs. (Can you imagine a  <br/>\nbank with a policy that might turn away potential customers over the  <br/>\nprice of a lollipop?)<br/>\n<br/>\nI&#39;m suspecting he didn&#39;t so much need a lollipop as the bank brought  <br/>\nit to mind. Haven&#39;t you ever wanted something special as part of an  <br/>\nevent or part of a routine?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m at a loss as for what to replace it with and I would really  <br/>\n&gt; appreciate your views.<br/>\n<br/>\n<br/>\n </span></blockquote>Try seeing him as helpless. (Which he is.) Nearly everything he wants  <br/>\nand needs he has to go through you. He&#39;s wants and needs are at the  <br/>\nmercy of your decision. You might decide it&#39;s too much trouble. You  <br/>\nmight decide he doesn&#39;t need it. You might decide it&#39;s inconvenient  <br/>\nright now and he has to wait. You might decide it&#39;s too expensive.<br/>\n<br/>\nPicture living your life like that. Everything you want and need, is  <br/>\nat the mercy of your husband&#39;s decision. And sometimes his decisions  <br/>\nand explanations don&#39;t make much sense to you. (I&#39;m sure your son  <br/>\ncouldn&#39;t imagine a reason you couldn&#39;t walk into the bank and ask for  <br/>\na lollipop like you&#39;ve done before.)<br/>\n<br/>\nThe more generous you are with your time and effort now, the more  <br/>\ngenerous your son will be when you&#39;re old and confined to bed at the  <br/>\nmercy of other&#39;s compassionate willingness to make their life more  <br/>\ndifficult to make your life a little easier! ;-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;ll be honest with you. I don&#39;t like the whining, I don&#39;t like the<br/>\n&gt; crying, and I get a bit irritated when he doesn&#39;t trust me to help  <br/>\n&gt; get him what he wants.<br/>\n<br/>\n </span></blockquote>See kids reactions as communication. *You* think you&#39;re trustworthy to  <br/>\nmeet his needs but he doesn&#39;t and he&#39;s going to respond to *his*  <br/>\nperception of the world not to your intentions. The whining is his way  <br/>\nof trying to meet his need since you can&#39;t (yet) be trusted.<br/>\n<br/>\nIt&#39;s not a good way! It&#39;s undoubtedly often counterproductive for him!  <br/>\nBut instead of seeing him as deliberately using a tool you dont&#39; like,  <br/>\nsee him as needing help. Trust that he&#39;s doing the best he can with  <br/>\nthe tools and understanding of the world he has and he needs help  <br/>\ngetting his needs met.<br/>\n<br/>\nRather than trying to pry that tool out of his hands and forcibly  <br/>\nreplace it with someone else, you use a better tool. (Though first,  <br/>\nsee what you can do to anticipate his needs and respond in a way that  <br/>\nearns his trust so he doesn&#39;t need to resort to the tool.)<br/>\n<br/>\nSome kids do whine. And if you are working hard at meeting his needs,  <br/>\n*then* you can say &quot;I can&#39;t understand you. If you speak calmly I can  <br/>\nhelp you better.&quot; (Make it about you meeting his needs rather than  <br/>\nabout him meeting your needs to not hear whining.)<br/>\n<br/>\nAnd often when kids are at their worst, what they need most is a  <br/>\nhug. :-)<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":321729783,"authorName":"Angela Shaw","from":"&quot;Angela Shaw&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] help needed with my reaction","postDate":"1285935541","msgId":57550,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzMwMWNiNjE2MiRkNTJlNmQzMCQ3ZjhiNDc5MCRAY29tPg==","inReplyToHeader":"PDRDQTU4RkZCLjYwMzA0MDhAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PGk4NDF1bytjYjgxQGVHcm91cHMuY29tPiA8NENBNThGRkIuNjAzMDQwOEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":57549,"nextInTopic":57551,"prevInTime":57549,"nextInTime":57551,"topicId":57546,"numMessagesInTopic":0,"msgSnippet":"You could go in the bank and have him ask a teller nicely if he could have a lollipop.  I know you have no business inside the bank but I don t think they","messageBody":"<div id=\"ygrps-yiv-398664034\">You could go in the bank and have him ask a teller nicely if he could have a<br/>\nlollipop.  I know you have no business inside the bank but I don&#39;t think<br/>\nthey would mind.  They would probably think it&#39;s cute.  I learned over time<br/>\nto go outside my comfort zone to make my kids happy if it didn&#39;t hurt anyone<br/>\nelse.  You are a member of that bank and they do give them out for free.<br/>\nYou could say something light, like, My son wants to know if he still gets a<br/>\nfree lollipop when we use the atm?  And smile.  I&#39;m sure they&#39;d give it to<br/>\nyou.<br/>\n<br/>\n <br/>\n<br/>\nBut honestly, I don&#39;t like whining either.  When my kids were little, I&#39;d<br/>\nask them to rephrase it without whining  if I knew that I&#39;d be feeling<br/>\nresentment at doing something.  I was up front with them and just stated it<br/>\nlike a fact.when you ask me in that voice, it doesn&#39;t make me want to get it<br/>\nfor you.  I&#39;d be happy to get it for you if you ask me in a nice voice.<br/>\nWhen I was matter of fact about it, it didn&#39;t escalate things and it didn&#39;t<br/>\ntake long at all before they knew that if they asked nicely, I&#39;d do my best<br/>\nto find a way to get them what they wanted.<br/>\n<br/>\n <br/>\n<br/>\nBut it was that trust that really made the difference.  Once they KNEW that<br/>\nI always tried to find a way to meet their needs, they became less needy and<br/>\nless whiney.<br/>\n<br/>\n <br/>\n<br/>\nAngela<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] help needed with my reaction","postDate":"1285918715","msgId":57547,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDQTU4RkZCLjYwMzA0MDhAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PGk4NDF1bytjYjgxQGVHcm91cHMuY29tPg==","referencesHeader":"PGk4NDF1bytjYjgxQGVHcm91cHMuY29tPg=="},"prevInTopic":57546,"nextInTopic":57549,"prevInTime":57546,"nextInTime":57548,"topicId":57546,"numMessagesInTopic":0,"msgSnippet":"... Maybe I am missing something? Why couldn t you go inside and get him a lollipop? (I m assuming they give them away in there and he knew it, right?) -pam","messageBody":"<div id=\"ygrps-yiv-507968773\">On 10/1/2010 12:17 AM, Lisa wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; So, today at the bank, I was just doing an atm withdrawal and I didn&#39;t <br/>\n&gt; need to go inside. My son said he wanted a lollipop. I said that I <br/>\n&gt; didn&#39;t have anything to go inside for and I offered him the lollipop I <br/>\n&gt; had in my bag.<br/>\n<br/>\n </span></blockquote>Maybe I am missing something? Why couldn&#39;t you go inside and get him a <br/>\nlollipop? (I&#39;m assuming they give them away in there and he knew it, right?)<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":185586397,"authorName":"lylaw","from":"&quot;lylaw&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] help needed with my reaction","postDate":"1285918658","msgId":57549,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk2QzMyODRCMTQ1NDQzQTg4NkMzM0FEMjM5OTM4MkRGQEx5bGFQQz4=","inReplyToHeader":"PGk4NDF1bytjYjgxQGVHcm91cHMuY29tPg==","referencesHeader":"PGk4NDF1bytjYjgxQGVHcm91cHMuY29tPg=="},"prevInTopic":57547,"nextInTopic":57550,"prevInTime":57548,"nextInTime":57550,"topicId":57546,"numMessagesInTopic":0,"msgSnippet":"I am confused by why you d have found it easier to go home than to go inside the bank to get him a lollypop?  also, if he whines and cries and  doesn t trust","messageBody":"<div id=\"ygrps-yiv-796685419\">I am confused by why you&#39;d have found it easier to go home than to go inside the bank to get him a lollypop?  also, if he whines and cries and  doesn&#39;t trust that you will help him, you might examine *that* - take it as communication of something...maybe next time, instead of *thinking* &quot;how can I get him a lollypop&quot;  - SAY it out loud   then he will know for certain you want to help.  <br/>\nwhat did you feel angry about specifically?  it can help to deconstruct your thought patterns and identify what was pushing your buttons.  what were you telling yourself about his whining or about his wanting a lollypop?<br/>\n<br/>\nlyla<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":170380942,"authorName":"Lisa","from":"&quot;Lisa&quot; &lt;lisa@...&gt;","profile":"cslisacs","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"help needed with my reaction","postDate":"1285917464","msgId":57546,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk4NDF1bytjYjgxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":57547,"prevInTime":57545,"nextInTime":57547,"topicId":57546,"numMessagesInTopic":0,"msgSnippet":"My son is 7. So, today at the bank, I was just doing an atm withdrawal and I didn t need to go inside.  My son said he wanted a lollipop.  I said that I didn t","messageBody":"<div id=\"ygrps-yiv-1048026255\">My son is 7.  <br/>\n<br/>\nSo, today at the bank, I was just doing an atm withdrawal and I didn&#39;t need to go inside.  My son said he wanted a lollipop.  I said that I didn&#39;t have anything to go inside for and I offered him the lollipop I had in my bag.  <br/>\n<br/>\nHe didn&#39;t like the flavor and was a little nasty about it.  Like I was offering him something yucky.<br/>\n<br/>\nI offered to take him home and get a lollipop.  He said he didn&#39;t want to go home.  I thought in my head &quot;how can I get him a lollipop?&quot; and while I was thinking this, he starts whining and crying.<br/>\n<br/>\nI&#39;ll be honest with you.  I don&#39;t like the whining, I don&#39;t like the <br/>\ncrying, and I get a bit irritated when he doesn&#39;t trust me to help get him what he wants.  His knee-jerk reaction is to cry and maybe whine.<br/>\n<br/>\nI responded in an angry way that I&#39;d rather not repeat, but I&#39;m at a loss as for what to replace it with and I would really appreciate your views. <br/>\n<br/>\nthank you.  Lisa</div>","specialLinks":[]}],"prevTopicId":57508,"nextTopicId":57677}}