{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] is it ok to persuade/motivate/convince?","postDate":"1456506132","msgId":76792,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMzNzEyRjU1LThEQ0EtNEI3NS1BMjFCLTMzMjMzNjJERUQ5NUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDE5NUIyRTUzLUYwMjctNEIxMC05RDFELTJGQkQ2Rjc0QjcxMEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PG5haTcwcyttMmdkOGdAWWFob29Hcm91cHMuY29tPiA8MTk1QjJFNTMtRjAyNy00QjEwLTlEMUQtMkZCRDZGNzRCNzEwQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":76791,"nextInTopic":0,"prevInTime":76791,"nextInTime":76793,"topicId":76790,"numMessagesInTopic":0,"msgSnippet":"DOH!  Sorry.  A correction. I meant to write deschool, not unschooling here: -=-Until you step away from the school, you can’t begin to unschool yourself.","messageBody":"<div id=\"ygrps-yiv-1842260813\">DOH!  Sorry.  A correction.<br/>\n<br/>\nI meant to write deschool, not unschooling here:<br/>\n<br/>\n-=-Until you step away from the school, you can’t begin to unschool yourself. That will take over a year. Maybe over two years, if you have university and teaching and child-in-school years from which you’ll need to recover. -=-<br/>\n<br/>\nI meant Until you step away from the school, you can’t begin to deschool yourself. <br/>\nI hope most readers translated that in their minds. :-)<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] is it ok to persuade/motivate/convince?","postDate":"1456502094","msgId":76791,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5NUIyRTUzLUYwMjctNEIxMC05RDFELTJGQkQ2Rjc0QjcxMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PG5haTcwcyttMmdkOGdAWWFob29Hcm91cHMuY29tPg==","referencesHeader":"PG5haTcwcyttMmdkOGdAWWFob29Hcm91cHMuY29tPg=="},"prevInTopic":76790,"nextInTopic":76792,"prevInTime":76790,"nextInTime":76792,"topicId":76790,"numMessagesInTopic":0,"msgSnippet":"-=-is it ok to persuade/motivate/convince?-=- Yes. But your daughter is in school, and so your question is not really about unschooling. If you came here for","messageBody":"<div id=\"ygrps-yiv-1689028131\">-=-is it ok to persuade/motivate/convince?-=-<br/>\n<br/>\nYes.<br/>\n<br/>\nBut your daughter is in school, and so your question is not really about unschooling.<br/>\n<br/>\nIf you came here for unschoolers to tell you that it’s okay to persuade her to stay in school, that’s a misuse of the discussion.  Sorry.  We’re not here to help you feel better about keeping her in school.<br/>\n<br/>\n-=-We are new to unschooling and are slowly finding our way into it.-=-<br/>\n<br/>\nUntil you step away from the school, you can’t begin to unschool yourself. That will take over a year.  Maybe over two years, if you have university and teaching and child-in-school years from which you’ll need to recover. <br/>\n<br/>\n-=- I feel that and at the same time I wonder if she is doing herself a disservice by choosing what is most comfortable at the moment: Staying home, in pajamas and watching movies instead of getting dressed and going out in the cool winter air. So she basically deprives herself of the playtime she could have every day in favor of comfort in the moment.-=-<br/>\n<br/>\nYou’re blaming her for depriving herself.  You say she has choices, but you’re critical of one of your daughters for doing the other one a disservice.  See her as whole.  <br/>\n<br/>\nIf she’s going to stay in school to play with friends, she won’t be able to stay home when she wants to (unless she’s in an expensive private school and you’ve made that deal with them—and not all school would go along with it).  If you don’t plan to enroll her in school when it becomes compulsory, it would probably be easier for her NOT to finish the school year.  The end of the year is much about how cool school will be the next year.  It nearly sets up an obligation, all that hype.  And the government likely has another obligation behind it (depending where you live).<br/>\n<br/>\n-=-she does not want to go to pre-school any more-=-<br/>\n-=-When she goes to bed at night she announces, she is not going tomorrow. In the morning, she repeats her statement.-=-<br/>\n<br/>\nIf you don’t listen to her clear, verbal messages, how will she learn to trust you in the future?<br/>\n<br/>\n-=- Sometimes &#39;show and tell&#39; at school motivates her to go.-=-<br/>\nWRONG!  You’re being dishonest with yourself, which will muddle your thinking horribly.<br/>\nShow and tell has never woken her up gently in the morning and asked her to please come to school for show and tell.<br/>\n<br/>\nYOU used show and tell to motivate her to go.<br/>\n<br/>\n -=-But most mornings are exhausting for the whole family. -=-<br/>\n<br/>\nThat should not be blamed on your daughter, who told you before she went to sleep that she didn’t want to go to school.  You woke her up anyway.  <br/>\n<br/>\n-=-is it ok to persuade/motivate/convince?-=-<br/>\n<br/>\nYes.  In an unschooling context, within a partnership with your child, persuasion isn’t terrible.  My husband and I persuade, motivate and convince each other.  Now that my kids are grown, they persuade, motivate and convince me of things—but always because they love me and care about me.  Not to limit me or stop me or to ignore me.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":576697157,"authorName":"","from":"katja.bostock@...","profile":"katja.bostock","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"is it ok to persuade/motivate/convince?","postDate":"1456250716","msgId":76790,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PG5haTcwcyttMmdkOGdAWWFob29Hcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":76791,"prevInTime":76789,"nextInTime":76791,"topicId":76790,"numMessagesInTopic":0,"msgSnippet":"My daughter (5) is currently enrolled in Pre-school She used to ask for a play date the minute I picked her up from pre-school, so we decided to enroll her for","messageBody":"<div id=\"ygrps-yiv-1103454139\"><p><span>My daughter (5) is currently enrolled in Pre-school&nbsp;</span></p><p><span><br></span></p><p><span>She used to ask for a play date the minute I picked her up from pre-school, so we decided to enroll her for the afternoons also. Hoping, she can get her fill of being with children that way.&nbsp;</span></p><p><span><br></span></p><p>We are new to unschooling and are slowly finding our way into it. Based on that, we relaxed around &#39;watching movies&#39; - which used to always be a heated one. Every time my daughter is finishing something, like her meal or coming home from pre-school, she asks for a movie. So for about 2 months now, I started responding: sure! and made sure to get her access immediately. Since then she has spent days with the iPad, watching cute little movies on amazon prime or kids youtube. She is free to chose and I join her often to give her company and support her interests.&nbsp;</p><p><br></p><p>Well, now, she does not want to go to pre-school any more. When she goes to bed at night she announces, she is not going tomorrow. In the morning, she repeats her statement. Sometimes &#39;show and tell&#39; at school motivates her to go. But most mornings are exhausting for the whole family. We then decided, about 2 weeks ago, that there is really no point in persuading her to do a fun thing - go to pre-school and play with her friends. If she really doesn&#39;t like it, she can stay home. Since, she has barely been to pre-school. But when she does go, she tells me at pick-up that she had a great day and loved it.&nbsp;</p><p><br></p><p>My question: I felt a lot more peace in our home since letting her watch movies and opt out of school. Our relationship is so much better when she stays home. I feel that and at the same time I wonder if she is doing herself a disservice by choosing what is most comfortable at the moment: Staying home, in pajamas and watching movies instead of getting dressed and going out in the cool winter air. So she basically deprives herself of the playtime she could have every day in favor of comfort in the moment.</p><p><br></p><p>Do I support her in her preference to stay home or persuade her so she can have the great day at school?</p><p><br></p><p>This is just one example - my daughter also says &#39;no&#39; to ice skating, snow skiing, ...</p></div>","specialLinks":[]}],"prevTopicId":76772,"nextTopicId":2371}}