{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] My $2.00 worth..","postDate":"1040046916","msgId":51765,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBMjM0NTc0LjEwQjA3JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGF0aWUwbytrdDIzQGVHcm91cHMuY29tPg=="},"prevInTopic":51752,"nextInTopic":0,"prevInTime":51764,"nextInTime":51766,"topicId":51609,"numMessagesInTopic":0,"msgSnippet":"... Time. Or no one has anything useful to comment on. Generally if no one responds then they re either nodding in agreement or they have no clue. Or it may be","messageBody":"<div id=\"ygrps-yiv-174559341\">on 12/15/02 12:26 PM, jaeschool &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:grlynbl@...\">grlynbl@...</a>&gt; at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:grlynbl@...\">grlynbl@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am curious as to why no one replied to my response.   I have<br/>\n&gt; replied to many posts and they are basically ignored or only a minute<br/>\n&gt; part of them responded to..<br/>\n<br/>\n </span></blockquote>Time. Or no one has anything useful to comment on. Generally if no one<br/>\nresponds then they&#39;re either nodding in agreement or they have no clue.<br/>\n<br/>\nOr it may be a matter of thinking you&#39;re asking questions when you&#39;re really<br/>\nmaking statements. (I didn&#39;t go back to check so I don&#39;t know.) If it<br/>\nhappens a lot, then it&#39;s worth wondering if you&#39;re not being read the way<br/>\nyou intend.<br/>\n<br/>\nFrom a certain perspective the list may seem like a big party or an<br/>\nafternoon let&#39;s-all-kick-back-and-chat get together. That sets up<br/>\nexpectations of &quot;Welcome!&quot;s and nods and smiles and pats on the back and<br/>\n&quot;Would you like some cookies?&quot; and other feedback that we&#39;re welcome and<br/>\nothers are listening to what we&#39;re saying that we&#39;d normally get from that<br/>\ntype of gathering. (And cheery chit chat between people who&#39;ve met people<br/>\nhere they&#39;ve come to feel are friends probably reinforces that.) But those<br/>\nare false expectations. The list isn&#39;t a tea party gathering of people who<br/>\ncall themselves unschoolers or wannabe unschoolers. It&#39;s a discussion list<br/>\nspecifically about unschooling.<br/>\n<br/>\nSome people do find this list a place to kick back because they share or are<br/>\ndrawn to the ideas they read about here. That&#39;s just a side effect. It&#39;s<br/>\njust a consequence of sharing the ideals of the place you happen to be in.<br/>\nBut creating that kick-back feeling isn&#39;t the goal of this list and it<br/>\ndoesn&#39;t try to be that. It&#39;s a place for discussing the unschooling<br/>\nphilosophy. If soemone is looking for a place to kick back then, unless they<br/>\nare drawn to the type of unschooling ideas expressed here, they would<br/>\nprobably find other lists an easier fit.<br/>\n<br/>\nThat&#39;s not telling anyone to get out. It&#39;s suggesting people examine what it<br/>\nis they want from a list and not just assume everyone wants the same and<br/>\nthat every list offers it.<br/>\n<br/>\nIf you want to discuss the unschooling philsophy, this is a really great<br/>\nplace for it :-) If you want to know more about extending the unschooling<br/>\nphilosophy into parenting it&#39;s also a great place. Some people may find<br/>\nother things here that the list wasn&#39;t designed for but the list can&#39;t be<br/>\nfaulted for not being something that it doesn&#39;t intend to be.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] My $2.00 worth..","postDate":"1040044003","msgId":51752,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBMjMzQTEyLjEwQUU0JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGF0aWUwbytrdDIzQGVHcm91cHMuY29tPg=="},"prevInTopic":51750,"nextInTopic":51765,"prevInTime":51751,"nextInTime":51753,"topicId":51609,"numMessagesInTopic":0,"msgSnippet":"... I think it usually means having goals that differ. We tend to assume we all have the same goals -- what s best for our kids -- but what we really mean by","messageBody":"<div id=\"ygrps-yiv-922457144\">on 12/15/02 12:26 PM, jaeschool &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:grlynbl@...\">grlynbl@...</a>&gt; at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:grlynbl@...\">grlynbl@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;Distruptive and defensive&quot; seems to be defined and not agreeing 100%<br/>\n&gt; with what some others practice..  Also, defending our own practices<br/>\n&gt; when we are judged harshly for them.  There IS a double standard<br/>\n&gt; here.. Its so easy to see when reading through the posts.<br/>\n<br/>\n </span></blockquote>I think it usually means having goals that differ. We tend to assume we all<br/>\nhave the same goals -- what&#39;s best for our kids -- but what we really mean<br/>\nby that isn&#39;t the same across the board. And sometimes if we talk about our<br/>\ngoals we&#39;d agree we had the same but we&#39;re actually not prioritizing them<br/>\nthe same way.<br/>\n<br/>\nThough I don&#39;t doubt that most parents would say their relationship with<br/>\ntheir children was paramount, that really isn&#39;t true in practice because we<br/>\nstrain it everytime we override what they want for what we want. (And, no,<br/>\nthe other option isn&#39;t their overriding what we want for what they want!) We<br/>\ncan justify those times! so it seems like those are just exceptions to the<br/>\nrule. But the parents who really do put relationshps first can offer good<br/>\nadvice on how we don&#39;t have to sacrifice relationships and how to build even<br/>\nbetter ones.<br/>\n<br/>\nSo if people want the list to be about sharing practices then they&#39;re going<br/>\nto have a hard time here because people will persist in talking about<br/>\nprinciples behind our practices. That&#39;s what&#39;s really valuable about this<br/>\nlist. &quot;What works&quot; isn&#39;t good enough. It&#39;s the principles behind what works.<br/>\nIt&#39;s digging deep to see the relationships and how things look from kid<br/>\npoints of view. It seeing what the consequences are of that kid perception<br/>\nand ways to avoid those problems.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] My $2.00 worth..","postDate":"1040043400","msgId":51750,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBMjMzN0I4LjEwQUUzJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGF0aWUwbytrdDIzQGVHcm91cHMuY29tPg=="},"prevInTopic":51747,"nextInTopic":51752,"prevInTime":51749,"nextInTime":51751,"topicId":51609,"numMessagesInTopic":0,"msgSnippet":"... This comes from perceiving that people are saying Give your kids everything they want. But we re saying help them figure out what they want and help them","messageBody":"<div id=\"ygrps-yiv-54782772\">on 12/15/02 12:26 PM, jaeschool &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:grlynbl@...\">grlynbl@...</a>&gt; at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:grlynbl@...\">grlynbl@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My children want a lot that I cant give them.. My son wants a go cart<br/>\n&gt; for Christmas.   Even if it was within my means, I wouldnt get him<br/>\n&gt; one because I know that he is implusive and does not have the skills<br/>\n&gt; to be safe on a go cart.<br/>\n<br/>\n </span></blockquote>This comes from perceiving that people are saying &quot;Give your kids everything<br/>\nthey want.&quot; But we&#39;re saying help them figure out what they want and help<br/>\nthem figure out ways to get it. If we become the locked door that stands<br/>\nbetween them and what they want, the only option we&#39;re giving them is to<br/>\npush against us or sneak around us. If we stand beside them and help them<br/>\nfigure out how they can get from where they are to where they want to be,<br/>\nthen we become their partner.<br/>\n<br/>\nWould your rather be a door or a partner? The people who perceive their<br/>\nrelathionship as partners to their kids have relationships that I admire.<br/>\nThey aren&#39;t without conflict but the conflict arises from personal<br/>\ndifferences rather than from the power struggle of a stronger person making<br/>\na weaker person do what&#39;s &quot;right&quot;. (Personally getting alog with people is<br/>\nhard enough that I don&#39;t want to compound it by adding in a layer of power<br/>\nstruggle!)<br/>\n<br/>\nI can&#39;t offer advice from experience on the go kart since I&#39;ve got a quiet<br/>\nkid who isn&#39;t a teen yet! And your son&#39;s been controlled so trying out<br/>\nletting go of control on a go kart sounds like failure waiting to happen.<br/>\nLike when control is let go on anything: tv, food, school, kids binge on<br/>\nwhat they&#39;ve been denied. Kids will binge on freedom too if they feel that&#39;s<br/>\nbeen controlled. But if he feels that his own life is in the decisions he<br/>\nmakes, then he&#39;s going to be a lot more sensible. He won&#39;t make the same<br/>\nchoices you would. He may take risks! (There probably was no holding Evel<br/>\nKnievel back. And since his son followed in his motorcycle tracks there was<br/>\nundoubtedly genetic factors.) But he&#39;s more likely to take more risks if<br/>\nwhat he&#39;s really doing is fighting control.<br/>\n<br/>\nI know that in partnership relationships that the children know their<br/>\nparents are there to help any way they can and they do care. They know that<br/>\nadvice is advice and not control. Partnership parents might find a trusted<br/>\nadult who could advise the teen about go karts. (It&#39;s often a whole lot<br/>\neasier to hear advice from somone who&#39;s been there and still doing that than<br/>\nfrom worrying parents.)<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] My $2.00 worth..","postDate":"1040041622","msgId":51747,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBMjMzMEM1LjEwQUUzJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGF0aWUwbytrdDIzQGVHcm91cHMuY29tPg=="},"prevInTopic":51681,"nextInTopic":51750,"prevInTime":51746,"nextInTime":51748,"topicId":51609,"numMessagesInTopic":0,"msgSnippet":"... I think there wasn t much you could do in that situation. The limitations were natural but he perceived them as imposed and I m guessing it s because ","messageBody":"<div id=\"ygrps-yiv-1369378562\">on 12/15/02 12:26 PM, jaeschool &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:grlynbl@...\">grlynbl@...</a>&gt; at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:grlynbl@...\">grlynbl@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; All options were offered and refused by Landon.<br/>\n<br/>\n </span></blockquote>I think there wasn&#39;t much you could do in that situation. The limitations<br/>\nwere natural but he perceived them as imposed and I&#39;m guessing it&#39;s because<br/>\nthat&#39;s the way he&#39;s most familiar with problems being solved in the family.<br/>\n<br/>\nI think for adults it&#39;s natural to solve family problems by analyzing the<br/>\nsituation and then suggesting the most practical solution(s) and the goal is<br/>\nto get the kids to agree to one of them. Though it solves the immediate<br/>\nproblem efficiently, it also creates other problems in the long run. Those<br/>\nother problems may be a small price to pay -- as they are for most parents<br/>\n-- for the efficiency of dealing with things that way. Those other problems<br/>\nmay be seen as self-correcting with maturity and things we just have to put<br/>\nup with.<br/>\n<br/>\nBut people here would argue that the problems it creates are more profound<br/>\nthan they seem on the surface because they involve relationships. And it<br/>\nsubstitutes learning (how to problem solve) by watching for learning by<br/>\ndoing. And it creates control for a teen to fight against rather than<br/>\nopportunities to figure out how to problem solve.<br/>\n<br/>\nThere are lots of stories here of how people trust their kids and the result<br/>\nof that trust. (Sandra has recently told about Kirby and Mary B about her<br/>\ndaughter.) It takes sacrificing some guarantees to get something that&#39;s even<br/>\nbetter. And it isn&#39;t about letting go to let them sink or swim. It&#39;s about<br/>\ncreating a relationship where they see family as those who are there to help<br/>\nthem solve their problems rather than as part of their problems.<br/>\n<br/>\nSo people here will speak up when they see someone offering parenting advice<br/>\nthat creates the relationship problems they know don&#39;t have to exist. That<br/>\nspeaking up is a source of conflict on the list because not everyone accepts<br/>\nthat the &quot;normal&quot; parent-kid relationships are a problem worth solving. But<br/>\nI know that the traditional parent-teen conflict isn&#39;t the type of<br/>\nrelationship I want to have with my daughter. I want something better and I<br/>\nsee the type of relationship I do want and it&#39;s coming out of the conscious<br/>\nparenting explained here, not from traditional parenting advice.<br/>\n<br/>\nThere&#39;s a really good book for anyone who is interested called Parent/Teen<br/>\nBreakthrough: The Relationship Approach by Mira Kirshenbaum and Charles<br/>\nFoster. Pam S recommends it often and it&#39;s very good :-)<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] My $2.00 worth..","postDate":"1039998176","msgId":51681,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBMjI4NzEwLjEwQTc3JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGF0aWUwbytrdDIzQGVHcm91cHMuY29tPg=="},"prevInTopic":51664,"nextInTopic":51747,"prevInTime":51680,"nextInTime":51682,"topicId":51609,"numMessagesInTopic":0,"msgSnippet":"... No, it isn t a cop out. You can take idea discussion personally as though they are attacking you and not your idea. And you ll get hurt a lot. To keep it","messageBody":"<div id=\"ygrps-yiv-2097086083\">on 12/15/02 12:26 PM, jaeschool &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:grlynbl@...\">grlynbl@...</a>&gt; at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:grlynbl@...\">grlynbl@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Thats nothing but a cop out.  When someone says something and another<br/>\n&gt; person makes a direct response to it, then it is aimed at you.   If I<br/>\n&gt; say, I eat red meat every day.. Then someone replies.. If you eat red<br/>\n&gt; meat, you are an animal hater.. Then.. DUHH. obviously they mean I am<br/>\n&gt; an animal hater..  Comments have been made in direct response to<br/>\n&gt; statements I have made.  I dont care if folks use my name or not, no<br/>\n&gt; one is naive enough to think they are &quot;general statements&quot;<br/>\n<br/>\n </span></blockquote>No, it isn&#39;t a cop out. You can take idea discussion personally as though<br/>\nthey are attacking you and not your idea. And you&#39;ll get hurt a lot.<br/>\n<br/>\nTo keep it in the realm of realish scenarios a more likely exchange is:<br/>\n<br/>\n&quot;We unschool except for math.&quot;<br/>\n<br/>\n&quot;That&#39;s not unschooling.&quot; And someone would usually go on to explain why<br/>\nthey don&#39;t think &quot;unschool except for math&quot; fits in with their concept of<br/>\nunschooling.<br/>\n<br/>\nPeople will read it as though it said &quot;You&#39;re not an unschooler.&quot; But that&#39;s<br/>\nnot what the statement says. It&#39;s talking about the *idea* of unschooling<br/>\nand the *idea* of whether it can encompass the concept of mandated math<br/>\ninstruction.<br/>\n<br/>\nBecause someone objected, does it mean the second person is right and their<br/>\nidea of what unschooling is overrides anyone else&#39;s? No. It means the first<br/>\nperson should tell us how they see mandated math fitting into the<br/>\nunschooling philosophy.<br/>\n<br/>\nIt will probably shake out into two different definitions of unschooling<br/>\nwith two different goals.<br/>\n<br/>\nAnd the clash between differing goals is where the rigidness gets sensed.<br/>\n<br/>\nThe goals of unschooling -- as defined here -- are pretty broad! But they<br/>\n*are* child centered, child respectful. (No matter how it gets described it<br/>\ngets interpretted to mean something no one means!)  And any ideas that don&#39;t<br/>\nhave the goal of child respect in mind do get questioned.<br/>\n<br/>\nSo why is there so much adamancy from some very vocal people that the &quot;child<br/>\ncentered&quot; (whatever you&#39;d call it!) viewpoint is right?<br/>\n<br/>\nThe How To Talk So Your Kids Will Listen book was when I first saw that<br/>\nchildren see the world differently than we do. (I mean something more<br/>\nprofound than what those words are saying!) I mean that to an adult it&#39;s<br/>\n&quot;obvious&quot; that the living room should be kept cleaned up. But to a child<br/>\nit&#39;s &quot;obvious&quot; that it makes no sense to spend time putting things away that<br/>\nthey&#39;re just going to take out tomorrow. Most people would say the adult is<br/>\nright. But we&#39;re *both* right. We just have different view points. Different<br/>\npriorities. But if I insist that my viewpoint is right because I&#39;m an adult<br/>\nand know better (or whatever justification I use), how does that model<br/>\nsolving problems when two people disagree? It doesn&#39;t. It models the<br/>\nstronger person gets their way and the weaker person gives in.<br/>\n<br/>\nOnce I started seeing how different the world looked from a child&#39;s point of<br/>\nview (based on what was important to them) I started to see how the messages<br/>\nI thought I was sending were being received very differently. When I thought<br/>\nI was saying &quot;I&#39;ve had more experience so that&#39;s why I know my way is<br/>\nright,&quot; what she was hearing was &quot;Your ideas aren&#39;t as good. I&#39;m bigger and<br/>\nstronger so we get to do it my way.&quot;<br/>\n<br/>\nThat *doesn&#39;t* mean I then switched my attitude to her way is right because<br/>\nthat&#39;s how she sees it. It meant that I had to be conscious of how she<br/>\nviewed the world in order to understand what I was communicating. For<br/>\nexample if I dragged her around all day doing errands from my point of view<br/>\nit was communicating that there are just some things in life we have to do.<br/>\nBut what she was hearing is that bigger people get to override the feelings<br/>\nof littler people.<br/>\n<br/>\nEven if there are some times when there are things we have to do, shouldn&#39;t<br/>\nthe message of stronger people get to override weaker people&#39;s feelings be<br/>\nreserved for emergencies? Was getting errands done worth that message? Was<br/>\nthat a message I wanted her to hear every week? (And that was just for<br/>\nerrands! There were other times I was unconsciously sending that message<br/>\ntoo.)<br/>\n<br/>\nI put that into a husband scenario. What if my husband dragged me around all<br/>\nday to sporting goods stores and made me stay by his side not touching<br/>\nanything? What if when I asked when we could go home, he said soon -- which<br/>\nreally meant as long as it takes me to be done? What if I said I was hungry<br/>\nand he said hold on until we get home because the food here&#39;s too expensive?<br/>\nOr he said I could have something inexpensive on his approved list?<br/>\n<br/>\nIt made me more conscious that a lot of the things I thought I had to do<br/>\nwere really things I *chose* to do. I didn&#39;t *have* to shop with her. I<br/>\ndidn&#39;t even have to shop. It was just more convenient for me. I was sending<br/>\nthe message that it was okay to inconvenience her for my convenience.<br/>\n<br/>\nThose realizations didn&#39;t make me stop shopping ;-) But I&#39;m more conscious<br/>\nof what she&#39;s putting up with for my convenience. I *appreciate* that she&#39;s<br/>\ninconveniencing herself on the times I&#39;m not clever enough or good enough<br/>\nabout planning ahead. I say &quot;Thank you!&quot; And I buy her expensive mall food.<br/>\n:-) My goal is to treat her the way I&#39;d want my husband to treat me if he<br/>\nwere inconveniencing me that way. (I ain&#39;t perfect! I&#39;m still selfish and<br/>\nstubborn. But I&#39;m better than I was and every time I have to put the<br/>\nthoughts into words I grow.)<br/>\n<br/>\nOnce I realized I wasn&#39;t trapped by all the &quot;have tos&quot; I started seeing more<br/>\noptions for problems. There were more options than the standard &quot;have tos&quot;.<br/>\nIt&#39;s also freeing. Once you realize that you don&#39;t have to cook every night,<br/>\nthat you *could* have take out pizza everynight if you wanted to do that,<br/>\nthen cooking everynight isn&#39;t so much of a chore. I do it because I *choose*<br/>\nto to save money, make more healthy things and so on.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] My $2.00 worth..","postDate":"1039992567","msgId":51664,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBMjI2RUUzLjEwQTY2JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGF0aWUwbytrdDIzQGVHcm91cHMuY29tPg=="},"prevInTopic":51663,"nextInTopic":51681,"prevInTime":51663,"nextInTime":51665,"topicId":51609,"numMessagesInTopic":0,"msgSnippet":"... Yes. But making the kid give to show them how things need to balance out doesn t model giving. It models the stronger gets to have their way. Yes, in the","messageBody":"<div id=\"ygrps-yiv-1054210852\">on 12/15/02 12:26 PM, jaeschool &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:grlynbl@...\">grlynbl@...</a>&gt; at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:grlynbl@...\">grlynbl@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In order to insure this balance of both parents and<br/>\n&gt; children &quot;passionately and joyously follow their interests&quot;  There<br/>\n&gt; has to be some give and take.<br/>\n<br/>\n </span></blockquote>Yes. But making the kid give to show them how things need to balance out<br/>\ndoesn&#39;t model giving. It models the stronger gets to have their way.<br/>\n<br/>\nYes, in the early years it *is* unbalanced. But that doesn&#39;t mean we can&#39;t<br/>\ntell them when we&#39;re honestly tired. But we do it *not* because we want to<br/>\nteach them to respect our feelings. But because we want to model being<br/>\nhonest about feelings and respecting ones self.<br/>\n<br/>\nWe model respect when we respect their expressions of their feelings. Even<br/>\nwhen we judge that they can&#39;t be as tired (or whatever) as they say they<br/>\nare. We have to trust that they are being honest about their feelings and<br/>\nrespond accordingly and we will be modeling how to respond to other&#39;s<br/>\nfeelings.<br/>\n<br/>\nThat&#39;s all a bit airy-fairy and really needs some real life scenarios to<br/>\nmake it clear.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What would <br/>\n&gt; JP have learned if I had said.. &quot;OK&quot;.. jumped up and ran downstairs<br/>\n&gt; and made the pancakes right away like he asked?   We compromised..<br/>\n&gt; I got to drink my coffee and get woke up and spend 15 mins or so<br/>\n&gt; getting ready to do downstairs.. He got to feel needed and helpful by<br/>\n&gt; getting the things ready. PLUS he got to read and follow directions,<br/>\n&gt; measure and stir.<br/>\n<br/>\n </span></blockquote>No, that was a good win-win solution! That was very creative! (And it&#39;s also<br/>\nwhy real life scenarios are much better to use as discussion points than<br/>\nmade up ones.)<br/>\n<br/>\nI probably just compounded the misunderstanding in my last post ;-) But what<br/>\nI&#39;m trying to say is that we can&#39;t train kids to judge what is important and<br/>\nwhat isn&#39;t but insiting that they respect that some adult needs are more<br/>\nimportant than kid needs. (But we can model respect for self by letting them<br/>\nknow what our needs are.) We help them learn respect by treating them with<br/>\nrespect. Instead of saying, &quot;No, you have to wait because my need for coffee<br/>\nis greater than your need for pancakes,&quot; you showed respect for his feelings<br/>\n(that pancakes were important) by suggesting something that he could do to<br/>\nhelp you meet his needs which cleverly got your own needs met at the same<br/>\ntime. :-)<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] My $2.00 worth..","postDate":"1039990053","msgId":51663,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBMjI2NzU1LjEwQTYyJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGF0aWUwbytrdDIzQGVHcm91cHMuY29tPg=="},"prevInTopic":51648,"nextInTopic":51664,"prevInTime":51662,"nextInTime":51664,"topicId":51609,"numMessagesInTopic":0,"msgSnippet":"... This one s more difficult to translate into understandable terms. This is, again, about the *idea* behind what you re saying. I m not criticizing you or","messageBody":"<div id=\"ygrps-yiv-453329831\">on 12/15/02 12:26 PM, jaeschool &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:grlynbl@...\">grlynbl@...</a>&gt; at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:grlynbl@...\">grlynbl@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He may continue to<br/>\n&gt; insist.  &quot;JP, I will be finished in a just a minute, go practice it<br/>\n&gt; some more, I will come watch you in just a minute..<br/>\n<br/>\n </span></blockquote>This one&#39;s more difficult to translate into understandable terms.<br/>\n<br/>\nThis is, again, about the *idea* behind what you&#39;re saying. I&#39;m not<br/>\ncriticizing you or saying I&#39;m better.<br/>\n<br/>\nThe goal of the type of parenting discussed here (is there a word for it?<br/>\n&quot;The type of parenting discussed here&quot; and &quot;extending unschooling principles<br/>\ninto parenting&quot; is awfully awkward!) *isn&#39;t* to teach a child how to judge<br/>\nwhat is and isn&#39;t important from an adult&#39;s point of view. We trust that<br/>\nwhat is important will change as the child matures. The goal is to model the<br/>\nrespect we&#39;d like them to give to others.<br/>\n<br/>\nFrom the child&#39;s point of view this scenario is &quot;I&#39;ve got something I think<br/>\nis important enough to interrupt you for.&quot; If we respond with &quot;No, you&#39;ve<br/>\njudged wrong. Even though from your point of view two adults talking looks<br/>\nunimportant, it&#39;s just one of those thing you have to remember is more<br/>\nimportant,&quot; what have we modeled for them? We&#39;ve modeled that you dole out<br/>\nyour attention based on your perception of the world, not on the trust and<br/>\nregard you have for someone.<br/>\n<br/>\nIf you came to a child all excited -- something on the level of excitement<br/>\nyour 7 yo is expressing, like aliens landed in the back yard ;-) -- and he<br/>\nsaid &quot;Just a minute&quot; and returned to something that from your point of view<br/>\nlooked trivial and you persisted that it was *really* important, how would<br/>\nyou want him to respond?<br/>\n<br/>\nIf we come to someone all excited about something, we&#39;d want them to trust<br/>\nthat we weren&#39;t interrupting for frivolous reasons and that it really was<br/>\nimportant. So that&#39;s what we should model for our kids. We should show that<br/>\nwe trust their judgement and respond how we&#39;d want others to respond to us.<br/>\n<br/>\nIf we want children to treat others with respect, then we need to treat them<br/>\nwith respect. *Not* when *we* think they deserve respect but when *they*<br/>\nthink they deserve respect. Sometimes it helps to translate a scenario into<br/>\na husband and wife scenario.<br/>\n<br/>\nIf we say to our husband &quot;This is something I&#39;m *really* excited about,&quot; --<br/>\nlike having won a million dollars -- we&#39;d want our husbands to interrupt<br/>\nwhat they&#39;re doing and pay attention to us. We wouldn&#39;t want them to react<br/>\nin a way that said &quot;Regardless of the tone you&#39;re using, I think I&#39;m a<br/>\nbetter judge of what is important enough to interrupt this conversation<br/>\nfor.&quot; (Now doesn&#39;t that sound condescending?)<br/>\n<br/>\n(Now if the child were interrupting every 5 seconds, that&#39;s a different<br/>\nscenario. Trying to get across the whys and wherefores of this kind of<br/>\nthinking doesn&#39;t work well with made up scenarios that can be what-ifed into<br/>\na corner. It&#39;s the motivations behind the actions that are important, not<br/>\nthe actions so it works best with real scenarios.)<br/>\n<br/>\nIn order for kids to know we take what they say seriously we have to see<br/>\nwhat the world looks like from their point of view. We can&#39;t judge the<br/>\nimportance of something from the adult point of view and second guess their<br/>\njudgement. We have to let them know we trust their judgement.<br/>\n<br/>\nMaturity *will* bring a *different* (not necessarily better ;-)<br/>\nunderstanding about what is and isn&#39;t important.<br/>\n<br/>\nThe other part of the model is to model respect for what others feel is<br/>\nimportant by respecting what *children* think is important. So if a child is<br/>\nin the middle of a video game or something that doesn&#39;t look important to us<br/>\nbut is important to them, we model how we&#39;d want them to treat interrupting<br/>\nsomething we think is important by asking them for attention when they come<br/>\nto a convenient stopping point.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If I <br/>\n&gt; immediately end my converstation with Judy, doesnt that show<br/>\n&gt; disrespect to Judy? and also show that my &quot;business&quot; it not as<br/>\n&gt; important as  JP&#39;s?<br/>\n<br/>\n </span></blockquote>As an adult hopefully Judy understands that what is important to a child is<br/>\ndifferent than what is important to an adult. If not, you could model it for<br/>\nher :-) That it is the level of importance to the child we need to respond<br/>\nto rather than the thing the child is interrupting us for.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] My $2.00 worth..","postDate":"1039983486","msgId":51648,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBMjI0REFFLjEwQTQ0JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGF0aWUwbytrdDIzQGVHcm91cHMuY29tPg=="},"prevInTopic":51609,"nextInTopic":51663,"prevInTime":51647,"nextInTime":51649,"topicId":51609,"numMessagesInTopic":0,"msgSnippet":"... If you assume that or have gotten that impression from how you are interpretting what people write then you are going to read that attitude into people s","messageBody":"<div id=\"ygrps-yiv-607734536\">on 12/15/02 12:26 PM, jaeschool &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:grlynbl@...\">grlynbl@...</a>&gt; at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:grlynbl@...\">grlynbl@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I know a lot of you dont give a rats ass what I have to say..<br/>\n<br/>\n </span></blockquote>If you assume that or have gotten that impression from how you are<br/>\ninterpretting what people write then you are going to read that attitude<br/>\ninto people&#39;s replies and it won&#39;t help you hear what they really are<br/>\nsaying.<br/>\n<br/>\nI could say the attitude isn&#39;t there. And we could do a yes it is/no it<br/>\nisn&#39;t battle. But I can say that people who post here do care about *ideas*<br/>\nand the principles of unschooling. If they didn&#39;t, they wouldn&#39;t respond.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I made a statement about how I manage my<br/>\n&gt; household, and judgement was passed on me.<br/>\n<br/>\n </span></blockquote>Then it&#39;s because you&#39;ve taken a discussion about an idea and assumed<br/>\nsomeone was saying something personal about you.<br/>\n<br/>\nIt *is* hard to separate ourselves from our ideas. For lots of us we feel<br/>\nour ideas *are* us. If our ideas or something we&#39;ve done gets criticized<br/>\nthen we feel like someone is criticizing us.<br/>\n<br/>\nOften, I think -- and this *isn&#39;t* personal but talking about the *idea* of<br/>\nfeeling personal attachment to ideas -- we feel like the choices we make in<br/>\nlife are on the order of &quot;Do what feels right and hope for the best.&quot; If it<br/>\nturns out badly, we can&#39;t be blamed because we&#39;re all just doing the best we<br/>\ncan and everything is chancy at best anyway.&quot; Criticism would feel like<br/>\nsomeone was saying &quot;Why did you roll a 1. You should have rolled a 6.&quot;<br/>\n<br/>\nI think one of the great things about this list is that people *don&#39;t* make<br/>\nthat assumption. It&#39;s assumed we *can* understand. And we generate a *lot*<br/>\nof words talking about the whys of things.<br/>\n<br/>\nAs an example, if someone asks what to do about a kid throwing a tantrum in<br/>\na store, on most parenting lists they&#39;ll get a range of ideas from the<br/>\nviewpoint of the gaol being to stop the tantrums. Here people will help dig<br/>\nand figure out why the tantrums are happening, what it looks like from the<br/>\nchild&#39;s point of view, what the parent&#39;s reaction looks like from the<br/>\nchild&#39;s point of view and then from that understanding, offer what they&#39;ve<br/>\ndone that works.<br/>\n<br/>\nAnother thing that happens -- and this is a biggie -- is that not everyone&#39;s<br/>\nparenting goals match the goals of the most frequent posters. This is<br/>\nprobably the source of the feeling there&#39;s a clique. Some of the frequent<br/>\nposters are *very* passionate about applying the principles of unschooling<br/>\nto parenting.<br/>\n<br/>\nIf someone&#39;s goal is improving their relationship with their child and<br/>\nhelping the child feel like he has reasonable control over his world and his<br/>\nvoice is taken seriously then that&#39;s a very different goal from someone who<br/>\nwould approach the tantrum scenario and say the first thing that must be<br/>\ndone is getting the child to realize that&#39;s unacceptable behavior.<br/>\n<br/>\nIt&#39;s not that end-the-tantrum-now thinking is wrong because it *would* work<br/>\nif someone&#39;s goal is changing a child&#39;s behavior. But that the two goals<br/>\ncoexist about as peacefully as unschooling and curriculum advice do. They<br/>\ncould coexist if we were just throwing out ideas and people could pick and<br/>\nchoose from them. But they can&#39;t coexist peacefully if we&#39;re discussing<br/>\nprinciples. And that *is* what many people come to the list for is the<br/>\ndiscussion of the principles and reasoning behind what we do.<br/>\n<br/>\nI&#39;m sure lots of people would feel more comfortable if we were just throwing<br/>\nout ideas for people to pick and choose from. They&#39;d feel they could<br/>\nparticipate more. But lots of people *wouldn&#39;t* like that because they do<br/>\nwant to extend the principles of unschooling into parenting. And that isn&#39;t<br/>\nsomething people can get too many places. Whereas they can get general<br/>\nparenting advice just about anywhere.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":56051484,"authorName":"jaeschool &lt;grlynbl@aol.com&gt;","from":"&quot;jaeschool &lt;grlynbl@...&gt;&quot; &lt;grlynbl@...&gt;","profile":"jaeschool","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"My $2.00 worth..","postDate":"1039973208","msgId":51609,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGF0aWUwbytrdDIzQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":51648,"prevInTime":51608,"nextInTime":51610,"topicId":51609,"numMessagesInTopic":0,"msgSnippet":"Well, I was not licking my wounds.. I have been MIA just doing normal parenting stuff, getting ready for Christmas, etc.. Bet you guys thought I had rode my","messageBody":"<div id=\"ygrps-yiv-715885190\">Well, I was not licking my wounds.. I have been MIA just doing normal <br/>\nparenting stuff, getting ready for Christmas, etc.. Bet you guys <br/>\nthought I had rode my dead horse on outta here.. :-)  I  read the 90 <br/>\nsome messages that have been posted since I checked my email.  I have <br/>\ncopied the original text, then added my replies after the asterisks.  <br/>\nI know a lot of you dont give a rats ass what I have to say.. Thats <br/>\nOK.. I gonna say it anyway..And its 10 times more that 2 cents. <br/>\n<br/>\n**********************************<br/>\nSarcasm comes from a root meaning to cut. Sandra was tryinh to help <br/>\nif you&#39;re <br/>\nnot interested in looking at yourself maybe its not time to ask the <br/>\nquestions.<br/>\n<br/>\nRenee<br/>\n**************<br/>\nI didnt ask any questions.  I made a statement about how I manage my <br/>\nhousehold, and judgement was passed on me.<br/>\n**********************<br/>\nThe mom should have a right to talk and be among <br/>\nadults and still be respected by her children. The kids do not have <br/>\nto be the <br/>\ncenter piece of every conversation and discussion.<br/>\nBeth<br/>\n*******************<br/>\nI agree, Beth.   I respect my children by not interrupting thier <br/>\nconverstations or demanding them to do things for me when I they are <br/>\noccupied.   I expect the same from them   Someone said that is how <br/>\nchildren learn patience and respect. . Someone else replied that <br/>\nchildren learn to ignore others by being ignored themselves.  I dont <br/>\nthink we are talking about ignoring our children at all.. Rather <br/>\nasking them to wait ( therefore, show respect) for us to attend to <br/>\nthem.   Yeah yeah, barring emotional or physical emergencies.   If I <br/>\nam in a converstation with an adult and my  7 yo says .. Moma, Moma, <br/>\nMoma ( 3 times fast before I can even answer) come see watch my <br/>\ntrick.. come watch my trick.  I would say.. OK, JP. I will come see <br/>\nyour trick as soon as I finish talking to Judy.    He may continue to <br/>\ninsist.  &quot;JP, I will be finished in a just a minute, go practice it <br/>\nsome more, I will come watch you in just a minute..    If I <br/>\nimmediately end my converstation with Judy, doesnt that show <br/>\ndisrespect to Judy? and also show that my &quot;business&quot; it not as <br/>\nimportant as  JP&#39;s?      If I was on the phone, I would try to wrap <br/>\nthe conversation up as quickly as possible, or say i would call her <br/>\nback. in a few minutes.  If she was at my house, I would suggest we <br/>\ngo watch his trick.  But, I wouldnt just DROP EVERYTHING and go watch <br/>\nthat second.   <br/>\nAlong these same lines.. here this was stated&quot;<br/>\n&lt;&lt;&lt; While a parent who concentrates 100% on her kids all the time <br/>\nhas a special gift of unlimited time and energy with her kids, it <br/>\nmight have the deficit of her children not seeing her pursue any of <br/>\nher own goals and plans. She might never take time for herself, and <br/>\nher own needs. &gt;&gt;<br/>\n<br/>\nRen replied:<br/>\nNo one here has advocated this.<br/>\nIn fact, one of the main principles of unschooling here, is that the <br/>\nparent <br/>\npassionately and joyously follow their interests, thereby being a <br/>\ngood <br/>\nexample of how to live a meaningful life and stay curious and <br/>\ninterested in <br/>\nlife.&gt;&gt;&gt;&gt;<br/>\nIn order to insure this balance of both parents and <br/>\nchildren &quot;passionately and joyously follow their interests&quot;  There <br/>\nhas to be some give and take.   Robin talked about not being able to <br/>\nwork on her novel . In order to allow her children to follow thier <br/>\nwants and interests, she has to put her writing on the back burner.   <br/>\nThere ARE many many practical problems that come into play when <br/>\neveryone tries do whatever they want to.   Just like the scenario <br/>\nwith my son wanting to go with his friends, but everyone else wanting <br/>\nto go camping.   Compromises DO have to exist.   <br/>\n<br/>\n Here is an example from this morning.  JP got up wanting pancakes <br/>\nfor breakfast..  &quot;Moma, Moma, can you make pancakes.!&quot;. I was just <br/>\nwaking up.. &quot;Oh.. yeah. I&#39;ll make some.. but I want to drink a cup of <br/>\ncoffee first.&quot;.  DH gets my coffee and JP says again.&quot; Moma, come <br/>\non.. make the pancakes, I want some, Im hungry&quot;  I reply.. &quot;OK OK.. I <br/>\nwill, just let me finish this coffee first.. I gotta get woke up&quot;   <br/>\nTwo minutes later.. &quot;Come on Moma, lets make the pancakes, hurry up <br/>\nand drink your coffee&quot;  Well, the coffee was good and hot and I <br/>\ncouldnt just chug it down. and I also needed to get dressed and use <br/>\nthe bathroom.  .. So, I said &quot;Honey, I wil make the pancakes, just <br/>\nhold on a couple of minutes&quot;   He is still impatiently hurrying me <br/>\nup..   So, then I say. &quot; Hey, I&#39;ve got a good idea, why dont you go <br/>\nget everything ready to help me make the pancakes&quot;  He says <br/>\nenthusiatisically, &quot;OK.. what do I get out&quot;  I tell him the <br/>\ningredients and supplies.. &quot;Flour, milk, eggs, sugar, butter, oil. <br/>\nthe griddle, a bowl and measuring cup&quot;  He thinks a minute and <br/>\nsays &quot;will you write it down&quot;  I make the list and off he goes.  I <br/>\nfinish my coffee and get dressed and in about  5 minutes hes back <br/>\nupstairs jumping up and down so excited.. &quot; I got it ready, I got <br/>\neverything&quot;  &quot;GREAT!.. good job, now lets go make the pancakes!&quot;  He <br/>\nhelps me measure and stir and everybody is happy.. and the pancakes <br/>\nwere delicisous ( as usual, since I am a great cook)..   What would <br/>\nJP have learned if I had said.. &quot;OK&quot;.. jumped up and ran downstairs <br/>\nand made the pancakes right away like he asked?   We compromised..   <br/>\nI got to drink my coffee and get woke up and spend 15 mins or so <br/>\ngetting ready to do downstairs.. He got to feel needed and helpful by <br/>\ngetting the things ready. PLUS he got to read and follow directions, <br/>\nmeasure and stir.   <br/>\n *******************<br/>\n<br/>\n<br/>\nMany people here don&#39;t even read the name of the person posting <br/>\nbefore <br/>\nreading, so I doubt the jabs were aimed at you.<br/>\nWe don&#39;t even know &quot;you&quot;<br/>\nWe only know what is told to us.<br/>\nElissa<br/>\nNo one on this board has said YOU are anything of the sort.<br/>\nYou is generral here, not specific. And I don&#39;t think that you have <br/>\nbeen <br/>\nreading long enough BEFORE posting for the first time, otherwise YOU <br/>\nwould <br/>\nunderstand that already.<br/>\nElissa<br/>\n***************<br/>\nThats nothing but a cop out.  When someone says something and another <br/>\nperson makes a direct response to it, then it is aimed at you.   If I <br/>\nsay, I eat red meat every day.. Then someone replies.. If you eat red <br/>\nmeat, you are an animal hater.. Then.. DUHH. obviously they mean I am <br/>\nan animal hater..  Comments have been made in direct response to <br/>\nstatements I have made.  I dont care if folks use my name or not, no <br/>\none is naive enough to think they are &quot;general statements&quot;<br/>\n*************<br/>\n<br/>\nMy 3 (THREE!) year old knows when <br/>\nhe is tired and asks to go to bed, he knows that if he is not tired <br/>\nhe can <br/>\nwatch cartoons quietly in our bed as long as he lets us sleep. He <br/>\nknows that <br/>\nhe needs to stay in our room but wouldn&#39;t be likely to wander the <br/>\napt. at <br/>\nnight since there&#39;s no one around.<br/>\n*****************<br/>\nI would suggest keeping your bedroom door locked.   I have <br/>\npersonally  known of   children getting up at night and wondering <br/>\naround the house or even outside. There have to be safety standards <br/>\nat practice.  <br/>\n******************** <br/>\nI would have spent alot of time trying to find ways for him to <br/>\ndetermine deep <br/>\ndown what was important and let him know that it was ok to do just <br/>\nthe one.<br/>\nWas there other options besided staying home or with the Gparents? <br/>\nCould he <br/>\nhave stayed at a few different friends houses? something really fun <br/>\nto make <br/>\nup for missing the camping trip?<br/>\nElissa<br/>\n********<br/>\nAll options were offered and refused by Landon.    You know, Ive been <br/>\nthinking alot about my own teenage years.  I know that when my folks <br/>\nsaid that I had to be by midnight, I thought they were crazy, just <br/>\ntrying to be mean and controlling.  Well, now I am an adult, I&#39;ve <br/>\nlived 35 years and I have some experience and wisdom.  My folks were <br/>\nright....staying out after midnight is not safe..  I wanted to go to <br/>\nthe beach with my friend my JR year of high school.  I couldnt go <br/>\nunless an adult chaperone went too.. OMG, how embarrassing, how awful <br/>\nof my parents, how dare they not trust me!!.. Well, guess what, I now <br/>\nthank them for the guidance and rules they enforced.   Even with an <br/>\nadult along( they didnt follow us around everywhere), we managed to <br/>\nget drunk a couple of times, hook up with strange guys, and get lost <br/>\ndowntown. I would have gotten in WAY more trouble, maybe even dead, <br/>\nif there was not an adult along.    I cant agree that children always <br/>\nknow what is best for them.. They are CHILDREN.  .. how can 13 or 14 <br/>\nor 16 years compare to 35 , or 40 , or 60 in knowing about life???  <br/>\nIt&#39;s funny, I dont resent my parents for caring about me and NOT <br/>\nletting me do everything I wanted to.<br/>\n****************<br/>\nChildren really want so little - why can&#39;t they have it, if it&#39;s <br/>\nwithin our <br/>\npower?<br/>\nLinda<br/>\n***********<br/>\nMy children want a lot that I cant give them.. My son wants a go cart <br/>\nfor Christmas.   Even if it was within my means, I wouldnt get him <br/>\none because I know that he is implusive and does not have the skills <br/>\nto be safe on a go cart.<br/>\n**************<br/>\n<br/>\nam not sure what you&#39;re talking about. Who is &quot;defensive&quot; <br/>\nand &quot;disruptive&quot;?<br/>\nFor being so UN-schooling you guys sure like to label things and <br/>\npeople. Is<br/>\nthis also part of your unschooling approach?<br/>\nI am an observer and I express what I&#39;ve been observing. This list <br/>\nactually<br/>\nsmells too much like a clique to me.<br/>\nYol<br/>\nYou&#39;re free to question anything at all. There are no gods here though<br/>\nyou&#39;ve been trying to draw a picture of some conflict between gods and<br/>\nmortals. That conflict doesn&#39;t exist because we&#39;re all just moms and<br/>\ndads<br/>\nwith ideas about a better life for our kids.<br/>\n<br/>\nYou&#39;re free to judge my comments, anyone can, but it means little to <br/>\nme<br/>\nbecause like everyone else here, my parenting choices have been held <br/>\nup<br/>\nto much criticism and scrutiny over the years. Theres very little I<br/>\nhaven&#39;t already heard, although I know I still have much to consider.<br/>\n<br/>\n***I am an observer and I express what I&#39;ve been observing.***<br/>\n<br/>\nIsn&#39;t this what I did and what you are now so angry about?<br/>\nIt&#39;s what happens here. We read, we consider, we learn, we question, <br/>\nwe<br/>\nmake observations. Is there some part of that seems contrary to what<br/>\nthis list is for? <br/>\n<br/>\nDeb L<br/>\n**********************<br/>\n&quot;Distruptive and defensive&quot; seems to be defined and not agreeing 100% <br/>\nwith what some others practice..  Also, defending our own practices <br/>\nwhen we are judged harshly for them.  There IS a double standard <br/>\nhere.. Its so easy to see when reading through the posts.<br/>\n***********<br/>\n<br/>\nI wouldn&#39;t say that Elissa!!<br/>\nBut you are quite a pretty lil thang....and when I say little people, <br/>\nI mean <br/>\nshe&#39;s about as big around as my ARM!! sheesh<br/>\n<br/>\nRen<br/>\n***********<br/>\nI have looks and brains.. :-)  And, for the record, I am 5&#39;3&quot; and I <br/>\nweigh 250 pounds.  <br/>\n<br/>\n*********<br/>\nAnyway just wanted to say Hi. My name is Pam. My children (Dallen-8 <br/>\nand <br/>\nPhillip-5) have never been to public school, we started out as <br/>\nrelaxed <br/>\nhomeschoolers/some unit studies etc. But we dumped that quickly and <br/>\nhave <br/>\nbeen unschooling ever since. What a group.<br/>\nI will go back to lurkdom for a while to get the feel of the group.<br/>\nTake care all,<br/>\nPam<br/>\n******<br/>\nHmmm, Pam, *squinting my eyes.. you look familar, have I seen you <br/>\nsomewhere before :-)<br/>\nGlad to see you here..<br/>\n************<br/>\n<br/>\n<br/>\n&lt;&lt; The toothpick and marshmallow structures burn BEAUTIFULLY in the <br/>\nfireplaces. &gt;&gt;<br/>\n<br/>\nI sure wish I would have thought of that. My kids love to burn stuff. <br/>\n*********<br/>\nMine too... When we went camping over Thanksgiving, the kids were <br/>\ntwirling burning sticks ( at my encouragment) to see <br/>\nthe &quot;fireworks&quot;.. and my son poked the burning stick in his eye.   <br/>\nThat was a hard lesson learned.. but, I guess more effective than. <br/>\nPut that stick down!, you might poke your eye out!  Although, with an <br/>\ninfection and patched eye for 4 days, JP wished I had made him put <br/>\nthe stick down. He said. .Moma, why didnt you tell me NO!<br/>\n*********<br/>\nroasting over the candle at the table<br/>\n*******<br/>\nYeah, JP loves candles too.. And he accidentally poured hot wax over <br/>\nhis head last week.. His hair was glued with molten wax to his head.  <br/>\nIts just now starting to flake out.  I guess he learned another good <br/>\nlesson . Dont pick up burning pillars candles that are over your head.<br/>\n *********<br/>\nOH! Last night one of the kids received a bag of Lego candy! Made of <br/>\nsugar---totally edible---and you can build with it TOO! Major cool!<br/>\n<br/>\n~Kelly<br/>\n******<br/>\nMy kids love those too. Only place I have found them is at Cracker <br/>\nBarrell.<br/>\n*********************<br/>\n<br/>\n<br/>\nJulie asked:<br/>\n<blockquote><span title=\"ireply\"> &gt; Is picking up before watching TV for &quot;parental convenience&quot; <br/>\n </span></blockquote>or &quot;living for<br/>\n<blockquote><span title=\"ireply\"> &gt; principles, not rules&quot;?<br/>\n&gt; <br/>\n </span></blockquote> I replied:<br/>\nI would say, its for &quot;family convenience&quot; So no one trips and falls.. <br/>\nSo, <br/>\ntoys are not lost or broken, so mold doesnt start to grow on dishes. <br/>\nAnd, <br/>\nI have to say, its not like a daily thing. .. Its more like. OK guys, <br/>\nwe cant <br/>\nwalk in here, there is no where to sit down.. You need to get this <br/>\nstuff up <br/>\nbefore the TV comes back on. .. Or.. OK, Ethan, you&#39;ve been playing <br/>\nthat <br/>\ngame ( on the PC) for 2 hours, JP wants to play, you can find <br/>\nsomething else <br/>\nto do or let him play with you. ..or maybe, JP, I need to finish my <br/>\nhomework, <br/>\nyou can play again when Im finished. .. <br/>\n<br/>\n **********<br/>\nI am curious as to why no one replied to my response.   I have <br/>\nreplied to many posts and they are basically ignored or only a minute <br/>\npart of them responded to..   Maybe I am not on blocked or just my <br/>\nmessages automaticlly deleted..   Another form or &quot;cliqueness&quot;..  I <br/>\nwas thinking, this list is a lot like High School.. or heck, even <br/>\nmiddle school.   I want my children to be exposed to diversity, <br/>\naccepted for what and who they are and what they beleive ( without <br/>\njudgment)  I am an advocate for equality of respect and acceptance.  <br/>\nWhy do the unschooling police  want to act like a group of Queen <br/>\nBees. that wont allow anyone &quot;in&quot; unless that are clones of them??  <br/>\nThere have even been subtle advice to &quot;just leave if you dont like <br/>\nit&quot;  Well, I am NOT leaving.  I wont be bullied by others into <br/>\nagreeing with every aspect of thier lifestyle.  I wont try to change <br/>\nthem, and again, I must reiterate.. I HAVE NOT JUDGED... I think my <br/>\nparenting methods are just as valid and worthy as the next persons.  <br/>\nI know I can gain knowledge and learn from others.  I think that <br/>\nothers can learn from me as well.   <br/>\n<br/>\nTeresa</div>","specialLinks":[]}],"prevTopicId":51732,"nextTopicId":51767}}