{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":16,"messages":[{"userId":183568025,"authorName":"Bob Collier","from":"&quot;Bob Collier&quot; &lt;bobcollier@...&gt;","profile":"quaussiebob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: shy unschooled kids","postDate":"1279598896","msgId":56243,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkyMzdmZytkc2hlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGlsZS11N1gtcHFFSDJ2aEZUTHdjSHRJVkloU25FOGt3Y1c1WXZzcUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":56219,"nextInTopic":0,"prevInTime":56242,"nextInTime":56244,"topicId":56130,"numMessagesInTopic":0,"msgSnippet":"... I was just listening to a self-improvement mp3 and came to a part where it says, Avoid negative people - losers, socialisers and time wasters. LOL When","messageBody":"<div id=\"ygrps-yiv-1842179946\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, k &lt;katherand@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; How people are with others is different for everyone for different<br/>\n&gt; reasons and at different times/stages in their lives. It&#39;s interesting<br/>\n&gt; what people think socialization means. A bunch of ideas rolled into<br/>\n&gt; one word.<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>I was just listening to a &quot;self-improvement&quot; mp3 and came to a part where it says, &quot;Avoid negative people - losers, socialisers and time wasters.&quot; LOL<br/>\n<br/>\nWhen I was in my late teens and twenties, I would often go to the pub for my social life and would fritter away my time in small talk and just hanging around hoping something exciting would happen. That was &quot;socialising&quot; for sure but it was mostly not the least bit life enhancing.<br/>\n<br/>\nSometimes my life has been a street party and other times I&#39;ve been home alone and I was relating this to my son a few days ago in fact when we were discussing how our life changed during the four years his nanna was living with us. It&#39;s been particularly quiet since she died last year. Old friends moved on. Good idea to see where we are now as simply being on an ebb tide - a phase of peaceful contemplation and regathering perhaps.<br/>\n<br/>\nBob</div>","specialLinks":[]},{"userId":336246301,"authorName":"NCMama","from":"&quot;NCMama&quot; &lt;dharmamama1@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: shy unschooled kids","postDate":"1279577854","msgId":56219,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkyMml0dSs0YmRpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PFNOVDExMi1XMUZGNUZEMjhDRjkxODdENDczNUNGQTVCRTBAcGh4LmdibD4="},"prevInTopic":56208,"nextInTopic":56243,"prevInTime":56218,"nextInTime":56220,"topicId":56130,"numMessagesInTopic":0,"msgSnippet":"===many aren t afraid of getting up in front of a group.. and I saw this whilst watching the youtube video of the Life Is Good talent quest/performances. The","messageBody":"<div id=\"ygrps-yiv-2035738099\">===many aren&#39;t afraid of getting up in front of a group.. and I saw this whilst watching the youtube video of the Life Is Good talent quest/performances. The kids were brilliant with their dancing etc. The few local unschooling families I know also have very outgoing or talkative children.===<br/>\n<br/>\nWhat the youtube video doesn&#39;t show are the kids too shy to be filmed! It doesn&#39;t show the child happily playing with her mom in the hotel room because the dance was too crowded and loud. It doesn&#39;t show the 2 - 3 kids dancing and singing together in the corner because they didn&#39;t want to get up on stage, but they still wanted to dance. It doesn&#39;t show the child sitting on his mom&#39;s lap, quietly taking everything in.<br/>\n<br/>\nIt&#39;s possible that more unschooling families live near you, but their kids don&#39;t enjoy going places with people they don&#39;t know, so they stay at home, or go to the park when they think other families won&#39;t be there. You&#39;re meeting people who are out and seeing people who are filmed because those people are &quot;out there&quot;, unlike a child who prefers one friend at a time, or quiet peaceful spaces.<br/>\n<br/>\nAs has been pointed out, your child may or may not retain his shyness; what&#39;s important is to accept and support him where he is.<br/>\n<br/>\nCaren</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: shy unschooled kids","postDate":"1279570995","msgId":56208,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE5NjdFREVFLTE0RjgtNDZCOC04MDBDLUUyQjg5NzY5MDNDNEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGkyMThoditpb2g5QGVHcm91cHMuY29tPg==","referencesHeader":"PGkyMThoditpb2g5QGVHcm91cHMuY29tPg=="},"prevInTopic":56194,"nextInTopic":56219,"prevInTime":56207,"nextInTime":56209,"topicId":56130,"numMessagesInTopic":0,"msgSnippet":"-=-He s as happy as a pig in a bucket of jelly beans-=- May God grant us all that joy. [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-1783900881\">-=-He&#39;s as happy as a pig in a bucket of jelly beans-=-<br/>\n<br/>\nMay God grant us all that joy.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] shy unschooled kids","postDate":"1279557561","msgId":56194,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlsZS11N1gtcHFFSDJ2aEZUTHdjSHRJVkloU25FOGt3Y1c1WXZzcUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PFNOVDExMi1XMUZGNUZEMjhDRjkxODdENDczNUNGQTVCRTBAcGh4LmdibD4=","referencesHeader":"PDEyNzk0NTQyMzYuMjIxLjMxNjU4Lm00QHlhaG9vZ3JvdXBzLmNvbT4JPFNOVDExMi1XMUZGNUZEMjhDRjkxODdENDczNUNGQTVCRTBAcGh4LmdibD4="},"prevInTopic":56191,"nextInTopic":56208,"prevInTime":56193,"nextInTime":56195,"topicId":56130,"numMessagesInTopic":0,"msgSnippet":"How people are with others is different for everyone for different reasons and at different times/stages in their lives. It s interesting what people think","messageBody":"<div id=\"ygrps-yiv-1053946084\">How people are with others is different for everyone for different<br/>\nreasons and at different times/stages in their lives. It&#39;s interesting<br/>\nwhat people think socialization means. A bunch of ideas rolled into<br/>\none word.<br/>\n<br/>\nOften it means fitting into a social category in school and sticking<br/>\nwith it. Boxes to get into, to tick off, to label oneself for, etc.<br/>\nStereotypes in school: jock, class prez, and other high profile<br/>\n&quot;types,&quot; nerd, teacher&#39;s pet, and not one of those catch phrases<br/>\nleaves much if any room for individual differences or diversity.<br/>\nPeople are lot more than their category might seem to imply. Many<br/>\npeople can be outgoing *and* shy. Some people defy their labels and<br/>\nsay &quot;so what&quot; or shrug when others object.<br/>\n<br/>\nIt so sweet that being unschooled means that Karl has a good chance to<br/>\nbe himself. I don&#39;t think Karl is exactly outgoing or not very much<br/>\nso. He absolutely has loved staying at home for days or even weeks or<br/>\nmonths in a row, and the closer he was to toddlerhood, the more he was<br/>\nlike that. He definitely watches people but not on the fringes. He may<br/>\nbe participating as he does so but that does not mean that he will do<br/>\njust anything that is expected. So many adults and children are<br/>\nschooled and probably don&#39;t have as much chance of enjoying being<br/>\nthemselves unless the family they live with encourages it even in<br/>\nschool and other group situations.<br/>\n<br/>\nI used to worry that since I don&#39;t go to many social events and Brian<br/>\ndoesn&#39;t either that Karl would be infringed on but we consciously take<br/>\nKarl where he can interact with others: UU church, my folks, Brian&#39;s<br/>\nfolks, people we know through business and Brian&#39;s work, people Brian<br/>\nknows through his music interest, friends I&#39;ve known for years who<br/>\nhave moved, Brian&#39;s friends, and yesterday we met some people (whose<br/>\nline of work is music) that we may visit in NY because for one thing<br/>\nI&#39;ve been wanting to go for several reasons anyway, etc. I do find<br/>\nthat I&#39;ve become much more aware of social opportunities since we&#39;ve<br/>\nhad Karl. I have tried making those happen with kids Karl&#39;s age and<br/>\nmostly those haven&#39;t taken off very well and Karl hasn&#39;t been all that<br/>\ngung ho about going anyway. The most success has been with following<br/>\nour interests, like music mainly because we all three share that<br/>\ninterest.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sun, Jul 18, 2010 at 10:41 AM, Kerrie Thomas &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kezzdee@...\">kezzdee@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi everyone, I don&#39;t contribute on this list very often but am often quietly reading, taking in all your wisdom :)<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I just wanted to ask a couple of questions that have been on my mind...<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;  I remember reading an article somewhere, that one of the things that first inspired the writer toward unschooling was meeting unschooled kids- and the writer noted (amongst other things) they were the most fun to be around. Maybe it was one of your articles Sandra. I also read John Holt&#39;s comments about how unschooled children are generally keen to try new things, many aren&#39;t afraid of getting up in front of a group.. and I saw this whilst watching the youtube video of the Life Is Good talent quest/performances. The kids were brilliant with their dancing etc. The few local unschooling families I know also have very outgoing or talkative children.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;  Well, as I mentioned my son is only young, but so far he is very shy in public... he doesn&#39;t respond to people in the street who say hello to him... he smiles but hides behind me. He is timid in approaching a new activity especially in a group setting, mostly he will say no but will happily watch from a distance. He becomes fairly quiet when we attend playgroup/have it at our place, a year or so ago when we first started he found it too overwhelming so I eased us into it by visiting with just a friend or two at a time. Now he says he enjoys it, but he still doesn&#39;t interact alot, he mostly sits on my lap and watches.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;  I have parented him in pretty relaxed, respectful way since birth, we don&#39;t do punishments or rewards etc. But I am just starting to wonder if maybe I have done, or am doing, something that is hindering him in some way, could anyone maybe offer some possible ideas? When it&#39;s just family around, he is very different, full of beans and very talkative! He asks questions about everything and is really funny and entertaining. But not many people outside the family get to see that. I guess I would like to know, should I just keep doing what I am doing, waiting patiently as his personality unfolds? Or hould I be encouraging him to try new things more often or maybe try us in more varied social groups (small ones)?<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I love him just the way he is so I don&#39;t know why I am worried. Maybe I feel some pressure because we are about to embark on our first year of official unschooling/we will not be enrolling in kindy. I don&#39;t want people to point at himand say &#39;&#39;See, homeschooled kids are socially awkward!&#39;&#39; and make some kind of example of him. I have already had a couple of people suggest that school would help him socially... I disagree obviously! He gets quite anxious at that idea (when well meaning others ask him when he will be starting school).<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Anyway, any thoughts appreciated, especially from parents of shy children. Thanks!<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Kerrie from Australia<br/>\n&gt;<br/>\n&gt; _________________________________________________________________<br/>\n&gt; View photos of singles in your area! Looking for a hot date?<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://clk.atdmt.com/NMN/go/150855801/direct/01/\">http://clk.atdmt.com/NMN/go/150855801/direct/01/</a><br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":183568025,"authorName":"Bob Collier","from":"&quot;Bob Collier&quot; &lt;bobcollier@...&gt;","profile":"quaussiebob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: shy unschooled kids","postDate":"1279534463","msgId":56191,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkyMThoditpb2g5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PFNOVDExMi1XMUZGNUZEMjhDRjkxODdENDczNUNGQTVCRTBAcGh4LmdibD4="},"prevInTopic":56168,"nextInTopic":56194,"prevInTime":56190,"nextInTime":56192,"topicId":56130,"numMessagesInTopic":0,"msgSnippet":"... Random thoughts that may or may not make sense or be useful. A couple of weekends ago, my wife and I and our 14 year old son Patrick, who doesn t go to","messageBody":"<div id=\"ygrps-yiv-351547036\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Kerrie Thomas &lt;kezzdee@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt;<br/>\n&gt; Anyway, any thoughts appreciated, especially from parents of shy children. Thanks!<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; Kerrie from Australia<br/>\n&gt;  \t\t \t   \t\t  <br/>\n<br/>\n<br/>\n </span></blockquote>Random thoughts that may or may not make sense or be useful.<br/>\n<br/>\nA couple of weekends ago, my wife and I and our 14 year old son Patrick, who doesn&#39;t go to school and hasn&#39;t done for almost eight years, were in Sydney for my daughter&#39;s 25th birthday party.<br/>\n<br/>\nIt&#39;s on occasions like these that I most see the contrast between my two children&#39;s personalities (offspring perhaps, neither of them are children now). My daughter was, literally and figuratively, &quot;the life and soul of the party&quot;. My son was a wallflower. He was happy to chat away if anybody spoke to him but he didn&#39;t initiate a conversation all night. <br/>\n<br/>\nThere are reasons for the dramatic difference in their personalities that have to do with the dramatic difference in their early life experiences, but that&#39;s another story.<br/>\n<br/>\nIn any event, my daughter is very outgoing, my son is very self-contained. I wouldn&#39;t call him timid. I was that as a child and he&#39;s not that. I wouldn&#39;t say he was shy either. But maybe some people would. He&#39;s very cautious. He&#39;s circumspect in new situations or in the company of people he doesn&#39;t know. He has a preference for his own company and for being at home. His social life since he quit school has had its lively phases but overall it&#39;s been very quiet compared to some unschooling lifestyles I&#39;ve read about. Nothing wrong with a quiet life of course and that certainly does seem to be how Patrick feels.<br/>\n<br/>\nSomebody asked me why he wasn&#39;t coming with me to the Australian Unschooling Conference in September. I said, &quot;Because he marches to the beat of his own drum.&quot;<br/>\n<br/>\nHe does. We haven&#39;t had anything to do with the home education community here in Canberra in the past almost eight years because Pat isn&#39;t interested. Frustrating for me sometimes, but I&#39;m not the one who&#39;s not going to school. I remember asking Pat one time, &quot;But wouldn&#39;t you like to mix with some other homeschoolers? You know, kids like you?&quot; and he looked at me as if I&#39;d affronted his individuality or something. That was most intriguing. <br/>\n<br/>\nWhen my son and I are out and about, he seems to be more interested in listening and observing than talking, and I see him in social situations where he hardly says a word, but when we&#39;re at home we get to chat away on this, that and the other and not only does he often surprise me with what he knows, he&#39;s very intelligent in how he presents his ideas, he&#39;s very sharp at picking out things I say that I haven&#39;t expressed very well, he&#39;s ribticklingly witty at times and generally I find having a conversation with him is a pleasure.<br/>\n<br/>\nAnd the thing is, if he was in school and I was at work, I would never have known that. About my own son.<br/>\n<br/>\nAnyway, yes, when I see my son and daughter together, I do occasionally wonder what I could do about my son&#39;s lack of enthusiasm for socialising. Mostly though I realise that I don&#39;t socialise just for the sake of it myself. I like being at home where I can do my own thing myself. And when I was my son&#39;s age, and older, I was terrified in most social situations and my son doesn&#39;t have *that* problem.<br/>\n<br/>\nHe&#39;s as happy as a pig in a bucket of jelly beans as far as I can tell.<br/>\n<br/>\nBob</div>","specialLinks":[]},{"userId":156024659,"authorName":"Livie Bennett","from":"Livie Bennett &lt;livbennett@...&gt;","profile":"livbennett","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:shy unschooled kids","postDate":"1279484113","msgId":56168,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAzMEE1NUMyLTc1MzUtNEVDNi1CNjdDLUIwM0Q1NEIxOTg0N0B5YWhvby5jb20+"},"prevInTopic":56160,"nextInTopic":56191,"prevInTime":56167,"nextInTime":56169,"topicId":56130,"numMessagesInTopic":0,"msgSnippet":"... beans and very talkative! He asks questions about everything and is really funny and entertaining. But not many people outside the family get to see that.","messageBody":"<div id=\"ygrps-yiv-1288481749\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;When it&#39;s just family around, he is very different, full of  <br/>\n </span></blockquote>beans and very talkative! He asks questions about everything and is  <br/>\nreally funny and entertaining. But not many people outside the family  <br/>\nget to see that. I guess I would like to know, should I just keep  <br/>\ndoing what I am doing, waiting patiently as his personality unfolds? <br/>\n&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nYou just described me - I get where he&#39;s coming from.  Yes, wait  <br/>\npatiently.  He is who he is.  He may &quot;grow out of it&quot; i.e. become more  <br/>\nextroverted, or he may be an introvert.  Nothing wrong with either of  <br/>\nthose.  I found this article<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.theatlantic.com/magazine/archive/2003/03/caring-for-your-introvert/2696/\">http://www.theatlantic.com/magazine/archive/2003/03/caring-for-your-introvert/2696/</a><br/>\nwhile it is written very tongue in cheek, I remember thinking &quot;Yes!   <br/>\nSomeone gets me!&quot;  One of the points made in the article is that while  <br/>\nit is easy for introverts to understand how extroverts work, it is  <br/>\nnearly incomprehensible to an extrovert why anyone would prefer to  <br/>\navoid groups of people.  Most introverts stay home and enjoy their  <br/>\nlittle domains, so extroverts congregate together (as they prefer) and  <br/>\nrarely run into introverts.  Thus introverts tend to be seen as  <br/>\nabnormal or shy, when really we&#39;ll gladly talk to you if you have  <br/>\nsomething interesting to talk about, but otherwise we&#39;ll just sit back  <br/>\nand take it all in - commenting when we&#39;ve thought out what we want to  <br/>\nsay and decided it is worth saying.<br/>\n<br/>\nPushing someone into participating when they don&#39;t want to just causes  <br/>\nresistance and irritation - probably not something you want to build  <br/>\nbetween you and your son.  He&#39;ll join in when (and if) he&#39;s ready.<br/>\n<br/>\nLivie<br/>\nSolvie (4), Myla (2), Finley (6 mos.)<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] shy unschooled kids","postDate":"1279482610","msgId":56160,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkzMDYxNi40MTA5Mi5xbUB3ZWIxMTA0MTYubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PFNOVDExMi1XMUZGNUZEMjhDRjkxODdENDczNUNGQTVCRTBAcGh4LmdibD4=","referencesHeader":"PDEyNzk0NTQyMzYuMjIxLjMxNjU4Lm00QHlhaG9vZ3JvdXBzLmNvbT4gPFNOVDExMi1XMUZGNUZEMjhDRjkxODdENDczNUNGQTVCRTBAcGh4LmdibD4="},"prevInTopic":56154,"nextInTopic":56168,"prevInTime":56159,"nextInTime":56161,"topicId":56130,"numMessagesInTopic":0,"msgSnippet":"***Well, as I mentioned my son is only young, but so far he is very shy in public... he doesn t respond to people in the street who say hello to him... he ","messageBody":"<div id=\"ygrps-yiv-2135081752\">***Well, as I mentioned my son is only young, but so far he is very shy in <br/>\npublic... he doesn&#39;t respond to people in the street who say hello to him... he <br/>\nsmiles but hides behind me. He is timid in approaching a new activity especially <br/>\nin a group setting, mostly he will say no but will happily watch from a <br/>\ndistance. ***<br/>\n<br/>\nThis was Chamille, only she didn&#39;t smile!  She&#39;d give people a puzzled look, <br/>\nlike she was saying &quot;who are you and why are you talking to me?&quot;  In group <br/>\nsettings, she&#39;d watch from the side and/or patiently wait for her turn, <br/>\nsometimes never getting one.<br/>\n<br/>\nWe&#39;ve been to all the Life is Good conferences, and she&#39;s been on the teen panel <br/>\nonce and has never been in the talent show.  One year she wowed people with her <br/>\nDDR skills, and this last year, she did people&#39;s hair and set up a special <br/>\neffects make-up thing and made up a bunch of boys.  She&#39;s still shy, but she&#39;s <br/>\neasy to talk to.  It didn&#39;t happen over night.<br/>\n<br/>\n***Maybe I feel some pressure because we are about to embark on our first year <br/>\nof official unschooling/we will not be enrolling in kindy. I don&#39;t want people <br/>\nto point at himand say &#39;&#39;See, homeschooled kids are socially awkward!&#39;&#39; and make <br/>\nsome kind of example of him. I have already had a couple of people suggest that <br/>\nschool would help him socially... I disagree obviously! He gets quite anxious at <br/>\nthat idea (when well meaning others ask him when he will be starting school).***<br/>\n<br/>\nI felt that when Chamille was 5.  School wouldn&#39;t have helped her socially, she <br/>\nmaybe would&#39;ve put aside her discomfort, ignored it, stuffed it down, and put up <br/>\nwith all the social stuff, but it wouldn&#39;t have helped her be better at dealing <br/>\nwith people.  She certainly wouldn&#39;t be the kind empathic person she is now that <br/>\npeople go to for help and reassurance.  That evolved over the years.  She&#39;s <br/>\nalways felt strongly about other people&#39;s feelings, but by keeping her home and <br/>\nin her comfort zone, she was able to develop herself alongside of that, in such <br/>\na way that she IS able to help others.  I feel pretty strongly that school would <br/>\nhave helped her lose herself.  <br/>\n<br/>\nChamille isn&#39;t the poster child for homeschooling, or even unschooling.  She&#39;s <br/>\nsweet and awesome and talented, but physically, most parents would discourage <br/>\ntheir kids from being like her.<br/>\n<br/>\nMargaux, Chamille&#39;s younger sister, in many ways is the polar opposite.  She <br/>\nisn&#39;t very shy, she isn&#39;t very empathic, although that is growing inside of her, <br/>\nand she would never sit on the side lines and patiently wait for her turn. <br/>\n She&#39;s often bossy and loud.  In the same way that Chamille was so quiet and <br/>\nshy, Margaux isn&#39;t at all, but school wouldn&#39;t have helped her any either.  Her <br/>\nloud bossy qualities would have drawn negative attention, and I doubt very much <br/>\nit would have helped her develop empathy towards others.<br/>\n<br/>\nIn social situations, for both my girls, I&#39;ve tried to be their &quot;right hand <br/>\nman&quot;, right there and helping them.  Chamille needed my help to break the ice <br/>\nand talk to others and be her voice, while Margaux has needed me to be there to <br/>\nmake sure that she doesn&#39;t overstep her bounds into other people&#39;s personal <br/>\ncomfort.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] shy unschooled kids","postDate":"1279479652","msgId":56154,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZCRjQ4MDdGMEQzRjQ4OTY5QjhDOThFMjlGQ0I5RUQ3QENvbm5pZVBDPg==","inReplyToHeader":"PDRDNDMyRTVFLjIwMDAwQGVhcnRobGluay5uZXQ+","referencesHeader":"PDEyNzk0NTQyMzYuMjIxLjMxNjU4Lm00QHlhaG9vZ3JvdXBzLmNvbT4gPFNOVDExMi1XMUZGNUZEMjhDRjkxODdENDczNUNGQTVCRTBAcGh4LmdibD4gPDRDNDMyRTVFLjIwMDAwQGVhcnRobGluay5uZXQ+"},"prevInTopic":56147,"nextInTopic":56160,"prevInTime":56153,"nextInTime":56155,"topicId":56130,"numMessagesInTopic":0,"msgSnippet":"... most kids. Don t worry if he likes to spend time with family, more than friends. Don t worry if he prefers to observe more than participate. Don t worry if","messageBody":"<div id=\"ygrps-yiv-1719546707\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;I am speaking from my own experience with a similar child. Do not push him to be gregarious. Don&#39;t worry if he prefers a lot more solitude than <br/>\n </span></blockquote>most kids. Don&#39;t worry if he likes to spend time with family, more than friends. Don&#39;t worry if he prefers to observe more than participate. <br/>\nDon&#39;t worry if he has just a few friends, not a big group of acquaintances. I worried and it was completely and totally needless.&lt;&lt;&lt;&lt;<br/>\n<br/>\nI am one of those kids. I am in my mid 30&#39;s. I went to public school but I still prefer to spend time with family. I don&#39;t like having lots of friends. I would prefer to have a few really close friends. It hurts when people tell me that I need to get out more. It hurts when people try to encourage me to quit wasting my time at home. It hurts when people tell me that I need to be out in the world sharing my talents. There are times when I am more social but that is usually in situations where I am really comfortable. I would love it if people would just accept the fact that I would rather hang out with my kids than go to a club or even a mother&#39;s night out. <br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: shy unschooled kids","postDate":"1279475982","msgId":56147,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkxdmZlZStyMDkzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PFNOVDExMi1XMUZGNUZEMjhDRjkxODdENDczNUNGQTVCRTBAcGh4LmdibD4="},"prevInTopic":56140,"nextInTopic":56154,"prevInTime":56146,"nextInTime":56148,"topicId":56130,"numMessagesInTopic":0,"msgSnippet":"... ************* Some people learn about people and social situations by observing first rather than diving right in to learn by interacting. Morgan is that","messageBody":"<div id=\"ygrps-yiv-1495516534\">Kerrie Thomas &lt;kezzdee@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;He is timid in approaching a new activity especially in a group setting, mostly he will say no but will happily watch from a distance.<br/>\n </span></blockquote>*************<br/>\n<br/>\nSome people learn about people and social situations by observing first rather than diving right in to learn by interacting. Morgan is that way, she&#39;ll sit and watch a group for awhile and figure out who she wants to be with, who looks nice, who picks on other kids - all that before ever saying Hi. I was one of those &quot;shy kids&quot; who people always tried to &quot;draw out&quot; and it was amazing to me to realize that hanging back and watching was actually a learning style. It can be really effective, too; Mo&#39;s a good judge of character. <br/>\n<br/>\n---Meredith (Mo 8, Ray 16)</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] shy unschooled kids","postDate":"1279471198","msgId":56140,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDNDMyRTVFLjIwMDAwQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PFNOVDExMi1XMUZGNUZEMjhDRjkxODdENDczNUNGQTVCRTBAcGh4LmdibD4=","referencesHeader":"PDEyNzk0NTQyMzYuMjIxLjMxNjU4Lm00QHlhaG9vZ3JvdXBzLmNvbT4gPFNOVDExMi1XMUZGNUZEMjhDRjkxODdENDczNUNGQTVCRTBAcGh4LmdibD4="},"prevInTopic":56137,"nextInTopic":56147,"prevInTime":56139,"nextInTime":56141,"topicId":56130,"numMessagesInTopic":0,"msgSnippet":"... I liked the rest of what you described - sounded very sweet and supportive. But this one line - not so much. What if you wait patiently and his personality","messageBody":"<div id=\"ygrps-yiv-2137951642\">On 7/18/2010 7:41 AM, Kerrie Thomas wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I guess I would like to know, should I just keep doing what I am <br/>\n&gt; doing, waiting patiently as his personality unfolds?<br/>\n<br/>\n </span></blockquote>I liked the rest of what you described - sounded very sweet and <br/>\nsupportive. But this one line - not so much. What if you wait patiently <br/>\nand his personality never unfolds into what you are waiting and hoping for?<br/>\n<br/>\nI am speaking from my own experience with a similar child. Do not push <br/>\nhim to be gregarious. Don&#39;t worry if he prefers a lot more solitude than <br/>\nmost kids. Don&#39;t worry if he likes to spend time with family, more than <br/>\nfriends. Don&#39;t worry if he prefers to observe more than participate. <br/>\nDon&#39;t worry if he has just a few friends, not a big group of <br/>\nacquaintances. I worried and it was completely and totally needless.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] shy unschooled kids","postDate":"1279470653","msgId":56137,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFEODhBODgxLTNBQjgtNENENC04OTE3LUYzNzM1RUY5MUU0QkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDRGNDMxRTJDLTdGMTMtNEZBMy1CRkNFLTE4QjJCQzNCOTMwQ0B2ZXJpem9uLm5ldD4=","referencesHeader":"PDEyNzk0NTQyMzYuMjIxLjMxNjU4Lm00QHlhaG9vZ3JvdXBzLmNvbT4gPFNOVDExMi1XMUZGNUZEMjhDRjkxODdENDczNUNGQTVCRTBAcGh4LmdibD4gPDRGNDMxRTJDLTdGMTMtNEZBMy1CRkNFLTE4QjJCQzNCOTMwQ0B2ZXJpem9uLm5ldD4="},"prevInTopic":56135,"nextInTopic":56140,"prevInTime":56136,"nextInTime":56138,"topicId":56130,"numMessagesInTopic":0,"msgSnippet":"-=- I also read John Holt s comments about how unschooled children are ... -=-That s also true of schooled kids.-=- I ve taught Jr. High, and I ve been to","messageBody":"<div id=\"ygrps-yiv-1528255463\">-=-&gt; I also read John Holt&#39;s comments about how unschooled children are<br/>\n<blockquote><span title=\"ireply\">  &gt; generally keen to try new things, many aren&#39;t afraid of getting up<br/>\n &gt; in front of a group<br/>\n<br/>\n </span></blockquote>-=-That&#39;s also true of schooled kids.-=-<br/>\n<br/>\nI&#39;ve taught Jr. High, and I&#39;ve been to three dozen or forty  <br/>\nconferences.  There IS a difference.  Technically, if the statement is  <br/>\n&quot;many aren&#39;t afraid&quot; it&#39;s also true of schooled kids, but I&#39;m also  <br/>\nthinking of teens, not of four year olds.<br/>\n<br/>\nI have vivid memories of my own school days.  I still remember some of  <br/>\nthe speeches I gave in class, and in assemblies, and remember speeches  <br/>\nothers gave.  Those were not the happy jump-on-stage-and-talk  <br/>\nexperiences my own children have.  I spoke in public, sang in public,  <br/>\nused microphones from the age of 14.   At school a great majority of  <br/>\nthe kids decided years back that they&#39;re going to be be as invisible  <br/>\nas possible, and nobody can &quot;make them&quot; give a speech or get on  <br/>\nstage.   Unschoolers are not being &quot;made to&quot; do things and they&#39;re not  <br/>\nseeking invisibility, because they haven&#39;t been knocked down so many  <br/>\ntimes they&#39;re afraid to get up.<br/>\n<br/>\n-=-I suspect the comments were in response to people&#39;s fears that unless<br/>\nkids are &quot;socialized&quot; (eg, forced into society) they&#39;ll be withdrawn.<br/>\nSo it wasn&#39;t a comment on how all unschooled kids are social.-=-<br/>\n<br/>\nI think it was a comment on the expansive, calm, open demeanor that  <br/>\ncomes from a child having grown up as a person rather than as a student.<br/>\n<br/>\n-=-&gt; When it&#39;s just family around, he is very different, full of beans<br/>\n<blockquote><span title=\"ireply\">  &gt; and very talkative!<br/>\n<br/>\n </span></blockquote>Not at all unusual. Once he&#39;s figured out how things work and gotten a<br/>\nfeel for the people, he feels comfortable to join in. (Though not<br/>\neveryone will be like that. Some people are quiet even when they feel<br/>\ncomfortable in a situation.)-=-<br/>\n<br/>\nI know two men my age (56) I&#39;ve known for 30 years.  Neither talks for  <br/>\nfun.  Neither jumps into situations.  Both are observant and  <br/>\nthoughtful, and if and when they DO decide to talk, everyone hushes  <br/>\nand listens.   I know MANY, many more people who talk and talk to the  <br/>\npoint that people ignore them.   Don&#39;t seek what appears to be  <br/>\n&quot;socialized&quot; and is really just blather and posture.<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [AlwaysLearning] shy unschooled kids","postDate":"1279469965","msgId":56132,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBMjlFOEQ5LUNEMEUtNDk3RC04NjQxLTVGN0FEREJDN0MzRkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PFNOVDExMi1XMUZGNUZEMjhDRjkxODdENDczNUNGQTVCRTBAcGh4LmdibD4=","referencesHeader":"PDEyNzk0NTQyMzYuMjIxLjMxNjU4Lm00QHlhaG9vZ3JvdXBzLmNvbT4gPFNOVDExMi1XMUZGNUZEMjhDRjkxODdENDczNUNGQTVCRTBAcGh4LmdibD4="},"prevInTopic":56131,"nextInTopic":56133,"prevInTime":56131,"nextInTime":56133,"topicId":56130,"numMessagesInTopic":0,"msgSnippet":"-=-I remember reading an article somewhere, that one of the things that first inspired the writer toward unschooling was meeting unschooled kids- and the","messageBody":"<div id=\"ygrps-yiv-1310523349\">-=-I remember reading an article somewhere, that one of the things  <br/>\nthat first inspired the writer toward unschooling was meeting  <br/>\nunschooled kids- and the writer noted (amongst other things) they were  <br/>\nthe most fun to be around. Maybe it was one of your articles Sandra-=-<br/>\n<br/>\nI don&#39;t know where it&#39;s in writing, but that would be the story of the  <br/>\nfour homeschooling families I knew when Kirby and Marty were little  <br/>\nand we were in a La Leche League playgroup and babysitting co-op, so  <br/>\nwe all knew the families in all their permutations--in their home and  <br/>\nours; kids in their home without parents; their kids in our home  <br/>\nwithout parents; kids with one parent and then both parents...  In a  <br/>\ngroup of 20 or so families that started off all pre-schoolers, as  <br/>\nthose few years passed, some families sent kids to school, but four  <br/>\nfamilies homeschooled before we were even thinking about it.  Two  <br/>\nfamilies were unschoolers and two were school-at-home.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] shy unschooled kids","postDate":"1279468407","msgId":56131,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRGNDMxRTJDLTdGMTMtNEZBMy1CRkNFLTE4QjJCQzNCOTMwQ0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PFNOVDExMi1XMUZGNUZEMjhDRjkxODdENDczNUNGQTVCRTBAcGh4LmdibD4=","referencesHeader":"PDEyNzk0NTQyMzYuMjIxLjMxNjU4Lm00QHlhaG9vZ3JvdXBzLmNvbT4gPFNOVDExMi1XMUZGNUZEMjhDRjkxODdENDczNUNGQTVCRTBAcGh4LmdibD4="},"prevInTopic":56130,"nextInTopic":56132,"prevInTime":56130,"nextInTime":56132,"topicId":56130,"numMessagesInTopic":0,"msgSnippet":"... That s also true of schooled kids. I suspect the comments were in response to people s fears that unless kids are socialized (eg, forced into society)","messageBody":"<div id=\"ygrps-yiv-2089820066\">On Jul 18, 2010, at 10:41 AM, Kerrie Thomas wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I also read John Holt&#39;s comments about how unschooled children are  <br/>\n&gt; generally keen to try new things, many aren&#39;t afraid of getting up  <br/>\n&gt; in front of a group<br/>\n<br/>\n </span></blockquote>That&#39;s also true of schooled kids.<br/>\n<br/>\nI suspect the comments were in response to people&#39;s fears that unless  <br/>\nkids are &quot;socialized&quot; (eg, forced into society) they&#39;ll be withdrawn.  <br/>\nSo it wasn&#39;t a comment on how all unschooled kids are social.<br/>\n<br/>\nKids are who they are. Unschooling prevents them from being warped by  <br/>\nthe unnatural &quot;normal&quot; environment of school. Being a shy child  <br/>\nmyself, I absolutely know school was not the best place for me. I  <br/>\ndidn&#39;t learn social skills there. I learned how to be self conscious  <br/>\nand make myself inconspicuous. Even at 54 I still feel the effects  <br/>\nwhen I&#39;m in a crowd of people socializing.<br/>\n<br/>\nMy husband had a similar experience in school but he&#39;s more of a  <br/>\nsocial introvert and blossomed out of school. I can definitely see his  <br/>\npersonality in Kathryn (who&#39;s 19) but she got to skip the years of  <br/>\npretending to be invisible to fit in. *Much* better socially adjusted  <br/>\nthan either of us.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; he doesn&#39;t respond to people in the street who say hello to him...  <br/>\n&gt; he smiles but hides behind me. He is timid in approaching a new  <br/>\n&gt; activity especially in a group setting, mostly he will say no but  <br/>\n&gt; will happily watch from a distance. He becomes fairly quiet when we  <br/>\n&gt; attend playgroup/have it at our place, a year or so ago when we  <br/>\n&gt; first started he found it too overwhelming so I eased us into it by  <br/>\n&gt; visiting with just a friend or two at a time.<br/>\n<br/>\n<br/>\n </span></blockquote>That&#39;s how he learns: by observing to get a feel for how things work.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Now he says he enjoys it, but he still doesn&#39;t interact alot, he  <br/>\n&gt; mostly sits on my lap and watches.<br/>\n<br/>\n </span></blockquote>Because you&#39;re judging enjoyment by your standards rather than by his.  <br/>\nTrust what he says.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; When it&#39;s just family around, he is very different, full of beans  <br/>\n&gt; and very talkative!<br/>\n<br/>\n<br/>\n </span></blockquote>Not at all unusual. Once he&#39;s figured out how things work and gotten a  <br/>\nfeel for the people, he feels comfortable to join in.  (Though not  <br/>\neveryone will be like that. Some people are quiet even when they feel  <br/>\ncomfortable in a situation.)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":433362453,"authorName":"Deborah Donndelinger","from":"Deborah Donndelinger &lt;deborahdonndelinger@...&gt;","profile":"deborahdonndelinger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] shy unschooled kids","postDate":"1279468008","msgId":56135,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDNDMyMUU4LjEwMDAyMDdAZ21haWwuY29tPg==","inReplyToHeader":"PFNOVDExMi1XMUZGNUZEMjhDRjkxODdENDczNUNGQTVCRTBAcGh4LmdibD4=","referencesHeader":"PDEyNzk0NTQyMzYuMjIxLjMxNjU4Lm00QHlhaG9vZ3JvdXBzLmNvbT4gPFNOVDExMi1XMUZGNUZEMjhDRjkxODdENDczNUNGQTVCRTBAcGh4LmdibD4="},"prevInTopic":56133,"nextInTopic":56137,"prevInTime":56134,"nextInTime":56136,"topicId":56130,"numMessagesInTopic":0,"msgSnippet":"Hi Kerrie, Your son sounds just like mine.  At home, he is very outgoing, talkative, in-charge.  In situations outside the home, he often likes to watch until","messageBody":"<div id=\"ygrps-yiv-1044018531\">Hi Kerrie,<br/>\n<br/>\nYour son sounds just like mine.  At home, he is very outgoing, <br/>\ntalkative, in-charge.  In situations outside the home, he often likes to <br/>\nwatch until he decides he wants to engage and after he&#39;s had a chance to <br/>\nobserve for a while.   My son is now 11.  We went to the Great Big Happy <br/>\nLife Unschooling Conference this year.  For part of the time he hung <br/>\nwith me, listening to the presenters, and enjoying being near me.  Other <br/>\ntimes he went off with the other kids - he went for a hike, into a cave, <br/>\nplayed kickball, etc.  I was astounded at how much he chose to do.   <br/>\nLast year at the conference he pretty much stuck with me.<br/>\n<br/>\nMy biggest challenges were, and are, managing comments and expectations <br/>\nfrom other folks - when he was a baby, if someone got too close, he&#39;d <br/>\nfuss.  When he was a preschooler and strangers talked to him and if he <br/>\ndidn&#39;t answer, they&#39;d call him shy.  I&#39;d feel the need to let him know <br/>\nit was okay so I&#39;d say something like &quot;He just needs time to warm up.&quot;  <br/>\n(There&#39;s probably a better way to handle that - I don&#39;t know what <br/>\nthough.)    Eventually I learned to try to avoid situations where he&#39;d <br/>\nfeel too much pressure and to ask him if he wanted to do something <br/>\nrather than just take him.<br/>\n<br/>\nHe takes karate (getting ready for his black belt test this fall!) and <br/>\nhe is now able to look an instructor in the eye and answer them.   The <br/>\ninstructors were always very respectful in how they interacted with  him <br/>\nand never shamed him for feeling shy.<br/>\n<br/>\nWe practiced answers to questions from strangers ... that helped him a lot.<br/>\n<br/>\nIf my son thinks of any ideas that might be  helpful to you and your <br/>\nson, I&#39;ll pass them on,<br/>\n<br/>\nI have more ideas but my kids are calling me,<br/>\nD.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 7/18/2010 10:41 AM, Kerrie Thomas wrote:<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I love him just the way he is so I don&#39;t know why I am worried. Maybe <br/>\n&gt; I feel some pressure because we are about to embark on our first year <br/>\n&gt; of official unschooling/we will not be enrolling in kindy. I don&#39;t <br/>\n&gt; want people to point at himand say &#39;&#39;See, homeschooled kids are <br/>\n&gt; socially awkward!&#39;&#39; and make some kind of example of him. I have <br/>\n&gt; already had a couple of people suggest that school would help him <br/>\n&gt; socially... I disagree obviously! He gets quite anxious at that idea <br/>\n&gt; (when well meaning others ask him when he will be starting school).<br/>\n&gt;<br/>\n&gt; Anyway, any thoughts appreciated, especially from parents of shy <br/>\n&gt; children. Thanks!<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":348277234,"authorName":"organicmom111","from":"&quot;organicmom111&quot; &lt;cksah@...&gt;","profile":"organicmom111","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: shy unschooled kids","postDate":"1279466299","msgId":56133,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkxdjV2ciszNjViQGVHcm91cHMuY29tPg==","inReplyToHeader":"PFNOVDExMi1XMUZGNUZEMjhDRjkxODdENDczNUNGQTVCRTBAcGh4LmdibD4="},"prevInTopic":56132,"nextInTopic":56135,"prevInTime":56132,"nextInTime":56134,"topicId":56130,"numMessagesInTopic":0,"msgSnippet":"**should I just keep doing what I am doing, waiting patiently as his personality unfolds?** Yes!  let him be himself.  As a former shy kid, pressuring and","messageBody":"<div id=\"ygrps-yiv-1893061191\">**should I just keep doing what I am<br/>\ndoing, waiting patiently as his personality unfolds?**<br/>\n<br/>\nYes!  let him be himself.  As a former shy kid, pressuring and pushing just makes it an issue, and makes you feel there is something wrong with you.  He&#39;ll grow up to be just fine!  Dont worry  :)<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Kerrie Thomas &lt;kezzdee@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; Hi everyone, I don&#39;t contribute on this list very often but am often quietly reading, taking in all your wisdom :)<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; I just wanted to ask a couple of questions that have been on my mind...<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt;  I remember reading an article somewhere, that one of the things that first inspired the writer toward unschooling was meeting unschooled kids- and the writer noted (amongst other things) they were the most fun to be around. Maybe it was one of your articles Sandra. I also read John Holt&#39;s comments about how unschooled children are generally keen to try new things, many aren&#39;t afraid of getting up in front of a group.. and I saw this whilst watching the youtube video of the Life Is Good talent quest/performances. The kids were brilliant with their dancing etc. The few local unschooling families I know also have very outgoing or talkative children.<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt;  Well, as I mentioned my son is only young, but so far he is very shy in public... he doesn&#39;t respond to people in the street who say hello to him... he smiles but hides behind me. He is timid in approaching a new activity especially in a group setting, mostly he will say no but will happily watch from a distance. He becomes fairly quiet when we attend playgroup/have it at our place, a year or so ago when we first started he found it too overwhelming so I eased us into it by visiting with just a friend or two at a time. Now he says he enjoys it, but he still doesn&#39;t interact alot, he mostly sits on my lap and watches.<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt;  I have parented him in pretty relaxed, respectful way since birth, we don&#39;t do punishments or rewards etc. But I am just starting to wonder if maybe I have done, or am doing, something that is hindering him in some way, could anyone maybe offer some possible ideas? When it&#39;s just family around, he is very different, full of beans and very talkative! He asks questions about everything and is really funny and entertaining. But not many people outside the family get to see that. I guess I would like to know, should I just keep doing what I am doing, waiting patiently as his personality unfolds? Or hould I be encouraging him to try new things more often or maybe try us in more varied social groups (small ones)? <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; I love him just the way he is so I don&#39;t know why I am worried. Maybe I feel some pressure because we are about to embark on our first year of official unschooling/we will not be enrolling in kindy. I don&#39;t want people to point at himand say &#39;&#39;See, homeschooled kids are socially awkward!&#39;&#39; and make some kind of example of him. I have already had a couple of people suggest that school would help him socially... I disagree obviously! He gets quite anxious at that idea (when well meaning others ask him when he will be starting school).<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; Anyway, any thoughts appreciated, especially from parents of shy children. Thanks!<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; Kerrie from Australia<br/>\n&gt;  \t\t \t   \t\t  <br/>\n&gt; _________________________________________________________________<br/>\n&gt; View photos of singles in your area! Looking for a hot date?<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://clk.atdmt.com/NMN/go/150855801/direct/01/\">http://clk.atdmt.com/NMN/go/150855801/direct/01/</a><br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":256043261,"authorName":"Kerrie Thomas","from":"Kerrie Thomas &lt;kezzdee@...&gt;","profile":"vespertine_nsw","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"[AlwaysLearning] shy unschooled kids","postDate":"1279464106","msgId":56130,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFNOVDExMi1XMUZGNUZEMjhDRjkxODdENDczNUNGQTVCRTBAcGh4LmdibD4=","inReplyToHeader":"PDEyNzk0NTQyMzYuMjIxLjMxNjU4Lm00QHlhaG9vZ3JvdXBzLmNvbT4=","referencesHeader":"PDEyNzk0NTQyMzYuMjIxLjMxNjU4Lm00QHlhaG9vZ3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":56131,"prevInTime":56129,"nextInTime":56131,"topicId":56130,"numMessagesInTopic":0,"msgSnippet":"Hi everyone, I don t contribute on this list very often but am often quietly reading, taking in all your wisdom :) I just wanted to ask a couple of questions","messageBody":"<div id=\"ygrps-yiv-1861817312\">Hi everyone, I don&#39;t contribute on this list very often but am often quietly reading, taking in all your wisdom :)<br/>\n<br/>\n <br/>\n<br/>\nI just wanted to ask a couple of questions that have been on my mind...<br/>\n<br/>\n <br/>\n<br/>\n I remember reading an article somewhere, that one of the things that first inspired the writer toward unschooling was meeting unschooled kids- and the writer noted (amongst other things) they were the most fun to be around. Maybe it was one of your articles Sandra. I also read John Holt&#39;s comments about how unschooled children are generally keen to try new things, many aren&#39;t afraid of getting up in front of a group.. and I saw this whilst watching the youtube video of the Life Is Good talent quest/performances. The kids were brilliant with their dancing etc. The few local unschooling families I know also have very outgoing or talkative children.<br/>\n<br/>\n <br/>\n<br/>\n Well, as I mentioned my son is only young, but so far he is very shy in public... he doesn&#39;t respond to people in the street who say hello to him... he smiles but hides behind me. He is timid in approaching a new activity especially in a group setting, mostly he will say no but will happily watch from a distance. He becomes fairly quiet when we attend playgroup/have it at our place, a year or so ago when we first started he found it too overwhelming so I eased us into it by visiting with just a friend or two at a time. Now he says he enjoys it, but he still doesn&#39;t interact alot, he mostly sits on my lap and watches.<br/>\n<br/>\n <br/>\n<br/>\n I have parented him in pretty relaxed, respectful way since birth, we don&#39;t do punishments or rewards etc. But I am just starting to wonder if maybe I have done, or am doing, something that is hindering him in some way, could anyone maybe offer some possible ideas? When it&#39;s just family around, he is very different, full of beans and very talkative! He asks questions about everything and is really funny and entertaining. But not many people outside the family get to see that. I guess I would like to know, should I just keep doing what I am doing, waiting patiently as his personality unfolds? Or hould I be encouraging him to try new things more often or maybe try us in more varied social groups (small ones)? <br/>\n<br/>\n <br/>\n<br/>\nI love him just the way he is so I don&#39;t know why I am worried. Maybe I feel some pressure because we are about to embark on our first year of official unschooling/we will not be enrolling in kindy. I don&#39;t want people to point at himand say &#39;&#39;See, homeschooled kids are socially awkward!&#39;&#39; and make some kind of example of him. I have already had a couple of people suggest that school would help him socially... I disagree obviously! He gets quite anxious at that idea (when well meaning others ask him when he will be starting school).<br/>\n<br/>\n <br/>\n<br/>\nAnyway, any thoughts appreciated, especially from parents of shy children. Thanks!<br/>\n<br/>\n <br/>\n<br/>\nKerrie from Australia<br/>\n \t\t \t   \t\t  <br/>\n_________________________________________________________________<br/>\nView photos of singles in your area! Looking for a hot date?<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://clk.atdmt.com/NMN/go/150855801/direct/01/\">http://clk.atdmt.com/NMN/go/150855801/direct/01/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":56055,"nextTopicId":56249}}