{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","replyTo":"LIST","senderId":"5IfqYkPZvNK_CUBHBXHYT5ZZbZx_mKpOh18mKdizSfuvs3c2aF2ilY7-2toBWG0Li12nCG-fAiCXqUH_PF8lS-eIVQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"FW: Radioactive Soil From Nuclear Plants May Be Sold To Homes And","postDate":"972318659","msgId":13751,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZmMwMWMwM2QxMiQ2N2U1ZTg0MCQ2NzVkZDFkMUBsZGlvbm5vPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":13750,"nextInTime":13752,"topicId":13751,"numMessagesInTopic":0,"msgSnippet":"Just when you thought it was safe to take your kids to the park. Lynda","messageBody":"<div id=\"ygrps-yiv-1291420346\">Just when you thought it was safe to take your kids to the park.<br/>\n<br/>\nLynda<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- &gt;<br/>\n<br/>\n&gt; Radioactive Soil From<br/>\n&gt;   Nuclear Plants May Be Sold<br/>\n&gt;   To Homes And Farms<br/>\n&gt;   By Brian Hansen<br/>\n&gt;   <a rel=\"nofollow\" target=\"_blank\" href=\"http://ens-news.com/ens/oct2000/2000L-10-19-15.html\">http://ens-news.com/ens/oct2000/2000L-10-19-15.html</a><br/>\n&gt;   10-22-00<br/>\n&gt;<br/>\n&gt;           WASHINGTON, DC (ENS) - A controversial plan that would<br/>\n&gt; allow nuclear power plant operators to market their radiologically<br/>\n&gt; contaminated soils to construction companies, farmers, golf courses<br/>\n&gt; and other commercial entities is moving closer to reality.<br/>\n&gt;<br/>\n&gt;           After a 14 month literature search, the U.S. Nuclear<br/>\n&gt; Regulatory Commission (NRC) has selected 56 documents with which to<br/>\n&gt; define &quot;realistic reuse scenarios&quot; for the many tons of contaminated<br/>\n&gt; soils currently piled up at nation&#39;s nuclear power plants.<br/>\n&gt;<br/>\n&gt;           According to the NRC, the nuclear power industry&#39;s<br/>\n&gt; stockpile of low level contaminated soils could be safely used for a<br/>\n&gt; number of private and public endeavors, such as home landscaping<br/>\n&gt; projects, athletic fields, and playgrounds.<br/>\n&gt;<br/>\n&gt;           Palo Verde Unit #1 nuclear power plant is located 34 miles<br/>\n&gt; west of Phoenix, Arizona. (Photo courtesy Nuclear Regulatory<br/>\n&gt; Commission)<br/>\n&gt;<br/>\n&gt;           The 56 documents selected in the literature search, which<br/>\n&gt; were culled from a collection of some two million scientific<br/>\n&gt; articles, academic publications and industry reports, will be used to<br/>\n&gt; characterize the impacts that the recycled contaminated soils would<br/>\n&gt; have on public health and the environment.<br/>\n&gt;<br/>\n&gt;           Specifically, the NRC hopes to use the documents to analyze<br/>\n&gt; the &quot;exposure pathways&quot; that will result from each soil reuse<br/>\n&gt; scenario. For example, the NRC will use the documents to analyze the<br/>\n&gt; exposure pathways in a &quot;suburban scenario,&quot; where recycled nuclear<br/>\n&gt; power plant soils are used as backfill around a domestic residence.<br/>\n&gt;<br/>\n&gt;           The exposure pathways resulting from any given soil reuse<br/>\n&gt; scenario would vary according to the activities of the people living<br/>\n&gt; area, the NRC notes. For example, if people within a suburban reuse<br/>\n&gt; scenario engaged in gardening activities, the exposure pathways could<br/>\n&gt; include inhalation, ingestion of vegetables or fruits, inadvertent<br/>\n&gt; ingestion of soil, and external exposure, the NRC points out.<br/>\n&gt;<br/>\n&gt;           Curtis Park Adventure Playground, Sacramento, California<br/>\n&gt; (Photo courtesy Sacramento Parks Dept.)<br/>\n&gt;<br/>\n&gt;           In order to evaluate the potential overall impact of<br/>\n&gt; reusing the power plant soils, the NRC will analyze several scenarios<br/>\n&gt; to determine a &quot;critical group.&quot; The NRC defines a critical group as<br/>\n&gt; a group of individuals reasonably expected to receive the greatest<br/>\n&gt; exposure to residual radioactivity for any applicable set of<br/>\n&gt; circumstances.<br/>\n&gt;<br/>\n&gt;           The dose of radiation received by the average member of the<br/>\n&gt; critical group will then be used to determine whether limitations are<br/>\n&gt; required so that soil reuse will be controlled in a way that is<br/>\n&gt; protective of public health and the environment, according to the<br/>\n&gt; NRC.<br/>\n&gt;<br/>\n&gt;           The 56 documents that were culled from more than two<br/>\n&gt; million during the literature search will provide valuable<br/>\n&gt; information in setting those parameters, the NRC maintains. Some of<br/>\n&gt; the document titles selected include:<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;           * &quot;Hazardous soils to be used in paving mix.&quot; * &quot;Large<br/>\n&gt; scale adobe brick manufacturing in New Mexico.&quot; * &quot;Methodology to<br/>\n&gt; estimate the amount and particle size of soil ingested by children:<br/>\n&gt; implications for exposure assessment at waste sites.&quot; * &quot;Ash: A<br/>\n&gt; valuable resource.&quot; * &quot;Building with adobe brick.&quot; * &quot;Probabilistic<br/>\n&gt; prediction of exposures to arsenic contaminated residential soil.&quot; *<br/>\n&gt; &quot;Technical basis for establishing environmentally acceptable<br/>\n&gt; endpoints in contaminated soils.&quot; * &quot;We&#39;re in the soils business,<br/>\n&gt; remember!&quot;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;           A key element of the project was to have a team of outside<br/>\n&gt; experts review the results of the literature search, the NRC<br/>\n&gt; emphasized. According to the NRC, the role of the outside experts was<br/>\n&gt; to alert the agency to concepts or information overlooked in the<br/>\n&gt; literature search.<br/>\n&gt;<br/>\n&gt;           One of the independent reviewers, Carlo Long Casler, did<br/>\n&gt; make such an alert to the NRC. Casler, who is affiliated with the<br/>\n&gt; Arid Lands Information Center at the University of Arizona, asked the<br/>\n&gt; NRC to review Russian documents pertaining to the accident at the<br/>\n&gt; Chernobyl nuclear power plant in 1986. Casler also suggested that the<br/>\n&gt; NRC analyze Japanese documents pertaining to the long term health<br/>\n&gt; effects of the atomic bombs that were dropped on Hiroshima and<br/>\n&gt; Nagasaki some 55 years ago.<br/>\n&gt;<br/>\n&gt;           Severe soil erosion in a wheat field in Washington. (Photo<br/>\n&gt; by Jack Dykinga courtesy U.S. Dept. of Agriculture)<br/>\n&gt;<br/>\n&gt;           The NCR, in a report released earlier this summer,<br/>\n&gt; concluded that the environmental and health impacts of those cases<br/>\n&gt; were not relevant to the question of reusing radiologically<br/>\n&gt; contaminated soil from U.S. nuclear power plants.<br/>\n&gt;<br/>\n&gt;           &quot;The unintentional exposure hazard from the high-level<br/>\n&gt; radiation that occurred in the cases Ms. Casler mentioned is<br/>\n&gt; significantly different from the anticipated exposure derived from<br/>\n&gt; soils intentionally released from NRC-regulated locations,&quot; the NRC<br/>\n&gt; stated in its report.<br/>\n&gt;<br/>\n&gt;           That&#39;s not good enough for Diane D&#39;Arrigo of Nuclear<br/>\n&gt; Information and Resource Service, a watchdog group based in<br/>\n&gt; Washington, D.C.<br/>\n&gt;<br/>\n&gt;           D&#39;Arrigo, like many environmentalists, takes issue with the<br/>\n&gt; NRC&#39;s plan to release low level radioactive materials from regulatory<br/>\n&gt; standards.<br/>\n&gt;<br/>\n&gt;           &quot;The goal should be to isolate radioactive materials and<br/>\n&gt; prevent exposures, not to deliberately expose people by allowing<br/>\n&gt; radioactive materials into regular daily commerce, D&#39;Arrigo said. &quot;If<br/>\n&gt; it&#39;s contaminated from nuclear power and the fuel chain, then it<br/>\n&gt; should be treated as a waste and isolated.&quot;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;           Joseph M. Farley Unit #1 is situated 16.5 miles from<br/>\n&gt; Dothan, Alabama (Photo courtesy Photo courtesy Nuclear Regulatory<br/>\n&gt; Commission) The NRC has already set radiation benchmarks that nuclear<br/>\n&gt; power plants must meet before they can be decommissioned. Now, the<br/>\n&gt; NRC is trying to set standards that would allow individual aspects of<br/>\n&gt; the plants to be released from regulatory control prior to a<br/>\n&gt; shutdown. In addition to contaminated soils, these standards would<br/>\n&gt; apply to metals, concrete and equipment used at nuclear power plants.<br/>\n&gt;<br/>\n&gt;           Like many environmentalists, D&#39;Arrigo is not convinced that<br/>\n&gt; the NRC&#39;s standards will be protective.<br/>\n&gt;<br/>\n&gt;           &quot;When the whole motivation behind it is to allow<br/>\n&gt; radioactive materials to be released from regulatory control, we<br/>\n&gt; can&#39;t have a lot of hope that these are really going to be objective<br/>\n&gt; or comprehensive or realistic,&quot; she said.<br/>\n&gt;<br/>\n&gt;           The NRC will take public comments on its report on human<br/>\n&gt; interaction with reused soils until November 17. The document can be<br/>\n&gt; viewed on line at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nrc.gov/NRC/NUREGS/SR1725/index.html.\">http://www.nrc.gov/NRC/NUREGS/SR1725/index.html.</a><br/>\n&gt;<br/>\n&gt;           Comments can be submitted by email to: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tjn@...\">tjn@...</a>, or by<br/>\n&gt; fax to: 301-415-5385.<br/>\n&gt;<br/>\n&gt;           © &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ens.lycos.com/Environment\">http://www.ens.lycos.com/Environment</a> News Service (ENS)<br/>\n&gt; 2000. All Rights Reserved. </span></blockquote></div>","specialLinks":[]}],"prevTopicId":13750,"nextTopicId":13746}}