{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":268949016,"authorName":"magenta_mum","from":"&quot;magenta_mum&quot; &lt;magenta_mum@...&gt;","profile":"magenta_mum","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"wavy glass, Puck! and an embiggened life","postDate":"1184700203","msgId":29963,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY3ajR2Yit2NXJpQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":29962,"nextInTime":29964,"topicId":29963,"numMessagesInTopic":0,"msgSnippet":"Bunching up some stuff here to save me replying to several posts. ~I have lived in one house that had some old wavy glass window panes... just now growing","messageBody":"<div id=\"ygrps-yiv-1495450912\">Bunching up some stuff here to save me replying to several posts. <br/>\n<br/>\n~I have lived in one house that had some old wavy glass window<br/>\npanes... just now growing curious about the history of sheet glass, I<br/>\nfound some info that indicates window panes, even the &#39;old&#39; wavy glass<br/>\nvariety are really quite new, comparative to glass/glasswork in general.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.glassonline.com/infoserv/history.html\">http://www.glassonline.com/infoserv/history.html</a><br/>\n<br/>\n<br/>\n~When it comes to &quot;R&quot; rated, savoury (or should that be unsavoury)<br/>\nlanguage, the f word is most often the one heard in our house, though<br/>\nK, my 14yr old daughter, recently resolved to substitute Puck! She&#39;s<br/>\nchosen this based on the knowledge that the f word, its connotations<br/>\nin some forms of usage is highly offensive to many people. It remains<br/>\nto be seen whether or not she&#39;ll catch herself every time a strong<br/>\nfeeling that might call for strong words is evoked in her. <br/>\n<br/>\nAt times during my life I have sworn like a trooper, or sailor,<br/>\nperhaps... and othertimes sworn off swearing in favour of exclamations<br/>\nlike Good Grief! which, lets face it, aren&#39;t half as satifying when<br/>\none has, for example, jammed one&#39;s finger in a cabinet, or cupboard<br/>\ndoor.  <br/>\n<br/>\nI recall a time when K was small and just beginning to speak short<br/>\nsentences/string of words, when on smashing my shin into the hard base<br/>\nof a bed as I was making it, I let rip a stream of highly unsavoury<br/>\nexpletives. I was mortified when my tiny angel girl (gushy, I know,<br/>\nbut that&#39;s about what went on inside me) who was right there,<br/>\nimmediately repeated what I&#39;d said in her small, sweet child voice. I<br/>\nswore off of swearing for a while then. Hearing those words from her<br/>\nmouth shocked me and made me question whether, or why, it was less<br/>\nshocking for me to speak so. <br/>\n<br/>\nK seldom used &quot;bad&quot; words inappropriately as she grew - I do think<br/>\nthere are times when a shit! or something similar is quite warranted<br/>\nin most every persons mind. There have been times, though, when other<br/>\nchildren were visiting our home and K&#39;s use of the f word, within<br/>\nearshot of me, was followed by a loaded silence into which it was<br/>\nexpected by the other children, I think, that I would interject some<br/>\nadmonishment. Sometimes I would say something like &quot;that&#39;s a strong<br/>\nword... what&#39;s up?&quot; Often I would break the tension by saying<br/>\neff,effitty,eff,eff! (just like that, or the actual word(s), depending<br/>\non what I knew of the homes the children present lived in), also in a<br/>\nstream, but really lightly, making everyone laugh. Occasionally, if I<br/>\ncould get away with it, I might pretend I hadn&#39;t heard if I could tell<br/>\nthat nothing needing my attention had prompted the use of the word. <br/>\n<br/>\n<br/>\n~I&#39;ve found the threads about children leaving home, or being forced<br/>\nout really interesting, and thought provoking. I know that when I was<br/>\nnot much older than my daughter I began to long for freedom from my<br/>\nparents (and school). Not because my parents were/are awful, but<br/>\nbecause I wanted to live as my own person. Hard for me to explain what<br/>\nthat meant to me then. From my current vantage point, the 42yrs old<br/>\none, and still feeling like I&#39;m struggling a bit sometimes to be seen<br/>\nas a whole separate person from my parents, from my family of origin -<br/>\neven while in an amicable relationship with my parents - I&#39;m still not<br/>\nsure I can quantify that desire, explain what is/was meaningful to me<br/>\nabout it.<br/>\n<br/>\nBecause of my own experiences, I&#39;d imagined that K might have a<br/>\nsimilar dream or feelings, and have asked her about what that might<br/>\nbe. (I confess, too, to beginning to plan, to envision the life I<br/>\nwould lead happily without her in it so much. I&#39;m thinking now, and<br/>\nnot unhappily, that that was pre-emptive folly of some kind.)<br/>\n<br/>\nAnyway, K was/is baffled by the idea that she might want to leave<br/>\nhome, can&#39;t imagine that she will want to, ever. So, I had something<br/>\nof an epiphany while thinking on recent discussions here, though doh!<br/>\nmoment probably describes it better. Why would she want to leave an<br/>\nenvironment where she is and always has been honoured and respected as<br/>\na whole, separate, sentient person. She has always had the power to<br/>\n*be*. She has no need to stretch, to rebel, to fight for recognition<br/>\nof her personhood, to seek to establish space to express that in. She<br/>\nalready has, in ways that are meaningful to her, an embiggened life.<br/>\n<br/>\nPerhaps she will leave one day, but if she doesn&#39;t, ever, as she says<br/>\nnow, or chooses to stay with me for years and years yet, we will, as<br/>\nothers have said, work that out as we go along, with the openess and<br/>\ngenerosity that characterises our relationship. <br/>\n<br/>\nJo R</div>","specialLinks":[]}],"prevTopicId":29944,"nextTopicId":29945}}