{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Christian Unschooling misc.","postDate":"1074792850","msgId":89700,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1LjIxMGMyOTE4LjJkNDE2MzkyQGFvbC5jb20+"},"prevInTopic":89674,"nextInTopic":89705,"prevInTime":89699,"nextInTime":89701,"topicId":89620,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/21/04 8:54:57 PM, kittiecatte@yahoo.com writes: ","messageBody":"<div id=\"ygrps-yiv-1193332295\">In a message dated 1/21/04 8:54:57 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kittiecatte@...\">kittiecatte@...</a> writes:<br/>\n<br/>\n&lt;&lt; but I won&#39;t be letting <br/>\n<br/>\nany unschooler tell me what to think or believe, or who I &quot;am&quot; or <br/>\n<br/>\nwhether I can use a certain word or term, any more than I will let <br/>\n<br/>\nthe PS so dictate &gt;&gt;<br/>\n<br/>\nBut that&#39;s internal to you and shouldn&#39;t affect what you want happening <br/>\naround you.<br/>\n<br/>\nIf someone tells you what to believe (meaning what they think you should <br/>\nbelieve) they have no way to enforce that, or even to determine if your thinking <br/>\ndid change.<br/>\n<br/>\nSo saying you don&#39;t want that to happen is just kind of talking to yourself <br/>\n(out loud to 1400 readers &lt;g&gt;).  <br/>\n<br/>\n&lt;&lt;There is a way of discussing, as Sandra said, <br/>\n<br/>\nwhat is &quot;not&quot; unschooling, but then are we talking about achieving <br/>\n<br/>\nfreedom, or including moving towards freedom; and if the latter, for <br/>\n<br/>\na minute, an hour, a day, a year?  &gt;&gt;<br/>\n<br/>\nSome people spend a minute there and get scared and run back to the fold.<br/>\n<br/>\nSome see the freedom only in academic terms.  Some let it ooze into every <br/>\npore of their  being.<br/>\n<br/>\nIt doesn&#39;t matter.  We&#39;re talking about talking about it, and what people <br/>\ntake away from the discussions is beyond the power of any committee or democratic <br/>\ngoverning body or gestapo to control.<br/>\n<br/>\nWe&#39;re talking about ideas.<br/>\nTake &#39;em or leave &#39;em.  Think them or think about something else.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":153743844,"authorName":"tjreynoso","from":"&quot;tjreynoso&quot; &lt;tjreynoso@...&gt;","profile":"tjreynoso","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Christian Unschooling misc.","postDate":"1074786329","msgId":89705,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJ1b3I2cCt0ZmlxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDQwMTIxMjI1NjEwLjM5NDk4LnFtYWlsQHdlYjQxNDA0Lm1haWwueWFob28uY29tPg=="},"prevInTopic":89700,"nextInTopic":0,"prevInTime":89704,"nextInTime":89706,"topicId":89620,"numMessagesInTopic":0,"msgSnippet":"... I m not vegetarian and I don t follow Feingold, but in my case add to that working full time.  I get the neglect part thrown at me from both homeschoolers","messageBody":"<div id=\"ygrps-yiv-388018679\"><blockquote><span title=\"ireply\">&gt; Now try being a family that is christian, unschooler,<br/>\n&gt; 1/2 vegetarian and who follow the Feingold program for<br/>\n&gt; kids with food additive allergies.<br/>\n&gt; <br/>\n&gt; I long ago realized that I would never ever find a<br/>\n&gt; &quot;support group&quot; in which this square peg fits, and<br/>\n&gt; that it was ok.  A support group of one, or a member<br/>\n&gt; of many different ones, I&#39;ve done it both ways.  It&#39;s<br/>\n&gt; all good.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I&#39;m not vegetarian and I don&#39;t follow Feingold, but in my case add <br/>\nto that working full time.  I get the neglect part thrown at me from <br/>\nboth homeschoolers and unschoolers!  I&#39;m not looking for a support <br/>\ngroup that&#39;ll include everything but it sure would be nice to find <br/>\na &quot;real, live person&quot; to talk to once in a while. Not to say that <br/>\nyou guys aren&#39;t great!!! LOL.  My schedule makes it almost <br/>\nimpossible to join one of the traditional groups inthe area. <br/>\n<br/>\nMy son mentioned yesterday maybe going to school next year.  I <br/>\nreally think that if he had other homeschoolers/unschoolers to play <br/>\nwith on a regular basis, he wouldn&#39;t feel like he was missing out on <br/>\nsomething at school. Sigh.  I try not to let it get to me when he <br/>\nsays these things. He&#39;s only just started getting used to <br/>\nunschooling but it does make me question myself.  I want to do what <br/>\nis best for him, but he doesn&#39;t really know what he wants.  He is <br/>\nonly seven.  He likes the novelty of school, but he hates homework <br/>\nand tests.  He likes the freedom he has at home, but misses being <br/>\naround other kids. At the same time he was going to the school for <br/>\nmusic and art and PE until recently and told me he doesn&#39;t want to <br/>\ngo anymore because the kids make too much noise and they don&#39;t <br/>\nreally get to do much.  So I said that&#39;s fine and he could choose if <br/>\nhe wanted to go or not.  <br/>\n<br/>\nSo, if anybody&#39;s in the Tampa Bay area give a shout out!!<br/>\nTanya</div>","specialLinks":[]},{"userId":779600,"authorName":"KathrynJB@aol.com","from":"KathrynJB@...","profile":"kathrynbeth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:Re: Christian Unschooling misc.","postDate":"1074737680","msgId":89674,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ2LjFiM2Y2ZTUuMmQ0MDhjMTBAYW9sLmNvbT4="},"prevInTopic":89669,"nextInTopic":89700,"prevInTime":89673,"nextInTime":89675,"topicId":89620,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/21/2004 8:35:05 PM Eastern Standard Time, UnschoolingDiscussion@yahoogroups.com writes: Ah, the old bisexual deal--you aren t queer enough","messageBody":"<div id=\"ygrps-yiv-488585682\">In a message dated 1/21/2004 8:35:05 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a> writes:<br/>\n<br/>\nAh, the old bisexual deal--you aren&#39;t queer enough to be queer!  -sigh-  Us,<br/>\nthem, the other.<br/>\n<br/>\nI hope I haven&#39;t made anyone feel like they AREN&#39;T or SHOULDN&#39;T or any of<br/>\nthat because of my questions.  I&#39;m curious how it works for you, not saying<br/>\nit CAN&#39;T work.<br/>\n<br/>\nKelly<br/>\n(famous ex-dyke!)<br/>\n************************<br/>\nKelly! I didn&#39;t know you used to be Joann Loulan! (Or were you Julie Cypher <br/>\nor Anne Heche?)<br/>\n<br/>\nKathryn, infamous dyke<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":63051713,"authorName":"happyadvocate","from":"&quot;happyadvocate&quot; &lt;kittiecatte@...&gt;","profile":"happyadvocate","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Christian Unschooling misc.","postDate":"1074733915","msgId":89668,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJ1bjgwcis0N2J1QGVHcm91cHMuY29tPg=="},"prevInTopic":89664,"nextInTopic":89669,"prevInTime":89667,"nextInTime":89669,"topicId":89620,"numMessagesInTopic":0,"msgSnippet":"... ***Kelly, thanks for your concern.  I agree with WifeToVegMan.  I d also say that you express yourself well, so I did understand your questions to *be*","messageBody":"<div id=\"ygrps-yiv-83284115\">-- Kelly Lenhart &lt;mina@m...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I hope I haven&#39;t made anyone feel like they AREN&#39;T<br/>\n&gt; or SHOULDN&#39;T or any of that because of my questions. <br/>\n&gt;I&#39;m curious how it works for you, not saying<br/>\n&gt; it CAN&#39;T work. Kelly<br/>\n<br/>\n </span></blockquote>WifetoVegMan said:<br/>\n<blockquote><span title=\"ireply\"> &gt;Nope, not at all. It is fun to discuss this topic<br/>\n&gt;with you. Never felt dissed in any way.<br/>\n <br/>\n </span></blockquote>***Kelly, thanks for your concern.  I agree with WifeToVegMan.  I&#39;d <br/>\nalso say that you express yourself well, so I did understand your <br/>\nquestions to *be* questions.  After I hit &quot;send&quot; I thought I should <br/>\nhave added that reassurance. No prob here.<br/>\n<br/>\nIn fact, I enjoyed participating in the interchange.  Questions help <br/>\nme to think, to phrase my thoughts, and to limit my ramblings <br/>\n(somewhat Ha!).<br/>\n<br/>\nI have found other threads in the past on this list to seem very <br/>\nharsh (IMHO) towards the professed Christians.  I am hoping this gap <br/>\nis narrowing or the people softening some.  (I do not mean you, <br/>\nKelly, and I doubt by your current tone that you had anything to do <br/>\nwith that, so I am not directing this at you.) <br/>\n<br/>\nHaving been beaten (literally and verbally) in my own (former) <br/>\nchurch, I self-diagnosed as PTSD and tend to get &quot;gun-shy&quot; if I feel <br/>\ntargeted, especially by more than one individual at a time.  Which <br/>\nwas why I stayed a member here and said little or nothing for a long <br/>\ntime. It&#39;s real easy to get rid of me!  I just set this aside and <br/>\nfigured I&#39;d read archives if I needed something.  But see, you <br/>\n(Kelly) didn&#39;t scare me off ;-)<br/>\n<br/>\nBack to the topic:<br/>\n<br/>\nUnschooling gives us - my sons and I - the freedom to exit when <br/>\nneeded.  There are so many positive reasons to unschool, towards our <br/>\ngifts and interests.  There are also many, many different injuries <br/>\nand disabilities which give people reasons to move away from <br/>\nsomething.  An example would be my youngest, who was in a private <br/>\nschool and was assigned to write an autobiography.  He began asking <br/>\nme questions and learned about &quot;the beating&quot; and immediately decided -<br/>\n stated clearly that - he did not want to write about his dad. He <br/>\ntold the teacher that he had been planning to write his <br/>\nautobiography &quot;when I am 32&quot; and was not going to change that <br/>\ndecision now.  (Somehow the sweatheart &quot;got away with it&quot; and I <br/>\npulled him out later when he was beaten at lunch.)<br/>\n<br/>\nAttending The Evergreen State College (TESC), we wrote &quot;self-<br/>\nevaluations&quot;.  The process was as educational as anything I have ever <br/>\ndone.  I was able to resurrect my self-esteem from a complete and <br/>\ntotal failure to do a planned project, by explaining that once inside <br/>\nthe research, I realized the field was already completely covered, <br/>\nand there was no point in rewriting it.  I don&#39;t think I mentioned <br/>\nthat that would have been really BORING!  But I didn&#39;t have to, <br/>\nbecause I had taken a different tangent at that point and written <br/>\nsomething new, so my work was accepted for the credit.  I had already <br/>\ngone through this process because I was interested in my topic and I <br/>\nhave to laugh at myself for going on to the interesting topic, and <br/>\nthen later &quot;worrying&quot; about the credit!  That, to me, is the gift of <br/>\nunschooling.  And a gift I can give to my children, to my students <br/>\nwhen hired to help people, and to MYSELF.  The gift of being able to <br/>\ndo something interesting!<br/>\n<br/>\nI think the term &quot;learning&quot; has been hijacked by the institutions.  <br/>\nAnd I just realized that we keep playing into their hands by using it <br/>\nfrom the view inside the school box.  Kids aren&#39;t &quot;learning&quot; (!?) <br/>\nWell, kids are always seeking to learn and so they are either <br/>\nlearning things we didn&#39;t plan to teach them, or they are bored <br/>\nbecause they aren&#39;t given nourishment for their brains and personal <br/>\ngrowth.  <br/>\n<br/>\n&quot;Learning&quot; in psychological terms is defined as a change in <br/>\nbehavior.  I look at it from inside the learning person - looking out <br/>\nat the world.  If I (the student) change my behavior then I <br/>\nhave &quot;learned&quot; something.  Sometimes I like the change in myself and <br/>\nsometimes I get help to overcome a &quot;lesson&quot; that came from a negative <br/>\nexperience.  Once I &quot;know how to learn&quot; I can self-regulate <br/>\nmy &quot;lessons&quot;.  If I don&#39;t like that I am angry from being abused, for <br/>\nexample, then I can research ways to calm down, forget it, or recycle <br/>\nthat energy, like helping others or writing.  I exercise, therefore, <br/>\nsome conscious control over what I am learning.<br/>\n<br/>\nThe institutionalized term, &quot;learning&quot; looks from inside the adults <br/>\nand committees out at the student.  It compares behavior to their <br/>\nstated goals, and if there *is* a change in behavior that wasn&#39;t on <br/>\nthe list, then it is &quot;not learning&quot;.  That, however, is inconsistent <br/>\nwith Psychologist&#39;s terms.  (There is a  movement amongst the <br/>\nteaching profession for it to become a &quot;science&quot; &lt;g&gt; but I have never <br/>\nheard it mentioned that this would require reconciliation of concepts <br/>\nand terminology with other sciences.)  Anyway, such measurements have <br/>\nnothing to do with my life or yours, nor that of any given student.  <br/>\nAnd any learning, real though it may be, that wasn&#39;t on the <br/>\ninstitutional list, doesn&#39;t &quot;count&quot;.  Except, in my experience, at <br/>\nTESC.  And then, my &quot;Christian&quot; faith was criticized and not <br/>\naccepted, so I was once again marching to a different drummer.  It <br/>\nseems I always am!<br/>\n<br/>\nWashington law allows a teacher to write an evaluation of a student <br/>\nas an annual option to standardized testing.  What I love about this <br/>\nprocess is being able to find and record and encourage the <br/>\nindividual &quot;learning&quot; that was so important to the homeschool parent <br/>\nand child but which may have been otherwise lost or &quot;not counted&quot;, if <br/>\nnot queried on a test or forgotten due to stress.<br/>\n<br/>\nOn this list this week, tt has been fulfilling to be able to have an <br/>\nintellectual discussion about what is necessarily (and shoudl be!) an <br/>\nextremely emotional topic - freedom, personal growth, and parenting!  <br/>\nThere are no roadmaps here.  <br/>\n<br/>\nAs to defining:  I asked about not &quot;doing&quot; that discussion.  I love <br/>\ndiscussing the examples and ideas and etc., but I won&#39;t be letting <br/>\nany unschooler tell me what to think or believe, or who I &quot;am&quot; or <br/>\nwhether I can use a certain word or term, any more than I will let <br/>\nthe PS so dictate.  There is a way of discussing, as Sandra said, <br/>\nwhat is &quot;not&quot; unschooling, but then are we talking about achieving <br/>\nfreedom, or including moving towards freedom; and if the latter, for <br/>\na minute, an hour, a day, a year?  <br/>\n<br/>\nI like discussing the details, the research, comparisons, and <br/>\nsharing.  I detest legalism in any of its forms.  Yes, we can ditch <br/>\nschooling or ditch Christ and still be legalistic! It&#39;s like trading <br/>\noff one addiction for another - a common human event -  if we can not <br/>\nsee that our own lifelong institutionalization has made us seek to <br/>\nimpose structure on our efforts to be unstructured.  Maybe the grown <br/>\nchildren who have not been institutionalized will be able to <br/>\nobjectively compare their experiences with those of others <br/>\nand &quot;define&quot; what we do (or do not do.)<br/>\n<br/>\nOn the topic of the CCU-List, there are no &quot;experts&quot; there to tell <br/>\nthe group members how they should think or believe.  It&#39;s just <br/>\npeachy, if you ask me.  If I can develop that kind of friendships and <br/>\nequality here I&#39;d stay I suppose, if I can manage to do all this <br/>\nreading!  <br/>\n<br/>\nFor now, it&#39;s intellectually interesting  ;-)  (and not emotionally <br/>\npainful)<br/>\n<br/>\nBlessings<br/>\n~Kit</div>","specialLinks":[]},{"userId":79793286,"authorName":"rachel_foodie","from":"&quot;rachel_foodie&quot; &lt;rachel_foodie@...&gt;","profile":"rachel_foodie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Christian Unschooling misc.","postDate":"1074730586","msgId":89669,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJ1bjRvcSsxcGNlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDQwMTIxMjI1NjEwLjM5NDk4LnFtYWlsQHdlYjQxNDA0Lm1haWwueWFob28uY29tPg=="},"prevInTopic":89668,"nextInTopic":89674,"prevInTime":89668,"nextInTime":89670,"topicId":89620,"numMessagesInTopic":0,"msgSnippet":"... Oh Susan!! (and Happy Advocate too) if that isn t exactly the truth! It s like we are pariahs no matter where we go. No one in either camp is ever really","messageBody":"<div id=\"ygrps-yiv-1545404258\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, Wife2Vegman <br/>\n&lt;wifetovegman2002@y...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; It&#39;s true, though, as happyadvocate pointed out, that<br/>\n&gt; Christian unschoolers get from the christian community<br/>\n&gt; &quot;you are sinning, you are too permissive, you need to<br/>\n&gt; read these scriptures again because they really<br/>\n&gt; say...&quot; and then we get from the secular unschooling<br/>\n&gt; community, &quot;I don&#39;t think you can unschool if you hold<br/>\n&gt; these beliefs&quot;.<br/>\n<br/>\n<br/>\n </span></blockquote>Oh Susan!! (and Happy Advocate too) if that isn&#39;t exactly the truth!<br/>\nIt&#39;s like we are pariahs no matter where we go. No one in either camp <br/>\nis ever really comfortable with us (or so it seems).  So to one camp <br/>\nthey call into question our very faith, the other camp calls into <br/>\nquestion our life philosophy. Ugh! (BTW, I am not saying this to <br/>\nanyone who is truly curious. Just to anyone who would make snap <br/>\njudgements about christian unschoolers.)<br/>\n<br/>\nRachel</div>","specialLinks":[]},{"userId":128695025,"authorName":"Wife2Vegman","from":"Wife2Vegman &lt;wifetovegman2002@...&gt;","profile":"wifetovegman2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Christian Unschooling misc.","postDate":"1074725770","msgId":89664,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwMTIxMjI1NjEwLjM5NDk4LnFtYWlsQHdlYjQxNDA0Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDEwYmQwMWMzZTA0NCQyZGM5MjIyMCRmZDAwYThjMEBKZW5ueT4="},"prevInTopic":89641,"nextInTopic":89668,"prevInTime":89663,"nextInTime":89665,"topicId":89620,"numMessagesInTopic":0,"msgSnippet":"... Nope, not at all.  It is fun to discuss this topic with you.  Never felt dissed in any way. It s true, though, as happyadvocate pointed out, that Christian","messageBody":"<div id=\"ygrps-yiv-30608561\">--- Kelly Lenhart &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mina@...\">mina@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I hope I haven&#39;t made anyone feel like they AREN&#39;T<br/>\n&gt; or SHOULDN&#39;T or any of<br/>\n&gt; that because of my questions.  I&#39;m curious how it<br/>\n&gt; works for you, not saying<br/>\n&gt; it CAN&#39;T work.<br/>\n&gt; <br/>\n&gt; Kelly<br/>\n<br/>\n<br/>\n </span></blockquote>Nope, not at all.  It is fun to discuss this topic<br/>\nwith you.  Never felt dissed in any way.<br/>\n<br/>\nIt&#39;s true, though, as happyadvocate pointed out, that<br/>\nChristian unschoolers get from the christian community<br/>\n&quot;you are sinning, you are too permissive, you need to<br/>\nread these scriptures again because they really<br/>\nsay...&quot; and then we get from the secular unschooling<br/>\ncommunity, &quot;I don&#39;t think you can unschool if you hold<br/>\nthese beliefs&quot;.<br/>\n<br/>\nNow try being a family that is christian, unschooler,<br/>\n1/2 vegetarian and who follow the Feingold program for<br/>\nkids with food additive allergies.<br/>\n<br/>\nI long ago realized that I would never ever find a<br/>\n&quot;support group&quot; in which this square peg fits, and<br/>\nthat it was ok.  A support group of one, or a member<br/>\nof many different ones, I&#39;ve done it both ways.  It&#39;s<br/>\nall good.<br/>\n<br/>\n<br/>\n<br/>\n=====<br/>\n--Susan in VA<br/>\nWifetoVegman<br/>\n<br/>\nWhat is most important and valuable about the home as a base for children&#39;s growth into the world is not that it is a better school than the schools, but that it isn&#39;t a school at all.  John Holt<br/>\n<br/>\n__________________________________<br/>\nDo you Yahoo!?<br/>\nYahoo! Hotjobs: Enter the &quot;Signing Bonus&quot; Sweepstakes<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://hotjobs.sweepstakes.yahoo.com/signingbonus\">http://hotjobs.sweepstakes.yahoo.com/signingbonus</a></div>","specialLinks":[]},{"userId":4324016,"authorName":"Kelly Lenhart","from":"&quot;Kelly Lenhart&quot; &lt;mina@...&gt;","profile":"mommamina","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Christian Unschooling misc.","postDate":"1074706192","msgId":89641,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwYmQwMWMzZTA0NCQyZGM5MjIyMCRmZDAwYThjMEBKZW5ueT4=","referencesHeader":"PDE1LjIwZDQ5MmQ0LjJkM2ZmN2U2QGFvbC5jb20+"},"prevInTopic":89634,"nextInTopic":89664,"prevInTime":89640,"nextInTime":89642,"topicId":89620,"numMessagesInTopic":0,"msgSnippet":"... then. ... Ah, the old bisexual deal--you aren t queer enough to be queer!  -sigh-  Us, them, the other. I hope I haven t made anyone feel like they AREN T","messageBody":"<div id=\"ygrps-yiv-1254551670\"><blockquote><span title=\"ireply\">&gt;Unschoolers get grief from outside AND inside the homeschooling world.  I<br/>\n&gt;hadn&#39;t thought that Christian unschoolers have it from four directions,<br/>\n </span></blockquote>then.<br/>\n<blockquote><span title=\"ireply\"> &gt;That IS harsh!<br/>\n&gt;Sandra<br/>\n<br/>\n<br/>\n </span></blockquote>Ah, the old bisexual deal--you aren&#39;t queer enough to be queer!  -sigh-  Us,<br/>\nthem, the other.<br/>\n<br/>\nI hope I haven&#39;t made anyone feel like they AREN&#39;T or SHOULDN&#39;T or any of<br/>\nthat because of my questions.  I&#39;m curious how it works for you, not saying<br/>\nit CAN&#39;T work.<br/>\n<br/>\nKelly<br/>\n(famous ex-dyke!)</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Christian Unschooling misc.","postDate":"1074699750","msgId":89634,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1LjIwZDQ5MmQ0LjJkM2ZmN2U2QGFvbC5jb20+"},"prevInTopic":89620,"nextInTopic":89641,"prevInTime":89633,"nextInTime":89635,"topicId":89620,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/21/04 1:05:58 AM, kittiecatte@yahoo.com writes: ","messageBody":"<div id=\"ygrps-yiv-235728206\">In a message dated 1/21/04 1:05:58 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kittiecatte@...\">kittiecatte@...</a> writes:<br/>\n<br/>\n&lt;&lt; It may have been already said, but unschoolers who also believe in <br/>\n<br/>\nChrist are getting &quot;it&quot; from both sides, as to whether one can <br/>\n<br/>\nunschool and &quot;be a Christian&quot;.  Ironic.  harsh! &gt;&gt;<br/>\n<br/>\nI think that&#39;s the one thing that hasn&#39;t been said.  Good point.<br/>\n<br/>\nUnschoolers get grief from outside AND inside the homeschooling world.  I <br/>\nhadn&#39;t thought that Christian unschoolers have it from four directions, then.   <br/>\n<br/>\nThat IS harsh!<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":63051713,"authorName":"happyadvocate","from":"&quot;happyadvocate&quot; &lt;kittiecatte@...&gt;","profile":"happyadvocate","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Christian Unschooling misc.","postDate":"1074671450","msgId":89620,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJ1bGIwcSs5YnR1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":89634,"prevInTime":89619,"nextInTime":89621,"topicId":89620,"numMessagesInTopic":0,"msgSnippet":"(I dont know who said this but...) ... wondering how one would define fear of reprisal. What exactly would that reprisal be? Eternal damnation? Is it","messageBody":"<div id=\"ygrps-yiv-479275146\">(I dont know who said this but...) <br/>\n<blockquote><span title=\"ireply\"> &gt;I can see &gt;how the &quot;fear of reprisal&quot; is a pivotal issue. But, I&#39;m <br/>\n </span></blockquote>wondering how one would define &quot;fear of &gt;reprisal.&quot; What exactly <br/>\nwould that reprisal be? Eternal damnation? Is it possible to be truly <br/>\n<blockquote><span title=\"ireply\"> &gt;okay with the idea of one&#39;s children being eternally damned because <br/>\n </span></blockquote>a parent values the &gt;autonomy of their choices?<br/>\n <br/>\n1 - When I read &quot;fear of reprisal&quot; I realized that the thread started <br/>\ntalking about Eternal Damnation - and yet I know all too well the <br/>\npainful reprisals of my former church and some others.  Fear can be <br/>\nof man or of the unseen.  People can exercise outward forms of their <br/>\nreligion because of a vague fear of hell, because of fear of being <br/>\nhumiliated or because of fear of being beaten, ostracized, etc.  <br/>\nInterestingly enough, schools have throughout history employed the <br/>\nsame punishments.  And with the same results: either outright <br/>\nrejection or else outward practice without understanding.<br/>\n<br/>\n2 - Because God himself is &quot;truly ok with&quot; us making our own choices <br/>\nand allowing us to not choose Him, then I feel obligated to emulate <br/>\nthat to the best of my ability.  <br/>\n<br/>\n3 - Because Eternal Damnation is just not too real here, many <br/>\nchurches and control-freak leaders feel compelled to institute a hell-<br/>\non-earth. I spent many years in one.  Supposedly this will &quot;teach&quot; <br/>\npeople to avoid hell.  In my case it was successful - I learned to <br/>\navoid those people and groups.<br/>\n<br/>\n4 - I presume that emulating heaven will be more motivating to others <br/>\nto want to learn about it and visit, eh?  And so, that&#39;s my job, when <br/>\nI remember to do it.  I mostly remember to do it when I am not <br/>\nobsessing about avoiding hell in the future, or obsessing about the <br/>\npeople who have tried to make my life into a living hell in the <br/>\npast.  Now, as for teaching children, I&#39;d presume that unschooling <br/>\nthem toward their natural positive interests and gifts would be a lot <br/>\nmore likely to interest them in eternal happiness.  There is this <br/>\nBible verse, &quot;Parents, do not irritate your children.&quot;  Hmmmmmm<br/>\n<br/>\nIt may have been already said, but unschoolers who also believe in <br/>\nChrist are getting &quot;it&quot; from both sides, as to whether one can <br/>\nunschool and &quot;be a Christian&quot;.  Ironic.  harsh!<br/>\n<br/>\nThe only mention I know of in the Bible regarding &quot;unschooled&quot; is a <br/>\npositive one, and the term &quot;Christian&quot; was coined to be derogatory, <br/>\nand is not a Biblical term.  So hey, why not?<br/>\n<br/>\nI just hope we can avoid the &quot;What and who really is unschooling?&quot; <br/>\ndiscussion, pretty please? It is sooooooo boring and we only find out <br/>\nin the end that no one is &quot;not doing school&quot; quite perfectly enough <br/>\nfor the rest of us.<br/>\n<br/>\nI didn&#39;t learn of &quot;original sin&quot; in my childhood church either.  <br/>\nLater I reconciled the concept more like &quot;nobody&#39;s perfect&quot;.  <br/>\nCertainly my compassionate honesty with my child will cover those <br/>\ntimes that I am hurt, disappointed, etc.<br/>\n<br/>\nIf we are both travelling to the city on the train, can&#39;t we just <br/>\nmake interesting conversation together on the way?  I see unschooling <br/>\nand faith as simultaneous journeys to a distant location.  I tend to <br/>\nsee and talk to those who are coming &quot;from&quot; a place near me, and yet <br/>\nI also might encourage someone else to make the trip, and they might <br/>\nhave to take a completely different mode of transportation or route.<br/>\n<br/>\nAs to the large Christ-Centered Unschooling list (CCU-List) -- well, <br/>\nit *is* a resource -- maybe for those coming from a certain direction <br/>\ninto that city I just referred to.  It&#39;s a research and fun-oriented <br/>\ngroup for encouragement, quite a diverse group.  However, there are <br/>\nno archives and it often has a high volume of mail.  There are many <br/>\nother lists that are also Christian Unschooling resources.  One other <br/>\nlarge one is the &quot;Delight-Driven&quot; list, and then there is a weekly <br/>\nChristian unschooling chat, too, on www.HomeschoolChat.us<br/>\n<br/>\nSandra mentioned priorities.  I&#39;d say that due to my divorce I had to <br/>\nturn to unschooling to survive in a shark-pool of other priorities, <br/>\nand so my kids could see their dad and lower their own stress.  One <br/>\nperson can only do so much, and schools more and more looked like <br/>\nplaces to be avoided. So I would have been a failure as a mom for not <br/>\nmaking them attend and do schoolwork, or a failure as a mom for not <br/>\ndoing school-at-home because I just plain couldn&#39;t take the time, or <br/>\nelse I could listen to my children&#39;s gifts and my own talents and we <br/>\ncould enjoy each other&#39;s company.  <br/>\n<br/>\nUnschooling and my faith both hold IMHO that we  - child and adult -  <br/>\nare equals learning together; are all, in fact, children with so much <br/>\nmore to learn and so much growing to do.<br/>\n<br/>\nBlessings<br/>\n~Kit</div>","specialLinks":[]}],"prevTopicId":89696,"nextTopicId":89639}}