{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":201436708,"authorName":"arcarpenter2003","from":"&quot;arcarpenter2003&quot; &lt;arcarpenter@...&gt;","profile":"arcarpenter2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Followup - Reading Program  - Unschooling my autistic child","postDate":"1120104203","msgId":22663,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ5dnF1YisydmhsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDUwNjI5MjMzNDEzLjk4MDMzLnFtYWlsQHdlYjUxOTA1Lm1haWwueWFob28uY29tPg=="},"prevInTopic":22657,"nextInTopic":0,"prevInTime":22662,"nextInTime":22664,"topicId":22657,"numMessagesInTopic":0,"msgSnippet":"... wrote: == ... You may know of this already, but there s a Yahoo group devoted to radically unschooling atypical and special needs child.  Explosive, out","messageBody":"<div id=\"ygrps-yiv-153567627\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Nanci Kuykendall &lt;aisliin@y...&gt;<br/>\nwrote:<br/>\n==<br/>\n<blockquote><span title=\"ireply\"> &gt; Is anyone else here unschooling a special needs child?==<br/>\n<br/>\n<br/>\n </span></blockquote>You may know of this already, but there&#39;s a Yahoo group devoted to<br/>\nradically unschooling atypical and special needs child.  Explosive,<br/>\nout -of-sync, sensory integration dysfunction, autism and autistic<br/>\nspectrum disorders, highly sensitive, and more -- all of these are<br/>\nterms that are regularly discussed on the Shine With Unschooling list.<br/>\n There are definitely moms who would be able to relate to your library<br/>\nexperience.<br/>\n<br/>\nThe focus is on letting each child shine for who they are.  Anne Ohman<br/>\nis the listowner, and she is wonderfully positive and, well,<br/>\nwonderful. &lt;G&gt;<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/shinewithunschooling/\">http://groups.yahoo.com/group/shinewithunschooling/</a><br/>\n<br/>\nPeace,<br/>\nAmy</div>","specialLinks":[]},{"userId":67247159,"authorName":"Nanci Kuykendall","from":"Nanci Kuykendall &lt;aisliin@...&gt;","profile":"aisliin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"[AlwaysLearning] Followup - Reading Program  - Unschooling my autistic child","postDate":"1120088053","msgId":22657,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwNjI5MjMzNDEzLjk4MDMzLnFtYWlsQHdlYjUxOTA1Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDExMjAwNjUxODcuNTUzLjM2MTA2Lm0xOEB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":22663,"prevInTime":22656,"nextInTime":22658,"topicId":22657,"numMessagesInTopic":0,"msgSnippet":"... LOL, I must not have done a good job at explaining this.  I don t actually want him to do it.  I was hesitant to mention it to him actually.  After ","messageBody":"<div id=\"ygrps-yiv-548989440\"><blockquote><span title=\"ireply\">&gt;It seems to me that you had to talk him into it a<br/>\n&gt;little.  Could you have just dropped it altogether<br/>\n&gt;at some point in the conversation and would he have <br/>\n&gt;been okay with that?  Is this something he could<br/>\n&gt;easily forget before you go to the library? <br/>\n<br/>\n </span></blockquote>LOL, I must not have done a good job at explaining<br/>\nthis.  I don&#39;t actually want him to do it.  I was<br/>\nhesitant to mention it to him actually.  After<br/>\ndiscussing it here and with my husband I decided to go<br/>\nthe route of honesty and let him make his own choice<br/>\nabout whether he wanted to do it, regardless of my own<br/>\njudgements about such schoolastically manipulative<br/>\nrewards programs.  <br/>\n<br/>\nSo I told him about it, as briefly and concisely as I<br/>\ncould.  Something like this: &quot;The library is doing<br/>\nthis reading program where you keep track of how much<br/>\ntime you read/are read to/look at books and then you<br/>\nget to pick prizes from their box after each 4 hours<br/>\nof reading.  You can do it if you want, or not.&quot;  I<br/>\nkeep reminding him that he doesn&#39;t have to keep doing<br/>\nit, that he can stop whenever he wants, etc.<br/>\n<br/>\nI would have left it at that, but he kept hounding me<br/>\nfor several days &quot;Tell me again how it works.&quot;  &quot;I<br/>\ndon&#39;t understand, explain it again.&quot;  &quot;What are the<br/>\nprizes like?&quot;  &quot;I still don&#39;t understand, what do you<br/>\nmean keep track of your reading?  What do mean, mark<br/>\nit in a booklet?&quot;  So that&#39;s why I had to repeatedly<br/>\nexplain it to him.<br/>\n<br/>\nI finally showed him using the booklet at the library<br/>\nas a visual aid and he seemed to be satisfied after<br/>\nthat.  He carefully collected his booklet and the<br/>\nbookmark they gave him, carries it around with him,<br/>\nconstantly asks if we can mark out time and asks if<br/>\nit&#39;s been enough time to mark another 1/2 hour square.<br/>\n He even marks his brother Alex&#39;s book for him, since<br/>\nAlex doesn&#39;t care much himself. <br/>\n<br/>\nHe woke up this morning literally saying &quot;I feel like<br/>\nsinging!  La La La!&quot; and was hopping around and giving<br/>\nspontaneous kisses and hugs to everyone, which is a<br/>\nbig deal for him.  He packed everything and everyone<br/>\neagerly in the car to go to the library this morning<br/>\nto collect on his prize, as he had enough reading<br/>\nsince yesterday afternoon.  <br/>\n<br/>\nThe prizes this week were stamps from various<br/>\ncountries and I could tell he was disappointed, but<br/>\nthankfully he didn&#39;t say anything.  I was very<br/>\nrelieved.  He did ask the children&#39;s librarian to tell<br/>\nhim what the prizes were going to be for the next few<br/>\nweeks.  When she listed that near the end of summer<br/>\nthey were going to do little toys his interest was<br/>\nimmediately caught.  I mentioned that he could just<br/>\nsave up his prize collection to come in when they had<br/>\nthe toys.  I&#39;m not sure he understood what I meant, he<br/>\nlooked confused but he nodded when I mentioned coming<br/>\nin when they had the toys.<br/>\n<br/>\nLibrary visits, like trips to the store, museums, and<br/>\nother events, are difficult.  We were in the library<br/>\nall told for about 15 minutes and here&#39;s a recap of<br/>\nit, part vent, part to help others understand what<br/>\nit&#39;s like to live with a high funcitoning autistic<br/>\nchild.  Thomas has Asperger&#39;s syndrome, Oppositional<br/>\nDefiance, Sensory Integration Dysfunction, Dyslexia,<br/>\nand has various serious allergies.  We don&#39;t like<br/>\nlabels and are glad that keeping him home has helped<br/>\nus avoid a lot of damage to his self esteem and myriad<br/>\nother problems trying to fit into a world where he is<br/>\na square peg.  Knowing where to draw the line bewteen<br/>\nmy unschooling principles guiding me to back off and<br/>\nnot interfere where my son&#39;s needs often conflict with<br/>\nthis and require me to step in a manage him is a<br/>\nconstant struggle.<br/>\n<br/>\nI was not going to sit and read to them in the library<br/>\ntoday, which can usually keep him focused and quiet<br/>\nwhile we were there, because I was only going to be<br/>\nthere a few minutes and then we had to get the car<br/>\nhome for his dad to get to work.  I needed to use the<br/>\nlibrary computer for 10 minutes to look something up,<br/>\nrequest a book in library loan and put a hold on<br/>\nanother book (some of the book suggestions given to me<br/>\nhere this week.)  I would have done it from home, but<br/>\nthe website was acting weird.  I do as much as I can<br/>\nfrom home.  <br/>\n<br/>\nI repeatedly had to explain to Thomas what I was going<br/>\nto do, where and for how long, telling him his library<br/>\nacceptable options for while I was doing that, which<br/>\nwere to stay with me quietly, or to look at books or<br/>\ndo games and puzles or play quietly a few feet away<br/>\nfrom me in the children&#39;s library area where he could<br/>\neasily see me or come to me if he needed me.  He could<br/>\nnot focus enough to acknowledge my comments.  He ran<br/>\nto get books he wanted while I was talking to him. <br/>\n<br/>\nAfter that he was running in circles between several<br/>\nrooms with adjoining doors (children&#39;s library room,<br/>\nempty conference room, main library area) and not<br/>\nresponding to or able to acknowledge my communication<br/>\nwith him about stopping or slowing down, even when I<br/>\nphysically stopped him or slowed him down as he ran<br/>\npast the stand up computer work station where I was. <br/>\nHis younger brother Alex (7yrs), who often gets roped<br/>\ninto his games, I was able to corral and get to stay<br/>\nby me willingly.  That didn&#39;t stop Thomas though and<br/>\nsoon he was getting several preschool kids in the<br/>\nchildren&#39;s area riled up and rowdy as well.  <br/>\n<br/>\nThomas was not able to make eye contact even when I<br/>\nheld his face with my hands blindering him on either<br/>\nside.  His eyes were shooting everywhere but at me. <br/>\nWhen I repeatedly asked him to acknowledge that he<br/>\nmust quiet down in the library and stop the running he<br/>\nshouted in my face &quot;OK! OK!&quot; and immediately began<br/>\nmanically giggling and running again when I let him<br/>\ngo.  When I finally wrapped my arms around him,<br/>\nrecognizing his inability to calm himself, he let<br/>\nhimself lean so far and heavily that he fell over and<br/>\nbegan to cry.  When I scooped him into my lap on the<br/>\nfloor, he was still pushing me away absently and began<br/>\ngiggling again and his eyes were rolling everywhere. <br/>\nWhen I stood him up again he was immediately pulling<br/>\nand leaning so far he was going to fall if I let him<br/>\ngo.<br/>\n<br/>\nThis took place all within the span of a few minutes<br/>\nand I decided we needed to leave.  I closed out the<br/>\ncomputer I was working on and went across to check out<br/>\nThomas&#39; books.  He climbed onto the step at the<br/>\ncounter for kids to use and started fingering the<br/>\ninkpad and trying to lift the laser scanner wand off<br/>\nthe counter and asking if he could check out the books<br/>\nwith it himself and just talking and moving a million<br/>\nmiles a minute, as well as shoving his brother and<br/>\ntrying to occupy whatever space he was in each time he<br/>\nmoved out of Thomas&#39; way.  <br/>\n<br/>\nThe librarian kindly offered Thomas a stamp and pad<br/>\nand suggested he stamp his hand.  He was horrified at<br/>\nthis idea, but I turned over his reading program<br/>\nbooklet and suggested he stamp and blank back side of<br/>\nit.  In the time it took her to check out his three<br/>\nbooks while I filled out a very short book request<br/>\nform (name, phone #, book title and author, check a<br/>\ncouple other boxes)  he had stamped his booklet 30<br/>\nsome times.<br/>\n<br/>\nThen of course he had a little ink on his hands and<br/>\nwas loudly complaining about that and shuddering.  I<br/>\ntook him to the restroom where he frantically scrubbed<br/>\nhis hand and 4 changes of liquid soap before being<br/>\nsatisfied that it was clean.  Alex meanwhile casually<br/>\nbrowsed books near the restroom and commented to me on<br/>\nthe cover art.<br/>\n<br/>\nI hustled them into the car and collapsed frazzledly<br/>\ninto the driver&#39;s seat to breath for a minute before<br/>\nheading home.  I was just thankful that all this was<br/>\nhappy manic behavior and there had been no explosions.<br/>\n This was not at all an unusual outing.  Thomas has<br/>\nimproved and progressed amazingly in the last 2 years<br/>\nin many ways, and we used to avoid the library and<br/>\nsimilar enclosed quiet places completely.  Now he can<br/>\nstay there quietly for as long as I am reading to him,<br/>\nbut if I try to do anything for myself (like today)<br/>\nit&#39;s another story.<br/>\n<br/>\nAnother interesting recent telltale exchange of<br/>\nThomas&#39; developmental and neurological differences was<br/>\nthat I began reading The Explosive Child by Ross W.<br/>\nGreene (which by the way so far seems pricelessly<br/>\naccurate of Thomas) yesterday.  Here is a link to the<br/>\ncover art, which plays a part in this anecdote.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/gp/reader/0060931027/ref=sib_dp_pt/002-6223567-7142404#readerpage\">http://www.amazon.com/gp/reader/0060931027/ref=sib_dp_pt/002-6223567-7142404#readerpage</a><br/>\n<br/>\nAlex walked into the kitchen, glanced at the book on<br/>\nthe table and said &quot;Awww, poor little bomb kid.&quot;  This<br/>\nseemed a cute but not noteworthy statement at first. <br/>\nLater I realized the implications of it.  It meant<br/>\nthat Alex recognized that the art was representative<br/>\nof both an abstract drawing of a child, AND an<br/>\nabstract drawing of a bomb.  He also immediately<br/>\nrecognized that the child-bomb had a facial expression<br/>\nand that that expression was a sad/unhappy one.<br/>\n<br/>\nThomas, hearing Alex&#39; comment, came in and looked at<br/>\nthe book as well.  After a moment and with a blank<br/>\nexpression he said &quot;Why did Alex say that?&quot; <br/>\n<br/>\nMe: &quot;Why did Alex say what?&quot;<br/>\nT: &quot;Why did he say that was a kid?&quot;<br/>\nMe: &quot;His large head and smaller body indicate that he<br/>\nis a child, as well as his playing with blocks.&quot;<br/>\nT: &quot;Why did he say &#39;poor bomb kid&#39; like that?  Is it<br/>\nbecause he has that fire thing in his head like a<br/>\nbomb.&quot;<br/>\nMe: &quot;Well the round red head and the fuse are what<br/>\nmade Alex say he was a bomb kid, yes.  I think Alex<br/>\ndisplayed sympathy for him because of his facial<br/>\nfeatures, which show sadness.  The way his eyebrows<br/>\nand mouth are drawn, the way his head is tilted and<br/>\nthe way his eyes are so small and seem almost teary<br/>\nshow his sadness.&quot;<br/>\n<br/>\nThomas looked again carefully for a minute, then went<br/>\nabout his business.<br/>\n<br/>\nUnschooling these two so radically different children<br/>\nis often a challenge, always an adventure and<br/>\ndefinitely a learning experience for me every day.<br/>\n<br/>\nIs anyone else here unschooling a special needs child?<br/>\n<br/>\nNanci K.</div>","specialLinks":[]}],"prevTopicId":22637,"nextTopicId":22664}}