{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"discovery6@aol.com","from":"discovery6@...","replyTo":"LIST","senderId":"nz9alOW9Fh55OtBiQyO_bCAF_Tp0uWhJbuTGF7DWGDpVrwfXie4k7zTGu0m95B7LpJR_n2BbdySX","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] video games and decision making","postDate":"980749653","msgId":15464,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ3LjZiNDk3ZGIuMjdhNjY3NTVAYW9sLmNvbT4="},"prevInTopic":15448,"nextInTopic":0,"prevInTime":15463,"nextInTime":15465,"topicId":15448,"numMessagesInTopic":0,"msgSnippet":"  Hi, I wrote the top line. And when I said it I did not say that I","messageBody":"<div id=\"ygrps-yiv-1942181606\">&lt;&lt; &lt;&lt; I think it is important that every <br/>\n family decide what is best for their family. &gt;&gt;<br/>\n <br/>\n &lt;&lt;&lt;&gt;<br/>\n<br/>\nHi, I wrote the top line. And when I said it I did not say that I or my <br/>\nhusband do not listen to our kid&#39;s input or ideas. If we did not listen then <br/>\nI would not have 5 puppies in my house right now. ( I use raising dogs as <br/>\nexamples because it is my kid&#39;s new project/job. They wanted to try raising <br/>\nand training dogs for hopeful profit and their Dad and I agreed to let them.) <br/>\nWhat I meant was that we are all in different situations. As our lives differ <br/>\nso does the way we decide how we wish to live them.  Sandra mentioned that <br/>\nletting her children play video games/tv as long as they wish works in her <br/>\nfamily. And her children often choose not to play the games at all. If this <br/>\nconcept works in her family who am I to say they should change. If it is <br/>\nworking then more power to them. All I can really do is look at my family and <br/>\nsee what works. My children have made choices. Of course they can change <br/>\ntheir minds and often do but when they have made commitments they have to <br/>\nstick with them. There is not enough time around here for anyone to be on the <br/>\npsx or computer very long. My kids are the ones with the dog business. When <br/>\nthey started this they agreed that dogs need to be exercised daily at least <br/>\nonce. Pens need to be cleaned, pups trained, feeding 3 times a day, houses <br/>\nbuilt, more pens added. The list goes on. By giving the kids a set amount of <br/>\ntime they can play the video games then it is fair. (The girls said that if <br/>\nthe boys could play all they wanted they would never get on again.lol) Then <br/>\nif there is more free time I do not care how the kids spend it. And if they <br/>\nall want to use the pc then we quickly figure how much freetime they have and <br/>\nthen divide it up to make it fair. I want to stress that I do not yell at <br/>\nthem to get off the &quot;whatever&quot; right now. But we did discuss this. I am not <br/>\nthe one that said &quot;hey why don&#39;t you get 10 dogs and tie yourselves down&quot;. I <br/>\nam the one that agreed to let them try what they wanted to do. And if I have <br/>\nto remind them that it is chores before play around here then I do, because <br/>\nanimals cannot wait until there is a good time to pause in a game. This is my <br/>\nfamily, and this is working. We are not working fools. The puppies are fun, <br/>\nand the grown dogs are loving, and we are working together and learning as we <br/>\ngo. <br/>\n     What works in my family may very well flop in yours. Isn&#39;t that one very <br/>\nbig problem in public schools treating all the kids the same though they are <br/>\nso different. I am not sure what I am trying to say is getting across. I <br/>\nsuppose it is that giving out ideas and thoughts is great and we can all pick <br/>\nand choose what we can use. But for me to say that your family should be <br/>\njogging 3 times a day( or whatever, fill in the blank) would be wrong. I <br/>\nmight tell you how much my family jogs but that does not mean it is what you <br/>\nor your family should do. <br/>\n<br/>\nCandy, who has gone on too long</div>","specialLinks":[]},{"userId":0,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","replyTo":"LIST","senderId":"CpZBUmB854TpS_5fML83Rr4j9MAoNQ0c--sI4Jm2WDuamFJAX0ADARP45VCo4ZUqBGhvxw1PhbOM","spamInfo":{"isSpam":false,"reason":"0"},"subject":"video games and decision making","postDate":"980707954","msgId":15448,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIzLjZhYmYxZTMuMjdhNWM0NzJAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":15464,"prevInTime":15447,"nextInTime":15449,"topicId":15448,"numMessagesInTopic":0,"msgSnippet":"-=- If I let the kids use the pc or tv as much as they wanted then there would be an endless fight over who s turn it was and fights get really old, really","messageBody":"<div id=\"ygrps-yiv-1270664335\">-=- If I let the kids use the pc or <br/>\n<br/>\ntv as much as they wanted then there would be an endless fight over who&#39;s <br/>\nturn it was and fights get really old, really fast.-=-<br/>\n<br/>\nHere, whoever&#39;s playing or on e-mail or whatever can stay on as long as they <br/>\nneed to, until they&#39;re done.  If another has said &quot;I&#39;m next,&quot; then it&#39;s their <br/>\nturn next, whether it&#39;s a half an hour or three hours or five minutes.  If <br/>\nsomeone has emergency need to check e-mail or they need to record a show or <br/>\nsomething, they ask for cuts and GET cuts, because it&#39;s rare to ask.  <br/>\n<br/>\n-=-this happens all the time. If I am totally involved in <br/>\n<br/>\nsomething and the kids, animals, chores, meals or whatever needs my attention <br/>\n<br/>\nI stop and take care of it. Isn&#39;t that something that too needs to be <br/>\nlearned?-=-<br/>\n<br/>\nSure, but YOU learned and decided what was important, it wasn&#39;t being <br/>\narbitrarily decided outside you.<br/>\n<br/>\nPlaying before dogs are fed wouldn&#39;t happen--there are priorities.  But if <br/>\nthe clock is a priority over the children&#39;s interests, maybe children&#39;s inte<br/>\nrests aren&#39;t being considered sufficiently.   And games have pausing places.  <br/>\nIf moms say &quot;When you can pause, please go bring wood in&quot; it&#39;s infinitely <br/>\nbetter than &quot;Turn that off right now and get me some wood.&quot;<br/>\n<br/>\nAh---I had already used wood gathering before I read the rest of the message <br/>\n(because it snowed here and I had boys bring wood in last night, even <br/>\ncompany-visitor boys).<br/>\n<br/>\n&lt;&lt;Or do you disagree and think I <br/>\n<br/>\nshould still allow my kids to do what they wish whenever they wish? &gt;&gt;  <br/>\n<br/>\nI didn&#39;t say whenever, I said however long.  I was questioning arbitrary time <br/>\nlimits.  Books aren&#39;t intrinsically better than moving pictures and <br/>\ninteractive media.  If that&#39;s true, why not just read homeschooling books <br/>\ninstead of e-mail lists and bulletin boards?<br/>\n<br/>\n&lt;&lt; I think it is important that every <br/>\n<br/>\nfamily decide what is best for their family. &gt;&gt;<br/>\n<br/>\nI think anyone making a decision can benefit from more input and ideas.<br/>\n<br/>\n&lt;&lt;How many levels does a typical Nintendo game have?  I worry that &quot;finished&quot; <br/>\ncan take a huge amount of time to achieve.&gt;&gt;<br/>\n<br/>\nI mean &quot;finished&quot; for then.  When you&#39;re reading a book, don&#39;t you sometimes <br/>\npick a satisfying stopping place instead of stopping right in the middle of a <br/>\nparagraph?  Like that.  And in the case of a game, stopping where the game <br/>\ncan be saved/backed up.<br/>\n<br/>\nThe end of a game, like the last page of a really good novel, can be a <br/>\nletdown, because something really provocative has ended.<br/>\n<br/>\n&lt;&lt;My 6 year old is asking for Nintendo, which he enjoys playing when he<br/>\n<br/>\nvisits his cousins.  What would be a cheap way to gratify his wishes?  Can<br/>\n<br/>\nI get an old model and buy mostly used games?&gt;&gt;<br/>\n<br/>\nYES.   I&#39;d recommend Super Nintendo, because you can still get used ones (and <br/>\nmaybe even still new ones).  Original NES is no longer supported by anyone. <br/>\nAnd you can get used games for $10 or sometimes less.    <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.gamestop.com/jump/\">http://www.gamestop.com/jump/</a> if there aren&#39;t places near you that sell used <br/>\ngames and systems.  [Amalia&#39;s right--if they&#39;ve played N64 Super will seem <br/>\nsmall to them, but on the other hand, my kids play with all of them.  There <br/>\nwas a long, hard game of an old Ninja Turtle four-player game this morning, <br/>\nbecause we have company and they were looking for something older kids could <br/>\ndo with younger kids (with the house full, people still asleep here and <br/>\nthere, and snow outside).  TMNT it was.  <br/>\n<br/>\n&lt;&lt; Last Christmas we got a reconditioned SuperNinendo (including a warranty!) <br/>\nfor a sibling group for  about $40 at Funcoland. &gt;&gt;<br/>\n<br/>\nFuncoland is out of business (sold to Gamestop within the last month).<br/>\n<br/>\n&lt;&lt;I can&#39;t fuss too much-------I still have a turntable and a shelf full of <br/>\nvinyl LPs!        &gt;&gt;<br/>\n<br/>\nOh.... me too. &lt;g&gt;  And we have a whole drawerful of original Nintendo games, <br/>\nmost bought used.  Marty and I bought Kirby a game for Christmas that he <br/>\ndidn&#39;t already have, for the regular, and he sat and played it for hours in <br/>\nthe first few days after Christmas even though he had also gotten the new <br/>\nZelda game for 64.   Just because somone has a shelf full of hardbound, <br/>\ncolor-illustrated books doesn&#39;t mean a cheap paperback isn&#39;t going to have a <br/>\ngreat story!!</div>","specialLinks":[]}],"prevTopicId":15439,"nextTopicId":15467}}