{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Trusting kids","postDate":"1240944712","msgId":44388,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd0N2o4OCtvaGJnQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":44387,"nextInTime":44389,"topicId":44388,"numMessagesInTopic":0,"msgSnippet":"Chamille had a friend over last night.  His mother was working late and he stayed at our house instead of being home alone.  They were hungry and not really","messageBody":"<div id=\"ygrps-yiv-1068711779\">Chamille had a friend over last night.  His mother was working late and<br/>\nhe stayed at our house instead of being home alone.  They were hungry<br/>\nand not really liking the choices for food here, so they rounded up a<br/>\nbunch of change and headed out on a mission to get food.  I thought<br/>\nthey&#39;d go to the 7-11 because it&#39;s only a couple of blocks away, but<br/>\nthey ended up at a pizza place a bit farther, maybe 6 or 7 blocks away,<br/>\nless than a mile for sure.  It was fine with me, Chamille called and<br/>\ntold me where they were when they got there.  On their way home the<br/>\nboy&#39;s mother called them and was very upset that he had gone to the<br/>\npizza place without telling her.  It&#39;s a little weird, but she&#39;s really<br/>\nover protective about knowing where he is at all times.<br/>\n<br/>\nSo, when they got back here, his mind was full of thoughts of how his<br/>\nmother was upset with him.  He expressed deep regret that he can&#39;t<br/>\ncommunicate well with his mother and that she doesn&#39;t ever really listen<br/>\nto him, cuts him off, usually because she doesn&#39;t like what he is<br/>\ntelling her.  He went on to express his frustration that his parents<br/>\ndon&#39;t trust him and that he doesn&#39;t know how to prove trustworthiness. <br/>\nHe&#39;s a good kid, does well in school, doesn&#39;t do drugs, gets home on<br/>\ntime, and really tries to be good.  His mother isn&#39;t even a bad parent,<br/>\nshe&#39;s pretty nice really, and he really does like his mother, even<br/>\nthough he&#39;s very hurt by her actions that show disappointment and lack<br/>\nof trust.<br/>\n<br/>\nThis kid cried and poured his heart out to us.  Chamille and I loved him<br/>\nup and fed him jelly bellies and apple juice and talked and talked about<br/>\neverything.  At one point he had said that he could understand how a<br/>\nparent wouldn&#39;t trust their child if they&#39;d done something to break<br/>\ntheir trust.  I really disagree with this.  Isn&#39;t a child who has done<br/>\nsomething, only making a mistake?  Does it really mean that trust is<br/>\nbroken, or doesn&#39;t it mean that a kid made a mistake and is going to do<br/>\nbetter next time?<br/>\n<br/>\nKids live up to their parent&#39;s expectations.  If parents don&#39;t trust<br/>\ntheir kids, eventually the kids will be untrustworthy, thereby giving<br/>\nvalidation to the fact that the kids weren&#39;t to be trusted.  Why even<br/>\nbother being trustworthy if you aren&#39;t trusted to begin with?  I trust<br/>\nmy kids absolutely.  I don&#39;t doubt for a moment that they will do things<br/>\nthat are less than brilliant, but I still trust them and still want to<br/>\ntrust them.<br/>\n<br/>\nAnyway, those are the thoughts floating in my head today.</div>","specialLinks":[]}],"prevTopicId":44375,"nextTopicId":44378}}