{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] excepert from A Gaian Paradigm","postDate":"1257565137","msgId":48475,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI1NDIzLjE5Nzk5LnFtQHdlYjExMDQxNS5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PGhkMjJ1NCtiNXZ0QGVHcm91cHMuY29tPg==","referencesHeader":"PGhkMjJ1NCtiNXZ0QGVHcm91cHMuY29tPg=="},"prevInTopic":48474,"nextInTopic":0,"prevInTime":48474,"nextInTime":48476,"topicId":48471,"numMessagesInTopic":0,"msgSnippet":"I got to this part and stopped reading, then skimmed on down and realized how incredibly long it was and didn t go on.   ***Trying to fix the organizations","messageBody":"<div id=\"ygrps-yiv-921802157\">I got to this part and stopped reading, then skimmed on down and realized how incredibly long it was and didn&#39;t go on.<br/>\n <br/>\n***Trying to fix the organizations that now make up our society is helping to maintain the status quo. Yet, ambitious programs rave on about &quot;fixing the schools,&quot; &quot;fixing the government,&quot; &quot;fixing the market,&quot; fixing the social infrastructure, &quot; &quot;fixing the health system&quot; and &quot;fixing&quot; all the other aspects of our culture. All of these not only harmonize with but are dependent on all of the others. All are based on the same values of self-interest, competition, and materialism. To rise above these limitation and open ourselves to real social change means rejecting the foundation as well as the superstructure.***<br/>\n <br/>\nI disagree with this assessment almost entirely.  I don&#39;t agree that they harmonize or are dependent on each other, nor do I agree that they are all based on the same value system that iclude self-interest, competition, and materialism.  Culture systems are much more complex than that and aren&#39;t based on any one set of values.  Since I believe that human nature is essentially good, most value systems in any culture are brought about through good intent, even if the outcome isn&#39;t as good as the intention.  And that&#39;s all assuming that value systems are intentional in a grand scheme to begin with.<br/>\n <br/>\nReal social change begins with a small child in your arms and how a parent chooses to raise that child.  That may seem small minded and silly, but that&#39;s what I see to be true in my own life.  I never dreamed that my first born child would change me so profoundly, nor did I foresee how very different she is from what is around me in the greater world.  Her life has changed everyone she&#39;s touched, and I have no doubt that my youngest daughter will do the same.<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"wt everlasting f!?  Re: [AlwaysLearning] excepert from A Gaian Paradigm","postDate":"1257554048","msgId":48474,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBMzdGMDc3LTRFNzUtNDJBRC1CMDI2LTlBRkJCMkU0NUM5RkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhkMjJ1NCtiNXZ0QGVHcm91cHMuY29tPg==","referencesHeader":"PGhkMjJ1NCtiNXZ0QGVHcm91cHMuY29tPg=="},"prevInTopic":48473,"nextInTopic":48475,"prevInTime":48473,"nextInTime":48475,"topicId":48471,"numMessagesInTopic":0,"msgSnippet":"-=-Our current society is too enmeshed by its current in the dominainator paradigm-=- Excuse me, but what the f**k!??      dominain...   dominainate.... ","messageBody":"<div id=\"ygrps-yiv-1340341721\">-=-Our current society is too enmeshed by its current in the  <br/>\ndominainator paradigm-=-<br/>\n<br/>\nExcuse me, but what the f**k!??      dominain...   dominainate....   <br/>\ndominainator!?????????    ?<br/>\n<br/>\nBy its current FLOW in the dominainator paradigm?<br/>\nBy its current PREDICAMENT in the...<br/>\nBy its ELECTRICAL current in the...??<br/>\n<br/>\n<br/>\nThis reminds me of a new group on Facebook:<br/>\nAn Arbitrary Number of People Demanding That Some Sort Of Action Be  <br/>\nTaken<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.facebook.com/group.php?gid=59306991210&ref=mf\">http://www.facebook.com/group.php?gid=59306991210&ref=mf</a><br/>\n<br/>\nFor fun, many people are saying very little, with great intensity of  <br/>\nfeeling.<br/>\n<br/>\nSo I don&#39;t know how that crazy stuff got by our team of censors, but  <br/>\nthere it is...  Sorry.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":287815876,"authorName":"Robyn L. Coburn","from":"&quot;Robyn L. Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] excepert from A Gaian Paradigm","postDate":"1257553397","msgId":48473,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA5RTdDOThDNTQ4RTQyM0I4RURGNTE5MDQxRDFBRjk3QFJvYnluUEM+","inReplyToHeader":"PGhkMjJ1NCtiNXZ0QGVHcm91cHMuY29tPg==","referencesHeader":"PGhkMjJ1NCtiNXZ0QGVHcm91cHMuY29tPg=="},"prevInTopic":48471,"nextInTopic":48474,"prevInTime":48472,"nextInTime":48474,"topicId":48471,"numMessagesInTopic":0,"msgSnippet":"Too much to read in one email. It s better to post a link to an online article or book chapter that you ve found interesting, with a short representative","messageBody":"<div id=\"ygrps-yiv-1495006628\">Too much to read in one email. It&#39;s better to post a link to an online <br/>\narticle or book chapter that you&#39;ve found interesting, with a short <br/>\nrepresentative quote, and then explain why it intrigued you.<br/>\n<br/>\nHowever it might be tough to find a representative quote. It sounds like a <br/>\nfairly fractured grab bag of a chapter - a little bit of everything with a <br/>\nlot of assertions - by which I mean no footnotes citing research sources. <br/>\nThere are some quotes but they are mixed in with the assertions that may or <br/>\nmay not be grounded in fact. Plus who is the author?<br/>\n<br/>\nI think many of the ideas (as far as I could see from a jumping around scan) <br/>\nsound like they fit with unschooling practice. But I tend to look askance a <br/>\nbit at books that include the phrase &quot;as we have discussed&quot;.<br/>\n<br/>\nReading something is not discussion. Spewing a ton of factoids is not <br/>\ndiscussion, and I can&#39;t discuss something with a page in a book. It&#39;s fuzzy <br/>\nlanguage, a sign of fuzzy thinking. What the author may mean is &quot;as I <br/>\nalready said&quot; - so that makes it repetitive. Hmmm.<br/>\n<br/>\nBill, how are the ideas in this book helping you enhance your relationship <br/>\nwith your kids? That&#39;s the real value to unschoolers of any of book.<br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.Iggyjingles.etsy.com<br/>\nwww.iggyjingles.blogspot.com<br/>\nwww.allthingsdoll.blogspot.com</div>","specialLinks":[]},{"userId":1665204,"authorName":"Bill E","from":"&quot;Bill E&quot; &lt;tranet@...&gt;","profile":"trails04970","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"excepert from A Gaian Paradigm","postDate":"1257541380","msgId":48471,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhkMjJ1NCtiNXZ0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":48473,"prevInTime":48470,"nextInTime":48472,"topicId":48471,"numMessagesInTopic":0,"msgSnippet":"A Gaian Paradigm Chapter 17 ---  Life-Long-Learning THOUGHTS ON THE TRANSITION Our current society is too enmeshed by its current in the dominainator paradigm","messageBody":"<div id=\"ygrps-yiv-605161165\">A Gaian Paradigm<br/>\n  Chapter 17 ---  Life-Long-Learning<br/>\n<br/>\nTHOUGHTS ON THE TRANSITION<br/>\n\tOur current society is too enmeshed by its current in the dominainator paradigm and its cultural blinders to see that options to our cultural norms exist.  The daily practices of our families,  our schools, and our churches, our stores, and our work teaches us that the way we do things and the way we think is &quot;normal&quot; and natural.  Not doing any of them is an abnormal as eating horse meat in the USA, or not saying &quot;please&quot; and &quot;thank you&quot; in Amish societies.  We take the values of self-interest, competition, and materialism as merely the way things are, not a value system that we could give up even if we wanted to.  The transition to a new paradigm is not normal.  It is a rejection, or at least an open reexamination of all that  we take as inalienable truths.  <br/>\n\tManish Jain has opened that door in India with his concern for &quot;unlearning.&quot;  School leavers, or homeschoolers as we would call them in America,  are encouraged and helped to erase what and the way they learned in school, from their minds.  Ivan Illich  in Deschooling Society (see chapter 6) urged EuroAmericans to do the same.  He went further to show that the cultural norms of our current society that are being  emphasized in our schools, perpetuates the illnesses of our current society that so many recognize but iyt of which can not see their way out.  The cry for &quot;change&quot; in President Obama&#39;s campaign hit a very responsive chord.  But the definition of the change that was needed has not yet been enunciated by any of our political leaders.  The word &quot;change&quot; hangs in a fog that everyone can see and agree with, but which no one articulates clearly.<br/>\n\tTrying to fix the organizations that now make up our society is helping to maintain the status quo.  Yet, ambitious programs rave on about &quot;fixing the schools,&quot; &quot;fixing the government,&quot; &quot;fixing the market,&quot; fixing the social infrastructure,&quot; &quot;fixing the health system&quot; and &quot;fixing&quot; all the other aspects of our culture.  All of these not only harmonize with but are dependent on all of the others.  All are based on the same values of self-interest, competition, and materialism.  To rise above these limitation and open ourselves to real social change means rejecting the foundation as well as the superstructure.<br/>\n\tAs we have shown throughout the first two sections of this book a Gaian paradigm and Gaian cultures give us optional goals for our lives.  What we need now is some ideas on how we can bring the transition about.   The first requirement may be to reset out vaues.  Rather than expecting self-interest, competition, and materialism to bring us the good life we might set our new goals on public interest, cooperation, and The health of Gaia.  \t<br/>\n\tPublic interest is the true meaning of democracy.  It refers to the &quot;common well-being&quot; or &quot;general welfare.&quot;  Under law these terms become almost meaningless since almost any action can be defended in terms of public interest.  Corporate greed to some is in the public interest.  In terms of materialism this is easy to defend. However as a personal goal within the concept of Gaia it can become clearer.   Public interest is whatever improves the well-being of Gaia including other people.   <br/>\n\tCooperation, as we have discussed, is human nature and the core of the successful evolution of humans.  A cooperative society is, like a reciprocity culture, one in which life&#39;s purpose is the well-being of all of society.  It is the recognition that we are all interdependent.  And the well-being of all is the well-being of each.  Within a Gaian society that moto extends to all of nature as well as all of humanity.  <br/>\n\tThe health of Gaia is the active part of this trio.  A society steeped in and practicing life-long-learning instead of the accumulation of material wealth is a radical departure from the status quo.  Large mansions, speedy cars, and conspicuous consumption are no longer accomplishments to be sought.  Accumulating knowledge and skills and using them in the public interest  replaces them.<br/>\n\tNo one of this trio alone sets out a new social order. Their interdependence does.  The question we need to address is how can life-long-learning create a  cooperative society that puts public-interest cooperation, and the well-being of Gaia.  ahead of self-interest, competition and material accumulation.  <br/>\n<br/>\nWHY  WE  LEARN <br/>\n\tThe industrial worker of the past is no longer of value in the Unites States. Menial boring jobs are done by machines or by the poor in other countries for far less cost than would support a family in America.   What is needed, if the United States is to remain viable, is  creative individuals inventing  new kinds of goods and services.   Locking young people up in schools during the most formative years of their lives to be taught skills and life styles no longer of value to society  is destructive not only of the individual&#39;s own self worth, but also of  the nation&#39;s potential future.  The time when graduating from school provided graduates with enough memorized knowledge to live a comfortable long life has passed.  The future industry requires life long self learning.<br/>\n\tNot only is the industrial need for workers radically different than in the past, but learning must be transformed to meet humans&#39; psychic and social needs as well.  There is no   personal satisfaction now, if there ever was, for the self-interest, competition, and materialism of industrial society.   As Alfie Kohn in  No Contest: the case against competition,&quot; [see Chapter 6]  so well points out, that the competition we take for granted is destructive of both individual and social well-being.   Kohn argues that the cultural norm of competition must be transformed to cooperation.  Ivan Illich enlarges the position in making the case that both learning and living should be  convivial. That is,  we should all learn and live in joyous collaboration with family, friends and colleagues.<br/>\n\tThe present education system limits its concern to pre-society individuals. It has not given up the old dominator  motivation for learning in spite of dramatic social changes and social needs.  Young people are still isolated in schools to be taught the mechanics and life styles they would have needed for jobs no longer available in this nation.  EuroAmerican societies no longer need automatons to work rote jobs in the boring production lines. Even industry now sees its needs creative critical thinkers able to invent, innovate and imagine new concepts, new systems, and new designs. They need workers able to keep current with the rapidly change of inventions and innovations  A new learning system must be designed for the future of industry as well as the psychic well-being of the life-long learners themselves.<br/>\n<br/>\nHOW  WE  LEARN <br/>\nBrain Research<br/>\n\tNot only is the reason to learn radically differently, for both the individual and society, but also brain research has revealed how the human mind learns.   No two minds are alike, nor is any one mind prepared to absorb and organize  the same information as any other at the same time and in the same way.  Trying to teach 20 or more people at the same thing ant the same time in the same way is an inefficient if not impossible, task.   <br/>\n\tBrain research sets a new foundation for understanding learning. It tells us  that learning is a nonlinear function of the mind.  That is, the input to the brain is not organized.  It includes a chaotic jumble of unorganized sounds, sights, feelings,  smells, tastes and ideas.  It is the mind that organizes the scattered inputs into logical and useful order.  The ability to learn anything new is unique for each person.  Learning is something each mind does for itself<br/>\n\tAs Roger Sperry pointed out, all steps in evolution include three new properaties -- physical forms  qualia, ahnd &quot;downward causation.&quot; &quot;downward causation.&quot; Sperry also recognized that the brain, triggered by the senses, is always feeding new data for the mind to organize and use.  We are learning all of the time,.   [See Sperry in Chapter #06].<br/>\n<br/>\n\tThe educate/teach/school syndrome with its government designed  curriculum taught by authoritarian teachers by rote memory, is not only inadequate but even destructive for the the process of learning.   Manish Jain in India has initiated a new program of &quot;unlearning&quot; for school graduates and school leavers  to enable them to become creative members of society.  Roland Meighan in England has organized a &quot;Personal Learning&quot; movement to recognize and meet the unique needs of each individual on a personal path.  In America some families have moved beyond homeschooling to &quot;unschooling.&quot; They learn with their children whatever and whenever a child expresses an interest in any topic.  A small booklet, &quot;How School Affect Your Kids,&quot; from  The Consumers&#39;  Association of Penang in Indonesia explores &quot;why schools make students ill.&quot;  It questions why students are &quot;cut off from reality,&quot; and wonders  how they can exist in the world having been taught that &quot;only what is authorized is accepted.&quot;  The booklet ends with a long list, and some stories of great men and women who have become leaders because of their refusal to be schooled.  Among them, are Ernest Hemingway, Jack London, Ansel Adam, Joan of Arc, Edison, the Wright Brothers, Benjamin Franklin, Steven Spielberg, Mozart, and Albert Einstein.<br/>\n\tWe will see later in the book how a few organizations have moved beyond education and adopted program to help learners learn without schools.<br/>\n<br/>\nWHAT WE LEARN<br/>\n\tWhat we learn is the central concern of the current education system.  In the K-12 system the curricula are given undue attention by educators, bureaucrats, and legislators. Even at best a curriculum is broken down into subjects.  Each subject is taught as if it had no connection with others.  The  products of ur scools may be graduates who have gotten straight As.  But who are not able to synthesize the courses into an integrated view of the whole.  They may have skills, facts,  and data but they have no wisdom and little participation in the world in which they live. <br/>\n\tHigher education is  likewise  carefully proscribed by degree granting institutions as well as is the schcled advance of  students.  I recall my own university education that as a engineering physics student I was discouraged from taking courses in theater.  It was argued. probably  correctly, that I had only 4 years to accumulate all the credits needed for my degree and a job in science.  Even in graduate school the proscribed courses narrow one&#39;s choice of learning.  Education is very Newtonian,  that is, it is atomized by topics and sub topics.  Very much as the dominator paradigm suggests.  A Gaian holistic approach to learning  is taboo. <br/>\n<br/>\n\tI found this approach to education limited the breadth of the physicists I met while in the physics program of the National Science Foundation.   Most of them knew all there was to know about their very narrow limite specialty.  But were woefully uninformed in other areas such as the fate of the Earth or the beauty of nature, .  A few, like Einstein,  Max Born, Eddington, Russell, and Murry GellMann are able to become specialists in their professions and still have a deep and broad understanding of other fields.  In my university teaching of physics  I insisted that each of my classes read a couple of the more philosophical books of some of these expert scientist.  The dean of my university soon reminded me that I was hired to teach only physics. This may, of course, be just the way the fields of knowledge are,  but it may also be that the system of education requires limits to wisdom.<br/>\n<br/>\n\tCertainly in all levels of learning and all levels of life,  society can and must develop a broader view of learning than now exists. New concepts of Life-Long-Learning must be freed of current strictures. Learning must be viewed as the purpose of life, replacing work, jobs, and material accumulation.  Each person must be free to learn anything at any time in any way from the vast world of knowledge without being limited to small hunks of that world determined by governments, religions or other outside forces.  The major work of learning is learning how to learn. Our mantra should be &quot; freedom to learn.&quot;<br/>\n<br/>\nWHEN WE LEARN<br/>\n\tThe current system of education concentrates on the K-12 ages with a passing interest in preschool training or in the values for life.  Higher education can be painted with the same brush.  Learn to get a job, not to improve life on Earth.  At one time, that may have been a somewhat justified assumption, as was the accompanying assumption  that one can be taught, in the  k-12 years, all of the information needed for a full life of work earning a living.   Both the current social needs and the new brain research give the lie to these assumptions.   To say nothing about the psychic needs of the individual for a pleasurable, creative and fulfilling lifetime of learning.  Add to that the new techniques and technologies, including the Internet, that make communication around the world possible in nanoseconds, and its easy to see why schools at all levels are failing to prepare students for the future. <br/>\n<br/>\n\tSocial needs, human capabilities, and technologies make it necessary as well a possible to design a learning system that betters serves both individuals and society.  The holistic Gaian concept implies that we are all integral parts of nature and society from birth.  New information is flowing endlessly and being organized in our brain/mind continually.  We are, whether we plan for it or not, life-long learners. <br/>\n <br/>\n\tLife-long-learning is more a change in philosophy, or world view, than merely a change in how we do things. It is first the world view that we are an integral par of the Earth and all life on Earth.  It is then the view that all people should, or must, be open to new ideas, new experiences, new behaviors, and new skills throughout their lives.  This not only leads to a more satisfying life, but is also necessary today and will be more so in the future.  The world of knowledge is growing so fast that even in the fading industrial world no one alone can keep current with all the knowledge they need.  No one  can get enough knowledge in their heads to serve them for more than a few years.  A few years ago the turn of time for knowledge was 25 or more years.  In the past decade or two it has shortened to 5 or 10 years.  This speed up in the growth of knowledge needs to be accounted for not only to maintain the skills one needs for a series of ever changing jobs.  But also for rapid change in all aspect of our cultures -- music, art, services, goods, leisure, religions, foods, medicines, and others.   Today with computers the transformation of knowledge is rapidly getting even shorter.<br/>\n<br/>\n  \tFor this reason alone it is clear that the school system is inadequate and that a learning system must provide  more flexibility so that each person can learn at any time what they need and want  at that specific time.  This fact drives many families to take their children out of school and become homeschoolers.  In doing so they also take their children out of the learning environment, and away for learning peers.<br/>\n <br/>\n \tIn cooperative learning with peers a learner gains from the interest, knowledge and help of others. The breadth of the topic studied comes not only from what other know but also from what they don&#39;t know and the questions one learner asks that might never come to another one&#39;s ind. In addition comrades in study fill in the basic human need to belong. That feeling of friendship, conviviality, cooperation, and sense of belonging last well beyond a session in math, english, or nature study. It is usually a lifelong enjoyment.<br/>\n<br/>\n<br/>\n<br/>\nEnd Chapter 17<br/>\nLife Long Learning if<br/>\nA Gaian Paradigm</div>","specialLinks":[]}],"prevTopicId":48045,"nextTopicId":48463}}