{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":22,"messages":[{"userId":294520986,"authorName":"Joanna","from":"&quot;Joanna&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: An all-new question","postDate":"1264820173","msgId":50269,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhrMDc0ZCs3a2ZqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRCNjMzMEFBLjYwODA5MDJAeWFob28uY2E+"},"prevInTopic":50256,"nextInTopic":0,"prevInTime":50268,"nextInTime":50270,"topicId":50120,"numMessagesInTopic":0,"msgSnippet":"... Nope--not since we stopped having the t.v. restricted.  :-)  Before that, when the kids were younger, my son was in some theater classes.  A majority of","messageBody":"<div id=\"ygrps-yiv-1054572361\"><blockquote><span title=\"ireply\">&gt; I was schooled, but I mostly felt the way that your teens felt, in that <br/>\n&gt; not having had much television as a child, I was always missing the key <br/>\n&gt; points of conversations, or not understanding the sexual inuendo, not <br/>\n&gt; getting the jokes, didn&#39;t listen to popular music so had no idea what <br/>\n&gt; was going on most of the time. <br/>\n&gt; <br/>\n&gt; Can we explore this further?  Do other&#39;s feel their unschooled teenagers <br/>\n&gt; also experience this? <br/>\n<br/>\n </span></blockquote>Nope--not since we stopped having the t.v. restricted.  :-)  Before that, when the kids were younger, my son was in some theater classes.  A majority of the warm-up ice breaker games they played were based on popular t.v. characters.  When my son would come home complaining about that to me, my first strategy was to talk with the teachers to see if they could play games NOT based around pop culture like that.  Although they sympathized, nothing really changed.  <br/>\n<br/>\nThe same thing came up around the same time, when he was looking for more friends, and all the boys we met were into video games.  I thought it was enough that he could play when he was with them.  But his skills were so lacking that he felt bad.  Not long after these experiences, we dropped all the limits around media, because I could see that he was actually socially handicapped.  It stopped making sense to me that I was raising him to not be able to function in his world.<br/>\n<br/>\nSince then he has &quot;caught up&quot; with his peers.  I&#39;d say he gets all the references that his schooled counterparts do, but without the meanness.<br/>\n<br/>\nI think media is where most of the common culture comes from--not school.<br/>\n<br/>\nThe other thing is that I remember moving the same year that Mork and Mindy came out.  We moved out to a house that didn&#39;t have t.v. for about 6 months.  EVERYONE at my new school was watching that show (or so it seemed) but me, and I felt really left out.<br/>\n<br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":197421595,"authorName":"Katy Jennings","from":"Katy Jennings &lt;kjennings95@...&gt;","profile":"coyotegoddess95","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Re: An all-new question","postDate":"1264804234","msgId":50256,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFNOVDEwNS1XMTY3MTRBQjUzRUFBNDY2RDdGRDA5OEJFNUIwQHBoeC5nYmw+","inReplyToHeader":"PDk4QkU1QjlFLTk1REUtNEUwOS05OTgzLTE5QzI2OTg4NzcyQUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDRCNjMzMEFBLjYwODA5MDJAeWFob28uY2E+IDw1NDA4NzAuMzc2MC5xbUB3ZWIxMTA0MDMubWFpbC5ncTEueWFob28uY29tPiw8OThCRTVCOUUtOTVERS00RTA5LTk5ODMtMTlDMjY5ODg3NzJBQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":50255,"nextInTopic":50269,"prevInTime":50255,"nextInTime":50257,"topicId":50120,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-789929891\">&lt;&lt;&lt;&lt;Sometimes the best justification given for all of that is that when <br/>\nschool kids grow up they&#39;ll be able to deal with bosses and co-workers <br/>\nthey don&#39;t like.<br/>\n<br/>\nHuh&gt;&gt;&gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nI have been told that many times.  People worried about how Richard would learn to deal with people that he had problems with. <br/>\n<br/>\n <br/>\n<br/>\nI went to preschool, elementary school, a 2 year jr. high school, a 2 year mid-high school, 2 year high school, and college, and I STILL have a hard time with mean two-faced bosses, co-workers, others.  All that school didn&#39;t help me any.  I just don&#39;t deal with it well, I don&#39;t understand it.  I will think of some smart thing that I could have said during a discussion/confrontation hours or days later.  <br/>\n<br/>\n <br/>\n<br/>\nRichard, who has never been to school, deals with it much better than I.  He hasn&#39;t endured the school-yard taunts, but most of his friends are school kids, all of his in town friends are.  He goes to TaeKwonDo, he plays on Xbox live, he interacts with school kids almost every day.  He just has more interpersonal intellegence than I do I guess.  He doesn&#39;t get his feelings hurt easily and he doesn&#39;t take hours to think of something to say.  School didn&#39;t help him with that.  <br/>\n<br/>\n <br/>\n<br/>\nKaty<br/>\n \t\t \t   \t\t  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: An all-new question","postDate":"1264803383","msgId":50255,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk4QkU1QjlFLTk1REUtNEUwOS05OTgzLTE5QzI2OTg4NzcyQUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDU0MDg3MC4zNzYwLnFtQHdlYjExMDQwMy5tYWlsLmdxMS55YWhvby5jb20+","referencesHeader":"PDRCNjMzMEFBLjYwODA5MDJAeWFob28uY2E+IDw1NDA4NzAuMzc2MC5xbUB3ZWIxMTA0MDMubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":50252,"nextInTopic":50256,"prevInTime":50254,"nextInTime":50256,"topicId":50120,"numMessagesInTopic":0,"msgSnippet":"-=-I m GLAD my kids recognize the cruelty of other kids and don t feel they must tolerate it. I m GLAD they know it s a choice to put up with the nonsense that","messageBody":"<div id=\"ygrps-yiv-639708401\">-=-I&#39;m GLAD my kids recognize the cruelty of other kids and don&#39;t feel  <br/>\nthey must tolerate it. I&#39;m GLAD they know it&#39;s a choice to put up with  <br/>\nthe nonsense that &quot;schooled&quot; kids spew out. There is a lot of head  <br/>\ngames and manipulation that happens in school social circles. It&#39;s  <br/>\nvery unnatural and definitely a direct outcome of being forced into  <br/>\nunnatural social situations that schools produce.<br/>\n-=-<br/>\n<br/>\nSometimes the best justification given for all of that is that when  <br/>\nschool kids grow up they&#39;ll be able to deal with bosses and co-workers  <br/>\nthey don&#39;t like.<br/>\n<br/>\nHuh.<br/>\n<br/>\nMy kids have thusfar found ways to avoid people they don&#39;t like, and  <br/>\nwhen they do take a job, to make themselves so useful and likable that  <br/>\nit&#39;s not torture.   When they&#39;re done, they quit.  Pretty much, they  <br/>\nhave quit with bosses asking them please not to quit.  Sometimes they  <br/>\nstayed a while longer. &lt;g&gt;<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: An all-new question","postDate":"1264802781","msgId":50252,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU0MDg3MC4zNzYwLnFtQHdlYjExMDQwMy5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PDRCNjMzMEFBLjYwODA5MDJAeWFob28uY2E+","referencesHeader":"PDRCNjMzMEFBLjYwODA5MDJAeWFob28uY2E+"},"prevInTopic":50250,"nextInTopic":50255,"prevInTime":50251,"nextInTime":50253,"topicId":50120,"numMessagesInTopic":0,"msgSnippet":"***I think this is sort of the fear that many non-homeschoolers, or anti-homeschoolers, are voicing when they say that children not schooled will not be","messageBody":"<div id=\"ygrps-yiv-1434603314\">***I think this is sort of the fear that many non-homeschoolers, or <br/>\nanti-homeschoolers, are voicing when they say that children not schooled <br/>\nwill not be &#39;socialized&#39; .***<br/>\n<br/>\nIt&#39;s a fair statement.  Unschooled kids and homeschooled kids in general won&#39;t be socialized in the same way that schooled kids are.<br/>\n<br/>\nThere is a local homeschool dad that I used to have a quote from, on a long ago computer that was long ago put out of commission, but it went something like, and I&#39;m only paraphrasing what I remember... &quot;If I wanted my kids socialized like what happens in schools, I&#39;d pee on his shoes in the bathroom, steal his lunch money, tease him, bully him, and send him away crying.&quot;  His child had experienced all of those socialization things in school and it was the reason they had pulled him out of school.<br/>\n<br/>\nI&#39;m GLAD my kids recognize the cruelty of other kids and don&#39;t feel they must tolerate it.  I&#39;m GLAD they know it&#39;s a choice to put up with the nonsense that &quot;schooled&quot; kids spew out.  There is a lot of head games and manipulation that happens in school social circles.  It&#39;s very unnatural and definitely a direct outcome of being forced into unnatural social situations that schools produce.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: An all-new question","postDate":"1264801805","msgId":50250,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIyQjZFQjc0LUMzMTUtNDEzMS1COUZBLUIwQjE0MkZBNjRCNEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDRCNjM1MzExLjIwMTA4MDBAeWFob28uY2E+","referencesHeader":"PDRCNjM1MzExLjIwMTA4MDBAeWFob28uY2E+"},"prevInTopic":50249,"nextInTopic":50252,"prevInTime":50249,"nextInTime":50251,"topicId":50120,"numMessagesInTopic":0,"msgSnippet":"-=-So, the stories about lockers, school, gym class... kids taunting, being mean. Do they just not care about those things? Do they not encounter those things,","messageBody":"<div id=\"ygrps-yiv-985746953\">-=-So, the stories about lockers, school, gym class... kids taunting,  <br/>\nbeing<br/>\nmean. Do they just not care about those things? Do they not encounter<br/>\nthose things, since they are mostly found in school-grounds? Do they<br/>\nknow how to deal with them? -=-<br/>\n<br/>\nWhen they were kids they would look at me and shrug, about the taunts,  <br/>\nand I would sometimes (especially if it was at our house) tell the kid  <br/>\nthat I know kids at school say things like that, but they weren&#39;t at  <br/>\nschool, and my kids weren&#39;t school kids and for them to be nicer.<br/>\n<br/>\nCalmly.  Matter of factly.  Our back yard was the place to be for  <br/>\nseven or so families of kids when my kids were little (just neighbors,  <br/>\nI mean, in addition to the La Leche League babysitting co-op friends),  <br/>\nso kids WOULD be nice to continue to get to come over.<br/>\n<br/>\nAs to school and lockers and teachers, Kirby had a karate teacher,  <br/>\nMarty had a skating teacher and Holly had a dance teacher, so they had  <br/>\nsomething to add, a little bit, but they mostly said &quot;What do you  <br/>\nmean?&quot; or &quot;I didn&#39;t go to school,&quot; and that was that.<br/>\n<br/>\n-=I was thinking of anyone who is exposed<br/>\nto all the same kinds of things learned in school (with or without<br/>\nformal learning, curriculum, etc...), but not exposed to the<br/>\nsocialization particular to school. -=-<br/>\n<br/>\nMe too.  That would be my kids.<br/>\n<br/>\nBut when people outside of homeschooling talk about that, they&#39;re  <br/>\nusually thinking of the isolated fundamentalist unschoolers I was  <br/>\ntalking about, whose parents are keeping them home because they want  <br/>\nthem to know less.<br/>\n<br/>\nI kept my kids home so they could know lots and lots MORE.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":251210887,"authorName":"Shira Rocklin","from":"Shira Rocklin &lt;shirarocklin@...&gt;","profile":"shirarocklin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: An all-new question","postDate":"1264800529","msgId":50249,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCNjM1MzExLjIwMTA4MDBAeWFob28uY2E+"},"prevInTopic":50244,"nextInTopic":50250,"prevInTime":50248,"nextInTime":50250,"topicId":50120,"numMessagesInTopic":0,"msgSnippet":"*How do you feel about not having the cultural exposure to be in on jokes and popular music?* Well, I felt left out.  I never was so interested in those","messageBody":"<div id=\"ygrps-yiv-526133933\">*How do you feel about not having the cultural exposure to be in on<br/>\njokes and popular music?*<br/>\n<br/>\nWell, I felt left out.  I never was so interested in those things, or at <br/>\nleast some of them.  Ok.  The television was my parents... there were <br/>\ntimes where we didn&#39;t have cable, just antenna.  And then there was when <br/>\nmy siblings got older and started to fight about who got to watch what, <br/>\nand they TV was just taken away for periods of time.  I remember <br/>\nwatching Murder She Wrote through the stair rails when my parents <br/>\nthought I was asleep.  That is not what I want to reproduce with my kids! <br/>\n<br/>\nBut music is different.  I just wasn&#39;t interested in it.  I loved what <br/>\nmy parents played... and they played what they loved.  They weren&#39;t <br/>\nattempting to limit us.  I just never had any urge to seek out anything <br/>\ndifferent (different from Simon and Garfunkle, Peter Paul and Mary, <br/>\netc).   So I guess that was my own doing.<br/>\n<br/>\nI still don&#39;t understand a lot of the sexual jokes that go around... I <br/>\nguess I&#39;m just that way, even being married and having two kids.  Just <br/>\npersonality. So, also not to do with schooling. <br/>\n<br/>\n*My kids only miss the traditional schoolyard taunts, as to their<br/>\nunderstanding. Because my kids know current music (And &#39;60&#39;s, AND a<br/>\nlot of Gilbert & Sullivan &lt;g&gt;), they aren&#39;t baffled by conversation.<br/>\nThey don&#39;t have stories about lockers or school counsellors or PE<br/>\nclasses, but they&#39;re natives of the culture around them.*<br/>\n<br/>\nSo, the stories about lockers, school, gym class... kids taunting, being <br/>\nmean.  Do they just not care about those things?  Do they not encounter <br/>\nthose things, since they are mostly found in school-grounds?  Do they <br/>\nknow how to deal with them? <br/>\n<br/>\nBut I guess it doesn&#39;t even matter, because there are schooled kids who <br/>\ndon&#39;t do anything about being taunted, and there are those that have <br/>\ngreat come-backs.   Maybe its more about personality than about school <br/>\nor no school.<br/>\n<br/>\n*There is no monolithic &quot;the homeschooler&quot; about whom we can make these<br/>\nstatements.<br/>\nSome homeschoolers are kept away from TV, computers, modern culture,<br/>\nscience books and mainstream history so that their parents can<br/>\nfabricate a cushion of reconstructed history around them, and help<br/>\nprepare them to take over America when they&#39;re grown. That doesn&#39;t<br/>\napply to anyone outside the U.S., and doesn&#39;t apply to all<br/>\nhomeschoolers. But they do exist, and their &quot;socialization&quot; is<br/>\nlimited to church, if the parents haven&#39;t already broken with the<br/>\nchurch for being too liberal.*<br/>\n<br/>\nOk, I should have described the homeschoolers I had in mind.  I was <br/>\nthinking of the average middle-of the road homeschoolers.  I know <br/>\ngeneralizations can&#39;t be made.  I was thinking of anyone who is exposed <br/>\nto all the same kinds of things learned in school (with or without <br/>\nformal learning, curriculum, etc...), but not exposed to the <br/>\nsocialization particular to school.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: An all-new question","postDate":"1264796617","msgId":50244,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBDQTY3RDZFLUY2QzEtNEQxRC04MTgyLUZBRTkwMkE2NzI5N0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDE2OUY5NDE3MEYwRDRDODZCQ0JCODMxQjg5ODJBOTg0QExZTEFMQVAyPg==","referencesHeader":"PDRCNjMzMEFBLjYwODA5MDJAeWFob28uY2E+IDwxNjlGOTQxNzBGMEQ0Qzg2QkNCQjgzMUI4OTgyQTk4NEBMWUxBTEFQMj4="},"prevInTopic":50243,"nextInTopic":50249,"prevInTime":50243,"nextInTime":50245,"topicId":50120,"numMessagesInTopic":0,"msgSnippet":"-=-if a child is unschooling, they have less of a need to be fluent in the cultural media language because there is a variety of other fellow unschoolers,","messageBody":"<div id=\"ygrps-yiv-258917711\">-=-if a child is unschooling, they have less of a need to be fluent in  <br/>\nthe cultural media &quot;language&quot; because there is a variety of other  <br/>\nfellow unschoolers, some of whom also have no interest in that and  <br/>\nmany/most of whom are accepting of each other even if they differ in  <br/>\ncultural fluency. that said, i think the &quot;fluency&quot; and familiarity  <br/>\nwith cultural/popular media and language is a natural result from the  <br/>\nfreedom and access around media for most unschoolers, to what ever  <br/>\nextent they are interested in such fluency, and those who aren&#39;t  <br/>\nprobably wouldn&#39;t be if they were in school either, but they would  <br/>\njust suffer from that lack more. -=-<br/>\n<br/>\nI agree with that, but if a child is unschooling and hanging around  <br/>\nwith a small group of other friends, they WILL have common interests  <br/>\nand experiences, either of what they&#39;ve played or built or who else  <br/>\nthey&#39;ve known and played with, to outings the families have been on,  <br/>\nand if when the kids are older they find other connections through  <br/>\nsports or dance or anime or WoW, they&#39;ll have those things in common.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: An all-new question","postDate":"1264796333","msgId":50243,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2OUY5NDE3MEYwRDRDODZCQ0JCODMxQjg5ODJBOTg0QExZTEFMQVAyPg==","inReplyToHeader":"PDRCNjMzMEFBLjYwODA5MDJAeWFob28uY2E+","referencesHeader":"PDRCNjMzMEFBLjYwODA5MDJAeWFob28uY2E+"},"prevInTopic":50242,"nextInTopic":50244,"prevInTime":50242,"nextInTime":50244,"topicId":50120,"numMessagesInTopic":0,"msgSnippet":"********* There is a petty jabbing verbal teasing/insulting way of relating to each other, among most teenagers, that seemed to always leave my kids feeling","messageBody":"<div id=\"ygrps-yiv-952453650\">*********<br/>\n    <br/>\n  &quot;There is a petty jabbing<br/>\n  verbal teasing/insulting way of relating to each other, among most<br/>\n  teenagers, that seemed to always leave my kids feeling just bewildered<br/>\n  and a bit hurt, but not really &quot;getting&quot; what was happening and feeling<br/>\n  oddly a bit left out. Again - can&#39;t generalize to all unschoolers, but<br/>\n  I&#39;ve seen that with some others, too.&quot;<br/>\n<br/>\n<br/>\n  *****************<br/>\n  I was schooled, but I mostly felt the way that your teens felt, in that <br/>\n<br/>\n  Can we explore this further? Do other&#39;s feel their unschooled teenagers <br/>\n  also experience this? Is it just dependent on personality type? Or <br/>\n  does it have something in particular to do with being unschooled/schooled? <br/>\n<br/>\n  I think this is sort of the fear that many non-homeschoolers, or <br/>\n  anti-homeschoolers, are voicing when they say that children not schooled <br/>\n  will not be &#39;socialized&#39;. And the stock homeschool answer is to give <br/>\n  all the examples of opportunities to socialize with all different types <br/>\n  of people that exist for homeschoolers that schoolers generally miss. <br/>\n  But its sort of side-stepping the question. Is the problem the value <br/>\n  that is being given to that particular type of socialization? Or is <br/>\n  there really something missing from the homeschooler&#39;s socialization? <br/>\n<br/>\n<br/>\n  *****************<br/>\n<br/>\n<br/>\n<br/>\n  i  don&#39;t read the above as being an indigtment of unschoolers/home schoolers socialization or lack thereof.  i read it as being a lack of indoctrination into the cruelty aspects of popular/schooled culture, and that &quot;ribbing&quot; feeling foreign is a GOOD thing.  my daughter was schooled until age 13, and now, at nearly 15 she is still blown away by the kindness that is inherent in unschooling groups of teens.  she is in HEAVEN with that milieu.  she was always very sensitive socially and deeply hurt by what others may have perceived to be very minor &quot;normal&quot; kid culture type interactions.  and she was in school!<br/>\n<br/>\n  i was also schooled, but was raised without T.V. and with hippy alternative parents who didn&#39;t know the first thing about popular culture, music, etc.  <br/>\n<br/>\n  i got along ok in schooler, without that knowledge, until i was 9 and i moved to the city from a small country town, and all of a sudden i knew NOTHING.  all the kids ever talked about was movies and t.v. shows and music and stuff that i was clueless about.  so - i was schooled but &quot;unsocialized&quot; in those things.  <br/>\n<br/>\n  if a child is unschooling, they have less of a need to be fluent in the cultural media &quot;language&quot; because there is a variety of other fellow unschoolers, some of whom also have no interest in that and many/most of whom are accepting of each other even if they differ in cultural fluency.  that  said, i think the &quot;fluency&quot; and familiarity with cultural/popular media and language is a natural result from the freedom and access around media for most unschoolers, to what ever extent they are interested in such fluency, and those who aren&#39;t probably wouldn&#39;t be if they were in school either, but they would just suffer from that lack more.  <br/>\n<br/>\n  lyla<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: An all-new question","postDate":"1264796014","msgId":50242,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ5QkJFNjdBLTEwQUQtNDM3My1CQjIxLUU2NDlDQTUwMDI2REBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDRCNjMzMEFBLjYwODA5MDJAeWFob28uY2E+","referencesHeader":"PDRCNjMzMEFBLjYwODA5MDJAeWFob28uY2E+"},"prevInTopic":50239,"nextInTopic":50243,"prevInTime":50241,"nextInTime":50243,"topicId":50120,"numMessagesInTopic":0,"msgSnippet":"-=-I was schooled, but I mostly felt the way that your teens felt, in that not having had much television as a child, I was always missing the key points of","messageBody":"<div id=\"ygrps-yiv-436555987\">-=-I was schooled, but I mostly felt the way that your teens felt, in  <br/>\nthat<br/>\nnot having had much television as a child, I was always missing the key<br/>\npoints of conversations, or not understanding the sexual inuendo, not<br/>\ngetting the jokes, didn&#39;t listen to popular music so had no idea what<br/>\nwas going on most of the time. -=-<br/>\n<br/>\nHow do you feel about not having the cultural exposure to be in on  <br/>\njokes and popular music?<br/>\n<br/>\nI had a friend in college who grew up in the 1960&#39;s without hearing  <br/>\nany new music, only listening to Gilbert & Sullivan and other eighty- <br/>\nyear-old stuff, because his parents thought those were classic and  <br/>\neducational.  He also knew nothing at all about the Bible or any Bible  <br/>\nstories, and as a literature major he was extremely inconvenienced by  <br/>\nthat.<br/>\n<br/>\n<br/>\nI&#39;m repeating that paragraph because now I&#39;m going further into it:<br/>\n<br/>\n-=-I was schooled, but I mostly felt the way that your teens felt, in  <br/>\nthat<br/>\nnot having had much television as a child, I was always missing the key<br/>\npoints of conversations, or not understanding the sexual inuendo, not<br/>\ngetting the jokes, didn&#39;t listen to popular music so had no idea what<br/>\nwas going on most of the time.<br/>\n<br/>\n-=-Can we explore this further? Do other&#39;s feel their unschooled  <br/>\nteenagers<br/>\nalso experience this?-=-<br/>\n<br/>\nMy kids only miss the traditional schoolyard taunts, as to their  <br/>\nunderstanding. Because my kids know current music (And &#39;60&#39;s, AND a  <br/>\nlot of Gilbert & Sullivan &lt;g&gt;), they aren&#39;t baffled by conversation.   <br/>\nThey don&#39;t have stories about lockers or school counsellors or PE  <br/>\nclasses, but they&#39;re natives of the culture around them.<br/>\n<br/>\n-=-I think this is sort of the fear that many non-homeschoolers, or<br/>\nanti-homeschoolers, are voicing when they say that children not schooled<br/>\nwill not be &#39;socialized&#39;. And the stock homeschool answer is to give<br/>\nall the examples of opportunities to socialize with all different types<br/>\nof people that exist for homeschoolers that schoolers generally miss.<br/>\nBut its sort of side-stepping the question. Is the problem the value<br/>\nthat is being given to that particular type of socialization? Or is<br/>\nthere really something missing from the homeschooler&#39;s socialization? - <br/>\n=-<br/>\n<br/>\nThere is no monolithic &quot;the homeschooler&quot; about whom we can make these  <br/>\nstatements.<br/>\nSome homeschoolers are kept away from TV, computers, modern culture,  <br/>\nscience books and mainstream history so that their parents can  <br/>\nfabricate a cushion of reconstructed history around them, and help  <br/>\nprepare them to take over America when they&#39;re grown.   That doesn&#39;t  <br/>\napply to anyone outside the U.S., and doesn&#39;t apply to all  <br/>\nhomeschoolers.   But they do exist, and their &quot;socialization&quot; is  <br/>\nlimited to church, if the parents haven&#39;t already broken with the  <br/>\nchurch for being too liberal.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":251210887,"authorName":"Shira Rocklin","from":"Shira Rocklin &lt;shirarocklin@...&gt;","profile":"shirarocklin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: An all-new question","postDate":"1264791722","msgId":50239,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCNjMzMEFBLjYwODA5MDJAeWFob28uY2E+"},"prevInTopic":50197,"nextInTopic":50242,"prevInTime":50238,"nextInTime":50240,"topicId":50120,"numMessagesInTopic":0,"msgSnippet":"There is a petty jabbing verbal teasing/insulting way of relating to each other, among most teenagers, that seemed to always leave my kids feeling just","messageBody":"<div id=\"ygrps-yiv-784753615\">&quot;There is a petty jabbing<br/>\nverbal teasing/insulting way of relating to each other, among most<br/>\nteenagers, that seemed to always leave my kids feeling just bewildered<br/>\nand a bit hurt, but not really &quot;getting&quot; what was happening and feeling<br/>\noddly a bit left out. Again - can&#39;t generalize to all unschoolers, but<br/>\nI&#39;ve seen that with some others, too.&quot;<br/>\n<br/>\nI was schooled, but I mostly felt the way that your teens felt, in that <br/>\nnot having had much television as a child, I was always missing the key <br/>\npoints of conversations, or not understanding the sexual inuendo, not <br/>\ngetting the jokes, didn&#39;t listen to popular music so had no idea what <br/>\nwas going on most of the time. <br/>\n<br/>\nCan we explore this further?  Do other&#39;s feel their unschooled teenagers <br/>\nalso experience this?  Is it just dependent on personality type?  Or <br/>\ndoes it have something in particular to do with being unschooled/schooled? <br/>\n<br/>\nI think this is sort of the fear that many non-homeschoolers, or <br/>\nanti-homeschoolers, are voicing when they say that children not schooled <br/>\nwill not be &#39;socialized&#39;.   And the  stock homeschool answer is to give <br/>\nall the examples of opportunities to socialize with all different types <br/>\nof people that exist for homeschoolers that schoolers generally miss.  <br/>\nBut its sort of side-stepping the question.  Is the problem the value <br/>\nthat is being given to that particular type of socialization?  Or is <br/>\nthere really something missing from the homeschooler&#39;s socialization?</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] An all-new question","postDate":"1264717209","msgId":50197,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCNjIwRDk5LjMwOTAwMDBAbWFjLmNvbT4=","inReplyToHeader":"PDIyODQ5NC40MjgyNy5xbUB3ZWIxMTA0MDQubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDcyNzUxNTAyLTY0MTMtNDM3MS04N0Q4LUNDMUFCMkEwMUQ4MUBzYW5kcmFkb2RkLmNvbT4gPDIyODQ5NC40MjgyNy5xbUB3ZWIxMTA0MDQubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":50152,"nextInTopic":50239,"prevInTime":50196,"nextInTime":50198,"topicId":50120,"numMessagesInTopic":0,"msgSnippet":"... I think lots of kids who look like they are square pegs fitting nicely into square holes don t have that feeling about themselves. I know I looked fine -","messageBody":"<div id=\"ygrps-yiv-1005636684\">On 1/27/2010 12:33 PM, Jenny Cyphers wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;ve always felt like a round peg in a world of square holes, but I&#39;ve found ways to fit in and be at peace with the world, even the things I really dislike.<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>I think lots of kids who look like they are square pegs fitting nicely <br/>\ninto square holes don&#39;t have that feeling about themselves. I know &quot;I&quot; <br/>\nlooked fine - I looked like a very conforming kid, for the most part. I <br/>\nwas careful about my rebellions - didn&#39;t get myself into much trouble - <br/>\ndidn&#39;t get noticed very much at all.<br/>\n<br/>\nBut - in answer to the original concern - my grown young adult kids do <br/>\nsometimes not fit in. For example, they do have some trouble taking <br/>\ndirections from &quot;superiors&quot; for example, when they think the person is <br/>\nbeing stupid or mean. They do really quite well in getting along, <br/>\nanyway, but when they find themselves in those kinds of situations, they <br/>\nstart figuring out how to get out of them as quickly as possible.  That <br/>\nseems like a good thing, to me, but I can see how some parents might <br/>\nview it as their kids not being able to &quot;handle&quot; certain kinds of <br/>\nsituations. Roxana was pretty miserable working at a department store, <br/>\nfor a few months, because of how incompetent the management was. She <br/>\ndidn&#39;t seem able to just accept it and live with it easily. Well - it <br/>\nmust have been pretty bad - it was Mervyn&#39;s and not long after that they <br/>\nwent out of business, so maybe it was just really exceptionally bad. <br/>\nMaybe they should have listened to her - she could have told them some <br/>\nthings about how badly the stores were being run. &lt;G&gt;<br/>\n<br/>\nRoya LOVES her job, but has had some frustration with a couple of <br/>\ndifferent bosses. But, that&#39;s probably more her personality - she&#39;s <br/>\nbossy, herself. But, from that experience, she&#39;s figured out that she&#39;d <br/>\nbe way better off and happier to be her own boss and she&#39;s taking steps <br/>\nto get herself into that position. So - again - that seems like a good <br/>\nthing.<br/>\n<br/>\nEven though my kids have hung out with groups of friends who are more <br/>\nconventional - schooled kids, etc., I will say that they and their <br/>\nunschooled friends do seem, to me, to stand out in some ways - they do <br/>\nseem different. Not that there are not lots of very cool other kids - <br/>\nI&#39;m not saying that the unschooled kids are &quot;better&quot; than the others. <br/>\nBut there are some things schooled kids do that seem very normal to them <br/>\nand very NOT normal to the unschooled kids. There is a petty jabbing <br/>\nverbal teasing/insulting way of relating to each other, among most <br/>\nteenagers, that seemed to always leave my kids feeling just bewildered <br/>\nand a bit hurt, but not really &quot;getting&quot; what was happening and feeling <br/>\noddly a bit left out. Again - can&#39;t generalize to all unschoolers, but <br/>\nI&#39;ve seen that with some others, too.<br/>\n<br/>\nIs that the kind of not fitting in that was meant? I&#39;m not sure.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] An all-new question","postDate":"1264625692","msgId":50151,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFCNDQ1MDkzLURCNzMtNDk3QS1COENBLTY0RUI2Mzk1REU3N0Bjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDcyNzUxNTAyLTY0MTMtNDM3MS04N0Q4LUNDMUFCMkEwMUQ4MUBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDcyNzUxNTAyLTY0MTMtNDM3MS04N0Q4LUNDMUFCMkEwMUQ4MUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":50149,"nextInTopic":50152,"prevInTime":50150,"nextInTime":50152,"topicId":50120,"numMessagesInTopic":0,"msgSnippet":"... I actually think of it as a square peg in a round hole because most round pegs would fit in the square holes with little problem! In that case , I","messageBody":"<div id=\"ygrps-yiv-162932901\"><blockquote><span title=\"ireply\">&gt; Am<br/>\n&gt; I raising her to be a round peg in a world of square holes?<br/>\n<br/>\n </span></blockquote>I actually think of it as a &quot;square peg in a round hole&quot; because most  <br/>\nround pegs would fit in the square holes with little problem!<br/>\n<br/>\nIn that case &lt;g&gt;, I hardly think the world is full of round pegs! More  <br/>\nsquare pegs are being squeezed into round holes in school than  <br/>\nanywhere. If anyone might feel helpless to make a difference, it would  <br/>\nbe those kids, not ours. It takes us square pegs (many of us parents  <br/>\nare, too) years to get over that whittling down of our pointy edges  <br/>\nand to get them to grow back again. If your daughter maintains her  <br/>\nedges, she&#39;s in better shape from the get-go.<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] An all-new question","postDate":"1264624421","msgId":50149,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIyODQ5NC40MjgyNy5xbUB3ZWIxMTA0MDQubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDcyNzUxNTAyLTY0MTMtNDM3MS04N0Q4LUNDMUFCMkEwMUQ4MUBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDcyNzUxNTAyLTY0MTMtNDM3MS04N0Q4LUNDMUFCMkEwMUQ4MUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":50147,"nextInTopic":50151,"prevInTime":50148,"nextInTime":50150,"topicId":50120,"numMessagesInTopic":0,"msgSnippet":"-=-I sometimes worry though, that if I raise my daughter to be a free thinker in this day and age, will she grow up unhappy, if it keeps getting more and more","messageBody":"<div id=\"ygrps-yiv-530229806\">-=-I sometimes worry though, that if I raise my daughter to be a free <br/>\nthinker in this day and age, will she grow up unhappy, if it keeps <br/>\ngetting more and more &quot;police state&quot; will she feel helpless and <br/>\ndefeated.... knowing it&#39;s wrong but unable to do anything about it. Am <br/>\nI raising her to be a round peg in a world of square holes? Kinda <br/>\nwanted your thoughts on that, if you have the time. -=-<br/>\n<br/>\nHaha!  My first thought was, &quot;there&#39;s always going to be rock and roll!&quot;<br/>\n<br/>\nAll those round pegs will help keep the world round!  I have a very non-conformist daughter, yet, she&#39;s not out to change the world either, she&#39;s not out to prove anything.  I remember when I was a teen and I see teens today do this too, rebelling for the sake of rebelling, doing lots of reactionary damage, just out to prove their parents are wrong, or the system is wrong.<br/>\n<br/>\nI&#39;ve always felt like a round peg in a world of square holes, but I&#39;ve found ways to fit in and be at peace with the world, even the things I really dislike.<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":226699805,"authorName":"lovelukira","from":"&quot;lovelukira&quot; &lt;lisa@...&gt;","profile":"lovelukira","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: An all-new question","postDate":"1264622096","msgId":50152,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqcTVtZytkYnJpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhqb2h2dityMTJwQGVHcm91cHMuY29tPg=="},"prevInTopic":50151,"nextInTopic":50197,"prevInTime":50151,"nextInTime":50153,"topicId":50120,"numMessagesInTopic":0,"msgSnippet":"I think this article by Peter Gray, titled The Dramatic Rise of Anxiety and Depression in Children and Adolescents: Is It Connected to the Decline in Play and","messageBody":"<div id=\"ygrps-yiv-2083043384\">I think this article by Peter Gray, titled &quot;The Dramatic Rise of Anxiety and Depression in Children and Adolescents: Is It Connected to the Decline in Play and Rise in Schooling? &quot; might be relevant, if not helpful.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tinyurl.com/yh83z4e\">http://tinyurl.com/yh83z4e</a><br/>\n<br/>\nLisa</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] An all-new question","postDate":"1264617302","msgId":50147,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYzOTQwQzBFLTg1MkQtNDAzMS1CQThGLUY3RDZCODg5OTcyMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDAxMDQwMWNhOWY3ZCRlN2YyYWUxMCRiN2Q4MGEzMCRAY29tPg==","referencesHeader":"PDcyNzUxNTAyLTY0MTMtNDM3MS04N0Q4LUNDMUFCMkEwMUQ4MUBzYW5kcmFkb2RkLmNvbT4gPDAxMDQwMWNhOWY3ZCRlN2YyYWUxMCRiN2Q4MGEzMCRAY29tPg=="},"prevInTopic":50145,"nextInTopic":50149,"prevInTime":50146,"nextInTime":50148,"topicId":50120,"numMessagesInTopic":0,"msgSnippet":"-=- It was a sweet & lovely childhood. -=-But then she died when I was six. -=- There, I think, is the most frightening part of trying to create an ideal","messageBody":"<div id=\"ygrps-yiv-1255846413\">-=- It was a sweet & lovely childhood.<br/>\n<br/>\n-=-But then she died when I was six. -=-<br/>\n<br/>\nThere, I think, is the most frightening part of trying to create an  <br/>\nideal situation for our children, is the idea that one might not live  <br/>\nto complete the project.<br/>\n<br/>\nWe had a plan early on, but things changed, and I know I&#39;m fortunate  <br/>\nnot to have needed the bail-out plan.  Holly lately turned 18.  Marty  <br/>\nturned 21.  Legally, they won&#39;t need a guardian if something happens  <br/>\nto me and Keith now.   Much of that was luck.  I&#39;ve been in accidents,  <br/>\nbeen ill, ridden airplanes...  It&#39;s not that I was good and God or the  <br/>\nuniverse gave me longer life.  I didn&#39;t &quot;manifest&quot; anything.  I  <br/>\nhappened to live.<br/>\n<br/>\nThere have been a few unschooling parents who didn&#39;t live, and it  <br/>\nmakes me feel really good to read what you wrote, Pamela K:<br/>\n<br/>\n-=-But I *remembered* my childhood with my mom. I *knew*<br/>\nthat there were other possibilities. That knowledge saved me from<br/>\nhelplessness and defeat. I suffered through some verrrrrry unhappy  <br/>\nyears, a<br/>\nwhole lot of wrongness, but the whole time I knew that eventually I&#39;d<br/>\nescape, and that I&#39;d eventually find joy.<br/>\n<br/>\n-=-... In my opinion,<br/>\nbeing a free thinker, and having a happy, peaceful beginning, is the  <br/>\nbest<br/>\npossible way to cope with those inevitable swings..-=-<br/>\n<br/>\nThanks VERY much for writing that, and I&#39;m sorry you lost your sweet  <br/>\nmother.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":431933808,"authorName":"pamela kaplan","from":"&quot;pamela kaplan&quot; &lt;pamelalucinda@...&gt;","profile":"pamelalucinda","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] An all-new question","postDate":"1264616643","msgId":50145,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMDQwMWNhOWY3ZCRlN2YyYWUxMCRiN2Q4MGEzMCRAY29tPg==","inReplyToHeader":"PDcyNzUxNTAyLTY0MTMtNDM3MS04N0Q4LUNDMUFCMkEwMUQ4MUBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDcyNzUxNTAyLTY0MTMtNDM3MS04N0Q4LUNDMUFCMkEwMUQ4MUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":50141,"nextInTopic":50147,"prevInTime":50144,"nextInTime":50146,"topicId":50120,"numMessagesInTopic":0,"msgSnippet":"-=-I sometimes worry though, that if I raise my daughter to be a free thinker in this day and age, will she grow up unhappy, if it keeps getting more and more","messageBody":"<div id=\"ygrps-yiv-670743160\">-=-I sometimes worry though, that if I raise my daughter to be a free <br/>\nthinker in this day and age, will she grow up unhappy, if it keeps <br/>\ngetting more and more &quot;police state&quot; will she feel helpless and <br/>\ndefeated.... knowing it&#39;s wrong but unable to do anything about it. Am <br/>\nI raising her to be a round peg in a world of square holes? Kinda <br/>\nwanted your thoughts on that, if you have the time. -=-<br/>\n<br/>\n<br/>\n<br/>\nThis isn&#39;t the situation the OP was describing, but I think it&#39;s related.<br/>\n<br/>\nMy mom set out to raise me in a mostly unschooly way.  She had John Holt<br/>\nbooks on her bookshelves.  She was a gentle, mindful parent.  She supported<br/>\nmy interests and served as a partner with me as I explored the world.  I was<br/>\na free thinker, a free kid.  It was a sweet & lovely childhood.<br/>\n<br/>\nBut then she died when I was six.  Without my mom as a buffer, my father&#39;s<br/>\nmentally illness became a prominent part of my life.  He was abusive to me,<br/>\nand not at all equipped to be a parent.  He remarried.  My stepmother was<br/>\nvery controlling and judgmental and had a lot of beliefs about How Dangerous<br/>\nLife Is.  Her home was kinda like a &quot;police state&quot; as far as I was<br/>\nconcerned.  I was definitely a round peg in a house of square holes, and it<br/>\nwas very painful.  But I *remembered* my childhood with my mom.  I *knew*<br/>\nthat there were other possibilities.  That knowledge saved me from<br/>\nhelplessness and defeat.  I suffered through some verrrrrry unhappy years, a<br/>\nwhole lot of wrongness, but the whole time I knew that eventually I&#39;d<br/>\nescape, and that I&#39;d eventually find joy.<br/>\n<br/>\nHere I am.  J<br/>\n<br/>\nNational politics swing back and forth, back and forth.. In my opinion,<br/>\nbeing a free thinker, and having a happy, peaceful beginning, is the best<br/>\npossible way to cope with those inevitable swings..<br/>\n<br/>\n~pamela k<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: An all-new question","postDate":"1264611657","msgId":50141,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU4NjEzRENCLTExQTItNEZCMC1CMTI3LUU4REM1OTM3RjdFNEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhqcGlhbStiN3ZoQGVHcm91cHMuY29tPg==","referencesHeader":"PGhqcGlhbStiN3ZoQGVHcm91cHMuY29tPg=="},"prevInTopic":50139,"nextInTopic":50145,"prevInTime":50140,"nextInTime":50142,"topicId":50120,"numMessagesInTopic":0,"msgSnippet":"-=-I think societies throughout history have gone through periods of more social control.-=- During WWII, famously, stories of air raid rules and blackouts and","messageBody":"<div id=\"ygrps-yiv-991112043\">-=-I think societies throughout history have gone through periods of  <br/>\nmore social control.-=-<br/>\n<br/>\nDuring WWII, famously, stories of air raid rules and blackouts and  <br/>\nrationing.   It wasn&#39;t ideal it was an emergency.<br/>\nIn any situation in which a government &quot;cracks down&quot; (checks your  <br/>\npockets and shoes before you can board a plane), being an unschooler  <br/>\ndoesn&#39;t save you.  Having gone to school probably doesn&#39;t make it any  <br/>\nmore pleasant.<br/>\n<br/>\nBeing reactionary and negative probably is worse than either of those  <br/>\nother two.  I have a brother-in-law whose hobby is pissing and moaning  <br/>\nabout every thing and every person.  He&#39;s just decided he will NOT get  <br/>\na passport, he will simply never travel again rather than subject  <br/>\nhimself to more government scrutiny.<br/>\n<br/>\nI think that&#39;s a good idea.  He spreads noise and frustration wherever  <br/>\nhe goes.  He SHOULD stay home.  His kids will not be visiting him;  <br/>\nthey quit listening to him years ago.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":177967425,"authorName":"treesock","from":"&quot;treesock&quot; &lt;treesock@...&gt;","profile":"treesock","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: An all-new question","postDate":"1264602262","msgId":50139,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqcGlhbStiN3ZoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDcyNzUxNTAyLTY0MTMtNDM3MS04N0Q4LUNDMUFCMkEwMUQ4MUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":50128,"nextInTopic":50141,"prevInTime":50138,"nextInTime":50140,"topicId":50120,"numMessagesInTopic":0,"msgSnippet":"I think societies throughout history have gone through periods of more social control. In times such as those, it may be the people who can name and question","messageBody":"<div id=\"ygrps-yiv-526523344\">I think societies throughout history have gone through periods of more social control. In times such as those, it may be the people who can name and question those controls rather than assuming &quot;this is just the way it is&quot; who will be more whole and better able to navigate their own lives. Sure, it will probably be frustrating. But would you rather be frustrated because a) you can see how great things could be, and you&#39;re struggling to carve out a place for that greatness in your own life and world, or b) there&#39;s a lingering sense that something&#39;s wrong, but you can&#39;t really understand why you feel miserable a lot of the time, why other people can&#39;t just tow the line, why the &quot;ills of society&quot; aren&#39;t getting better, etc.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; This was asked in the side, somewhere, and I thought it might be fun  <br/>\n&gt; for the list.<br/>\n&gt; <br/>\n&gt; -=-I sometimes worry though, that if I raise my daughter to be a free  <br/>\n&gt; thinker in this day and age, will she grow up unhappy, if it keeps  <br/>\n&gt; getting more and more &quot;police state&quot; will she feel helpless and  <br/>\n&gt; defeated.... knowing it&#39;s wrong but unable to do anything about it. Am  <br/>\n&gt; I raising her to be a round peg in a world of square holes? Kinda  <br/>\n&gt; wanted your thoughts on that, if you have the time. -=-<br/>\n&gt; <br/>\n&gt; My first thought is &quot;what are the options?&quot;<br/>\n&gt; <br/>\n&gt; I might write more tomorrow; I hope it&#39;s been answered a dozen clever  <br/>\n&gt; ways by the time I get back here. :-)<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] An all-new question","postDate":"1264594883","msgId":50128,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI5RjQ5QjA0LUIyNjItNEM3Ri04RDAxLUY2MkI3NEEzRjkzNUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDcyNzUxNTAyLTY0MTMtNDM3MS04N0Q4LUNDMUFCMkEwMUQ4MUBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDcyNzUxNTAyLTY0MTMtNDM3MS04N0Q4LUNDMUFCMkEwMUQ4MUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":50125,"nextInTopic":50139,"prevInTime":50127,"nextInTime":50129,"topicId":50120,"numMessagesInTopic":0,"msgSnippet":"... I think there are more choices than powerlessly aware and blissfully ignorant! Knowledge is power. Self confidence is power. Felling empowered is power. I","messageBody":"<div id=\"ygrps-yiv-1233402628\"><blockquote><span title=\"ireply\">&gt; -=-I sometimes worry though, that if I raise my daughter to be a free<br/>\n&gt; thinker in this day and age, will she grow up unhappy, if it keeps<br/>\n&gt; getting more and more &quot;police state&quot; will she feel helpless and<br/>\n&gt; defeated.... knowing it&#39;s wrong but unable to do anything about it. Am<br/>\n&gt; I raising her to be a round peg in a world of square holes? Kinda<br/>\n&gt; wanted your thoughts on that, if you have the time. -=-<br/>\n<br/>\n </span></blockquote>I think there are more choices than powerlessly aware and blissfully  <br/>\nignorant!<br/>\n<br/>\nKnowledge is power. Self confidence is power. Felling empowered is  <br/>\npower.<br/>\n<br/>\nI think achieving a true state of blissful ignorance is dependent on  <br/>\npersonality, how untuned someone is to their world and how tuned they  <br/>\nare to their own niche. And that won&#39;t apply to very many people! So  <br/>\nit&#39;s not something you can give to a child.<br/>\n<br/>\nI suspect ignorance is more likely to create someone who has a  <br/>\ngrowing fear there&#39;s something to worry about but is afraid to find  <br/>\nout and feels powerless on how someone would take action.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":294520986,"authorName":"Joanna","from":"&quot;Joanna&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: An all-new question","postDate":"1264569151","msgId":50122,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqb2h2dityMTJwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDcyNzUxNTAyLTY0MTMtNDM3MS04N0Q4LUNDMUFCMkEwMUQ4MUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":50120,"nextInTopic":50125,"prevInTime":50121,"nextInTime":50123,"topicId":50120,"numMessagesInTopic":0,"msgSnippet":"Are you raising your daughter in the United States?  If so, then you are not living in a police state.  Hopefully this won t change, but we live in a place","messageBody":"<div id=\"ygrps-yiv-1030514977\">Are you raising your daughter in the United States?  If so, then you are not living in a police state.  Hopefully this won&#39;t change, but we live in a place with lots of opportunities, and the more inner resources, including creative and original thinking, that a person has, the more interesting pathways they can access.  I&#39;ve seen and met homeschooled and unschooled kids who are taking very unique views to the question of what they want to be as they grow up, and that is a source of inspiration and hope!<br/>\n<br/>\nSchool doesn&#39;t insure that a person will be a round peg--and I think tons of parents on this list who have always felt different and unique, and have chosen a different and unique way to live their lives with their children can attest to that.  Most of us have not been homeschooled.<br/>\n<br/>\nHopefully, having been raised outside of the education system, she will feel more empowered and more hopeful about her impact on her world.  I think school is the perfect place to explore powerlessness, so the antidote is...<br/>\n<br/>\nJoanna<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; This was asked in the side, somewhere, and I thought it might be fun  <br/>\n&gt; for the list.<br/>\n&gt; <br/>\n&gt; -=-I sometimes worry though, that if I raise my daughter to be a free  <br/>\n&gt; thinker in this day and age, will she grow up unhappy, if it keeps  <br/>\n&gt; getting more and more &quot;police state&quot; will she feel helpless and  <br/>\n&gt; defeated.... knowing it&#39;s wrong but unable to do anything about it. Am  <br/>\n&gt; I raising her to be a round peg in a world of square holes? Kinda  <br/>\n&gt; wanted your thoughts on that, if you have the time. -=-<br/>\n&gt; <br/>\n&gt; My first thought is &quot;what are the options?&quot;<br/>\n&gt; <br/>\n&gt; I might write more tomorrow; I hope it&#39;s been answered a dozen clever  <br/>\n&gt; ways by the time I get back here. :-)<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":326782993,"authorName":"Vidyut Kale","from":"Vidyut Kale &lt;wide.aware@...&gt;","profile":"vidyutgore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] An all-new question","postDate":"1264566711","msgId":50125,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5YzFkMWI0MTAwMTI2MjAzMXI1OWE0ZWZhOHhlMmU0MmM2ODdiNzU1OTgyQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDcyNzUxNTAyLTY0MTMtNDM3MS04N0Q4LUNDMUFCMkEwMUQ4MUBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDcyNzUxNTAyLTY0MTMtNDM3MS04N0Q4LUNDMUFCMkEwMUQ4MUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":50122,"nextInTopic":50128,"prevInTime":50124,"nextInTime":50126,"topicId":50120,"numMessagesInTopic":0,"msgSnippet":"Our deepest fear is not that we are inadequate. Our deepest fear is that we are powerful beyond measure. It is our light, not our darkness, that most ","messageBody":"<div id=\"ygrps-yiv-1176240499\">&quot;Our deepest fear is not that we are inadequate. Our deepest fear is that we<br/>\nare powerful beyond measure. It is our light, not our darkness, that most<br/>\nfrightens us. We ask ourselves, who am I to be brilliant, gorgeous,<br/>\ntalented, and fabulous? Actually, who are you not to be? You are a child of<br/>\nGod. Your playing small doesn&#39;t serve the world. There&#39;s nothing enlightened<br/>\nabout shrinking so that other people won&#39;t feel insecure around you. We are<br/>\nall meant to shine, as children do. We are born to make manifest the glory<br/>\nof God that is within us. It&#39;s not just in some of us, it&#39;s in everyone. And<br/>\nas we let our own light shine, we unconsciously give other people permission<br/>\nto do the same. As we are liberated from our own fear, our presence<br/>\nautomatically liberates others.&quot; The above speech by Nelson Mandela was<br/>\norignally written by Marianne Williamson who is the author of other similar<br/>\nmaterial.&quot;<br/>\n<br/>\n- Marianne Williamson, Return to Love.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed, Jan 27, 2010 at 9:47 AM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; This was asked in the side, somewhere, and I thought it might be fun<br/>\n&gt; for the list.<br/>\n&gt;<br/>\n&gt; -=-I sometimes worry though, that if I raise my daughter to be a free<br/>\n&gt; thinker in this day and age, will she grow up unhappy, if it keeps<br/>\n&gt; getting more and more &quot;police state&quot; will she feel helpless and<br/>\n&gt; defeated.... knowing it&#39;s wrong but unable to do anything about it. Am<br/>\n&gt; I raising her to be a round peg in a world of square holes? Kinda<br/>\n&gt; wanted your thoughts on that, if you have the time. -=-<br/>\n&gt;<br/>\n&gt; My first thought is &quot;what are the options?&quot;<br/>\n&gt;<br/>\n&gt; I might write more tomorrow; I hope it&#39;s been answered a dozen clever<br/>\n&gt; ways by the time I get back here. :-)<br/>\n&gt;<br/>\n&gt; Sandra<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"An all-new question","postDate":"1264565823","msgId":50120,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcyNzUxNTAyLTY0MTMtNDM3MS04N0Q4LUNDMUFCMkEwMUQ4MUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":50122,"prevInTime":50119,"nextInTime":50121,"topicId":50120,"numMessagesInTopic":0,"msgSnippet":"This was asked in the side, somewhere, and I thought it might be fun for the list. -=-I sometimes worry though, that if I raise my daughter to be a free ","messageBody":"<div id=\"ygrps-yiv-1882200364\">This was asked in the side, somewhere, and I thought it might be fun  <br/>\nfor the list.<br/>\n<br/>\n-=-I sometimes worry though, that if I raise my daughter to be a free  <br/>\nthinker in this day and age, will she grow up unhappy, if it keeps  <br/>\ngetting more and more &quot;police state&quot; will she feel helpless and  <br/>\ndefeated.... knowing it&#39;s wrong but unable to do anything about it. Am  <br/>\nI raising her to be a round peg in a world of square holes? Kinda  <br/>\nwanted your thoughts on that, if you have the time. -=-<br/>\n<br/>\nMy first thought is &quot;what are the options?&quot;<br/>\n<br/>\nI might write more tomorrow; I hope it&#39;s been answered a dozen clever  <br/>\nways by the time I get back here. :-)<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":49437,"nextTopicId":50299}}