{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":143181466,"authorName":"Melissa","from":"&quot;Melissa&quot; &lt;melissa4123@...&gt;","profile":"melissa4123","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: a good definition of unschooling (in case anyone was bored)","postDate":"1076725776","msgId":91026,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMwazE2Zysxb3F2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFkNS4xOWU5ZjAyMC4yZDVlZDY1MUBhb2wuY29tPg=="},"prevInTopic":91024,"nextInTopic":91030,"prevInTime":91025,"nextInTime":91027,"topicId":91024,"numMessagesInTopic":0,"msgSnippet":"...  Thank you, I have already forwarded this to my DH and my MIL, neither of","messageBody":"<div id=\"ygrps-yiv-2096532262\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, SandraDodd@a... wrote:<br/>\n<br/>\n&lt;&lt;A good delineation of unschooling vs. homeschooling (in case <br/>\nanyone was bored)&gt;&gt;<br/>\n<br/>\nThank you, I have already forwarded this to my DH and my MIL, <br/>\nneither of whom have expressed a dislike of unschooling, they just <br/>\ndon&#39;t really understand what exactly it is.  Hopefully, this will <br/>\nhelp.<br/>\n<br/>\nMelissa </span></blockquote></div>","specialLinks":[]},{"userId":164542605,"authorName":"Danielle Conger","from":"&quot;Danielle Conger&quot; &lt;danielle.conger@...&gt;","profile":"danielleconger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] a good definition of unschooling (in case anyone was bored)","postDate":"1076724218","msgId":91030,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGIwMWMzZjI5ZSRjMzBlZDZiMCQ2NTAxYThjMEBqZ2s2OTAwPg==","referencesHeader":"PDFkNS4xOWU5ZjAyMC4yZDVlZDY1MUBhb2wuY29tPg=="},"prevInTopic":91026,"nextInTopic":0,"prevInTime":91029,"nextInTime":91031,"topicId":91024,"numMessagesInTopic":0,"msgSnippet":"Unschooling or Homeschooling? by Billy Greer ... Billy Greer and his wife are big names around here. They live in the county just north of mine. I understand","messageBody":"<div id=\"ygrps-yiv-769895032\">Unschooling or Homeschooling? <br/>\n<br/>\n  by Billy Greer <br/>\n  -----------------<br/>\n<br/>\nBilly Greer and his wife are big names around here. They live in the county just north of mine. I understand they&#39;re just incredibly thoughtful, interesting, warm people. They have lots of good things to say, and they&#39;re website is well worth exploring. I was excited to see that he was going to be a vendor (?) at the Live and Learn Conference.<br/>\n<br/>\n--danielle<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"a good definition of unschooling (in case anyone was bored)","postDate":"1076722769","msgId":91024,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkNS4xOWU5ZjAyMC4yZDVlZDY1MUBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":91026,"prevInTime":91023,"nextInTime":91025,"topicId":91024,"numMessagesInTopic":0,"msgSnippet":"A good delineation of unschooling vs. homeschooling (in case anyone was bored) http://www.unschooling.org/fun12_unschooling.htm The text is here for anyone who","messageBody":"<div id=\"ygrps-yiv-836944233\">A good delineation of unschooling vs. homeschooling (in case anyone was bored)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.org/fun12_unschooling.htm\">http://www.unschooling.org/fun12_unschooling.htm</a><br/>\n<br/>\nThe text is here for anyone who doesn&#39;t want to mess with going to a website:<br/>\n<br/>\n<br/>\nUnschooling or Homeschooling? <br/>\n<br/>\nby Billy Greer <br/>\n<br/>\nWhat is the difference between unschooling and homeschooling? At one time <br/>\nthey were just two terms for the same thing, so the question was like asking what <br/>\nthe difference is between a car and an automobile. Today, homeschooling has <br/>\nremained a generic term while unschooling has come to refer to a specific type <br/>\nof homeschooling. So now the question is like asking what the difference is <br/>\nbetween a Ferrari and a car. Just what is it about unschooling that <br/>\ndifferentiates it from other types of homeschooling enough to warrant its own term? <br/>\n<br/>\nBefore we look at that question, let&#39;s look at a history of the words. At one <br/>\ntime, there was no special term for people who took their children out of the <br/>\npublic school system to teach them at home. If you look at references to <br/>\neducation before there even was a public school system, you will see phrases such <br/>\nas &quot;tutored at home,&quot; &quot;self-taught,&quot; or &quot;no formal education&quot; to refer to <br/>\npeople we might now call homeschooled. <br/>\n<br/>\nEven after the modern homeschooling movement got started, there wasn&#39;t a <br/>\nstandard term for what these parents were doing. People simply referred to <br/>\nteaching their children at home, or not sending them to school. In issue #108 of <br/>\nGrowing Without Schooling, Susannah Sheffer tells us that the first issue of GWS <br/>\n(published in 1977), did not even make use of the term homeschooling. In issue <br/>\n#2, John Holt used the term unschooling, but it was used as a general term for <br/>\nwhat we now call homeschooling. In issue #118 of GWS, Aaron Falbel tells us <br/>\nthat Holt wrote in issue #2 of GWS (Nov. 1977) that they [GWS] would use <br/>\nunschooling &quot;when we mean taking kids out of school.&quot; Falbel goes on to say that it <br/>\nwasn&#39;t until the early 1980&#39;s that the term homeschooling became more popular. <br/>\n<br/>\nI don&#39;t know when it happened or who first used the phrase, but it is pretty <br/>\neasy to see that if most kids went to public school, then people might say <br/>\nkids who were taught at home went to &quot;home school.&quot; As the term has become more <br/>\nan accepted part of our vocabulary, it has moved from the novelty phrase &quot;home <br/>\nschooling&quot; (in quotes) to home schooling (no quotes), to home-schooling <br/>\n(hyphenated), and now homeschooling (one word). <br/>\n<br/>\nJohn Holt is considered the father of unschooling and the person who coined <br/>\nthe term. In Holt&#39;s early writings, he seemed to hold out hope that the school <br/>\nsystem could be fixed, but he later became more convinced that parents were <br/>\nbetter off taking their kids out of schools. I imagine that it then seemed <br/>\nnatural to him to refer to the process of not sending your kids to school as <br/>\nunschooling, as in not schooling. <br/>\n<br/>\nWhile the terms may have been interchangeable originally, that is no longer <br/>\nthe case today. Unschooling has become associated with the particular style of <br/>\nhomeschooling in which no set curriculum is used. Where the split originated <br/>\nis hard to say, but part of the reason for the division is probably because of <br/>\nthe words themselves. Homeschooling carries an implication of <br/>\nschooling-at-home, while unschooling connotes that what you are doing is the opposite of <br/>\nschool. People who accepted the teaching techniques of school but wanted more <br/>\ncontrol over the subject matter, socialization, or morals that their children were <br/>\nexposed to might readily accept the term homeschooling. People who disliked <br/>\nthe teaching techniques and environment of school might be more inclined to use <br/>\nthe term unschooling.<br/>\n<br/>\nCurrently, homeschooling is considered to span a spectrum from those who <br/>\nschool-at-home to those who unschool. The school-at home designation is <br/>\nself-explanatory. This group revels in all the trappings of school! They may have the <br/>\nsame desks used in the public schools, some of the same text books, and they may <br/>\neven start each day by ringing a bell and saying the pledge of allegiance. <br/>\nThe parent assumes the role of teacher, preparing lesson plans, assigning <br/>\nhomework or tests, and grading papers. Their &quot;holy grail&quot; is the search for the <br/>\nperfect curriculum, the one that will cover everything their children need to <br/>\nlearn.<br/>\n<br/>\nWhat is it that unschoolers do? Where do you find a curriculum package that <br/>\nwill help you to be an unschooler? The reason that unschooling is hard to <br/>\nexplain and hard for some people to understand, is that it is not a technique that <br/>\ncan be broken down to a step by step process. Rather, unschooling is an <br/>\nattitude, a way of life. Where most homeschooling puts the emphasis on what needs to <br/>\nbe learned, unschooling puts the emphasis on who is doing the learning. This <br/>\nmakes it a very personalized experience and one that does not lend itself well <br/>\nto the one size-fits-all approach of a commercial curriculum package. <br/>\n<br/>\nWhat are some of the unintended lessons of a &quot;school&quot; approach to learning? <br/>\nFirst of all, the student is taught that learning is something that takes place <br/>\nin a certain location at certain times. From 8 to 3 you do lessons at your <br/>\ndesk. Learning is also unpleasant and often boring, so it is usually a relief <br/>\nwhen &quot;school&quot; is finally out. Students become used to the idea that learning <br/>\nrequires a teacher - someone more knowledgeable than them. This follows the old <br/>\nmodel of learning in which students are empty cups waiting to be filled and the <br/>\nteacher is the pitcher full of knowledge that will fill them. This also <br/>\nemphasizes the idea that students must be taught - in other words, what happens to <br/>\nyou (learning) is the result of what someone else does to you (teaching). <br/>\nSchool also reinforces the idea that learning is a linear process. You work and <br/>\nadd knowledge incrementally over time in a steady process. To get from point A <br/>\nto point C, you must first pass point B. <br/>\n<br/>\nIn unschooling, learning can happen anywhere and at anytime. It is an <br/>\nongoing, natural process - part of the journey we call life. It is not unpleasant or <br/>\nboring anymore than breathing, eating or sleeping are. There is no sense of <br/>\nrelief that school is out because learning is always happening. Students also <br/>\nknow that they are responsible for their learning. They do not need an &quot;expert&quot; <br/>\nto teach them. If they have an interest, they can go out and pursue the <br/>\nknowledge they need. This is another fundamental difference between a schoolish <br/>\napproach and an unschooling model. School is a case of knowledge (that someone <br/>\nelse has determined to be important) in pursuit of the student, while unschooling <br/>\nputs the student in pursuit of the knowledge (which they have decided is <br/>\nimportant). In this role, parents are not teachers who always know more than their <br/>\nchildren, they are often fellow learners making the journey along with their <br/>\nchildren. (See the side bar for more comments about the non-linear learning of <br/>\nunschooling.) <br/>\n<br/>\nIt is unfortunate that the older term &quot;unschooled&quot; often means uneducated. As <br/>\nunschooling gains acceptance and its effectiveness is recognized, the <br/>\ndictionaries will have to be corrected to reflect the positive aspects of someone who <br/>\nhas been educated by unschooling.    <br/>\n<br/>\n <br/>\n<br/>\nSchool is a case of knowledge (that someone else has determined to be <br/>\nimportant) chasing after the student, while unschooling puts the student chasing <br/>\nafter the knowledge (that they have decided is important)<br/>\n<br/>\n<br/>\n<br/>\nHave you noticed that unschooling doesn&#39;t result in a steady increase in <br/>\nlearning? You&#39;ll have periods where it seems like nothing is happening. You may <br/>\nfind yourself wondering if your kids are learning anything or if they ever will. <br/>\nSuddenly, something will click and your kids immerse themselves in a subject. <br/>\nYou can barely drag them away from what they are doing or keep up with the <br/>\nquestions they have. <br/>\n<br/>\nIn pursuing this new interest with them, you will discover they know about <br/>\nmany things that they seem to have just absorbed out of the air they breathe. <br/>\n<br/>\nIn retrospect, those periods where nothing seemed to be happening were <br/>\nprobably laying the foundation for that sudden &quot;knowledge spurt.&quot; There are <br/>\nsimilarities with physical growth that suggest this is a natural pattern. Studies have <br/>\nshown that infants do not grow steadily. They may stay exactly the same size <br/>\nfor weeks, then suddenly grow as much as an inch in only a few days. This is <br/>\nvery different from the steady, gradual pattern that growth charts might lead <br/>\nyou to expect. <br/>\n<br/>\n<br/>\n<br/>\nWhere most homeschooling puts the emphasis on what needs to be learned, <br/>\nunschooling puts the emphasis on who is doing the learning.<br/>\n<br/>\nTaken from issue 12 of F.U.N. News</div>","specialLinks":[]}],"prevTopicId":91027,"nextTopicId":90935}}