{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":117369878,"authorName":"Kelli Traaseth","from":"Kelli Traaseth &lt;kellitraas@...&gt;","profile":"kellitraas","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Teaching vs learning plus more thoughts","postDate":"1048535973","msgId":61869,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwMzI0MTk1OTMzLjkxNTM3LnFtYWlsQHdlYjQwMTEwLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGE4LjFhNWFjYTQ2LjJiYjA4ZGQ0QGFvbC5jb20+"},"prevInTopic":61838,"nextInTopic":0,"prevInTime":61868,"nextInTime":61870,"topicId":61802,"numMessagesInTopic":0,"msgSnippet":" We also stopped with restrictions about the same time as","messageBody":"<div id=\"ygrps-yiv-1070921369\">&lt;&lt; Also just a quick comment on the tv thing...we stopped restricting <br/>\ntv/computers back in <br/>\n<br/>\noctober &gt;&gt;<br/>\n <br/>\nWe also stopped with restrictions about the same time as Stephanie and it has been going great.   As far as TV,  it&#39;s just like any other resource.  Sometimes its on, sometimes not. <br/>\n <br/>\nI&#39;ve noticed with my son,  (who loves the Playstation and is now borrowing a gameboy from a friend of ours) that he seems to be more at peace with himself.   Even bedtime is going better now,  he hadn&#39;t wanted to be in his room alone.  We had been letting him sleep with us or his sisters.   Lately,  he&#39;ll stay in his room.  He&#39;ll play the gameboy for a while and then just happily go to sleep.  I let him play as much as he wants,  he shares once in a while when his sis wants to play.  But she recognizes that he loves it. <br/>\n <br/>\nI saw some awesome teamwork between the two of them yesterday,  he would let her play, on his game,  (that he bought with his money)  and then they would pass it back and forth.  Working toward the goal together.        It was really nice to see. <br/>\n <br/>\nI have gotten some raised eyebrows from neighbors on how much he is on the games,  that he&#39;s not outside playing, but I just say &quot;its &#39;his&#39; thing!&quot;.   <br/>\n<br/>\n     <br/>\n<br/>\nI also say,  &quot;Sometimes I just want to read or be on the computer,  how about you?&quot;    Hoping they&#39;ll get it.   They just kind-of look at me.    They can think what they want.          I know he will be fine,  actually,  let me restate that!   I know he&#39;ll be better than fine!  He&#39;s happy and content!   When can my neighbors say that about their schooled children?     Not a whole lot,  yet those same kids sure want to be at our house alot!&lt;g&gt;   <br/>\n<br/>\n <br/>\n<br/>\nKelli<br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n<br/>\nYahoo! Groups SponsorADVERTISEMENT<br/>\n<br/>\n~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~<br/>\n<br/>\nIf you have questions, concerns or problems with this list, please email the moderator, Joyce Fetteroll (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>), or the list owner, Helen Hegener (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>).<br/>\n<br/>\nTo unsubscribe from this group, click on the following link or address an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\nVisit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\nYour use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nYahoo! Platinum - Watch CBS&#39; NCAA March Madness, live on your desktop!<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Teaching vs learning plus more thoughts","postDate":"1048523732","msgId":61838,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGE4LjFhNWFjYTQ2LjJiYjA4ZGQ0QGFvbC5jb20+"},"prevInTopic":61834,"nextInTopic":61869,"prevInTime":61837,"nextInTime":61839,"topicId":61802,"numMessagesInTopic":0,"msgSnippet":"Stephanie, thanks for sharing this: ","messageBody":"<div id=\"ygrps-yiv-1077637351\">Stephanie, thanks for sharing this:<br/>\n<br/>\n&lt;&lt; Also just a quick comment on the tv thing...we stopped restricting <br/>\ntv/computers back in <br/>\n<br/>\noctober (used to limit it to 1 hr/day). We do watch more then an hour a day <br/>\nnow, but it<br/>\n<br/>\nby no means is all that we do. I have been pretty happy with the balance that <br/>\nthe boys<br/>\n<br/>\nhave fallen into. And I have a feeling that come spring and summer they will <br/>\nbe watching<br/>\n<br/>\neven less (although that is no longer a goal for me as it used to be). &gt;&gt;<br/>\n<br/>\nIt&#39;s always good to hear when people are happy with advice they get on this <br/>\nlist.  And to read of one more family with a little (or a lot) more peace and <br/>\nsweetness between parents and children makes the whole world seem brighter.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":141102765,"authorName":"Mary","from":"&quot;Mary&quot; &lt;mummy124@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Teaching vs learning plus more thoughts","postDate":"1048522329","msgId":61834,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTkwMWMyZjIyMCQxZjQ4NDM2MCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+","referencesHeader":"PDlENkNGOUNFQTc2ODNDNEQ4RjQxNUEzRjU0RDFDMDY2MDEyRjdEN0FAZHN0cDEuZGVsdGFzb2x1dGlvbnMuY29tPg=="},"prevInTopic":61802,"nextInTopic":61838,"prevInTime":61833,"nextInTime":61835,"topicId":61802,"numMessagesInTopic":0,"msgSnippet":"From: Stephanie Elms ","messageBody":"<div id=\"ygrps-yiv-383916916\">From: Stephanie Elms <br/>\n  &lt;&lt;Oh yeah... and I did let Jason taste some of my beer once. He did not like it. :o) Jason<br/>\n  did like my Mikes Hard Lemonade however so I have chosen not to drink that around him.<br/>\n  Kyle on the other hand did like the taste of beer. He also loves the couple of drops of<br/>\n  rescue remedy I give him now and again (it is alcohol based) so it might be a little <br/>\n  different with him. But at 3 he is not begging me to give him alcohol so I am not <br/>\n  much worried. I have talked with Jason about alcohol and how it can affect people and<br/>\n  why some people like it and some people don&#39;t. I plan to take things as they come<br/>\n  as he gets older but I do not plan on out and out restricting it.&gt;&gt;<br/>\n<br/>\n  Already acquring certain tastes in beverages huh?!! I used to drink beer and always had some here. Joe doesn&#39;t drink at all except for an O&#39;Douls every now and then. Kids never asked for a sip and knew about alcohol and all the rules about who could legally drink it and all. Tara would take a sip every now and then, mostly I think just because she could. That stopped soon enough too. I have never told her no when she would grab a wine cooler or Smirnoff Ice. Let me make clear I mean grab a sip of mine, not her own!! I know she has drank on occasion with her friends partying. Nothing to make her sick or wasted. Again I think it was because they were doing it too. She doesn&#39;t drink now at all. I&#39;m sure when she gets older and able to legally do it out in public, she will try again. I&#39;m also hoping that it won&#39;t be such a big deal, she&#39;ll see how much she can get. I just don&#39;t see that happening. <br/>\n  Joseph watched something with me the other night. We were the only ones up and it was some cop thing I think where people were partying and kids were on spring break. I explained why they were acting that way and he said he will never drink alcohol. It makes you act stupid. Maybe he will and maybe he won&#39;t. I just think he&#39;ll be even wiser about it than Tara is becuse of the early education he has about it all. But so far, none of the 3 younger ones ever ask to taste any of it we have here.<br/>\n<br/>\n  Mary B<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1572768,"authorName":"Stephanie Elms","from":"&quot;Stephanie Elms&quot; &lt;stephanie.elms@...&gt;","profile":"elmsfam","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] Teaching vs learning plus more thoughts","postDate":"1048490325","msgId":61802,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlENkNGOUNFQTc2ODNDNEQ4RjQxNUEzRjU0RDFDMDY2MDEyRjdEN0FAZHN0cDEuZGVsdGFzb2x1dGlvbnMuY29tPg=="},"prevInTopic":0,"nextInTopic":61834,"prevInTime":61801,"nextInTime":61803,"topicId":61802,"numMessagesInTopic":0,"msgSnippet":"... I am a bit behind on my messages, but wanted to chime in here. We are relatively new in our unschooling journey (my boys are 6 and 3) but I have been","messageBody":"<div id=\"ygrps-yiv-1010492689\"><blockquote><span title=\"ireply\">&gt; As I have said, I am in a unique situation in which I<br/>\n&gt; can not totally throw out curricula...at least with my<br/>\n&gt; oldest child; but my three year old isn&#39;t going to<br/>\n&gt; learn to read if he doesn&#39;t learn the alphabet and the<br/>\n&gt; sounds that letters make either through me, Sesame<br/>\n&gt; Street, computer games or even his sister playing<br/>\n&gt; school with him. There has to be some sort of<br/>\n&gt; instruction somewhere. <br/>\n<br/>\n </span></blockquote>I am a bit behind on my messages, but wanted to chime in here. We are relatively new<br/>\nin our unschooling journey (my boys are 6 and 3) but I have been really loving it and<br/>\nhave had many shifts in my thinking since I started reading this list. One of the biggest<br/>\nshifts has been from thinking that kids &quot;need to be taught&quot; to realizing that &quot;kids will<br/>\nlearn&quot;. My youngest has actually really helped me get comfortable with this idea. <br/>\n<br/>\nJason (my 6 yo) loved to be read to. He would sit and we would read board books when he was<br/>\n6 months old. He would sit through cat and the hat books at 2 and by 3 we were reading <br/>\nchapter books (winnie the pooh and thomas). Now at age 6 we just finished the 4th Harry Potter<br/>\nbook in 1 week (read all 4 books in a month...it was all he wanted to do). If you had asked<br/>\nme, I would have told you that I taught him his colors, shapes, letters, letter sounds etc.<br/>\nMainly because we read lots of books about these subjects...counting books, letter books etc.<br/>\nPlus I &quot;worked&quot; on things with him...specifically counting things or pointing out colors<br/>\nwith the idea that I had to teach him (don&#39;t get me wrong, I was not overly anal about<br/>\nthis or overly pushy and never made him do anything he did not want to, but my basic mindset<br/>\nwas that it was my job to teach him these things). Well, flash forward to Kyle (my now 3 yo).<br/>\nHe was not really interested in books when he was little...in fact I felt guilty for not<br/>\nreading to him as much as I had with Jason and specifically made an effort to read more until<br/>\nI realized that he had other things that he was more interested in (like crawling at 6 months).<br/>\nI backed off and did not push it. We just went about our life, mostly playing and following<br/>\nJason&#39;s lead with Kyle coming along for the ride in everything. One day we were at the park and<br/>\nKyle (about 2) looked at the slide and said &quot;red&quot;. I was surprised and realized over the next<br/>\nfew weeks that Kyle knew all his colors. I felt guilty at first because I realized that I <br/>\nhad not &quot;worked&quot; on colors like I had with Jason. But he had learned them anyways! It<br/>\nhas been the same way with letters and counting. Kyle also has a great love of being read<br/>\nto now...he often will bring books to me and ask me to read them. But the way that he enjoys<br/>\na book is completely different from Jason...Kyle is much more interested in looking at the<br/>\npictures and making up his own story whereas Jason just loves to listen to the story and soak<br/>\nit up.<br/>\n<br/>\nSeeing Kyle learn along with reading here on this list has really helped me make the shift<br/>\naway from thinking that kids need to be taught. Does that mean that I try not to expose him<br/>\nto numbers/letters/ or so called educational things? No. It just means that I am finally <br/>\nstarting to realize that I do not need to go out of my way to expose him. That these things<br/>\nare part of our everyday life naturally and he will pick them up as he needs them. That<br/>\nkids want to learn...just not always on the schedule we want them to learn on.<br/>\n<br/>\nAlso just a quick comment on the tv thing...we stopped restricting tv/computers back in <br/>\noctober (used to limit it to 1 hr/day). We do watch more then an hour a day now, but it<br/>\nby no means is all that we do. I have been pretty happy with the balance that the boys<br/>\nhave fallen into. And I have a feeling that come spring and summer they will be watching<br/>\neven less (although that is no longer a goal for me as it used to be). I have also made <br/>\na decision to not restrict them to content. This does not mean that I am sitting them<br/>\ndown and telling them to watch er or nypd blue. We have tivo (which I absolutely love!)<br/>\nand I tape all their favorite shows. If Jason (6 yo) sees something that he wants to<br/>\nwatch I tape it for him). To watch something he goes through a list of all the shows<br/>\nwe have taped on tivo which include Jeff&#39;s (my dh) and my shows. He has not been interested<br/>\nin watching our shows. He actually has a very good sense of what he is comfortable with.<br/>\nHe does not like things that are scary and violent. My parents bought Jeff the Star Wars <br/>\nAttack of the Clones dvd. I fully expected Jason to want to watch it but he said that he<br/>\nhad seen a small part of it at a friends house and thought that it was too scary and said<br/>\nthat he would wait until he was older. One time he accidentally started watching a show that<br/>\nI had taped during the 1 yr anniversary of 9/11. My first instinct was to immediately tell<br/>\nhim to turn it off. Instead I told him what it was about and that it might have some things<br/>\nthat were sad and a little scary (he was only 4 on 9/11 and knows generally what happened).<br/>\nHe watched a little but then chose to turn it off. Mostly I think because it was just people<br/>\ntalking and he got bored. I have found that he just is not interested in things that deal<br/>\nwith &quot;adult themes&quot;. It has given me more confidence in his ability to decide for himself<br/>\nwhat is appropriate for him.<br/>\n<br/>\nOne other point  that I want to make is that this does not mean that I am throwing up my hands<br/>\nand saying watch whatever you want. I am very aware of what he is watching and how he is <br/>\nreacting. If I think that something might be a little overwhelming for him I will start to <br/>\nwatch with him (actually we watch quite a bit of tv together...it is a fun way to connect<br/>\nand cuddle and has led to some great conversations). <br/>\n<br/>\nOh yeah... and I did let Jason taste some of my beer once. He did not like it. :o) Jason<br/>\ndid like my Mikes Hard Lemonade however so I have chosen not to drink that around him.<br/>\nKyle on the other hand did like the taste of beer. He also loves the couple of drops of<br/>\nrescue remedy I give him now and again (it is alcohol based) so it might be a little <br/>\ndifferent with him. But at 3 he is not begging me to give him alcohol so I am not <br/>\nmuch worried. I have talked with Jason about alcohol and how it can affect people and<br/>\nwhy some people like it and some people don&#39;t. I plan to take things as they come<br/>\nas he gets older but I do not plan on out and out restricting it.<br/>\n<br/>\nJust some thoughts, hope that it helps!<br/>\n<br/>\nStephanie E.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; </span></blockquote></div>","specialLinks":[]}],"prevTopicId":61743,"nextTopicId":61793}}