{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] edification and edifice","postDate":"1302803212","msgId":60603,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI0Q0E3Qzg1LUIwNDgtNDlDMy04MzA5LTY2MzlEQjNFRTM3OEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEEwRjg1ODFFRTA5RDQ2QkQ4QjhGREI4M0NBNzExMUEzQGRlYm9yYWg0M2YxM2ZkPg==","referencesHeader":"PDdCMkIzMjBCLUUyNjgtNEMwQS1CMTZGLTQ2RDAyNjA4NTkwRUBzYW5kcmFkb2RkLmNvbT4gPEEwRjg1ODFFRTA5RDQ2QkQ4QjhGREI4M0NBNzExMUEzQGRlYm9yYWg0M2YxM2ZkPg=="},"prevInTopic":60601,"nextInTopic":0,"prevInTime":60602,"nextInTime":60604,"topicId":60597,"numMessagesInTopic":0,"msgSnippet":"-=-And I thought about how wise he is for someone so young. Once before he jostled me back to reality when I had been rude to David. He pointed it out and gave","messageBody":"<div id=\"ygrps-yiv-1499562754\">-=-And I thought about how wise he is for someone so young. Once before he jostled me back to reality when I had been rude to David. He pointed it out and gave a better alternative. <br/>\n<br/>\n-=-Growing without the pressure of compliance and performance lets kids learn how to think more naturally and probably more rationally. The reason they teach things like logic and philosophy in college might be public schooling. &lt;g&gt;-=-<br/>\n<br/>\n<br/>\nWhen Kirby was here one day we had a discussion of situations, and it reminded me how wise he is.  Marty, too.  They could have (and would have, and might have) had that discussion without me.  I&#39;m no longer the &quot;facilitator.&quot;<br/>\n<br/>\nAnd yesterday Holly was helpful, while I was noticing and trying to rearrange myself so as not to need her help or disturb her day with my way-past-teenage angst.<br/>\n<br/>\nPart of it is probably the lack of pressure of compliance and performance, for sure!!  Definitely.  And another facet is our having accepted their telling us they think we could be wrong.   Many children (and adult children) wouldn&#39;t begin to tell a parent that their thinking was screwed up, or that they ought to breathe, or that they were likely to make a situation worse if they continued on a path.<br/>\n<br/>\nI&#39;m glad my kids still like me enough to help me out.  It&#39;s not too late (even though they are 19, 22 and 24 to push and push until they don&#39;t like me, so I need to be as nice as I can be as often as I can be.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] edification and edifice","postDate":"1302799571","msgId":60601,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEwRjg1ODFFRTA5RDQ2QkQ4QjhGREI4M0NBNzExMUEzQGRlYm9yYWg0M2YxM2ZkPg==","referencesHeader":"PDdCMkIzMjBCLUUyNjgtNEMwQS1CMTZGLTQ2RDAyNjA4NTkwRUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":60597,"nextInTopic":60603,"prevInTime":60600,"nextInTime":60602,"topicId":60597,"numMessagesInTopic":0,"msgSnippet":"***That was a sort of Freudian slip, for me to use edification. I don t use it much. And the Eiffel Tower is an edifice, for sure. So my subconscious seems","messageBody":"<div id=\"ygrps-yiv-1190693174\">***That was a sort of &quot;Freudian slip,&quot; for me to use &quot;edification.&quot; I don&#39;t use it much. And the Eiffel Tower is an edifice, for sure. So my subconscious seems to have seen that as a good analogy for the way a person can strengthen herself, himself, into something solid, and constant, and closer to the sun.***<br/>\n<br/>\nI have thought of edification as a conjuring word of religion.   But in my life everything that&#39;s uplifting is uplifting without being spiritual so you can snag that word back from the church if you want. &lt;g&gt;   Your post at Just Add Light and Stir was edifying.  The photo could be said to edify the edifice of the Eiffel Tower.  I think it would be uplifting to see it in person.  And verily to ascend! &lt;g&gt;<br/>\n<br/>\nI hope you&#39;re having a better day and that things are starting to look brighter through the clouds. <br/>\n<br/>\nTo bring this around to unschooling in some unnatural way so as to better comply with the list guidelines, I got some useful advice from my unschooled son recently.   I&#39;m having some anxiety over my husband&#39;s new job (it seems like he might quit and he&#39;s quit five jobs in a year and a half and in addition to the financial insecurity, made worse now by the loss of my own job in December, I have this horrible feeling that he&#39;s losing his mind)  and some problems with my mother and her elderly sister so that it feels impossible to get another job with these two little women so needy. <br/>\n<br/>\nI was complaining more than I like to (and more than I like to admit) and Dylan said, &quot;Don&#39;t panic.  Worry over what David will do won&#39;t decide what he&#39;ll do and won&#39;t change what he&#39;ll do, it&#39;s wasted energy.  Wait, it might work out and in that time you can take care of the aunt.  And if you really need to work remember there are other people who can take care of the aunt, hospice, hospital, nursing home.&quot;   All things I knew but in the moment (which had stretched into weeks) had let get washed away in my brain&#39;s chemical storm.  And it comes back to your, &quot;Be present and patient.&quot; <br/>\n<br/>\nAnd I thought about how wise he is for someone so young.  Once before he jostled me back to reality when I had been rude to David.  He pointed it out and gave a better alternative.   <br/>\n<br/>\nGrowing without the pressure of compliance and performance lets kids learn how to think more naturally and probably more rationally.  The reason they teach things like logic and philosophy in college might be public schooling.  &lt;g&gt;<br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"edification and edifice","postDate":"1302789652","msgId":60597,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdCMkIzMjBCLUUyNjgtNEMwQS1CMTZGLTQ2RDAyNjA4NTkwRUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":60601,"prevInTime":60596,"nextInTime":60598,"topicId":60597,"numMessagesInTopic":0,"msgSnippet":"Here s a short text: Even when it s not as clear as you re used to, the sun is as bright as can be behind the clouds. It s the same sun. Even when it s not as","messageBody":"<div id=\"ygrps-yiv-1875763633\">Here&#39;s a short text:<br/>\n<br/>\nEven when it&#39;s not as clear as you&#39;re used to, the sun is as bright as can be behind the clouds. <br/>\n<br/>\nIt&#39;s the same sun.<br/>\n<br/>\nEven when it&#39;s not as clear as you&#39;re used to, love is as bright as can be behind fear and frustration.<br/>\n<br/>\nIt&#39;s the same love.<br/>\n<br/>\nToday, be present and patient.<br/>\n<br/>\n====================================<br/>\n<br/>\nI wrote it yesterday for this:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://justaddlightandstir.blogspot.com/2011/04/being-same_14.html\">http://justaddlightandstir.blogspot.com/2011/04/being-same_14.html</a><br/>\n<br/>\nBut later it picked and poked at my brain.  Love isn&#39;t as constant as the sun.  People have to feed it like a fire, in a way.  And it can fade away or be damaged.  So the analogy wasn&#39;t perfect.<br/>\n<br/>\nThis morning I added this in the comments:<br/>\n====================<br/>\nSandra Dodd said...<br/>\nBeth Fuller&#39;s beautiful photograph inspired me, but my thoughts were probably nowhere near her thoughts, so &quot;the picture is not about that.&quot; (Pictures can be what people want them to be about, certainly.)<br/>\n<br/>\nI wrote this for myself, partly, because yesterday I was very emotional and tried not to inconvenience others with it. I knew I would recover. I thanked those who helped, and apologized for being quick to tears. Those kinds of days pass. The damage done by not being careful on those days can last a long time. So for my own comfort and edification, I came up with that analogy.<br/>\n<br/>\nI like that I used &quot;edification&quot; so near the Eiffel Tower. :-)<br/>\n=====================<br/>\n<br/>\nThat was a sort of &quot;Freudian slip,&quot; for me to use &quot;edification.&quot;  I don&#39;t use it much.  And the Eiffel Tower is an edifice, for sure.  So my subconscious seems to have seen that as a good analogy for the way a person can strengthen herself, himself, into something solid, and constant, and closer to the sun.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":60591,"nextTopicId":60599}}