{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":77817828,"authorName":"LOWRIEK@aol.com","from":"LOWRIEK@...","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Homebirth analogy to respectful parenting","postDate":"1056665426","msgId":75601,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyMS4yMzdkMGUwYy4yYzJjYzk1MkBhb2wuY29tPg=="},"prevInTopic":75537,"nextInTopic":0,"prevInTime":75600,"nextInTime":75602,"topicId":75512,"numMessagesInTopic":0,"msgSnippet":"In a message dated 25/06/2003 13:36:57 Pacific Daylight Time, ... Oh boy, that was a fabulous analogy, Julie, I am saving it for sure!!!!!!!!!!! Nancy in BC,","messageBody":"<div id=\"ygrps-yiv-878262498\">In a message dated 25/06/2003 13:36:57 Pacific Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:julie@...\">julie@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Unschooling is like this. We cannot start with the assumption <br/>\n&gt; that kids can learn without coercion and then spend the rest of <br/>\n&gt; the day coercing. Our kids will read the mixed message: she <br/>\n&gt; trusts me to teach myself how to read but I have to ask <br/>\n&gt; permission to eat a handful of chocolate chips?<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Oh boy, that was a fabulous analogy, Julie, I am saving it for <br/>\nsure!!!!!!!!!!!<br/>\nNancy in BC, in awe of your ability to articulate this stuff.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141102765,"authorName":"Mary","from":"&quot;Mary&quot; &lt;mummy124@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Homebirth analogy to respectful parenting","postDate":"1056583733","msgId":75537,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNjgwMWMzM2I3MSQ4YTkwZTI0MCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+","referencesHeader":"PGJkZDBvMitwaHRiQGVHcm91cHMuY29tPg=="},"prevInTopic":75512,"nextInTopic":75601,"prevInTime":75536,"nextInTime":75538,"topicId":75512,"numMessagesInTopic":0,"msgSnippet":"Julie B is on a roll today!!! That s a keeper. Mary B","messageBody":"<div id=\"ygrps-yiv-600645841\">Julie B is on a roll today!!!<br/>\n<br/>\nThat&#39;s a keeper.<br/>\n<br/>\nMary B</div>","specialLinks":[]},{"userId":77522235,"authorName":"Julie Bogart","from":"&quot;Julie Bogart&quot; &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Homebirth analogy to respectful parenting","postDate":"1056572994","msgId":75512,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJkZDBvMitwaHRiQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":75537,"prevInTime":75511,"nextInTime":75513,"topicId":75512,"numMessagesInTopic":0,"msgSnippet":"The post by the mom who wants new unschooling lists reminded me of something I wrote last week. I was explaining to someone who questioned whether we should","messageBody":"<div id=\"ygrps-yiv-900079417\">The post by the mom who wants new unschooling lists <br/>\nreminded me of something I wrote last week. I was explaining to <br/>\nsomeone who questioned whether we should &quot;trust our <br/>\nchildren&quot; what it meant to parent them respectfully. The following <br/>\npost is taken from that dialog.<br/>\n<br/>\nMost of us were raised either with authoritarian parents or what <br/>\nmight be called permissive parents (and at the extreme end, <br/>\nneglect). I&#39;m pretty certain that on this list, none of us has <br/>\nexperienced what we are learning about: respectful parenting. <br/>\n<br/>\nAn analogy occurs to me.<br/>\n<br/>\nIf I&#39;m wanting support for homebirth, consulting my memories of <br/>\nmy mother&#39;s hospital births doesn&#39;t help me. Listening to women <br/>\nwho&#39;ve decided between natural birth in a birth center versus <br/>\nthose who gave birth in a hospital proper doesn&#39;t clarify how <br/>\nhomebirth works. And in fact, the problems raised by those who <br/>\nhave never done home births are usually very &quot;hospitally&quot; in<br/>\nnature. They not only can&#39;t answer the questions of a home birth <br/>\nseeking mother, they don&#39;t even ask the right questions <br/>\nthemselves!<br/>\n<br/>\nTo continue this example (and I promise to tie it all together), <br/>\nwhen a woman says, &quot;I want a safe birth. The only way I know to <br/>\nguarantee a safe birth is to be at a hospital in case of <br/>\nemergency,&quot; she already comes from a set of beliefs about birth <br/>\nthat are radically different than the mother considering <br/>\nhomebirth. Mothers considering homebirths see birth as natural<br/>\nand usually void of any complications whatsoever AND they see <br/>\nhospitals as perpetrating a lot of unnecessary dangers to both <br/>\nmother and baby in the name of protection.<br/>\n<br/>\nFor the home birthing mother, her starting point is different. Birth <br/>\nis natural. Birth is 99% of the time without a hitch. Birth is not an <br/>\nemergency to be handled or a painful process to be endured <br/>\nwith epidurals. It&#39;s the normal, overwhelmingly natural and most <br/>\noften safe passage of a full term baby from a womb. Birth <br/>\nrequires attendance, not intervention.<br/>\n<br/>\nAnd not surprisingly, the number of problem births at home is <br/>\nminiscule. But many hospital birth mothers consider that result <br/>\n&quot;lucky&quot; or &quot;she just has a good body for birth.&quot; They want to say <br/>\nthat their births were necessarily full of intervention or that their <br/>\nbaby couldn&#39;t have survived at home.<br/>\n<br/>\nBut what if the underlying philosophy really does influence the <br/>\noutcome?<br/>\n<br/>\nAs I&#39;ve thought about respectful parenting, consulting my history <br/>\nor Jon&#39;s hasn&#39;t been that helpful. What was missing in our <br/>\nhomes wasn&#39;t more or fewer boundaries. What was missing <br/>\nwas a belief about children. (And I say this is true for how we <br/>\nunschool as well.)<br/>\n<br/>\nLike birth, how you view it determines your choices. If we see <br/>\nkids as needing boundaries because they won&#39;t be &quot;safe&quot; <br/>\nwithout them, we&#39;ve already started from a totally different pov <br/>\nthan the parents who follow AP or NCP. When we face what<br/>\nappear to be dangerous situations, we&#39;re usually still thinking <br/>\nfrom the old mindset about children.  We&#39;re thinking of children <br/>\nas people who need management and correction and <br/>\nsupervision. We don&#39;t see their development as natural, as <br/>\nsomething to support and facilitate but as something to control <br/>\nand manage.<br/>\n<br/>\nThis attitude will influence us at all levels. How we &quot;school&quot; or <br/>\n&quot;educate&quot; our kids will grow out of our ideas about children.<br/>\n<br/>\n&quot;What if my daughter is in a dangerous situation that I could have <br/>\nprevented with a boundary?&quot; is a question asked by people who <br/>\nfeel that children are in danger and our job is to protect them.<br/>\n<br/>\nBut what if the foundational belief system says, &quot;Children are <br/>\nmostly inclined to respond to input and make rational decisions <br/>\nif they feel fundamentally respected as complete, thinking <br/>\nindividuals&quot;? Suddenly the belief itself may set in motion a very <br/>\ndifferent birth/result. And solutions to problems that crop up will <br/>\nbe rooted in preserving that pov, not in abandoning it.<br/>\n<br/>\nFor instance, when mothers in hospitals have pain, they take <br/>\ndrugs.<br/>\n<br/>\nThey can&#39;t go sit in a bathtub. They can&#39;t walk around outdoors <br/>\nand breathe the air. They can&#39;t get foot massages while listening <br/>\nto soothing music in the dark. Heck, they don&#39;t even have a crock <br/>\npot of heated washcloths to continually put on the perineum to <br/>\nkeep it relaxed.<br/>\n<br/>\nThe number of ways to relieve pain when you see birth as <br/>\nnatural are myriad. But the one thing you don&#39;t do is leave home <br/>\nand head for the hospital! :)<br/>\n<br/>\nThe number of ways to resolve typical family issues (eating, tv <br/>\nviewing, keeping house, cleaning the dishes...) for our children <br/>\nare probably just as numerous, if not more, if we fully embrace <br/>\nthe premise that children can understand reason, that they <br/>\nthemselves want to be safe and secure and that we are their <br/>\nbest allies when we give them the dignity of choice in their own <br/>\nlives.<br/>\n<br/>\nWhen we start with the assumption that they won&#39;t want our <br/>\nlimits, we&#39;ve already started with a different set of suppositions.<br/>\n<br/>\nIf we start with the assumption that kids respond well to dialog, <br/>\noptions, respect and support, giving our ideas of what <br/>\nconstitutes safety or a healthy lifestyle will probably go a lot <br/>\nfurther in winning their support than a boundary or enforcement <br/>\never could. And it probably stands to reason that kids raised this <br/>\nway really do have fewer problems than those who have felt <br/>\ndisrespected for most of their lives.<br/>\n<br/>\n---<br/>\n<br/>\nUnschooling is like this. We cannot start with the assumption <br/>\nthat kids can learn without coercion and then spend the rest of <br/>\nthe day coercing. Our kids will read the mixed message: she <br/>\ntrusts me to teach myself how to read but I have to ask <br/>\npermission to eat a handful of chocolate chips?<br/>\n<br/>\nThe philosophical underpinnings will establish the family culture <br/>\nthat will or won&#39;t support the choices we make for our kids&#39; <br/>\neducation (on all levels, not just school subjects).<br/>\n<br/>\nJulie B</div>","specialLinks":[]}],"prevTopicId":75592,"nextTopicId":75603}}