{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Moving from rules to principles","postDate":"1363046389","msgId":70915,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtobHI1bCt2YTdqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtobDYwNCtubDJpQGVHcm91cHMuY29tPg=="},"prevInTopic":70910,"nextInTopic":0,"prevInTime":70914,"nextInTime":70916,"topicId":70903,"numMessagesInTopic":0,"msgSnippet":"... *********** As things come up, you can talk about reasons, think things through with her - if she s the talky sort, that is. Some kids don t like that much","messageBody":"<div id=\"ygrps-yiv-1109024137\">&quot;trish52101&quot; &lt;simplycrunchy@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Is it best to just stop talking about rules and start talking about principles as situations occur or is it best to talk about it with Grace?<br/>\n </span></blockquote>***********<br/>\n<br/>\nAs things come up, you can talk about reasons, think things through with her - if she&#39;s the talky sort, that is. Some kids don&#39;t like that much talking! And then it may be better to just say yes more. If she asks &quot;why are you saying yes when the rule is such-and-such&quot; you can talk about your reasoning, specific reasoning. That might refer back to a principle like... oh! here&#39;s an example: The other day I was crossing a parking lot with my daughter and reached for her hand. Then I looked at her and realized she&#39;s nearly as tall as I am! So I said: you know, there&#39;s no real reason for us to hold hands - drivers will see you just fine, now that you&#39;re so tall. In the past, holding hands wasn&#39;t really a rule, but if she wasn&#39;t walking where I could see her I&#39;d ask her to hold my hand or walk next to or in front of me - because I wasn&#39;t sure drivers could see her and I wanted to make sure she was safe. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"sandralynndodd","from":"&quot;sandralynndodd&quot; &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Moving from rules to principles","postDate":"1363037226","msgId":70910,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtobGk3YStmbWxjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtobDYwNCtubDJpQGVHcm91cHMuY29tPg=="},"prevInTopic":70907,"nextInTopic":70915,"prevInTime":70909,"nextInTime":70911,"topicId":70903,"numMessagesInTopic":0,"msgSnippet":"It is scary at first.  You re thinking of it as a ten-car pile up at high speeds, it seems! -=-I am struggling with figuring out how to apply the Read a","messageBody":"<div id=\"ygrps-yiv-934837721\">It is scary at first.  You&#39;re thinking of it as a ten-car pile up at high speeds, it seems! <br/>\n<br/>\n-=-I am struggling with figuring out how to apply the &quot;Read a little, try a little,<br/>\nwait a while, watch,&quot; to this. Is it best to just stop talking about rules and<br/>\nstart talking about principles as situations occur or is it best to talk about<br/>\nit with Grace? -=-<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/gradualchange\">http://sandradodd.com/gradualchange</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/yes\">http://sandradodd.com/yes</a><br/>\n<br/>\nGradually, without fanfare, be more positive and more supportive of her desires and requests.  <br/>\n<br/>\nHere is an antidote to your no-speed-limits fear.  It&#39;s called &quot;The Beautiful Park,&quot; by Robyn Coburn.  It&#39;s about people getting off bicycles to walk.   I think it could replace your fearful background with something gentle and peaceful.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/park\">http://sandradodd.com/park</a><br/>\n<br/>\nRead about why, and what others have seen.<br/>\nTry it a little.<br/>\nDon&#39;t expect her not to think you&#39;re crazy at first; wait a while.<br/>\nWatch her reaction.  Feel your own thoughts.  Lay your fears out to dry in the air and sunshine.<br/>\n<br/>\nSubscribe to this while you&#39;re waiting:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://justaddlightandstir.blogspot.com\">http://justaddlightandstir.blogspot.com</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Moving from rules to principles","postDate":"1363026516","msgId":70907,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhOaG9feHBDSFFQbm80QVRoVFpjaGYwV29nTUw4MG1RaUxkTE9OTHA1bT1pQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGtobDYwNCtubDJpQGVHcm91cHMuY29tPg==","referencesHeader":"PGtobDYwNCtubDJpQGVHcm91cHMuY29tPg=="},"prevInTopic":70906,"nextInTopic":70910,"prevInTime":70906,"nextInTime":70908,"topicId":70903,"numMessagesInTopic":0,"msgSnippet":"Maybe talk about them only as they come up. If you have a rule about eating only at the dining table, you could suggest: You could take your sandwich to eat","messageBody":"<div id=\"ygrps-yiv-742572244\">Maybe talk about them only as they come up. If you have a rule about eating<br/>\nonly at the dining table, you could suggest: &quot;You could take your sandwich<br/>\nto eat in the living room if you want.&quot; If she says, &quot;What about the rule?&quot;<br/>\nthen you can say, &quot;It&#39;s okay - we can be flexible.&quot;<br/>\n<br/>\nI wouldn&#39;t ever say, &quot;No more rules,&quot; because it is confusing to the child<br/>\n- there really will still be rules in her life, lots of them. What you&#39;re<br/>\ngoing to be doing is looking at rules more sensibly and being flexible and<br/>\nnot having rules just for the sake of having a rule.<br/>\n<br/>\nSometimes rules are for convenience of parents so they don&#39;t have to spend<br/>\nso much time talking about options, etc. One mom I know said she would<br/>\nabsolutely not let her 12 year old watch a PG-13 movie, no matter if she<br/>\nactually thought the movie was fine, because then her son would argue with<br/>\nher over every other PG-13 movie. I think a lot of rules are imposed<br/>\nbecause parents feel overwhelmed and busy and don&#39;t want to spend their<br/>\ntime working with kids on these kinds of choices. I get that.<br/>\n<br/>\nAnd I think unschooling families DO have rules for convenience even if they<br/>\ndon&#39;t call them rules. They aren&#39;t rules for the sake of control and they<br/>\naren&#39;t enforced with the threat of punishment, they are more like, &quot;This is<br/>\nhow we do this in our family.&quot; And usually always open to questioning. So -<br/>\nmy kids didn&#39;t eat food in their bedrooms because we just didn&#39;t eat food<br/>\nin bedrooms. Why? Because we had really big ant invasion problems and<br/>\nnobody would have liked sleeping in a bed with ants. When they were little<br/>\nI&#39;d just say, &quot;Eat it out here, not in the bedroom,&quot; and probably sit to<br/>\nchat with them or turn on the tv or something to make it more fun. They<br/>\nweren&#39;t kids who had experienced arbitrary rules so they were pretty much<br/>\nwilling to go along with clear requests like that. There were a few times i<br/>\ncan recall that a kid really wanted to eat in her room. I&#39;d put the food on<br/>\na big tray and remind her not to let the crumbs or drips get anywhere but<br/>\non the tray. I&#39;d go in and get the remains of the food right away when she<br/>\nfinished. It wasn&#39;t a big deal - wasn&#39;t &quot;breaking a rule&quot; in the bad sense,<br/>\nit was making an exception to the more convenient way we usually did things.<br/>\n<br/>\nSo - make exceptions, be more flexible, stop talking about rules and<br/>\nbreaking rules with regard to things that are really just ways of living.<br/>\nIf she asks about a specific rule you could say, &quot;Yeah, guess we don&#39;t<br/>\nexactly have that rule anymore.&quot;<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mon, Mar 11, 2013 at 10:58 AM, trish52101 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:simplycrunchy@...\">simplycrunchy@...</a>&gt;wrote:<br/>\n<br/>\n&gt; I would be afraid to speed unless they explicitly said, &quot;its okay to use<br/>\n&gt; your judgment to drive at what you consider a safe speed.&quot;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Moving from rules to principles","postDate":"1363026200","msgId":70906,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU5N0Q1NzA1LTg2QjEtNERFOS1BQzJELTAyOUI5OURDOTFCOEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGtobDYwNCtubDJpQGVHcm91cHMuY29tPg==","referencesHeader":"PGtobDYwNCtubDJpQGVHcm91cHMuY29tPg=="},"prevInTopic":70903,"nextInTopic":70907,"prevInTime":70905,"nextInTime":70907,"topicId":70903,"numMessagesInTopic":0,"msgSnippet":"... Principles aren t for you to impose on her like a different type of rule. Principles are what you live by. They re what you use to help you make choices.","messageBody":"<div id=\"ygrps-yiv-476865320\">On Mar 11, 2013, at 1:58 PM, trish52101 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Is it best to just stop talking about rules and start talking about principles<br/>\n<br/>\n </span></blockquote>Principles aren&#39;t for you to impose on her like a different type of rule. Principles are what you live by. They&#39;re what you use to help you make choices. They&#39;re what you build into the solutions to her problems. If she wants something, and she can&#39;t do it kindly, you help her find ways to get what she wants AND be kind.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; but I worry that Grace will still have all the rules in her head and the pressure to follow them will be there. <br/>\n<br/>\n<br/>\n </span></blockquote>Depending on her age, it&#39;s possible. It will fade with time. Say yes more.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Almost like if the police did away with the speed limit by taking <br/>\n&gt; away the signs, I would be afraid to speed unless they explicitly<br/>\n&gt; said, &quot;its okay to use your judgment to drive at what you consider <br/>\n&gt; a safe speed.&quot;<br/>\n<br/>\n </span></blockquote>Eventually you would realize from people acting differently around you that things were different. <br/>\n<br/>\nPeople learn by testing what they know about the world against what happens. When the two don&#39;t match up, they adjust their theories.<br/>\n<br/>\nKids are used to doing that. Adjusting their ideas about how the world works is how they&#39;ve been living their lives since they were born ;-)<br/>\n<br/>\nIs there something in particular that&#39;s happened? It might be easier to explain with a real example. Or are you projecting and imagining? TIme is better spent on real problems than imagined ones ;-)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":528259386,"authorName":"trish52101","from":"&quot;trish52101&quot; &lt;simplycrunchy@...&gt;","profile":"trish52101","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Moving from rules to principles","postDate":"1363024708","msgId":70903,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtobDYwNCtubDJpQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":70906,"prevInTime":70902,"nextInTime":70904,"topicId":70903,"numMessagesInTopic":0,"msgSnippet":"I am looking for some help making the transition from rules to principles. Our daughter Grace is almost six. We were pretty good about not having rules early","messageBody":"<div id=\"ygrps-yiv-125355260\">I am looking for some help making the transition from rules to principles. Our daughter Grace is almost six. We were pretty good about not having rules early on, but gradually began using rules in the past few years. <br/>\n<br/>\nI am struggling with figuring out how to apply the &quot;Read a little, try a little, wait a while, watch,&quot; to this. Is it best to just stop talking about rules and start talking about principles as situations occur or is it best to talk about it with Grace? On one hand, I feel like the better choice is to simply let the change happen by not talking about/having rules anymore, but I worry that Grace will still have all the rules in her head and the pressure to follow them will be there. Almost like if the police did away with the speed limit by taking away the signs, I would be afraid to speed unless they explicitly said, &quot;its okay to use your judgment to drive at what you consider a safe speed.&quot;<br/>\n<br/>\nThanks,<br/>\nTrisha</div>","specialLinks":[]}],"prevTopicId":70908,"nextTopicId":70839}}