{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Cararmst@aol.com","from":"Cararmst@...","replyTo":"LIST","senderId":"it-36heaQRKfSctDtAOL1Jw_p8OE99y8wdOZ6RvsSDoDEBa7CzYfhxfjgwv27zFI2oXR5Zjn_Q","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Love and Logic (was Questions from a Newbie!)","postDate":"967258581","msgId":12178,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQzLjkxZjg4M2YuMjZkODhiZDVAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":12177,"nextInTime":12179,"topicId":12178,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/25/2000 12:43:19 PM Central Daylight Time, ... one ... Do you make the choice for them?  What are the consequences of their refusal to","messageBody":"<div id=\"ygrps-yiv-1235853695\">In a message dated 8/25/2000 12:43:19 PM Central Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Jaam1224@...\">Jaam1224@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This is <br/>\n&gt;  the conversation that I get...&quot;I WANT to do this.........&quot; &quot;That is not <br/>\n </span></blockquote>one <br/>\n<blockquote><span title=\"ireply\"> &gt;  of the choices.  Here are the choices........&quot; but &quot;I want to do <br/>\n&gt;  this..............&quot; over and over again....<br/>\n&gt;  <br/>\n&gt;  Julie<br/>\n<br/>\n </span></blockquote>Do you make the choice for them?  What are the consequences of their refusal <br/>\nto choose? <br/>\n<br/>\nI think especially in the beginning, when we&#39;re trying this new way of <br/>\nthinking and dealing with our kids, that people expect instant results.  <br/>\nActually, at least with Love and Logic, nothing is instant.  We consider <br/>\nchildhood a training ground for turning out responsible adults.  That takes <br/>\nsome time.  And practice.  And fine tuning to see what works with your <br/>\nchildren.<br/>\n<br/>\nI can honestly say that after employing Love and Logic for the last two years <br/>\nwith our kids, we&#39;ve had some really good results.  But, it was a learning <br/>\nprocess for all of us.  As we were experimenting with all this, if we gave <br/>\nour 3 year old two choices, and if she refused to accept those two choices, <br/>\nwe learned to make the choice for her.  On certain occasions she has <br/>\nsurprised us with a third choice that is perfectly acceptable to us.  Like:  <br/>\nDo you want to sit quietly, or do you want to go to your room for a while?  <br/>\nShe said, I&#39;d rather go sit in the kitchen.  Fine -- she has made a choice, <br/>\nretained some control and dignity, and we have what we want.  She&#39;s stopped <br/>\njumping on the couch.  If she says, NO, I won&#39;t stop jumping, she is still <br/>\nyoung enough that I can pick her up and carry her away from jumping on the <br/>\ncouch, and I tell her in a calm voice that continuing to jump was not a <br/>\nchoice, and that since she wouldn&#39;t make a choice, I had to do it for her.  <br/>\nThen I would say, Do you want to walk to your room, or should I carry you?  <br/>\nShe learned in short order that continuing the behavior was not an acceptable <br/>\nchoice.<br/>\n<br/>\nWe employ a broken record approach, too.  As calmly as we can, we repeat, <br/>\nThat is not a choice.  Your choices are. . .  They say, NO, I want to do <br/>\nthis.  Again, that is not a choice.  Your choices are . . .  Okay, since you <br/>\nwon&#39;t make a choice, I have to do it for you.  I choose. . .<br/>\n<br/>\nFor Love and Logic to work, you have to be willing to allow your children to <br/>\nlive with the consequences of their actions (just like we do!).  Now, if my <br/>\nson, who is now 8, refused to stop or accept one of those choices, he&#39;s a <br/>\nlittle more difficult to physically control.  You may not want to risk the <br/>\nnatural consequences of allowing your child to fall off the couch, so <br/>\nsometimes we have to &quot;manufacture&quot; consequences.  Then, we go for the <br/>\nthinking words:  People who jump on couches often fall and hurt themselves.  <br/>\nPeople who jump on couches don&#39;t get dessert (or TV, or Nintendo, or whatever <br/>\nthe treat of the moment is).  We didn&#39;t tell him not to jump on the couch, <br/>\nand his choices are implicit:  if he chooses to jump on the couch he could <br/>\nget hurt and he will lose dessert.  For particularly obstinate situations, <br/>\nwe&#39;d up the ante until we got the behavior we needed, but we would rarely <br/>\ntell him to outright stop.  That we save for truly dangerous situations (like <br/>\ntonight when he started to walk out into a line of traffic in a parking lot <br/>\nwhile he was looking at his new Pokemon cards).  We were so surprised when, <br/>\nin pretty short order, he started responding.  He realized that he had <br/>\nchoices to make and that we were willing to make those for him and to stand <br/>\nby the consequences.<br/>\n<br/>\nSometimes, kids can really play us like a violin.  If they suspect that we&#39;ll <br/>\ngive in, they&#39;ll keep at us until we do.  In Love and Logic, we give many <br/>\nchoices because we want our children to learn to make responsible choices as <br/>\nteens and adults.  We also let them live with the consequences because those <br/>\nconsequences are a much better teacher than any words or orders I give them.  <br/>\n<br/>\nIt takes practice, and I tell my workshop participants from the get go that <br/>\nsome methods and devices and words and choices work better than others on <br/>\ndifferent children.  It takes consistency and practice.  And it takes time to <br/>\nlearn to craft appropriate choices and thinking words and consequences.  <br/>\nThat&#39;s why we do a 4 or 6 week workshop -- to give people lots of time to <br/>\nexperiment and practice in class, to bring their problem situations to the <br/>\nclass for comment and suggestions, to share successes.  I don&#39;t mean to make <br/>\nthis sound like a commercial for Love and Logic, but if anyone is interested <br/>\nenough to participate in a workshop, you might want to log onto <br/>\nwww.loveandlogic.com for more information.  There&#39;s a lot of interesting <br/>\nstuff there.  They can also give names of people in your area who give <br/>\nworkshops.  <br/>\n<br/>\nCarron<br/>\n<br/>\nCarron</div>","specialLinks":[]}],"prevTopicId":12149,"nextTopicId":12147}}