{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":24,"messages":[{"userId":223130287,"authorName":"Krisula Moyer","from":"&quot;Krisula Moyer&quot; &lt;krisula@...&gt;","profile":"krisulaula","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"unschooling personal hygiene","postDate":"1117196955","msgId":106206,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwNTI3MTIyOS5qNFJDVERYNzAwODY5NUBtcy1zbXRwLTAyLWVyaTAuc29jYWwucnIuY29tPg==","inReplyToHeader":"PDExMTY4OTgyNjkuMTg1Ni4zNzQ0NS5tMjlAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":106174,"nextInTopic":0,"prevInTime":106205,"nextInTime":106207,"topicId":106060,"numMessagesInTopic":0,"msgSnippet":"On the subject of shoes (or *not* wearing them),  I used to insist all the kids wear them in stores and restaurants because, The store requires that we wear","messageBody":"<div id=\"ygrps-yiv-754661276\">On the subject of shoes (or *not* wearing them),  I used to insist all the<br/>\nkids wear them in stores and restaurants because, &quot;The store requires that<br/>\nwe wear shoes &quot; or something like that.  I tried to point out the little<br/>\nsigns that I remember seeing in windows saying &quot;no shoes no shirt no<br/>\nservice&quot; or whatever but surprisingly, maybe just where we live, there don&#39;t<br/>\nseem to be any.  <br/>\n<br/>\nMy 11yo and 9yo wear them to go in stores but the 4yo doesn&#39;t want to put<br/>\nthem on.  So, if there is no sign I might offer to carry a pair of flip fops<br/>\nin my purse just in case a store manager or someone asks her to  put on some<br/>\nshoes.  No one ever has.  I remember once in a grocery store being told they<br/>\ncould ride in the cart barefooted so that&#39;s been the rule there but just<br/>\nabout everywhere else we&#39;ve been surprised by how little anyone cared.  It&#39;s<br/>\na beach community too though so it&#39;s not too unusual to see peaople walking<br/>\naround in bathing suits.</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [UnschoolingDiscussion] unschooling personal hygiene","postDate":"1117044214","msgId":106174,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDAwNzIwMWM1NjEzYiQ4OTc1MmUxMCQ2NDAxYThjMEBob21lPg=="},"prevInTopic":106170,"nextInTopic":106206,"prevInTime":106173,"nextInTime":106175,"topicId":106060,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-2045687565\">&lt;&lt;&lt;&lt;&lt;I have a slightly different problem.  Lisa likes to wear tanktops and<br/>\nsome of them do not completely cover her bra.  I can live with just the bra<br/>\nstraps showing, even though it is a style that I don&#39;t care to wear myself.<br/>\nKind of funny, really, as I remember when having a bra strap poke out was<br/>\nembarrassing, but now bras come in lots of pretty colors and designs and<br/>\nexposed straps have become a fashion statement.&gt;&gt;&gt;&gt;<br/>\n<br/>\nShe may be too small for this idea to work, but: Travelsmith (a catalogue of<br/>\ntravel clothing and website) has really nice varieties of tank tops and<br/>\ncamisoles with built in bras in a wide range of fabrics and colors. Maybe<br/>\nthe smallest size would fit her and make the problem disappear. I bought a<br/>\nton of them because I can&#39;t go without a bra, and t-shirts often get too<br/>\nhot, and I&#39;m just too old fashioned to like the visible bra strap look<br/>\nunless the bras are pretty (meant to be seen), and I don&#39;t have any of<br/>\nthose.<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;Monday night we were going to an end of baseball season party for<br/>\nJackie (YMCA league for 8-10 yo).  Lisa had on a purple tank top with lace<br/>\naround the top edge.  It barely covered the top of her bra, but not very<br/>\nwell.  I asked her to change because I was concerned that some of the people<br/>\nat the party would be offended by a girl her age wearing a top that exposed<br/>\nher bra that much.  She did change, although she was pretty grumpy about<br/>\nit.&gt;&gt;&gt;&gt;<br/>\n<br/>\nMaybe dye some of her bras to match or coordinate with her favorite tanks,<br/>\nto the effect is of layering??<br/>\n<br/>\nThe broader issue of walking the line between child&#39;s autonomy, the fashion<br/>\npractices that are peer accepted, and the social expectations of adults who<br/>\nmay be conservative or judgmental, is sometimes tough. <br/>\n<br/>\nWorrying excessively about other people&#39;s opinions is something that is a<br/>\npersonal growth challenge for me. In a similar situation my task would be to<br/>\nexamine my reaction closely to make sure I was being reasonable and accurate<br/>\nrather than letting my personal timidity or paranoia take over. <br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n-- <br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Anti-Virus.<br/>\nVersion: 7.0.322 / Virus Database: 266.11.16 - Release Date: 5/24/2005</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] unschooling personal hygiene","postDate":"1117038992","msgId":106170,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU4YzQyMGVlYjYyZDY3ZGVkYTljNmY1MmRlY2VjMjQzQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDAwNzIwMWM1NjEzYiQ4OTc1MmUxMCQ2NDAxYThjMEBob21lPg==","referencesHeader":"PGY1LjUyMjBjYTczLjJmYzVkZGM2QGFvbC5jb20+IDwwMDcyMDFjNTYxM2IkODk3NTJlMTAkNjQwMWE4YzBAaG9tZT4="},"prevInTopic":106169,"nextInTopic":106174,"prevInTime":106169,"nextInTime":106171,"topicId":106060,"numMessagesInTopic":0,"msgSnippet":"I say do not worry about what other people think - unless it is a rich great aunt or someone who might decide not to leave you money!  With three daughters","messageBody":"<div id=\"ygrps-yiv-563243950\">I say do not worry about what other people think - unless it is a rich <br/>\ngreat aunt or someone who might decide not to leave you money! &lt;G&gt;<br/>\n<br/>\nWith three daughters who are all very creative - now 14, 17, and 20 - <br/>\nwe&#39;ve been through all kinds of &quot;styles&quot; - and some seem inappropriate <br/>\nto me. But they pass. Don&#39;t start having power struggles over clothing. <br/>\nNOT worth it.<br/>\n<br/>\nThe low-cut tank top thing is the style - bras show - they&#39;re MEANT to <br/>\nshow - that&#39;s why they&#39;re made in all those cool colors and patterns. <br/>\nThe layered look now INCLUDES the bra!<br/>\n<br/>\nSo - I have a 14 yo wearing them, too.<br/>\n<br/>\nAnd my very very modest 17 yo got herself right to the edge of it - had <br/>\na little smidgen of bra showing the other day. You gotta KNOW this is a <br/>\nvery accepted style when she feels comfortable in it.<br/>\n<br/>\n-pam<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On May 25, 2005, at 8:07 AM, nellebelle wrote:<br/>\n<br/>\n&gt; Monday night we were going to an end of baseball season party for <br/>\n&gt; Jackie (YMCA league for 8-10 yo).  Lisa had on a purple tank top with <br/>\n&gt; lace around the top edge.  It barely covered the top of her bra, but <br/>\n&gt; not very well.  I asked her to change because I was concerned that <br/>\n&gt; some of the people at the party would be offended by a girl her age <br/>\n&gt; wearing a top that exposed her bra that much.  She did change, <br/>\n&gt; although she was pretty grumpy about it. </span></blockquote></div>","specialLinks":[]},{"userId":109856460,"authorName":"nellebelle","from":"&quot;nellebelle&quot; &lt;nellebelle@...&gt;","profile":"lamaribelle","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] unschooling personal hygiene","postDate":"1117033672","msgId":106169,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNzIwMWM1NjEzYiQ4OTc1MmUxMCQ2NDAxYThjMEBob21lPg==","referencesHeader":"PGY1LjUyMjBjYTczLjJmYzVkZGM2QGFvbC5jb20+"},"prevInTopic":106167,"nextInTopic":106170,"prevInTime":106168,"nextInTime":106170,"topicId":106060,"numMessagesInTopic":0,"msgSnippet":"... enough for society? Advice on this list helped me relax about my kid s hygiene.  Buying requested shampoos, etc., helped a lot too.  And","messageBody":"<div id=\"ygrps-yiv-1471484470\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;Where do you draw the line between individuality and being  presentable<br/>\n </span></blockquote>enough for society?&lt;&lt;&lt;&lt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nAdvice on this list helped me relax about my kid&#39;s hygiene.  Buying requested shampoos, etc., helped a lot too.  And then age kicks in.  Now I am trying to keep my mouth shut about how much hot water Lisa (12) is using for showers and shampooing!  Jackie typically bathes about once a week, but hasn&#39;t started to get greasy or stinky yet.<br/>\n<br/>\nI have a slightly different problem.  Lisa likes to wear tanktops and some of them do not completely cover her bra.  I can live with just the bra straps showing, even though it is a style that I don&#39;t care to wear myself.  Kind of funny, really, as I remember when having a bra strap poke out was embarrassing, but now bras come in lots of pretty colors and designs and exposed straps have become a fashion statement.<br/>\n<br/>\nMonday night we were going to an end of baseball season party for Jackie (YMCA league for 8-10 yo).  Lisa had on a purple tank top with lace around the top edge.  It barely covered the top of her bra, but not very well.  I asked her to change because I was concerned that some of the people at the party would be offended by a girl her age wearing a top that exposed her bra that much.  She did change, although she was pretty grumpy about it.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;All Abercrombie or Gap and very conscious of the type of  shoes they wear and hairstyles.&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>I keep my eye out for Gap jeans at thrift shops because for some reason the cut usually fits me very well.<br/>\n<br/>\nMary Ellen<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] re: unschooling personal hygiene","postDate":"1117030863","msgId":106167,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI5LjczZTA4ODE3LjJmYzVlM2NmQGFvbC5jb20+"},"prevInTopic":106166,"nextInTopic":106169,"prevInTime":106166,"nextInTime":106168,"topicId":106060,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/25/2005 7:58:02 AM Mountain Daylight Time, gailbrocop@aol.com writes: I m not  sure if that s more about being in a public schooled","messageBody":"<div id=\"ygrps-yiv-1241553157\">In a message dated 5/25/2005 7:58:02 AM Mountain Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:gailbrocop@...\">gailbrocop@...</a> writes:<br/>\n<br/>\nI&#39;m not  sure if that&#39;s more about being in a public schooled setting with   <br/>\npeer pressure or their family lifestyle.<br/>\n<br/>\n<br/>\n-------<br/>\nCould be the combination of parents who bought into peer pressure and think  <br/>\nit&#39;s a civilizing, reasonable thing, and encouraging their kids to care about  <br/>\nwhat the other kids think, supporting their buying habits SO that they&#39;ll be  <br/>\n&quot;popular at school,&quot; and it just snowballs in those cases, I think.<br/>\n <br/>\nIn some places it&#39;s hard to get away from that because even the greater  <br/>\nculture is into the same kind of &quot;houses must match&quot; and &quot;cars must be new,&quot; but  <br/>\na cool thing about New Mexico is that because things don&#39;t rust, 30 year old  <br/>\ncars are way feasible transport, and houses rarely match anyway.  In the  50&#39;s <br/>\ntract neighborhoods the coolest thing is to customize house and yard.   I&#39;m <br/>\nassuming that will be happening with the current-new silly neighborhoods  where <br/>\nthe houses are the same and about five feet apart.  They all look the  same <br/>\nnow, but it&#39;s still New Mexico.  Or maybe they&#39;ve signed covenants to  live <br/>\nthere that say they will not customize anything. &lt;G&gt;  (I doubt  it.)<br/>\n <br/>\nBeing creative in dress and hair is easier in northern New Mexico than in  <br/>\nmost part of the U.S., I&#39;m guessing, but I wouldn&#39;t be so quick to cheer my kids <br/>\n on to be different if we lived in SE New Mexico (a.k.a. &quot;Little Texas&quot;) <br/>\nwhich is  a pocket of redneck conservatism.<br/>\n <br/>\nWithin any area some are more conservative than others, so a conservative  <br/>\nfamily in a conservative area (where &quot;conservative&quot; means blending in with the  <br/>\nprevailing mode of dress/lifestyle) will reward kids for any conservative  <br/>\ntendencies.<br/>\n <br/>\nKirby had long hair when he was little, cut it off after the one-too-many  <br/>\ncomments that he was in the wrong bathroom (not people being mean, just thinking <br/>\n honestly he wasn&#39;t a boy), and said he would grow it again when he had <br/>\nfacial  hair.  He grew it again before facial hair.  Once he had facial hair,  he <br/>\nwas wanting it cut more often.  He&#39;s never let anyone else cut it (I&#39;ve  <br/>\nencouraged it that direction), but he wants me to do it.  Last week he  asked for <br/>\nthe back to be cut off and the front left longish, and I had doubts  but it <br/>\nworked out fine.  Apparently the fear of someone saying &quot;mullet&quot; has  lots of <br/>\nnaturally-occuring hair growth being chopped off in back.  That too  shall pass.<br/>\n <br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":77669557,"authorName":"gailbrocop@aol.com","from":"gailbrocop@...","profile":"gailbrocop","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] re: unschooling personal hygiene","postDate":"1117029318","msgId":106166,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY1LjUyMjBjYTczLjJmYzVkZGM2QGFvbC5jb20+"},"prevInTopic":106149,"nextInTopic":106167,"prevInTime":106165,"nextInTime":106167,"topicId":106060,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/23/2005 5:00:46 P.M. Eastern Standard Time, ... and hair length and clothes ,ect... Where do you draw the line between induviduality and","messageBody":"<div id=\"ygrps-yiv-1340084257\">In a message dated 5/23/2005 5:00:46 P.M. Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ssag@...\">ssag@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;really glad someone brought this issue this up. Between  personal hygiene<br/>\n </span></blockquote>and hair length and clothes ,ect...<br/>\nWhere do you draw the line between induviduality and being  presentable<br/>\nenough for society?&lt;&lt;&lt;&lt;<br/>\n <br/>\nI&#39;m delayed chiming in on this but twice in the past month, Logan (12) has  <br/>\nbeen mistaken for a girl because of his long hair.  Once he and I were in  line <br/>\nat the post office and an elderly man said, &quot;Your daughter is going to look  <br/>\njust like you when she grows up.&quot;  Logan and I caught each other&#39;s eye and  <br/>\nkept from laughing.  I knew it would probably embarrass the gentleman much  more <br/>\nthan Logan if we said anything so we just let it go.  We had a great  laugh <br/>\nabout it afterwards.  The other incident was at a hotel eating  breakfast when <br/>\nan adjoining table asked if Logan and my niece (who has much  darker skin than <br/>\nmy son) were both my daughters.  I said...&quot;Logan is my son  and Cailin is my <br/>\nniece&quot;  Both kids laughed about this later too.<br/>\n <br/>\nWhen I asked Logan if this bothered him his response was, &quot;I like my hair  <br/>\nand I don&#39;t much care what other people think about it.&quot;  He is quite  <br/>\ncomfortable with who he is and that seems to include his hair, the clothes he  wears <br/>\nand his viewpoints on life.  <br/>\n <br/>\nNeither of my children care much about clothes even my 15 year old  daughter. <br/>\nThey are happy in t-shirts and jeans.  It&#39;s an interesting  contrast in the <br/>\nsummer when my 3 stepkids are with us.  Two teen boys and a  12 year old girl <br/>\nand they don&#39;t own anything that is not a popular name  brand.  All Abercrombie <br/>\n or Gap and very conscious of the type of  shoes they wear and hairstyles.  <br/>\nLots of comments about what is cool and  what isn&#39;t.  All public schooled and <br/>\nlive in an affluent  neighborhood.  My stepson just turned 16 and he got either <br/>\nan Audi or a  Volvo.  Those are good cars  but it seems the brand names  are <br/>\nmost important to all of them.<br/>\n <br/>\nI&#39;m not sure if that&#39;s more about being in a public schooled setting with  <br/>\npeer pressure or their family lifestyle.  It does seem important to many of  the <br/>\npublic schooled kids in our neighborhood also.<br/>\n <br/>\nGail<br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [UnschoolingDiscussion] re: unschooling personal hygiene","postDate":"1116961742","msgId":106149,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDAwMzAwMWM1NWZkNyRmMDJmZDBjMCQ0ZWEyOTY0M0BzdGVwaD4="},"prevInTopic":106128,"nextInTopic":106166,"prevInTime":106148,"nextInTime":106150,"topicId":106060,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-709097187\">&lt;&lt;&lt; I have felt  worried at times about  what if cps see my children walking<br/>\ndown the sidewalk barefoot. But it is not worth it to me to get them to stop<br/>\njust because for so many other people they have &quot;issues&quot; with this.<br/>\nI&#39;ve told my kids that if  grown-ups or kids are mean to them about their<br/>\npreference to be barefoot they should ask that person why they are so<br/>\ninterested in their feet. &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nDepending on the child&#39;s age, just carrying their shoes for them in full<br/>\nview of passers by defuses a lot of worry about cps. Also works for coats in<br/>\ncold weather. If you smile and shrug, people may think you are &quot;teaching a<br/>\nlesson through experience&quot; rather than just living freely, and may be more<br/>\nhumorous and light instead of judgmental.<br/>\n<br/>\nI guess if the child is asking why the adult is interested in their feet,<br/>\nthe adult could be likely to add &quot;cheeky and disrespectful&quot; to the catalog<br/>\nof complaints. It is adding more negative energy to the situation of adults&#39;<br/>\nmeanness and judgmental attitudes. I agree that the adults own the problem<br/>\nof their own feelings. Maybe Mom saying something like &quot;I&#39;m not worried<br/>\nabout them&quot; would help refocus the adult&#39;s attention. Of course that only<br/>\nworks if you are present!<br/>\n<br/>\nI think these &quot;issues&quot; are part of the spectrum of envy that we often have<br/>\nto face. Envy from parents because we have so much less conflict with our<br/>\nchildren about everyday stuff. Envy from kids because ours are not being<br/>\nforced to do school or homework and get to watch tv/play/eat whenever. It is<br/>\nimpossible for me to change their feelings - they have to do that for<br/>\nthemselves. Sometimes I say something like, &quot;Yes, we&#39;re so lucky&quot;.<br/>\nExpressing Gratitude helps defuse the envy.<br/>\n<br/>\n&lt;&lt;&lt;&lt;One more thing, my son is loving being able to grow his hair out long.<br/>\nHe is11 and his hair is now at his shoulders he wants to grow it long down<br/>\nhis back. I really want him to keep it out of his eyes, but he likes it that<br/>\nway. I think he may be trying to hide behind his bangs, but he just says he<br/>\nlikes it. I know that a lot of people look at him and can&#39;t understand his<br/>\nhair and are afraid to get to know him because of it. I have discussed my<br/>\nfeelings to him, but he says he doesn&#39;t care what other people think he<br/>\nlikes his hair long. I think it feels freeing to him. I feel in this case to<br/>\nlive up to my principles of allowing him freedom of choices for his own body<br/>\nI must let him wear his hair how he likes it and he will have to live the<br/>\nconsequences of his choice even how much I wish I could spare him that.<br/>\n<br/>\nAnyone have any thoughts on this? &gt;&gt;&gt;&gt;<br/>\n<br/>\nSorta related.<br/>\n<br/>\nMy dd, Jayn (5.5) has not allowed me to brush her hair since June of last<br/>\nyear. Her hair is fine and was curly (think Shirley Temple). It is now in<br/>\nthree matted wads, with dreadlock like strands poking out. We do wash it<br/>\nwith shampoo and conditioner periodically when she is willing, and rinse it<br/>\nin water almost every day, so it is an odd combination of stiffness and<br/>\nsoftness. It is now so matted that it is growing in such a way that when I<br/>\neventually cut the wads off, it will be untangled - almost all the ends are<br/>\nnow captured - but appears to be turning straighter, more like dh&#39;s slight<br/>\nwave.<br/>\n<br/>\nJayn is very happy with her unusual hairstyle and loves putting clips and<br/>\nornaments into the front. She also wears hats and backwards or sideways<br/>\nbaseball caps on occasion. She needs an adult size to get over the wads. If<br/>\nwe are going somewhere that might be vaguely formal, she will let me put it<br/>\ninto a bun - an interesting but not impossible exercise.<br/>\n<br/>\nShe has an outgoing personality, and is definitely &quot;cute&quot;, as against<br/>\n&quot;pretty&quot;. Most people seem to accept her Phyllis Diller hair as part of her<br/>\nspecialness. <br/>\n<br/>\nHowever, I found myself doing two things that I didn&#39;t like. <br/>\n<br/>\nThe first was with people (adults) I know, such as in my HS group, where<br/>\nJayn is pretty much odd-girl-out with her hair. It was telling them, as a<br/>\nconversation about her hair may come up, about how I was ready with<br/>\nconditioners and brushes for the moment that Jayn was willing to let me<br/>\n&quot;fix&quot; her hair. Usually this would be a response to people having &quot;helpful<br/>\nsuggestions&quot; like particular products, but it came from my side, from a<br/>\ndesire to excuse myself - with the base assumption that her hair was some<br/>\nkind of aberration or fault, that it was temporary, that it was an area that<br/>\nI was &quot;allowing&quot; her to experiment. A sort of &quot;she&#39;s wrong but will come<br/>\nround soon, and I&#39;m ready for when she does&quot;. <br/>\n<br/>\nI have had to accept that this just isn&#39;t Jayn. She LOVES her wads.<br/>\n<br/>\nThe second thing came from a place of me being a bit embarrassed in public<br/>\nplaces amongst strangers - a body language version of the same ideas as<br/>\nabove. I would pick at her hair, as if trying to tidy it a bit - thereby<br/>\ndrawing even more attention to it, and to my discomfort. James (dh) was the<br/>\nperson who actually pointed out the activity to me, with strongly worded<br/>\nexhortations to desist.<br/>\n<br/>\nThe challenge for me has been to become genuinely acceptant of Jayn&#39;s hair,<br/>\nrather than &quot;temporarily&quot; and superficially acceptant. That has been<br/>\nfacilitated by talking to her about it - and her emphatic expression of her<br/>\nenjoyment of her hair. She tells me that she will let me cut her wads when<br/>\nshe is 100 years old. <br/>\n<br/>\nSo now *if* anyone has a negative comment to me, I usually just say, &quot;Yes<br/>\nshe really loves her wads.&quot;<br/>\n<br/>\nRobyn L. Coburn <br/>\n<br/>\n-- <br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Anti-Virus.<br/>\nVersion: 7.0.322 / Virus Database: 266.11.16 - Release Date: 5/24/2005</div>","specialLinks":[]},{"userId":8151304,"authorName":"rubyprincesstsg@aol.com","from":"rubyprincesstsg@...","profile":"rubyprincesstsg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] re: unschooling personal hygiene","postDate":"1116887255","msgId":106128,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZjLjEzZDMxYzNlLjJmYzNiMmQ3QGFvbC5jb20+"},"prevInTopic":106126,"nextInTopic":106149,"prevInTime":106127,"nextInTime":106129,"topicId":106060,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/23/2005 5:00:44 P.M. Eastern Daylight Time, ssag@tcsn.net writes: I have  felt  worried at times about  what if cps see my children","messageBody":"<div id=\"ygrps-yiv-618362509\">In a message dated 5/23/2005 5:00:44 P.M. Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ssag@...\">ssag@...</a> writes:<br/>\n<br/>\nI have  felt  worried at times about  what if cps see my children  walking<br/>\ndown the sidewalk barefoot. But it is not worth it to me to get  them to stop<br/>\njust because for so many other people they have &quot;issues&quot; with  this.<br/>\nI&#39;ve told my kids that if  grown-ups or kids are mean to them  about their<br/>\npreference to be barefoot they should ask that person why they  are so<br/>\ninterested in their feet.<br/>\n<br/>\n<br/>\n<br/>\nMy dad MADE us wear shoes.  So we wouldn&#39;t get cut/sick/anything that  might <br/>\ncost him money.<br/>\n <br/>\nHe would stomp really hard on our feet if he saw us without shoes on.<br/>\n <br/>\nAs an adult, I never ever wear shoes at home.  I wear shoes out mostly  <br/>\nbecause it&#39;s required in stores and such.<br/>\n <br/>\nI have been known to leave my shoes at different homes, quite by  accident.  <br/>\nI always take my shoes off as soon as practical and I might get  a phone call <br/>\ntelling me I left my shoes, or I might look for them later and then  remember <br/>\nwhere I left them.<br/>\n <br/>\nSo making kids wear shoes might make them LOOSE them.  Better reason  than my <br/>\nfather had for making us wear them.  Or just as good anyway.   And I bet no <br/>\none will stomp their feet and break their toes to remind them NOT  to wear them.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] re: unschooling personal hygiene","postDate":"1116882643","msgId":106126,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFmMi5hNTJiMTUxLjJmYzNhMGQzQGFvbC5jb20+"},"prevInTopic":106124,"nextInTopic":106128,"prevInTime":106125,"nextInTime":106127,"topicId":106060,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/23/2005 3:00:43 PM Mountain Daylight Time, ssag@tcsn.net writes: -=-I m  really glad someone brought this issue this up. Between personal ","messageBody":"<div id=\"ygrps-yiv-1064322873\">In a message dated 5/23/2005 3:00:43 PM Mountain Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ssag@...\">ssag@...</a> writes:<br/>\n<br/>\n-=-I&#39;m  really glad someone brought this issue this up. Between personal  <br/>\nhygiene<br/>\nand hair length and clothes ,ect...<br/>\nWhere do  you draw the line between induviduality and being presentable<br/>\nenough for  society?-=-<br/>\n<br/>\n<br/>\n========<br/>\n <br/>\nDepends.<br/>\nDepends who the others are, how the kid feels about being possibly disliked  <br/>\nor shunned, whether it&#39;s actually a danger to some social situation (will an  <br/>\nex-husband throw a fit or take legal action, or is it just kinda tacky?);  <br/>\ndepends and could change every time.<br/>\n <br/>\n-=-I feel in this case to live up to my principles of allowing him freedom  of<br/>\nchoices for his own body I must let him wear his hair how he likes it and  he<br/>\nwill have to live the consequences of his choice even how much I wish  I<br/>\ncould spare him that.<br/>\n-=-<br/>\n <br/>\n-=-I must let him wear his hair how he likes it ...-=- <br/>\nAs opposed to what?  Cutting it off while he&#39;s sleeping?  Force  him to go to <br/>\na barber?<br/>\n <br/>\n-=He will have to live the consequences of his choice-=-<br/>\n <br/>\nNo he won&#39;t.  The decision making repeats over and over and  over.  It&#39;s not <br/>\nlike getting a tattoo.  He could cut his hair off in  the next half hour, in <br/>\nthe next minute, and then not cut it again for five  years.  <br/>\n <br/>\nWhen the consequences are less pleasant than the hair is, he can cut the  <br/>\nhair off. <br/>\nHe doesn&#39;t have to live with it.<br/>\n <br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":82098222,"authorName":"wilson family","from":"&quot;wilson family&quot; &lt;ssag@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"re: unschooling personal hygiene","postDate":"1116880944","msgId":106124,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzAwMWM1NWZkNyRmMDJmZDBjMCQ0ZWEyOTY0M0BzdGVwaD4=","referencesHeader":"PDExMTY4NDIyMjQuNDc5LjEzMDgyLm0xN0B5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":106112,"nextInTopic":106126,"prevInTime":106123,"nextInTime":106125,"topicId":106060,"numMessagesInTopic":0,"msgSnippet":"I m really glad someone brought this issue this up. Between personal hygiene and hair length and clothes ,ect... Where do you draw the line between","messageBody":"<div id=\"ygrps-yiv-594917709\">I&#39;m really glad someone brought this issue this up. Between personal hygiene<br/>\nand hair length and clothes ,ect...<br/>\n     Where do you draw the line between induviduality and being presentable<br/>\nenough for society?<br/>\n<br/>\nMy kids love going barefoot, especially my daughter. So I only insist on<br/>\nshoes in stores (where you have to), going to friends that don&#39;t know them<br/>\nwell enough to be understanding about the barefoot thing, classes such as<br/>\ndrama and art but I hear that they take their shoes off when they get there<br/>\nanyway.<br/>\n<br/>\n To a whole lot of people this elicits  many reactions. Some kids (I&#39;ll bet<br/>\nthe ones who are never allowed to take shoes off) are very angry and shout<br/>\nthings like &quot;where&#39;s your shoes?&quot; in a very mean tone. Adults laugh and just<br/>\ndon&#39;t quite know what to do. A lot of people ask them about hurting their<br/>\nfeet. They have extremely tough feet and rarely ever get cut.<br/>\n<br/>\nI have felt  worried at times about  what if cps see my children walking<br/>\ndown the sidewalk barefoot. But it is not worth it to me to get them to stop<br/>\njust because for so many other people they have &quot;issues&quot; with this.<br/>\nI&#39;ve told my kids that if  grown-ups or kids are mean to them about their<br/>\npreference to be barefoot they should ask that person why they are so<br/>\ninterested in their feet.<br/>\n<br/>\nOne more thing, my son is loving being able to grow his hair out long. He is<br/>\n11 and his hair is now at his shoulders he wants to grow it long down his<br/>\nback. I really want him to keep it out of his eyes, but he likes it that<br/>\nway. I think he may be trying to hide behind his bangs, but he just says he<br/>\nlikes it. I know that a lot of people look at him and can&#39;t understand his<br/>\nhair and are afraid to get to know him because of it. I have discussed my<br/>\nfeelings to him, but he says he doesn&#39;t care what other people think he<br/>\nlikes his hair long. I think it feels freeing to him.<br/>\nI feel in this case to live up to my principles of allowing him freedom of<br/>\nchoices for his own body I must let him wear his hair how he likes it and he<br/>\nwill have to live the consequences of his choice even how much I wish I<br/>\ncould spare him that.<br/>\n<br/>\nAnyone have any thoughts on this?<br/>\n<br/>\n~Steph</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: unschooling personal hygiene","postDate":"1116859547","msgId":106112,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ3LjI3MTUwYTA5LjJmYzM0NjliQGFvbC5jb20+"},"prevInTopic":106111,"nextInTopic":106124,"prevInTime":106111,"nextInTime":106113,"topicId":106060,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/23/2005 8:24:32 AM Mountain Daylight Time, ecsamhill@earthlink.net writes: My son  mostly would rather not comb his hair.  A real sentence","messageBody":"<div id=\"ygrps-yiv-2108869323\">In a message dated 5/23/2005 8:24:32 AM Mountain Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ecsamhill@...\">ecsamhill@...</a> writes:<br/>\n<br/>\nMy son  mostly would rather not comb his hair.  A real sentence from my house <br/>\n (roughly remembered) is, &quot;Aunt C------- will think I&#39;m a bad mom if she sees <br/>\n your hair looking like that, so would you let me comb  it?&quot;<br/>\n<br/>\n<br/>\n------------<br/>\n <br/>\nI&#39;ve said &quot;Wear real shoes because I don&#39;t want people to call CPS,&quot; and  <br/>\nI&#39;ve meant it. &lt;g&gt;<br/>\n <br/>\nKirby went to his class once last spring (probably more than once, but one  <br/>\nday I saw...) in shorts and flip-flops.  Only bad thing was it was  snowing.  <br/>\nBut his dad&#39;s that way, so it&#39;s not ignorance, it&#39;s a genetic  tendency to be <br/>\nwarmer than other people (and they have nice legs).<br/>\n <br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223130287,"authorName":"Krisula Moyer","from":"&quot;Krisula Moyer&quot; &lt;krisula@...&gt;","profile":"krisulaula","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: unschooling personal hygiene","postDate":"1116859469","msgId":106111,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwNTIzMTQ0NC5qNE5FaU1YNzAwNTI0MEBtcy1zbXRwLTAyLWVyaTAuc29jYWwucnIuY29tPg==","inReplyToHeader":"PDExMTY4NDIyMjQuNDc5LjEzMDgyLm0xN0B5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":106109,"nextInTopic":106112,"prevInTime":106110,"nextInTime":106112,"topicId":106060,"numMessagesInTopic":0,"msgSnippet":"The biggest hygiene issue here is ds s finger nails.  He really does not like to trim them and when they get too long they gather dirt and become very gross","messageBody":"<div id=\"ygrps-yiv-710564597\">The biggest hygiene issue here is ds&#39;s finger nails.  He really does not<br/>\nlike to trim them and when they get too long they gather dirt and become<br/>\nvery gross looking.  We talked about bacteria and how finger nails harbor it<br/>\nand then pass it along to everything we do with our hands including eating.<br/>\nThat helped but he still likes them long (to scratch of course).  <br/>\n<br/>\nLast weekend we were all invited to a wedding and I found a big salon style<br/>\nmanicure kit on sale at Ross.  So I got it and set up bowls of warm soapy<br/>\nwater and fluffy towels in the living room.  I was thinking of the girls<br/>\nwhen I did this but wouldn&#39;t you know ds joined us and let me wash, cut file<br/>\nand buff his nails while we laughed and watched TV. He enjoyed a little<br/>\npampering and it made doing his nails not so much a chore for him.  Who<br/>\nwould&#39;ve guessed.<br/>\n<br/>\nKrisula</div>","specialLinks":[]},{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: unschooling personal hygiene","postDate":"1116858495","msgId":106109,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyOTFFODdGLjQwNzA2MDdAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDE1OS41MWEwZGY2MS4yZmMyODdjMUBhb2wuY29tPg==","referencesHeader":"PDE1OS41MWEwZGY2MS4yZmMyODdjMUBhb2wuY29tPg=="},"prevInTopic":106106,"nextInTopic":106111,"prevInTime":106108,"nextInTime":106110,"topicId":106060,"numMessagesInTopic":0,"msgSnippet":"**You could say that if he grows up and in his own home decides to be dirty, that only makes him look odd and anti-social and might keep him from keeping a job","messageBody":"<div id=\"ygrps-yiv-636844889\">**You could say that if he grows up and in his own home decides to be <br/>\ndirty, that only makes him look odd and anti-social and might keep him <br/>\nfrom keeping a job or friends, but that when he&#39;s a kid it makes his mom <br/>\nlook bad, odd, anti-social and negletful and that&#39;s not a cool thing to <br/>\ndo. **<br/>\n<br/>\nMy son mostly would rather not comb his hair.  A real sentence from my house (roughly remembered) is, &quot;Aunt C------- will think I&#39;m a bad mom if she sees your hair looking like that, so would you let me comb it?&quot;<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: unschooling personal hygiene","postDate":"1116810689","msgId":106106,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1OS41MWEwZGY2MS4yZmMyODdjMUBhb2wuY29tPg=="},"prevInTopic":106105,"nextInTopic":106109,"prevInTime":106105,"nextInTime":106108,"topicId":106060,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/22/2005 7:04:40 PM Mountain Daylight Time, kjennings95@msn.com writes: I  did talk to him about hygiene before, but not really *why* it is","messageBody":"<div id=\"ygrps-yiv-423542670\">In a message dated 5/22/2005 7:04:40 PM Mountain Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kjennings95@...\">kjennings95@...</a> writes:<br/>\n<br/>\nI  did talk to him about hygiene before, but not really *why* it is  <br/>\nimportant. <br/>\n<br/>\n<br/>\n-------------<br/>\n <br/>\nBut without the WHY, what message was he getting?<br/>\nThat he should do it because... mom said?  Because other people do  it?<br/>\nThe bacterial build-up is #1, but...<br/>\n <br/>\n-=- a smelly kid looks like neglect to a social worker.=-<br/>\n <br/>\nI don&#39;t think a person would need to be a social worker to feel a smelly  kid <br/>\nwas a neglected kid.  You could tell him that, in all honesty.   You could <br/>\nsay that if he grows up and in his own home decides to be dirty, that  only <br/>\nmakes him look odd and anti-social and might keep him from keeping a job or  <br/>\nfriends, but that when he&#39;s a kid it makes his mom look bad, odd, anti-social  and <br/>\nnegletful and that&#39;s not a cool thing to do.   <br/>\n <br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":197421595,"authorName":"Katy Jennings","from":"&quot;Katy Jennings&quot; &lt;kjennings95@...&gt;","profile":"coyotegoddess95","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: unschooling personal hygiene","postDate":"1116804779","msgId":106105,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTEwNy1EQVYxNkI5RDIxRThGREUzMDkzQTc4QUREQkUwQjBAcGh4LmdibD4=","referencesHeader":"PGQ2cTVjaitsMW5uQGVHcm91cHMuY29tPiA8NDI5MEUzRDkuNDA5MDQwOUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":106102,"nextInTopic":106106,"prevInTime":106104,"nextInTime":106106,"topicId":106060,"numMessagesInTopic":0,"msgSnippet":"This discussion is extremely timely for me.  I have been having issues lately with Richard s hygiene.  He is 9, and has in the last year started having lots of","messageBody":"<div id=\"ygrps-yiv-495709942\">This discussion is extremely timely for me.  I have been having issues lately with Richard&#39;s hygiene.  He is 9, and has in the last year started having lots of body odor, mostly after exercising.  He doesn&#39;t like to get in the shower, but once he is in he doesn&#39;t like to get out &lt;g&gt;.<br/>\n<br/>\nThe other day I blew up at him.  There was a lot leading up to it, but some of the things were:  I had asked him to shower every day for the last 5 and he didn&#39;t, I didn&#39;t harp on it, just reminded him, and he just forgot each day.  He likes me to set out clothes for him sometimes, and each time I did lately I noticed that he put on everything that I set out *except* the clean underwear.  He has been forgetting to put on deodorant, even with reminders.  He hasn&#39;t brushed his teeth in a week, not a huge problem except that he likes to drink red Fanta so his teeth are red. <br/>\nAnd, the biggest factor leading up to it, I was tired and grumpy!  <br/>\n<br/>\nSo, I blew up about him not taking care of himself.  I felt really bad afterwards, and I apologized and asked him for suggestions to help him remember to do these things.  He gets mad at me if I remind him *too* much, too much like nagging ya know?  So I try really hard not to do that, but he *does* need to be reminded.  So he came up with a list on the bathroom mirror.  That way I only remind him to do his &quot;morning stuff&quot; (kind of a funny name, since mornings at our house are really closer to noon!) and he goes and looks at the list.   It has been working so far, and he seems to like checking each thing off each day.  I work 3 days a week, and on those days he gets himself up and rides his bike to a childcare home.  Those are the days that it has really helped.  I really worry about him smelling since someone called CPS on us a while back (not for that, for homeschooling and a cluttered house, case is to be closed this week, finally!), a smelly kid looks like neglect to a social worker.  He also tends to have a little bit of dandruff, and the anti-dandruff shampoos only work if you shower! &lt;g&gt; So we talked about this, how it looks bad to others if we smell, or have visible dandruff, and that wearing the same underwear for days on end is not the same as wearing the same jeans a couple of days in a row.  <br/>\n<br/>\nI found out that there was a reason that he wasn&#39;t changing his underwear.  A while back he told me that he didn&#39;t like the feel of his underwear (those boxer briefs, fitted like briefs but with legs like shorts) under his cup/supporter that he has to wear for TaeKwonDo.  He decided that he liked wearing regular boxers, the soft ones made of t-shirt knit, better.  So I bought him a bunch of those.  At some point he changed his mind, but was afraid to tell me.  So he had lots of boxers clean, but no boxer briefs, so he just kept wearing the same ones for a week!  He wasn&#39;t afraid that I would be mad, but he said he was afraid of disappointing me, that I had just spent money on these boxers and then he didn&#39;t like them.  I felt really bad and told him that I wanted him to be comfortable, I don&#39;t care about buying the new underwear.  <br/>\n<br/>\nAnyway, things are  much better now, after talking about it with him.  I did talk to him about hygiene before, but not really *why* it is important.  And I am rambling now!<br/>\n<br/>\nKaty<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: unschooling personal hygiene","postDate":"1116791769","msgId":106102,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyOTBFM0Q5LjQwOTA0MDlAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PGQ2cTVjaitsMW5uQGVHcm91cHMuY29tPg==","referencesHeader":"PGQ2cTVjaitsMW5uQGVHcm91cHMuY29tPg=="},"prevInTopic":106084,"nextInTopic":106105,"prevInTime":106101,"nextInTime":106103,"topicId":106060,"numMessagesInTopic":0,"msgSnippet":"** In unschooling, we don t have to break down to discuss something with our kids, if it s an actual discussion and dialogue and giving information, as","messageBody":"<div id=\"ygrps-yiv-991054770\">**<br/>\n<br/>\nIn unschooling, we don&#39;t have to &quot;break down&quot; to discuss something<br/>\nwith our kids, if it&#39;s an actual discussion and dialogue and giving<br/>\ninformation, as opposed to &quot;laying down the law.&quot;  Discussing is a<br/>\nhuge part of what we do as unschooling parents -- giving information,<br/>\nlistening to our children, considering things from all angles, being<br/>\nas honest about our own feelings and experiences as we are respectful<br/>\nof theirs.  **<br/>\n<br/>\nRight.<br/>\n<br/>\nThis made me think that dysfunctional, dictatorial families in which having a dissenting opinion is &quot;talking back&quot; are very likely to create the (very common now) next generation of dysfunctional families in which the adults &quot;don&#39;t know how to communicate&quot; with each other (due to lack of opportunities to practice).<br/>\n<br/>\nPeople get all anxious about windows of opportunity to learn foreign language or math and sail right past the critical opportunity to learn to play nice and share.    ::::: overly dramatic sigh :::::<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":201436708,"authorName":"arcarpenter2003","from":"&quot;arcarpenter2003&quot; &lt;arcarpenter@...&gt;","profile":"arcarpenter2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: unschooling personal hygiene","postDate":"1116772563","msgId":106084,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ2cTVjaitsMW5uQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGQ2bzJtdCtrMTNtQGVHcm91cHMuY29tPg=="},"prevInTopic":106083,"nextInTopic":106102,"prevInTime":106083,"nextInTime":106085,"topicId":106060,"numMessagesInTopic":0,"msgSnippet":"...  wrote: ==Sometimes I break down and do discuss it with ... In unschooling, we don t have to break down to discuss something with our","messageBody":"<div id=\"ygrps-yiv-1199842598\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;kricketp2&quot;<br/>\n&lt;gpurscell@c...&gt; wrote:<br/>\n==Sometimes I break down and do discuss it with <br/>\n<blockquote><span title=\"ireply\"> &gt; him, and the reasoning I give to him is his health. ==<br/>\n<br/>\n </span></blockquote>In unschooling, we don&#39;t have to &quot;break down&quot; to discuss something<br/>\nwith our kids, if it&#39;s an actual discussion and dialogue and giving<br/>\ninformation, as opposed to &quot;laying down the law.&quot;  Discussing is a<br/>\nhuge part of what we do as unschooling parents -- giving information,<br/>\nlistening to our children, considering things from all angles, being<br/>\nas honest about our own feelings and experiences as we are respectful<br/>\nof theirs.  This is how our children learn to communicate as a real<br/>\nperson in the world (instead of as a powerless sub-human, which is<br/>\nwhat they learn in school).  This is how they get the information they<br/>\nneed to make well-considered decisions.<br/>\n<br/>\nSo by all means, keep discussing!<br/>\n<br/>\nPeace,<br/>\nAmy</div>","specialLinks":[]},{"userId":177721839,"authorName":"Angela S.","from":"&quot;Angela S.&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [UnschoolingDiscussion] unschooling personal hygiene","postDate":"1116771970","msgId":106083,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwNTIyMTQyNjA3LlJPWVc0MTkxLm10YTEzLmFkZWxwaGlhLm5ldEBTdWdhcj4=","inReplyToHeader":"PGU1LjEzZDE0Y2NmLjJmYzFlYmRhQGFvbC5jb20+"},"prevInTopic":106082,"nextInTopic":106084,"prevInTime":106082,"nextInTime":106084,"topicId":106060,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-63135640\">&lt;&lt;&lt;So, when  we&#39;re close <br/>\ntogether, sitting on the couch, and he&#39;s stinky, I don&#39;t   have a bit of a <br/>\nproblem with telling him I&#39;d enjoy our snuggle more if he  were  clean &gt;&gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nWe do a lot of snuggling in our house and I have a pretty sensitive nose.  I<br/>\nhave only daughters (8 and 10) but they don&#39;t like to shower either.  I have<br/>\nno problem telling them when they smell badly and need to bathe.  I am not<br/>\ntrying to insult them but just inform them that if they want people to enjoy<br/>\nbeing around them, that it would benefit them to bathe.  Also, it&#39;s harder<br/>\nto notice your own body odor or even that of your own kids, so I think that<br/>\nby the time I notice that they stink that any other people who have come in<br/>\nclose contact have already noticed.   My kids can go a good week without<br/>\nsmelling too badly and longer in the summer when they swim often.  I don&#39;t<br/>\nthink it&#39;s too much to ask to ask them to shower occasionally for the<br/>\nbenefit of others who live in the same house or come in close contact with<br/>\nthem.  <br/>\n<br/>\n <br/>\n<br/>\nMy kids still like to have me shampoo their hair and adjust the water<br/>\ntemperature in the shower.  I don&#39;t mind helping to make their shower<br/>\nexperiences as easy as possible.   It just encourages them to do it more<br/>\noften.<br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\nAngela<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a><br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":77669557,"authorName":"gailbrocop@aol.com","from":"gailbrocop@...","profile":"gailbrocop","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] unschooling personal hygiene","postDate":"1116770778","msgId":106082,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU1LjEzZDE0Y2NmLjJmYzFlYmRhQGFvbC5jb20+"},"prevInTopic":106077,"nextInTopic":106083,"prevInTime":106081,"nextInTime":106083,"topicId":106060,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/22/2005 9:34:58 A.M. Eastern Standard Time, tuckervill2@aol.com writes: So, when  we re close together, sitting on the couch, and he s","messageBody":"<div id=\"ygrps-yiv-344218092\">In a message dated 5/22/2005 9:34:58 A.M. Eastern Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tuckervill2@...\">tuckervill2@...</a> writes:<br/>\n<br/>\nSo, when  we&#39;re close <br/>\ntogether, sitting on the couch, and he&#39;s stinky, I don&#39;t   have a bit of a <br/>\nproblem with telling him I&#39;d enjoy our snuggle more if he  were  clean.  <br/>\n<br/>\n<br/>\n<br/>\n____<br/>\n <br/>\nI use this with my 12 year old son.  He is a big hugger and I always  tell <br/>\nhim how good his hair smells when he comes to hug me good night after a  shower. <br/>\n I also remind him about his teeth occasionally....he doesn&#39;t  mind.  He&#39;s <br/>\nbusy and get preoccupied for hours and often doesn&#39;t shower  because it&#39;s just <br/>\nnot something that he wants to take time to do.<br/>\n <br/>\nHis sister has no problem at all telling him that he stiinks!  She  doesn&#39;t <br/>\nhave much tact and will say something like...&quot;Logan you smell really  really <br/>\nbad!&quot;  <br/>\n <br/>\nOne thing that saves us in the summer is our pool.  Last summer I had  three <br/>\nboys (two stepchildren) here ages 11, 13 and 15.  The 13 year  old showered <br/>\nonly twice in one month.  I just encouraged them to swim  often and kept <br/>\nchlorine in the pool.  They have a room in the garage in the  summer and I just <br/>\ndidn&#39;t go in there.  The 15 year old was starting to  shower more and with 3 <br/>\nteenage girls in the neighborhood I predict he may  be showering more this summer.  <br/>\n <br/>\nGail<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":163750020,"authorName":"tuckervill2@aol.com","from":"tuckervill2@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] unschooling personal hygiene","postDate":"1116768795","msgId":106077,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhlLjI3ZDc5OThkLjJmYzFlNDFiQGFvbC5jb20+"},"prevInTopic":106071,"nextInTopic":106082,"prevInTime":106076,"nextInTime":106078,"topicId":106060,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/21/2005 5:08:34 PM Central Standard Time, SandraDodd@aol.com writes: On the  other hand, lots of kids will start showering more (or lots!)","messageBody":"<div id=\"ygrps-yiv-1740990451\">In a message dated 5/21/2005 5:08:34 PM Central Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\nOn the  other hand, lots of kids will start showering more (or lots!) when   <br/>\nthey&#39;re into puberty, and 12 can be the last holdout period for  boys.  The  <br/>\ngamer boys will tell the younger boys &quot;take a  shower,&quot; but I know of NO <br/>\nolder  <br/>\ngamer boys who don&#39;t take regular  showers.  And those are the geekiest of  <br/>\nthe <br/>\ngeek-boys,  generally.<br/>\n<br/>\n<br/>\n<br/>\n~~~<br/>\n <br/>\nYeah, I was thinking about that too, until she said it was going on from  <br/>\nlong ago.<br/>\n <br/>\nGlenda, I&#39;d like to know how much physical closeness you have with your  son? <br/>\n My youngest is 11 and we still snuggle up on the couch together a  lot.  He <br/>\nonly stopped sleeping with me last year.  He has problems  remembering to <br/>\nshower and brush his teeth, but I remind him like I always have  (he didn&#39;t <br/>\nremember to shower or brush his teeth when he was 3, either).   So, when we&#39;re close <br/>\ntogether, sitting on the couch, and he&#39;s stinky, I don&#39;t  have a bit of a <br/>\nproblem with telling him I&#39;d enjoy our snuggle more if he were  clean.  <br/>\n <br/>\nThis is an area where my son needs help remembering how and when to do the  <br/>\nproper thing, and like anything (eating, baseball practice), I help him <br/>\nremember  to get it done.  I&#39;ve even insisted on the shower at certain times.   The <br/>\nlucky thing is he&#39;s 11 now, and I can tell him how much time he has left  from <br/>\nthe time we have to leave or whatever, or I can point out that he didn&#39;t  <br/>\nshower yesterday because we stayed home all day in our pajamas, and he&#39;ll go and  <br/>\nshower without being cajoled into it.  It took a long time to get him to  that <br/>\npoint.  11 years.  :)  He simply wasn&#39;t ready to do it on  his own before <br/>\nnow.  He&#39;s still not showering independently of his own  choice, but like my <br/>\nolder sons, I know that day is coming when he will be  using up the hot water <br/>\nbefore I can.<br/>\n <br/>\nI&#39;m an unschooler, by the way.  Unschooling doesn&#39;t mean we don&#39;t  interact <br/>\nor guide or encourage your children.  Unschooling is all about the  <br/>\n*relationship* between the child and his world.  He doesn&#39;t live in a  bubble of his own <br/>\nchoosing.  Parents are a major part of that world.<br/>\n <br/>\nAnother thing...Is your shower clean?  Are any of the tiles missing or  does <br/>\nthe water back up into the tub?  Is it scary in there for him?   Does he have <br/>\nenough privacy?  No windows with sheer curtains or  anything like that?  <br/>\nThere&#39;s a lock on the door?  Does he know HOW to  shower and wash himself?  Is <br/>\nthere plenty of soap, a washcloth and clean  towels?  Does he object to you seeing <br/>\nhim naked?  (Will doesn&#39;t want  me to see him anymore.)  Could you sit in the <br/>\nbathroom with him while  showers?  Make conversation, talk about the weather. <br/>\n Could you put a  radio in there so he could blast his favorite music while <br/>\nhe showers?  <br/>\n <br/>\nI like a clean shower.  If I&#39;m camping out and the nearest shower is  creepy <br/>\nor not clean, I&#39;ll gladly skip showers until I can&#39;t stand myself  anymore.  <br/>\n(Lots of people don&#39;t shower when they camp, I know.  I like  to shower on <br/>\noccasion if I can.)  Maybe your son doesn&#39;t enjoy the  experience of showering.  <br/>\nMaybe he needs help making the environment more  comfy for him.  <br/>\n <br/>\nI&#39;d definitely ask him how you can help him be get clean more often, and  <br/>\nthen follow through on it right away.<br/>\n <br/>\nKaren<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] unschooling personal hygiene","postDate":"1116729434","msgId":106071,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA3NjlhN2NjYzFlYmQ0NzQ0MGJmOTcxM2E3MThhNTdjQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PGQ2bzJtdCtrMTNtQGVHcm91cHMuY29tPg==","referencesHeader":"PGQ2bzJtdCtrMTNtQGVHcm91cHMuY29tPg=="},"prevInTopic":106065,"nextInTopic":106077,"prevInTime":106070,"nextInTime":106072,"topicId":106060,"numMessagesInTopic":0,"msgSnippet":"You ve been through hell and gotten out of it!! Wow! I wouldn t worry at ALL about the personal hygiene thing - after what he s been through, it isn t that big","messageBody":"<div id=\"ygrps-yiv-1904305805\">You&#39;ve been through hell and gotten out of it!! Wow!<br/>\n<br/>\nI wouldn&#39;t worry at ALL about the personal hygiene thing - after what <br/>\nhe&#39;s been through, it isn&#39;t that big a deal and, trust me, it is VERY <br/>\nvery very common among boys his age.<br/>\n<br/>\nI don&#39;t have sons, but I have 3 daughters 14, 17, and 20 and have spent <br/>\na lot of time around a lot of young boys. There seems to be a stage <br/>\nthat many many many of them go through during which they don&#39;t seem to <br/>\nmind at ALL being really stinky and having dirty hair and all that.<br/>\n<br/>\nUsually this is just before puberty - and sometimes they can really get <br/>\npretty awful smelling. I&#39;ve had some boys in my car, over the years, <br/>\nwhere I had to open the windows and air the car out after they&#39;d been <br/>\nin it.<br/>\n<br/>\nSo - it passes. I BET there will be a time in the not-too-distant <br/>\nfuture when he&#39;ll be taking frequent and really LONG showers and you&#39;ll <br/>\nbe wondering what the heck he is doing in there &lt;BEG&gt;!!!<br/>\n<br/>\nI&#39;d bribe him to shower, if it was me, because I wouldn&#39;t want to have <br/>\nhim around me, all stinky and gross. MY problem, not his, right? But I <br/>\nwouldn&#39;t worry that he&#39;d never come round to wanting to be clean - for <br/>\nhimself --- that&#39;ll happen.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On May 21, 2005, at 12:38 PM, kricketp2 wrote:<br/>\n<br/>\n&gt; The only area I worry about in the long term is his extreme lack of<br/>\n&gt; personal hygiene.  He absolutely hates bathing, washing his hair,<br/>\n&gt; and brushing his teeth. </span></blockquote></div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] unschooling personal hygiene","postDate":"1116715176","msgId":106065,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDNzJDNkQxOURENzRBMy00RTQtNERCMjZATUJMSy1NMzMuc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PGQ2bzJtdCtrMTNtQGVHcm91cHMuY29tPg==","referencesHeader":"PGQ2bzJtdCtrMTNtQGVHcm91cHMuY29tPg=="},"prevInTopic":106062,"nextInTopic":106071,"prevInTime":106064,"nextInTime":106067,"topicId":106060,"numMessagesInTopic":0,"msgSnippet":"... From: kricketp2  -=-=-=- Sometimes I break down and do discuss it with him, and the reasoning I give to him is his health.  There is","messageBody":"<div id=\"ygrps-yiv-1743928266\">-----Original Message-----<br/>\nFrom: kricketp2 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:gpurscell@...\">gpurscell@...</a>&gt;<br/>\n<br/>\n -=-=-=- Sometimes I break down and do discuss it with<br/>\nhim, and the reasoning I give to him is his health.  There is truth<br/>\nin it being a health issue, but to be totally honest my biggest<br/>\nreason for wanting him to be clean has nothing to do with that -- it<br/>\nis because I am embarrassed when other adults see him looking dirty<br/>\nand unkempt.  I am afraid they will think that he is neglected and<br/>\nthink poorly of me as his parent (or worse yet, report me to Child<br/>\nProtective Services over it).-=-=-=-<br/>\n<br/>\nI think you need to break down and be honestly honest with him.<br/>\n<br/>\nI think that it seriously *could* be considered an issue that would <br/>\ninvolve CPS. It could jeapordize your unschooling.<br/>\n<br/>\nIf he considers school a better option, by all means, he can continue <br/>\nto live in filth. If he likes his life right now, he might want to <br/>\nconsider doing something as simple as showering to remain at home in <br/>\npeace and joy.<br/>\n<br/>\nNot a hard decision, really.<br/>\n<br/>\nBe honest and quit beating around the bush. He stinks and is filthy, <br/>\nand &quot;neglect&quot; IS grounds for a CPS report.<br/>\n<br/>\n<br/>\n-=-=-=-=-So I&#39;m looking for opinions on where this issue fits into RU.<br/>\nObviously, I haven&#39;t arrived at being a radical unschooler yet, but<br/>\nthat is the goal.  Is the fact that there is a health issue involved<br/>\nmake this an area where he doesn&#39;t just get to choose what he wants<br/>\nto do-=-=-=-=-=-<br/>\n<br/>\nThis doesn&#39;t seem much like an unschooling issue. But...<br/>\n<br/>\nPart of unschooling is making sure he knows the facts so that he can <br/>\nmake wise decisions. I don&#39;t think you&#39;ve talked enough.<br/>\n<br/>\n~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\nConference Coordinator<br/>\nLive and Learn Unschooling Conference<br/>\nOctober 6-9, 2005<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://liveandlearnconference.org\">http://liveandlearnconference.org</a></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] unschooling personal hygiene","postDate":"1116713198","msgId":106062,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwNC4yMTIyMWRlLjJmYzEwYWVlQGFvbC5jb20+"},"prevInTopic":106060,"nextInTopic":106065,"prevInTime":106061,"nextInTime":106063,"topicId":106060,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/21/2005 3:34:25 PM Mountain Daylight Time, gpurscell@cox.net writes: Because  some days are rather lean on the together time, we declared","messageBody":"<div id=\"ygrps-yiv-1580181150\">In a message dated 5/21/2005 3:34:25 PM Mountain Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:gpurscell@...\">gpurscell@...</a> writes:<br/>\n<br/>\nBecause  some days are rather lean on the together <br/>\ntime, we declared Sunday to be  family day (at his request) so that <br/>\nwe can have one day a week that is  just for us to do activities <br/>\ntogether (no work for me and no friends over  for him, except on rare <br/>\nand mutually agreeable occasions).  He is  very much a night owl and <br/>\nwill often stay up all night and sleep most of  the day.  He spends <br/>\nhis waking hours watching TV and playing video  games, or playing <br/>\nwith his ps friends after they get home in the  afternoon.<br/>\n<br/>\n<br/>\n======================<br/>\n <br/>\nWhy can&#39;t a weekday be the family day?  If he already has to wait for  <br/>\nschoolkids, why black out one of the days they&#39;re all home?<br/>\n <br/>\n-=-The only area I worry about in the long term is his extreme lack of  <br/>\npersonal hygiene.  He absolutely hates bathing, washing his hair,  <br/>\nand brushing his teeth. -=-<br/>\n <br/>\nSo if he were going to school he would do it because it was time to go  <br/>\nsomewhere?<br/>\nYou could take him somewhere every day, after he&#39;s cleaned up and ready to  <br/>\ngo, maybe.<br/>\n <br/>\n-=- He will wear the same clothes for weeks at <br/>\na time, =-<br/>\n <br/>\nNot if you put them in the washing machine when he takes them off.<br/>\nIf he&#39;s sleeping in them, tell him it&#39;s not good for the sheets and the  <br/>\nsheets are yours, so to change for bed.  Then wash what he pulls off.<br/>\n <br/>\n-=- I cannot <br/>\nremember the last time that he brushed his teeth.   Since coercion <br/>\nand even blatant bribery with money has failed over the  years, . . .-=-<br/>\n <br/>\nIf this has been going on for years, then it&#39;s not about deschooling or  <br/>\nhomeschooling, right?<br/>\n <br/>\n-=-He did bathe on occasion when in private school <br/>\nbecause the teachers  or principal would tell him he needed to.-=-<br/>\n <br/>\nIf he would do it for them, why wouldn&#39;t he do it for you?<br/>\nWhy could YOU say &quot;Take a shower now&quot; but in a nice way?<br/>\n <br/>\n-=--=- Sometimes I break down and do discuss it with <br/>\nhim,-=-<br/>\n <br/>\n&quot;Break down&quot; from WHAT!?<br/>\nYou have a policy of not discussing things with him?<br/>\n <br/>\n-=- Sometimes I break down and do discuss it with <br/>\nhim, and the  reasoning I give to him is his health.  There is truth <br/>\nin it being a  health issue, but to be totally honest my biggest <br/>\nreason for wanting him to  be clean has nothing to do with that -- it <br/>\nis because I am embarrassed when  other adults see him looking dirty <br/>\nand unkempt.  I am afraid they will  think that he is neglected and <br/>\nthink poorly of me as his parent (or worse  yet, report me to Child <br/>\nProtective Services over it).-=-<br/>\n <br/>\n <br/>\nIf you were regularly discussing things with him, you couldn&#39;t write  <br/>\n&quot;sometimes I break down and discuss it.&quot;<br/>\n <br/>\nIf you were totally honest with him, you could write to us and say &quot;the  <br/>\nreasoning I give him is his health... but to be totally honest...&quot;<br/>\n <br/>\nHe should have heard long ago that it&#39;s embarrassing to you and that you  <br/>\ncould be in trouble with CPS.  Those things are real and true, and if you  <br/>\nhaven&#39;t been communicating well with him that could be your first goal, I  think.<br/>\n <br/>\n_<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/truck_\">http://sandradodd.com/truck_</a> (<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/truck)\">http://sandradodd.com/truck)</a> <br/>\nThat article might help.<br/>\n <br/>\n-=-So I&#39;m looking for opinions on where this issue fits into  RU. =-<br/>\n <br/>\nCan we just say unschooling, maybe?  <br/>\nThose issues do NOT &quot;fit into&quot; unschooling.<br/>\n <br/>\nI think your question is how to apply principles to this situation.   What <br/>\nare your priorities for your relationship with him and for how the  environment <br/>\nin which he&#39;s living and learning should be?<br/>\n <br/>\nSomething went wrong a long time back that has nothing to do with private  <br/>\nschool or public school.<br/>\n <br/>\nOn the other hand, lots of kids will start showering more (or lots!) when  <br/>\nthey&#39;re into puberty, and 12 can be the last holdout period for boys.  The  <br/>\ngamer boys will tell the younger boys &quot;take a shower,&quot; but I know of NO older  <br/>\ngamer boys who don&#39;t take regular showers.  And those are the geekiest of  the <br/>\ngeek-boys, generally.<br/>\n <br/>\n-=-  I really don&#39;t care so much about his wearing the same clothes  for two <br/>\nweeks (less <br/>\nlaundry),-=-<br/>\n <br/>\nWell it&#39;s not good for the cloth itself, and it&#39;s not as good for his  health <br/>\nas changing clothes would be.   Maybe you should take a detour  from <br/>\ndeschooling for a unit study on germs.  If you as a mom aren&#39;t more  worried about the <br/>\ncleanliness in which your child resides, and if your honest  discussion only <br/>\nvaguely concerns health, maybe you need to do a google-session  looking up <br/>\nbacteria and how laundry detergents and soaps work and maybe your son  would be <br/>\ninterested in seeing it too.  It might inspire him to want more  showers.  <br/>\n <br/>\nWhat about renting Osmosis Jones?  If he doesn&#39;t want to watch it with  you, <br/>\nyou could watch it.<br/>\n <br/>\nDo you change your own clothes a lot?  Shower lots?  Do you say  &quot;OH, that <br/>\nfeels good!&quot; when you&#39;re hair&#39;s just clean after you&#39;ve worked in the  yard (or <br/>\nwhatever) and then taken a shower?<br/>\nWould he like new clothes (or  different, used clothes)?<br/>\n <br/>\nIs he still depressed?<br/>\n <br/>\n <br/>\nSandra<br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210692647,"authorName":"kricketp2","from":"&quot;kricketp2&quot; &lt;gpurscell@...&gt;","profile":"kricketp2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"unschooling personal hygiene","postDate":"1116704285","msgId":106060,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ2bzJtdCtrMTNtQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":106062,"prevInTime":106059,"nextInTime":106061,"topicId":106060,"numMessagesInTopic":0,"msgSnippet":"Hello all.  I have been lurking on this site for about three weeks now, and am so grateful that I discovered you all.  I feel like a sponge that is soaking up","messageBody":"<div id=\"ygrps-yiv-372207357\">Hello all.  I have been lurking on this site for about three weeks <br/>\nnow, and am so grateful that I discovered you all.  I feel like a <br/>\nsponge that is soaking up all of these wonderful ideas about life <br/>\nand learning.  Right now, I&#39;m looking for opinions on how to <br/>\napproach the concept of personal hygiene (or extreme lack thereof) <br/>\nfrom an RU perspective.<br/>\n<br/>\nI am a single mother homeschooling my ds age 12.  We are still new <br/>\nto homeschooling and even newer to the concept of unschooling, so we <br/>\nare still very much in a deschooling adjustment period.  My ds <br/>\ntolerated attending a small private school through 5th grade, but <br/>\ndue to a job layoff and new job with about 60% less income, and <br/>\ntherefore no money for tuition, he transferred into a large <br/>\nextremely overcrowded public middle school for 6th grade.  I wish I <br/>\nhad heard of the concept of unschooling before I enrolled him in ps, <br/>\nor I never would have done that hideous thing to him at all.  But <br/>\nuntil last November, homeschooling in my mind had always been <br/>\nequivalent to school-at-home and therefore a last resort.  <br/>\n<br/>\nNot surprisingly, he did not take the transition into ps well at <br/>\nall. The anxiety created severe IBS problems, causing him to miss <br/>\nquite a bit of school and eventually spiraling him into a suicidal <br/>\ndepression.  The psychiatrist gave him drugs, and when those didn&#39;t <br/>\nwork they gave him more drugs, all in an effort to make him able to <br/>\ntolerate the *necessary* school atmosphere.  The school was ready to <br/>\nhold him back a year because he had missed too many days, therefore <br/>\nlabeling him as a failure.  It became extremely apparent to me that <br/>\nall of them were less concerned about him as a human being, and more <br/>\nconcerned about him helping to maintain their high test score <br/>\naverages in the school district, so I said *enough* and pulled him <br/>\nout of school.  He was almost immediately a totally different child, <br/>\nas if I had rescued him from death (which I guess I did).  We <br/>\neventually also dumped the psychiatrist (and his drugs).  And we <br/>\ndumped the counselor who said that homeschooling was the worst thing <br/>\nI could do for my child and who scolded me for never having assigned <br/>\nhim chores yet in his life, because they were long overdue.  Even <br/>\nthe IBS problems have completely ceased.  He is no longer depressed <br/>\nor suicidal.<br/>\n<br/>\nBecause I was initially afraid of the school questioning me and <br/>\nclaiming that I was simply trying to avoid truancy, we did attempt <br/>\nto do school-at-home for the first two months, but it didn&#39;t work <br/>\nwell at all.  Not even when we only studied one subject a day and <br/>\nonly for 30 minutes.  Even if he got to pick the subject.  It became <br/>\nobvious that he desperately needed a long period of deschooling with <br/>\na goal of unschooling.  So that&#39;s where we are now.  <br/>\n<br/>\nFortunately, I work from home, so we just each go about our day <br/>\ndoing what we each need/want to do, doing activities together as <br/>\nmuch as possible.  Because some days are rather lean on the together <br/>\ntime, we declared Sunday to be family day (at his request) so that <br/>\nwe can have one day a week that is just for us to do activities <br/>\ntogether (no work for me and no friends over for him, except on rare <br/>\nand mutually agreeable occasions).  He is very much a night owl and <br/>\nwill often stay up all night and sleep most of the day.  He spends <br/>\nhis waking hours watching TV and playing video games, or playing <br/>\nwith his ps friends after they get home in the afternoon.  On <br/>\nextremely rare occasions he will read for a little bit.<br/>\n<br/>\nThe only area I worry about in the long term is his extreme lack of <br/>\npersonal hygiene.  He absolutely hates bathing, washing his hair, <br/>\nand brushing his teeth.  He will wear the same clothes for weeks at <br/>\na time, he has taken one shower in the last four months (on Mother&#39;s <br/>\nDay as a gift to me, even though I didn&#39;t ask for it), and I cannot <br/>\nremember the last time that he brushed his teeth.  Since coercion <br/>\nand even blatant bribery with money has failed over the years, I am <br/>\ntrying to give him space to choose these things on his own, but he <br/>\nsimply doesn&#39;t.  He did bathe on occasion when in private school <br/>\nbecause the teachers or principal would tell him he needed to.  And <br/>\nthere was a short time in 5th grade when he chose to shower every <br/>\nday, but I&#39;m pretty sure there was peer pressure involved in that.  <br/>\nNow he just doesn&#39;t.  Sometimes I break down and do discuss it with <br/>\nhim, and the reasoning I give to him is his health.  There is truth <br/>\nin it being a health issue, but to be totally honest my biggest <br/>\nreason for wanting him to be clean has nothing to do with that -- it <br/>\nis because I am embarrassed when other adults see him looking dirty <br/>\nand unkempt.  I am afraid they will think that he is neglected and <br/>\nthink poorly of me as his parent (or worse yet, report me to Child <br/>\nProtective Services over it).<br/>\n<br/>\nSo I&#39;m looking for opinions on where this issue fits into RU.  <br/>\nObviously, I haven&#39;t arrived at being a radical unschooler yet, but <br/>\nthat is the goal.  Is the fact that there is a health issue involved <br/>\nmake this an area where he doesn&#39;t just get to choose what he wants <br/>\nto do (sort of like I would never let him choose to play in the <br/>\nmiddle of a busy highway), or should I continue to let him make his <br/>\nown decisions in this area and I just need to be more patient and <br/>\nwork on healing my own attitude and fears?  I really don&#39;t care so <br/>\nmuch about his wearing the same clothes for two weeks (less <br/>\nlaundry), but I do worry about the months of not bathing at all or <br/>\nbrushing his teeth.  Sorry this was so long, but I thought some <br/>\nbackground might be useful.<br/>\n<br/>\nGlenda in OK</div>","specialLinks":[]}],"prevTopicId":106201,"nextTopicId":106212}}