{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","replyTo":"LIST","senderId":"gEllUCzH2JSXrOrqhM4k6A5mt5l6aOW-3AH7GhNuIM1yGYyCc6FYLyGi04u8JHjWP5DM3-X2NqIBOQnGqcbWYgAaxA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Fw: Corporate welfare","postDate":"989857378","msgId":21257,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZDIwMWMwZGM5MiQyYWE4OTBjMCRhZTVkZDFkMUBsZGlvbm5vPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":21256,"nextInTime":21258,"topicId":21257,"numMessagesInTopic":0,"msgSnippet":"For those that wonder where their tax dollars are going.  According to this article, the government is doing this to keep the price of food down on the","messageBody":"<div id=\"ygrps-yiv-10404300\">For those that wonder where their tax dollars are going.  According to this article, the government is doing this to keep the price of food down on the shelves, perhaps they can explain why their math doesn&#39;t work--they increase the payments to corporate farmers so that they don&#39;t feel the pinch of increased production costs yet the price to the consumer keeps rising &quot;because it costs more to produce.&quot;  Am I the only one bothered by that &quot;logic?&quot;<br/>\n<br/>\nAnd, please notice that the biggest chunk of all the &quot;welfare&quot; is going to Texas and not to small farmers!<br/>\n<br/>\nLynda<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\n<br/>\nFar From Dead, Subsidies Fuel Big Farms <br/>\n<br/>\nBy ELIZABETH BECKER <br/>\n<br/>\nALHART, Tex. — By any measure, Lanny Bezner is a successful family <br/>\nfarmer. His eldest son, John, rides herd over his cattle, spread <br/>\nout on pastureland from here to nearby New Mexico. A younger son, <br/>\nBrian, looks after the farm&#39;s heavily irrigated cornfields, with <br/>\nhelp from the husband of Mr. Bezner&#39;s daughter, Virginia. As a <br/>\nTexas patriarch, Mr. Bezner rigorously sticks to the principle that <br/>\neconomy of scale is the only way to survive in modern farming. The <br/>\nbigger the farm, the better likelihood of turning a profit, he <br/>\nsays. <br/>\n<br/>\nBy buying adjacent fields, he has expanded his cropland from its <br/>\noriginal 700 acres to more than 8,000. In five years he has doubled <br/>\nhis grazing land by leasing 90,000 acres of pasture. He owns a <br/>\nfleet of tractors and heavy farm equipment; he fills their tanks <br/>\nwith fuel from his own gas pumps. He dries and stores his harvest <br/>\nin his own imposing grain elevators, which hold more than a million <br/>\nbushels of corn. <br/>\n<br/>\nSurveying the farm that he carved out in the Panhandle landscape <br/>\nof dry mesquite and sagebrush, Mr. Bezner says the key to his <br/>\nfamily&#39;s prosperity is federal farm subsidies. <br/>\n<br/>\n&quot;We&#39;re successful primarily because of government help,&quot; said Mr. <br/>\nBezner, 59, an entomologist who grew up on a farm outside Amarillo. <br/>\n<br/>\nAlthough Mr. Bezner hesitated to discuss the size of those <br/>\nsubsidies (and refused to divulge how much he makes without federal <br/>\nhelp, or what his expenses are), government documents show that in <br/>\nthe last four years of the 1990&#39;s, he received $1.38 million in <br/>\ndirect federal payments. <br/>\n<br/>\nMost remarkably, Mr. Bezner and the other big farmers here in <br/>\nHartley County and across the country received those <br/>\nrecord-breaking payments in an era when farm subsidies were slated <br/>\nfor extinction. <br/>\n<br/>\nUnder the Freedom to Farm Act of 1996, swept up in the language of <br/>\nthe Republican revolution under Speaker Newt Gingrich, farmers who <br/>\nplanted row crops — corn, wheat, soybeans, rice or cotton — were <br/>\nfreed from government production controls. In exchange for being <br/>\nable to plant what they wanted, they were told, they would have <br/>\ntheir subsidies gradually phased out. <br/>\n<br/>\nWhile farmers embraced their new freedom to decide what to plant, <br/>\nthey balked at accepting the rigors of the free market. When prices <br/>\nfor their crops held stagnant and their costs rose, farmers lobbied <br/>\nCongress for &quot;emergency&quot; payments. <br/>\n<br/>\nTheir friends in Congress relented. Instead of diminishing, the <br/>\nsubsidies have nearly tripled with steep emergency payments that <br/>\nreached $22 billion last year, according to Keith Collins, the top <br/>\neconomist at the Agriculture Department. <br/>\n<br/>\nSupporters of farm subsidies, which were enacted in the <br/>\nDepression, argue that they are needed to save the family farm. But <br/>\ngovernment documents indicate that the prime beneficiaries hardly <br/>\nfit the image of small, hardscrabble farmers. Because eligibility <br/>\nis based on acreage planted with subsidized crops in the past, the <br/>\nfarmers who have the biggest spreads benefit the most, according to <br/>\nthe Environmental Working Group, a nonprofit advocacy organization <br/>\nthat obtained government records of farm subsidies through the <br/>\nFreedom of Information Act. <br/>\n<br/>\n&quot;The data shows that government subsidies are tilting the playing <br/>\nfield in favor of the largest farms,&quot; said Clark Williams-Derry, <br/>\nthe senior analyst at the Environmental Working Group who created a <br/>\nnational database of subsidies. <br/>\n<br/>\nMr. Bezner, who saw his direct federal payments balloon from <br/>\n$164,621 in 1996 to $741,839 in 1999, is one of the elite 10 <br/>\npercent of American farmers who receive 61 percent of the billions <br/>\nof dollars the program distributes. The subsidies have been a chief <br/>\nsource of capital for large operators to expand their holdings, <br/>\noften by buying out their smaller neighbors. <br/>\n<br/>\nAnd unlike other federal entitlement programs, farm subsidies have <br/>\nno requirements of income, assets or debts. <br/>\n<br/>\nFriends in High Places <br/>\n<br/>\nAs Congress considers reauthorizing the Freedom to Farm Act, <br/>\nlawmakers have already made one fundamental decision: they will <br/>\nkeep the subsidies. The phaseouts are a thing of the past. <br/>\n<br/>\nThe cost, and the fact that the money goes mostly to a select few, <br/>\nwill be at the crux of the debate over how to reshape subsidies. <br/>\n<br/>\n&quot;The cost of this program is astonishing,&quot; Mr. Collins said. &quot;Any <br/>\nperson engaged in small business in America would be amazed looking <br/>\nat this. Their jaws would drop at the money farmers receive.&quot; <br/>\n<br/>\nMr. Bezner makes no apologies for accepting the money. To his <br/>\nmind, government subsidies help the American consumer by making <br/>\nsure grocery stores are stocked with inexpensive food. <br/>\n<br/>\n&quot;That government money is keeping cheap cereal on the shelves in <br/>\nNew York City,&quot; he said. <br/>\n<br/>\nAnd no one expects farmers to lose their subsidies — not with the <br/>\nfriends they have in Congress. <br/>\n<br/>\nThe top leaders of both parties represent farm states that rely on <br/>\nsubsidies. In the Senate, the majority leader is from Mississippi <br/>\nand the minority leader from South Dakota. In the House, the <br/>\nspeaker is from Illinois and the minority leader from Missouri. The <br/>\nrelevant committees are headed by representatives from farm states; <br/>\nthe chairman of the House Agriculture Committee is Representative <br/>\nLarry Combest, a Republican who represents Mr. Bezner&#39;s district in <br/>\nthe northern plains of Texas. <br/>\n<br/>\n&quot;Look at the Nasdaq: those companies are going out of business and <br/>\nwe don&#39;t open up the Treasury to them,&quot; Mr. Collins said. &quot;But <br/>\nCongress chose not to let farmers bear that kind of pain.&quot; <br/>\n<br/>\nLike their counterparts in Hartley County, large farmers around <br/>\nthe country have complained to Congress that Freedom to Farm is not <br/>\nworking because their crops are selling at the same low prices <br/>\ntheir grandfathers&#39; crops fetched 40 years ago. <br/>\n<br/>\nWhen lawmakers passed the act in 1996, they approved generous <br/>\nsubsidies for the first two years in order to give farmers a <br/>\ncushion to prepare for their independence. But when the world <br/>\nmarket pushed prices down, farmers asked for emergency payments. <br/>\n<br/>\nIn 1998, Congress approved additional money, adding 50 percent to <br/>\nthe core subsidy payments. In 1999 and 2000, the lawmakers doubled <br/>\nthe core payments. This month, with the strong backing of the White <br/>\nHouse, Congress added $5.5 billion to next year&#39;s budget blueprint <br/>\nto cover potential emergencies. <br/>\n<br/>\nThe concentration of payments will remain the same: the <br/>\nwheat-growing plains states from the Texas Panhandle through North <br/>\nDakota; the Corn Belt across the Midwest; and the rice and cotton <br/>\nstates of the Mississippi Valley from Missouri through Louisiana. <br/>\n<br/>\nWhile there are other subsidy programs, like those for dairy <br/>\nfarmers and sugar producers, the row-crop payments are by far the <br/>\nbiggest. Ranchers, and farmers who produce fruits and vegetables, <br/>\nreceive virtually nothing from this program. <br/>\n<br/>\nRepresentative Combest said he had concluded that the subsidy <br/>\nsystem should remain intact. His one minor proposal is to cut <br/>\nsubsidies when farmers receive higher prices for their crops — what <br/>\nhe calls a &quot;countercyclical&quot; approach. <br/>\n<br/>\nWho Benefits? <br/>\n<br/>\nEven though President Bush has promised to eliminate what he calls <br/>\ncorporate welfare, Mr. Combest and some Republican leaders see no <br/>\ncontradiction between the farm payments and Republican free-market <br/>\northodoxy. They contend that the subsidy is meant to help the <br/>\nconsumer, not the farmer. <br/>\n<br/>\n&quot;The consuming public has been the beneficiary of this program <br/>\nthat gives money to farmers to produce low-price commodities,&quot; Mr. <br/>\nCombest said in an interview. &quot;We don&#39;t want to become as dependent <br/>\non foreign food as foreign oil.&quot; <br/>\n<br/>\nThose emotional appeals fall flat with his counterpart, Senator <br/>\nRichard G. Lugar, the Republican from Indiana who is chairman of <br/>\nthe Senate Agriculture Committee. <br/>\n<br/>\n&quot;Let&#39;s not make a mistake that these subsidies are pro-consumer; <br/>\nthey are pro-producer,&quot; Senator Lugar said in an interview. &quot;There <br/>\nwould be extraordinarily adequate supplies of food in America if <br/>\nyou had no control and no subsidies.&quot; <br/>\n<br/>\nSenator Lugar said he wanted a revised farm policy to provide more <br/>\nmoney to conserve land, improve rural communities and help farmers <br/>\nwho are not doing well. <br/>\n<br/>\nHe also said he was under no illusion about the effect of the <br/>\nmultibillion-dollar payments. <br/>\n<br/>\n&quot;The rhetoric of failing farms doesn&#39;t always match the reality, <br/>\nbecause large commercial farmers are doing well with their <br/>\nsubsidies; their land values have gone up and so have land rents,&quot; <br/>\nMr. Lugar said. <br/>\n<br/>\nEight percent of the country&#39;s farms produce 72 percent of the <br/>\ncountry&#39;s harvest. Most of the rest of the two million American <br/>\nfarmers earn their incomes from jobs off the land. <br/>\n<br/>\nInstead, Senator Lugar said, these crop subsidies are a direct <br/>\ntransfer of taxpayers&#39; money to rural landowners. &quot;Is the American <br/>\npublic willing to spend money each year and every year providing a <br/>\ntransfer payment from the taxpayers to the agricultural sector?&quot; he <br/>\nasked. &quot;And how much — 5 billion, 10 billion, 15 billion?&quot; <br/>\n<br/>\nWhat no lawmaker is expected to do is ask farmers to prove they <br/>\nneed the subsidies. <br/>\n<br/>\n&quot;This is not meant to be a welfare program, and it won&#39;t be — not <br/>\nif I have anything to do with it,&quot; Representative Combest said. <br/>\n<br/>\nAgriculture economists say such an argument misses the point. <br/>\n<br/>\n<br/>\n&quot;In our food stamp program we means-test the working poor with <br/>\nstrict requirements, but we ask nothing of farmers,&quot; said Mr. <br/>\nCollins, the Agriculture Department economist, who called the <br/>\nsubsidies &quot;an income supplement from the government.&quot; <br/>\n<br/>\nWhere the Money Goes <br/>\n<br/>\nEven in Mr. Combest&#39;s Congressional <br/>\ndistrict, where federal subsidies make up more than one-third of <br/>\nthe total farm income, Hartley County holds a special place. The <br/>\ntop 10 percent of the county&#39;s subsidy recipients were paid an <br/>\naverage $396,131 from 1996 to 1999 — more than double the national <br/>\naverage. <br/>\n<br/>\nAnd in the pecking order, Lanny Bezner ranks third. Two other <br/>\nHartley County farmers received more money: John Cover, whose <br/>\nsubsidies totaled $2.3 million over that period, and Carl Kupyer, <br/>\nwho received $1.9 million. <br/>\n<br/>\nWith subsidies of that size, those families rank among the top 10 <br/>\nrecipients in Texas and the top 100 in the country. <br/>\n<br/>\nYet the Kupyer family considers the subsidies barely large enough <br/>\nto keep it in business, according to J. C. Kupyer, who works with <br/>\nhis father, Carl. <br/>\n<br/>\n&quot;We do make a living as farmers,&quot; J. C. Kupyer said. &quot;But actually <br/>\nit would be hard to farm without subsidies.&quot; <br/>\n<br/>\nFor three generations the Kupyers have been adding to their <br/>\nproperty, building their farm from less than 700 acres to a <br/>\n16,000-acre spread that they now own free and clear. Yet with <br/>\nspiraling energy costs, Mr. Kupyer said, the family would sell the <br/>\nfarm if someone offered to buy it. <br/>\n<br/>\nMr. Cover refused to discuss his subsidies. <br/>\n<br/>\nAndy Michael, the <br/>\nHartley County commissioner and a rancher, said he discounted many <br/>\ncomplaints from big farmers like Mr. Kupyer. In his view, farmers <br/>\ncomplain to cover up how much money they are receiving from the <br/>\ngovernment. <br/>\n<br/>\n&quot;The farmers are very closemouthed about getting help from the <br/>\ngovernment — they never, never talk about it,&quot; Mr. Michael said. <br/>\n&quot;Farmers work the system. There&#39;s no system for us to work.&quot; <br/>\n<br/>\nIn the last five years, he said, the classic divide between <br/>\nfarmers and ranchers, exploited in generations of cowboy movies, <br/>\nhas gotten worse, because farmers are receiving bigger subsidy <br/>\nchecks while ranchers get nothing. <br/>\n<br/>\n&quot;Any time I&#39;m around farmers they say farming doesn&#39;t pay, but <br/>\nthen they go out and buy those $150,000 tractors with their <br/>\ngovernment checks,&quot; Mr. Michael said. &quot;When times are tough for us, <br/>\nthe rancher just tightens his belt.&quot; <br/>\n<br/>\nBusiness is good for Mr. Michael and many other farmers and <br/>\nranchers in Dalhart, a town of more than 7,000 people midway <br/>\nbetween Dallas and Denver. Local farm equipment dealers report that <br/>\ndespite the downturn in crop prices, their sales of tractors and <br/>\nother equipment are among the best in the country. <br/>\n<br/>\nAt the John Deere dealership, farmers have spent $13 million to <br/>\n$21 million on agricultural equipment every year since Freedom to <br/>\nFarm was enacted. &quot;This is one of Deere&#39;s strongest markets,&quot; said <br/>\nMark Miller, finance manager at the Dalhart dealership. <br/>\n<br/>\nRalph Link is a Hartley County farmer who cannot afford new <br/>\ntractors. He works his 845-acre spread himself with used equipment <br/>\nand received $173,787 in subsidies the first four years of Freedom <br/>\nto Farm. <br/>\n<br/>\nBut unlike his neighbors with larger farms, Mr. Link has nothing <br/>\nbut praise for the prosperity that comes with federal checks. With <br/>\nhis new freedom, Mr. Link has been able to take advantage of the <br/>\nregion&#39;s shift toward agribusiness and plant all his cropland in <br/>\ncorn, selling it to one of the huge cattle feedlots. <br/>\n<br/>\nIn bad times, he says, the checks provide a safety net. In good <br/>\ntimes, like the current season, the subsidies will provide him with <br/>\na good profit — this season, he says, it will be 18 percent. <br/>\n<br/>\n&quot;The government payments are bigger since Freedom to Farm, so I <br/>\ndon&#39;t understand why you wouldn&#39;t like it,&quot; Mr. Link said. &quot;Things <br/>\ncouldn&#39;t be better.&quot;  <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nytimes.com/2001/05/14/national/14FARM.html?ex=990854833&ei=1&\">http://www.nytimes.com/2001/05/14/national/14FARM.html?ex=990854833&ei=1&</a> <br/>\nen=362be1ecf6e126dc <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]}],"prevTopicId":21255,"nextTopicId":21258}}