{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] Re: parenting difficulties","postDate":"1060282160","msgId":78107,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkwLjNhZGJhMGM2LjJjNjNmOTMwQGFvbC5jb20+"},"prevInTopic":78101,"nextInTopic":78170,"prevInTime":78106,"nextInTime":78108,"topicId":78101,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/7/03 11:48:41 AM, Heatherette@comcast.net writes: ","messageBody":"<div id=\"ygrps-yiv-1864505383\">In a message dated 8/7/03 11:48:41 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Heatherette@...\">Heatherette@...</a> writes:<br/>\n<br/>\n&lt;&lt; I just go into melt down mode really fast when they <br/>\nargue or cry and I can&#39;t figure out what is wrong.  I feel so helpless <br/>\nbecause all I know how to do is hug.  Got that part down really well.   &gt;&gt;<br/>\n<br/>\nMy sister used to be that way.<br/>\n<br/>\nI told her it was as though she had a huge load of straw on her cart, and <br/>\neverything that happened was the last straw.  So she would &quot;calm down&quot; by taking <br/>\none little straw off her cart, and the NEXT thing that happened was THE LAST <br/>\nSTRAW!<br/>\n<br/>\nInstead of REALLY finding ways to calm herself and get to a truly quiet <br/>\nplace, she got just calm enough to barely function.<br/>\n<br/>\nIf you can find ways to be really calm, you can give some of that calmness to <br/>\nyour children.  Moods are contagious, and if you&#39;re frenzied (even <br/>\nfrenzied-but-controlled) they&#39;ll be more like that too.  And if you&#39;re frenzied, your <br/>\nheart and digestion and breathing aren&#39;t probably working as well as they could.<br/>\n<br/>\nEven if you do nothing else, if you start breathing more deeply—slow, deep <br/>\nbreaths you hold and let out slowly— it will help.  Not all your breathing, just <br/>\nonce in a while.  Try for ten.  You might not have time or concentration to <br/>\nmake it all the way to ten, but if you do you&#39;ll probably find that your head <br/>\nclears out and stills, that your heartrate slows down, and that you just feel <br/>\nless bristly in your skin.  You can do it while you&#39;re reading online, or <br/>\ndriving, or doing dishes, or folding clothes, or lying down for a rest.  You can do <br/>\none deep breath the next time you feel like yelling or grumping, and as <br/>\nyou&#39;re letting it out you can try to think of two things you could do, and then <br/>\nchoose the better one when the breath is out.<br/>\n<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":56051484,"authorName":"grlynbl@aol.com","from":"grlynbl@...","profile":"tbb1967","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] Re: parenting difficulties","postDate":"1060280080","msgId":78170,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY0LjMyY2VkZjg5LjJjNjNmMTEwQGFvbC5jb20+"},"prevInTopic":78107,"nextInTopic":0,"prevInTime":78169,"nextInTime":78171,"topicId":78101,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/7/03 1:48:50 PM Eastern Daylight Time, ... you re doing fine :-) really, you are! [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-279985805\">In a message dated 8/7/03 1:48:50 PM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Heatherette@...\">Heatherette@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If I could have <br/>\n&gt; someone sitting on my shoulder all day to just whisper &quot; you&#39;re doing <br/>\n&gt; fine&quot; I think I could do it. <br/>\n<br/>\n </span></blockquote>you&#39;re doing fine :-)<br/>\n<br/>\nreally, you are!<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":98863955,"authorName":"Heather Hall","from":"Heather Hall &lt;Heatherette@...&gt;","profile":"harrietsmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: parenting difficulties","postDate":"1060275872","msgId":78101,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM2QzUzRDFFLUM4RjktMTFENy05NzIwLTAwMzA2NUEzMDAyNEBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDEwNjAyMTgwNjMuMjA4NS45MDMwLm05QHlhaG9vZ3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":78107,"prevInTime":78100,"nextInTime":78102,"topicId":78101,"numMessagesInTopic":0,"msgSnippet":"Ok, had time to read several posts before I responded.  (nursing a really horrid double ear infection, can t hear ugh.) Having the kids at Montessori allows me","messageBody":"<div id=\"ygrps-yiv-2013190932\">Ok, had time to read several posts before I responded.  (nursing a <br/>\nreally horrid double ear infection, can&#39;t hear ugh.)<br/>\nHaving the kids at Montessori allows me to go to an hour of therapy <br/>\neach week with a woman who seems very knowledgeable about sexual abuse <br/>\nissues, pms and hormone imbalances in general, I also get 1 hour of <br/>\nreiki ( on trade, I sew for him, he does reiki for me) and I go to the <br/>\nChiropractor.  Now my insurance changed and therapy isn&#39;t covered, so <br/>\nI&#39;m trying out yoga ( missed this week cuz of the ears).<br/>\nI am working really hard to get healthy, and being a mom at the same <br/>\ntime is hard.  It&#39;s gets a little better a bit at a time, I just am <br/>\nsoooo tired.  I think every parent is to some extent.<br/>\nI have way more on my plate than I should.  I have a cloth diaper <br/>\nbusiness, I teach Bradley classes weekly, I am a doula, I run a co-op, <br/>\nI&#39;m on the committee of another co-op project with the local chapter of <br/>\nWeston A. Price.  I should quit most of that and just be a mom.  I am <br/>\nterrified to do that.  I have made great strides in my therapy, been <br/>\ndoing it in some fashion since I was ten( EMDR was my favorite).  My <br/>\nkids do deserve the best and I go to great lengths to do the best I <br/>\ncan.  I think the real problem is I don&#39;t give myself any credit.  My <br/>\nhusband is an amazing father, 400 times better parent than me.  He is <br/>\nnot very good at being a cheerleader*for me*, and most times I feel <br/>\ninferior around him.  I know I must be doing ok because I am constantly <br/>\ncomplimented on how great my kids are.  I love them intensely and they <br/>\nare great kids!  I just go into melt down mode really fast when they <br/>\nargue or cry and I can&#39;t figure out what is wrong.  I feel so helpless <br/>\nbecause all I know how to do is hug.  Got that part down really well.  <br/>\nI never realized before I had kids that someone would ever turn down a <br/>\nhug!  now what?  If I can stay calm long enough to redirect them it <br/>\nworks sometimes.  There are days Crispin just cries all day long and I <br/>\nhave no idea why, look at his mouth, his butt, feel his tummy, take him <br/>\nto the Chiropractor, let him lay in the middle of the floor and scream <br/>\nand feel like a failure.  I had the misconception before I had children <br/>\nthat if you could love them enough, everyone would be happy.<br/>\nMy house is super tiny and cramped and I keep think if we had more <br/>\nroom, I might be more calm about them helping me and being with me <br/>\nwhile I do stuff, since I wouldn&#39;t trip on them.  I also think we <br/>\nshould have at least one room in the house where they can touch <br/>\nanything they want and not be told &#39;no, that&#39;s an ouch&#39; or something <br/>\nlike that.  We really don&#39;t have that.  I have ideas of how to create <br/>\nthat but my husband wants to move so badly he won&#39;t agree to totally <br/>\nrearrange the house with me ;)<br/>\nI do think if I could find a mother&#39;s helper it would work well for us. <br/>\n  I had a wonderful lady while I was pregnant with Crispin but she <br/>\ncouldn&#39;t work for $5 an hour for ever.  She was such a good cook too!  <br/>\nThere aren&#39;t a lot of people who can work for what I can pay.  That is <br/>\nhow we ended up with day care (NIGHTMARE!) then Montessori.  Originally <br/>\nI was too sick to care for them on my own and it wasn&#39;t a choice.  Now <br/>\nit is more realistic to find a way to make it work.  If I could have <br/>\nsomeone sitting on my shoulder all day to just whisper &quot; you&#39;re doing <br/>\nfine&quot; I think I could do it.  Typing just that line made me cry - not <br/>\nsure why.  May be I just really need to hear it.<br/>\n<br/>\nOn Wednesday, August 6, 2003, at 09:01 PM, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-Discussion@yahoogroups.com\">Unschooling-Discussion@yahoogroups.com</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &lt;&lt; She turned everything<br/>\n&gt; into a game and I was so envious of her ability to do that.  It is a<br/>\n&gt; real test of my patience to let my kids help me do anything.  How can I<br/>\n&gt; so strongly believe something is right, yet feel so wrong in the role? <br/>\n&gt; &gt;&gt;<br/>\n&gt;<br/>\n&gt; I&#39;m guessing the Montessori tuition is more expensive than counselling <br/>\n&gt; for<br/>\n&gt; you.<br/>\n&gt;<br/>\n&gt; Maybe you can (QUICKLY!) find a really good short-term counsellor, <br/>\n&gt; someone<br/>\n&gt; who doesn&#39;t intend to draw out your entire life&#39;s story and keep you <br/>\n&gt; as a<br/>\n&gt; regular client for years, but who could have some incredibly easy and <br/>\n&gt; good ideas for<br/>\n&gt; getting you past your stuck place.<br/>\n&gt;<br/>\n&gt; If you plan to stay stuck, unschooling might not work out for you.  If <br/>\n&gt; you<br/>\n&gt; want to unschool, you need to have some flexibility and joy and happy<br/>\n&gt; expectation.<br/>\n&gt;<br/>\n&gt; Are you an introvert and just get crowded?  Can you hire a mother&#39;s <br/>\n&gt; helper,<br/>\n&gt; to hang out with the kids and get them snacks and water and play with <br/>\n&gt; them?<br/>\n&gt;<br/>\n&gt; &lt;&lt;I don&#39;t like to read to my kids, I don&#39;t like it when they<br/>\n&gt; try to &#39;help&#39;.  I feel like a creep! &gt;&gt;<br/>\n&gt;<br/>\n&gt; Some moms like one age lots more than others.  Maybe you don&#39;t love <br/>\n&gt; toddlers,<br/>\n&gt; but if you don&#39;t love THESE particular children, it will be harder to <br/>\n&gt; unfold<br/>\n&gt; with them as they grow.<br/>\n&gt;<br/>\n&gt; You can heal your own childhood traumas by looking at little things <br/>\n&gt; your<br/>\n&gt; children do and thinking that you wish you could have done that.  And <br/>\n&gt; if you think<br/>\n&gt; it sweetly instead of with jealous resentment, you can allow the hurt <br/>\n&gt; child<br/>\n&gt; inside you to experience a moment of release.<br/>\n&gt;<br/>\n&gt; I could be off on this, but if you have childhood issues you&#39;ve been <br/>\n&gt; burying<br/>\n&gt; or ignoring, it might be the season to release them.  If it&#39;s<br/>\n&gt; child-of-alcoholic stuff, al-Anon can help you and it won&#39;t cost <br/>\n&gt; money.  If it&#39;s codependency,<br/>\n&gt; you might find a self-help group too.  If it&#39;s survival of sexual <br/>\n&gt; abuse,<br/>\n&gt; likewise.  If it&#39;s less generic, it might be worth going to <br/>\n&gt; counselling for a<br/>\n&gt; while, so that you are freed up and open to give your children what <br/>\n&gt; they need so<br/>\n&gt; that they don&#39;t grow up with a lump left over from childhood too.<br/>\n&gt;<br/>\n&gt; When I was 32 I started four years of going to Adult Children of <br/>\n&gt; Alcoholics<br/>\n&gt; meetings.  Without that, I would not have been a good mom, and my <br/>\n&gt; marriage<br/>\n&gt; probably wouldn&#39;t have lasted, because I had knots in me I didn&#39;t know <br/>\n&gt; that other<br/>\n&gt; people didn&#39;t all have.  In that same first season, I got pregnant <br/>\n&gt; with Kirby.<br/>\n&gt;  And I went to La Leche League after he was born.  Those two <br/>\n&gt; organizations<br/>\n&gt; and their ideas about how peple can and should live in peace changed <br/>\n&gt; my life,<br/>\n&gt; and my kids&#39; lives, and my husband&#39;s life in really good ways.<br/>\n&gt;<br/>\n&gt; Unschooling seemed quite like more of the same, to me,  beause it&#39;s <br/>\n&gt; related<br/>\n&gt; to them both.   Children have natural needs for peace and positive <br/>\n&gt; regard and<br/>\n&gt; for joy.  They grow best when they&#39;re not stunted, which seems <br/>\n&gt; obvious, but<br/>\n&gt; it&#39;s easy to forget if we go with the cultural flow which says <br/>\n&gt; children are bad,<br/>\n&gt; irritating, whiney, sneaky and so forth.  Children raised openly and <br/>\n&gt; kindly<br/>\n&gt; don&#39;t need to be that way.<br/>\n&gt;<br/>\n&gt; I think that where your kids are or aren&#39;t won&#39;t matter unless you <br/>\n&gt; change<br/>\n&gt; your own heart and eyes toward them and toward yourself.<br/>\n&gt;<br/>\n&gt; Sandra<br/>\n&gt;<br/>\n </span></blockquote>-- <br/>\nHeather, mom to<br/>\nHarriet 12.15.99<br/>\nCrispin 01.25.02<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heatherette@...\">heatherette@...</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":78168,"nextTopicId":78196}}