{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"Tracy Oldfield","from":"&quot;Tracy Oldfield&quot; &lt;tracy.oldfield@...&gt;","replyTo":"LIST","senderId":"hx0HCeeXfUo5FZLFjSwOty_upA30-4RIWSHI8THRk8-PJJRI3V6uwio2OhUGTNjds1OMJxpa-xthtFtYG3OOuEbyg0FaU3K9gZwvOite7Tq9sM7j8g","spamInfo":{"isSpam":false,"reason":"0"},"subject":"type of unschooling? was Re: school year beginning","postDate":"966603035","msgId":12054,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5OUQzRjJCLjg1NDEuNjkwMjQ2QGxvY2FsaG9zdD4=","inReplyToHeader":"PDZmLjk0MzI3NTMuMjZjY2I0ZjRAYW9sLmNvbT4="},"prevInTopic":12016,"nextInTopic":0,"prevInTime":12053,"nextInTime":12055,"topicId":12016,"numMessagesInTopic":0,"msgSnippet":"erin, this is an interesting area.  To be honest, atm I don t have the energy to be one of the former type of unschooler, so I m trusting heavily that the","messageBody":"<div id=\"ygrps-yiv-750867925\">erin, this is an interesting area.  To be honest, atm I don&#39;t have the <br/>\nenergy to be one of the former type of unschooler, so I&#39;m trusting <br/>\nheavily that the latter works!!  I think there are merits to both <br/>\napproaches, and it probably depends on one&#39;s children, like my <br/>\nalmost 5yo doesn&#39;t like me telling her things in an &#39;educational&#39; <br/>\nway...  If it doesn&#39;t fit her box, she finds it hard to accept, I think. <br/>\n<br/>\nTracy<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 16 Aug 2000, at 23:24, MorelFam@... wrote:<br/>\n<br/>\n\u000f<br/>\none more abstract thought...\u000e i wonder how many of you <br/>\nhave an unschooling \u000f<br/>\napproach that reflects the active learning, conscious <br/>\nseeking out of info to \u000f<br/>\nanswer ideas that come up-- constantly diligent and <br/>\naware of opportunities to \u000f<br/>\neducate and absorb etc, verses the learning is <br/>\nhappening whether you TRY or \u000f<br/>\nnot method?\u000e i see these as some distinctions in <br/>\nunschoolers approaches...\u000f<br/>\n\u000f<br/>\nerin\u000f<br/>\n<br/>\n<br/>\n<br/>\n \u0015Message boards, timely articles, a free newsletter and more!\u000f<br/>\nCheck it all out at: http://www.unschooling.com\u000f<br/>\n\u000f<br/>\nAddresses:\u000f<br/>\nPost message: Unschooling-dotcom@egroups.com\u000fUnsubscribe: Unschooling-dotcom-unsubscribe@egroups.com\u000f<br/>\nList owner: Unschooling-dotcom-owner@egroups.com\u000f<br/>\nList settings page: <br/>\nhttp://www.egroups.com/group/Unschooling-dotcom </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"MorelFam@aol.com","from":"MorelFam@...","replyTo":"LIST","senderId":"eoqHmkDQHc3DkPHDyBtesX4tqzR870Y5s6bLN0CAJZaPJjmFaPUmIdS7TpzVzaEfOxCKD3wZ4A","spamInfo":{"isSpam":false,"reason":"0"},"subject":"school year beginning","postDate":"966482676","msgId":12016,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZmLjk0MzI3NTMuMjZjY2I0ZjRAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":12054,"prevInTime":12015,"nextInTime":12017,"topicId":12016,"numMessagesInTopic":0,"msgSnippet":"as someone else mentioned, the beginning of the traditional school year often gives me doubts about our plan!  or leaves me wishing i had more of a plan. so","messageBody":"<div id=\"ygrps-yiv-980298968\">as someone else mentioned, the beginning of the traditional school year often <br/>\ngives me doubts about our &quot;plan!&quot;  or leaves me wishing i had more of a plan. <br/>\n so i was thinking, even as an unschooler, i can write down a plan, that may <br/>\nhelp me keep my sanity.  this plan would NOT have subjects and page numbers <br/>\nand school assignments, but instead broad goals for the way we would like to <br/>\nsee our family function over the upcoming year, how we would like to treat <br/>\neach other, what we would have liked to see happen if we looked back over a <br/>\nyear.  another idea that helps me a lot is to go back over the last year, <br/>\n(which was very &quot;unschooly&quot;for us) and record some of the many things that <br/>\nhappened.  it is validating, but still always hard to quantify ALL the <br/>\nwonderful learning that we know went on.  it is sooo easy to focus on the <br/>\nareas we havent ever &quot;covered...&quot;<br/>\n<br/>\nhaving just given birth to our fifth child almost 4 wks ago, i feel a great <br/>\nloss of control over so many household things... and tho i am relaxed about <br/>\nmost things most of the time (thats good!) there are those other times when i <br/>\nhave this underlying grouchiness about the chaos.  and i think it is due to a <br/>\nfeeling of having no control over most things and being buffeted by the winds <br/>\nof many personalities daily.  this is just life i guess.<br/>\n<br/>\nanyway, in wanting to give the best to the education end of things, i <br/>\nstruggle with not helping the kids be steadfast in things they dont want to <br/>\ndo.  (like multiplication tables!)  i dont want to have them hate those kinds <br/>\nof things, but i do want them to realize its not so bad to do things that <br/>\naren&#39;t fun-- there is even a great sense of accomplishment there!<br/>\n<br/>\nmy 10yo says she feels behind in things (obviously compared to someone!  <br/>\nprobably her one close friend who goes to school and is doing homework all <br/>\nthe time!)  it is hard, tho we try, to get across the concept of arbitrarily <br/>\nassigned knowledge and also everyone having a different set of life <br/>\nexperiences and so NONE of us knowing the same things...  so i let her peruse <br/>\na book that is one of those that says what 4th graders are learning in <br/>\nschool, so she would actually see on paper what things her school peers might <br/>\nbe being taught and therefore perhaps not be intimidated that there is really <br/>\nmuch she might be missing.<br/>\n<br/>\nspeaking of four year olds, i just love this age, and it does sound like <br/>\nsomething is going on with your sweetie, kandace.  i hope you are able to <br/>\ncheck into the autism and allergies (both good sounding suggestions) and <br/>\nnarrow down her situation so she can be releived of her frustrations and <br/>\nreturn to herself!  best wishes, there.<br/>\n<br/>\none more abstract thought...  i wonder how many of you have an unschooling <br/>\napproach that reflects the active learning, conscious seeking out of info to <br/>\nanswer ideas that come up-- constantly diligent and aware of opportunities to <br/>\neducate and absorb etc, verses the learning is happening whether you TRY or <br/>\nnot method?  i see these as some distinctions in unschoolers approaches...<br/>\n<br/>\nerin</div>","specialLinks":[]}],"prevTopicId":12053,"nextTopicId":11990}}