{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":11,"messages":[{"userId":287815876,"authorName":"dezignarob","from":"&quot;dezignarob&quot; &lt;dezigna@...&gt;","profile":"dezignarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Sleep Habits","postDate":"1285918194","msgId":57548,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk4NDJsaStidmhuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk3bWliNytqdWsxQGVHcm91cHMuY29tPg=="},"prevInTopic":57545,"nextInTopic":0,"prevInTime":57547,"nextInTime":57549,"topicId":57496,"numMessagesInTopic":0,"msgSnippet":"====What have you done during a phase like this?======== My daughter was the same way. I too recall fondly the times when she was a toddler and we all would","messageBody":"<div id=\"ygrps-yiv-2113084093\">====What have you done during a phase like this?========<br/>\n<br/>\nMy daughter was the same way. I too recall fondly the times when she was a toddler and we all would retire to watch the news, and she would nurse and be off within minutes. As it turned out from about the age of four or so, her natural sleep schedule is 10 hours of sleep, 16 hours awake. The math means a 26 hour day - she lives on a slow, or sometimes fast, cycle around the clock. Still.<br/>\n<br/>\nShe is about to turn 11 and it has only been in the last two years I think, maybe 2.5 - I&#39;m just being a bit too pressed for time to scroll through the archives - that I have been able to sleep on a different schedule from her, because she has been more willing to stay awake alone. Before that time I had been following her around the clock - and it is tiring. But I think what I have written in the past was along the lines of &quot;I will be tired. I can choose to be tired and cranky.&quot; Acceptance, concious acceptance, of How She Is always helps me.<br/>\n<br/>\nLike Logan, she was able to get a great deal of energy from a shortish nap.<br/>\n<br/>\nLike Logan, she still announces that she is hungry just when I am ready to go to bed myself - so I try to pre-empt that by saying that I am going shortly and if she wants food, now is the time to ask for it. She nursed to sleep until she was 8 - and btw eating a lot of one food at any particular meal is also something she still does.<br/>\n<br/>\nSo it occurs to me that advice that starts with &quot;this won&#39;t last&quot; could lead to an expectation of some kind on your part. With Jayn, it lasted a long time. If you think of it as a &quot;phase&quot;, you may be ever watching for it to end. That is not a path to acceptance.<br/>\n<br/>\nJayn still doesn&#39;t really or always like to be alone at night, so now what she will do, when I am going to bed, is bring her laptop computer with her to the bedroom (we only have one) and hunker down on her bed (which is next to ours these days) and play her games and make her Sims 2 characters. Usually the tv is on, because my dh likes the sound and Jayn will take charge of the remote control. I sleep with a pillow over my head - I was using earplugs until dh said it made him nervous that I wouldn&#39;t wake up in the event on an emergency. Now the pillow also keeps out the light.<br/>\n<br/>\nJayn continues to need a lot of attention and presence. It has only been since April of this year pressed by financial concerns, that I have returned to working part time outside of the home, including having an externally imposed schedule influencing my time and my sleep needs.<br/>\n<br/>\nIt has been a tough transition for Jayn, and I have noticed that she has reverted to being a bit needier including wanting me to serve her with food and drinks more like I used to when she was a few years younger. It&#39;s as if her self-sufficiency around getting herself snacks has just evaporated.  <br/>\n<br/>\nI wonder if this asking for food and activity is a way for Logan to be asking for more presence and attention from you. Maybe he just isn&#39;t ready to give you up at that moment and has found some strategies that bring your focus on to him. <br/>\n<br/>\nMust you work outside the home while he is so young?<br/>\n<br/>\nA lot of my energy has gone into protecting my dh&#39;s sleep. There have been times when Jayn has become rowdy in the bedroom and pretty much forced me to get up and stay up with her in order to allow dh to sleep. I&#39;m not much fun when that happens, but apparently grumpy Mom is better than no Mom. This happens increasingly rarely with Jayn&#39;s maturity. <br/>\n<br/>\nNow that I am working some days, dh is taking more childcare shifts in the evenings after his work, or on some weekend days. It is still a big, shuffling work in progress around here, and they have all kinds of special activities and games that she and I don&#39;t share. <br/>\n<br/>\nJayn continues to move around the clock. But most of the time, she is very nice about letting me go back to sleep after I get up to make her a very early breakfast on those days in her schedule. She has more resources for spending time alone than she used to have, including phoning her friends, and increased gaming competence. <br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.robyncoburn.blogspot.com<br/>\nwww.iggyjingles.blogspot.com<br/>\nwww.allthingsdoll.blogspot.com</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Sleep Habits","postDate":"1285613123","msgId":57514,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGluU1JfSFpQRVBrdzlQbzZ1X0toU1RxNFRwVTVDTnhwUVNWRV9iZEBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGk3bms3Nyt1M2k3QGVHcm91cHMuY29tPg==","referencesHeader":"PGk3bWliNytqdWsxQGVHcm91cHMuY29tPgk8aTduazc3K3UzaTdAZUdyb3Vwcy5jb20+"},"prevInTopic":57507,"nextInTopic":57545,"prevInTime":57513,"nextInTime":57515,"topicId":57496,"numMessagesInTopic":0,"msgSnippet":"I suggest a bedroom potty (chamber pot) and some wipees to clean hands and wipe with after pottying, and nearby a small trash can. This can cut out the extra","messageBody":"<div id=\"ygrps-yiv-1174338914\">I suggest a bedroom potty (chamber pot) and some wipees to clean hands and<br/>\nwipe with after pottying, and nearby a small trash can. This can cut out the<br/>\nextra running to the bathroom bit if it&#39;s further than next door from the<br/>\nbedroom to the bathroom. What takes only a short run through for an adult<br/>\ncan be a wakeful production for a child.<br/>\n<br/>\nKarl wakes up a lot when watching tv too, and I have sometimes suggested<br/>\nplaying something quiet like counting or naming fingers and toes and then<br/>\nafterward just talked together or told stories .. and I did this without<br/>\nhauling out books or reading because Karl likes the immediate connection and<br/>\nintimacy of me talking or telling stories in conversation better than<br/>\nreading from a book. We also pretend to paint each other&#39;s faces and that&#39;s<br/>\nvery relaxing. I had to stretch to tell stories that because I didn&#39;t think<br/>\nI was any good at it but can retell old stories like fairytales from memory<br/>\nand after a time I started telling my own version of tales. That helps Karl<br/>\nget quiet enough (even now) though it&#39;s playing Uno instead of finger/toe<br/>\ngames and then we talk in the dark together.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\nOn Sun, Sep 26, 2010 at 10:09 AM, plaidpanties666 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a><br/>\n<blockquote><span title=\"ireply\"> &gt; wrote:<br/>\n<br/>\n&gt; &quot;nycartgal2003&quot; &lt;mranzer@...&gt; wrote:<br/>\n&gt; &gt;&gt; He does not have a set bed time, he goes to sleep when he&#39;s tired...<br/>\n&gt; &gt; Before we moved in May, we&#39;d read, shut the light, and go to sleep around<br/>\n&gt; 10pm.<br/>\n&gt;<br/>\n&gt; While that&#39;s not a &quot;bedtime&quot; in the conventional sense, you had a routine,<br/>\n&gt; and now that has changed. Sometimes that kind of change is a result of a<br/>\n&gt; child getting older - sleep needs do change - but it could also be more a<br/>\n&gt; matter of losing your old routine without having found a new one, yet. It<br/>\n&gt; might help you think in those terms - is there a way to create a new routine<br/>\n&gt; that will work better for everyone?<br/>\n&gt;<br/>\n&gt; &gt; In the last few weeks, he&#39;s started wanting to go to sleep anywhere from<br/>\n&gt; 6-9pm.<br/>\n&gt;<br/>\n&gt; Can you get the process going earlier by putting on a movie around 6 and<br/>\n&gt; being available if he wants to nurse? Were you nursing while reading before?<br/>\n&gt; That&#39;s not clear. Can you offer more food before he&#39;s likely to nurse so<br/>\n&gt; that he&#39;s not so hungry afterwards? I&#39;m assuming he&#39;s nursing more for<br/>\n&gt; connection than nutrition, but the nursing is also stimulating his<br/>\n&gt; digestion, setting him up to be hungry, so it could help for him to eat<br/>\n&gt; first. That would be easier to arrange with a regular routine, for sure! If<br/>\n&gt; you can set things up so that he eats first, cleans up, and then settles<br/>\n&gt; down, there&#39;s a better chance of him staying settled and sleeping.<br/>\n&gt;<br/>\n&gt; &gt;&gt;He&#39;ll sleep for a few hours, and then he wakes up wanting to eat and<br/>\n&gt; play, bursting with energy for anywhere from 2-6 hours.<br/>\n&gt; *****************<br/>\n&gt;<br/>\n&gt; Can he play by himself? Some kids are fine with that so long as they can<br/>\n&gt; get to everything they need - snacks, toys, the remote control - while<br/>\n&gt; others really need the company.<br/>\n&gt;<br/>\n&gt; ---Meredith<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":171830749,"authorName":"nycartgal2003","from":"&quot;nycartgal2003&quot; &lt;mranzer@...&gt;","profile":"nycartgal2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Sleep Habits","postDate":"1285520721","msgId":57545,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk3bnVnaCs1Y2FyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDk5MEMzOUNGLUEyMDctNDAwNC1BQzlDLTczMUVCQjYwOTYzM0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":57514,"nextInTopic":57548,"prevInTime":57544,"nextInTime":57546,"topicId":57496,"numMessagesInTopic":0,"msgSnippet":"... I get that now. I was coming from frustration, so in that place I can t see other possibilities. Meryl","messageBody":"<div id=\"ygrps-yiv-1711912009\"><blockquote><span title=\"ireply\">&gt; ****-=-What I said was, &quot;You get the idea, impossible to sleep while all<br/>\n&gt; this is happening.&quot;-=-<br/>\n&gt; <br/>\n&gt; Right.<br/>\n&gt; But you said that after you seemed to dicard other ideas.<br/>\n&gt; <br/>\n&gt; If you&#39;re unwilling to change, then nothing will change.****<br/>\n&gt; <br/>\n&gt; <br/>\n </span></blockquote>I get that now. I was coming from frustration, so in that place I can&#39;t see other possibilities.<br/>\n<br/>\nMeryl<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Sleep Habits","postDate":"1285519843","msgId":57507,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk5MEMzOUNGLUEyMDctNDAwNC1BQzlDLTczMUVCQjYwOTYzM0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGk3bnMwcCtyNWc1QGVHcm91cHMuY29tPg==","referencesHeader":"PGk3bnMwcCtyNWc1QGVHcm91cHMuY29tPg=="},"prevInTopic":57506,"nextInTopic":57514,"prevInTime":57506,"nextInTime":57508,"topicId":57496,"numMessagesInTopic":0,"msgSnippet":"-=-What I said was, You get the idea, impossible to sleep while all this is happening. -=- Right. But you said that after you seemed to dicard other ideas. If","messageBody":"<div id=\"ygrps-yiv-1330079320\">-=-What I said was, &quot;You get the idea, impossible to sleep while all<br/>\nthis is happening.&quot;-=-<br/>\n<br/>\nRight.<br/>\nBut you said that after you seemed to dicard other ideas.<br/>\n<br/>\nIf you&#39;re unwilling to change, then nothing will change.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":171830749,"authorName":"nycartgal2003","from":"&quot;nycartgal2003&quot; &lt;mranzer@...&gt;","profile":"nycartgal2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Sleep Habits","postDate":"1285518169","msgId":57506,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk3bnMwcCtyNWc1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEI4QzQ5MDQ0LTE2QjQtNEMwOS04MjA0LUQ0QjE1NDJBQjExMkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":57505,"nextInTopic":57507,"prevInTime":57505,"nextInTime":57507,"topicId":57496,"numMessagesInTopic":0,"msgSnippet":"... What I said was, You get the idea, impossible to sleep while all this is happening. I can see how that does not serve me or my son. I know that this will","messageBody":"<div id=\"ygrps-yiv-182282419\">****-=-You get the idea, impossible...-=-<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; If you say so.<br/>\n&gt; <br/>\n&gt; I thought there were suggestions made to change where you were.<br/>\n&gt; <br/>\n&gt; If it&#39;s impossible, discussing it on the list won&#39;t help.  But  <br/>\n&gt; possibly it will help other people.<br/>\n&gt; <br/>\n&gt; One good thing is that he&#39;s healthy, and you don&#39;t have to feed him  <br/>\n&gt; through a tube, and he can sleep (I&#39;m guessing) without machinery  <br/>\n&gt; being attached.  And no one stays three years old forever.****<br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>What I said was, &quot;You get the idea, impossible to sleep while all<br/>\nthis is happening.&quot;<br/>\n<br/>\nI can see how that does not serve me or my son.<br/>\nI know that this will change on it&#39;s own because he won&#39;t be 3 forever, and I&#39;m grateful that he is a happy, healthy little boy.<br/>\n<br/>\nI try to get him to eat enough during the day. We have his favorite foods in the house, ready for him. Some days, he just does not want to eat much, and seems to get really hungry late at night. I used to put out monkey platters while he ate TV, which was great, but now he gets upset if he has more than one choice of food at a time, so he&#39;ll eat one thing, and then ask me to get him something else. He wants my company while he is watching TV. If I start to doze, he&#39;ll wake me.<br/>\n<br/>\nLogan is a real homebody, and there are days when he won&#39;t leave the house. It&#39;s harder to get him to burn as much energy at home, so we run, we dance, we pretend swordfight, and all kinds of other fun games that he makes up, but he does sleep better the days he&#39;s been outside running around.<br/>\n<br/>\nWhat I&#39;m seeing based on all of the suggestions is that there is a shift I have to make here, to create a new routine.<br/>\n<br/>\nMeryl</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Sleep Habits","postDate":"1285510183","msgId":57505,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk3bms3Nyt1M2k3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk3bWliNytqdWsxQGVHcm91cHMuY29tPg=="},"prevInTopic":57503,"nextInTopic":57506,"prevInTime":57504,"nextInTime":57506,"topicId":57496,"numMessagesInTopic":0,"msgSnippet":"... While that s not a bedtime in the conventional sense, you had a routine, and now that has changed. Sometimes that kind of change is a result of a child","messageBody":"<div id=\"ygrps-yiv-497380400\">&quot;nycartgal2003&quot; &lt;mranzer@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; He does not have a set bed time, he goes to sleep when he&#39;s tired...<br/>\n&gt; Before we moved in May, we&#39;d read, shut the light, and go to sleep around 10pm.<br/>\n<br/>\n </span></blockquote>While that&#39;s not a &quot;bedtime&quot; in the conventional sense, you had a routine, and now that has changed. Sometimes that kind of change is a result of a child getting older - sleep needs do change - but it could also be more a matter of losing your old routine without having found a new one, yet. It might help you think in those terms - is there a way to create a new routine that will work better for everyone? <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In the last few weeks, he&#39;s started wanting to go to sleep anywhere from 6-9pm.<br/>\n<br/>\n </span></blockquote>Can you get the process going earlier by putting on a movie around 6 and being available if he wants to nurse? Were you nursing while reading before? That&#39;s not clear. Can you offer more food before he&#39;s likely to nurse so that he&#39;s not so hungry afterwards? I&#39;m assuming he&#39;s nursing more for connection than nutrition, but the nursing is also stimulating his digestion, setting him up to be hungry, so it could help for him to eat first. That would be easier to arrange with a regular routine, for sure! If you can set things up so that he eats first, cleans up, and then settles down, there&#39;s a better chance of him staying settled and sleeping.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;He&#39;ll sleep for a few hours, and then he wakes up wanting to eat and play, bursting with energy for anywhere from 2-6 hours.<br/>\n </span></blockquote>*****************<br/>\n<br/>\nCan he play by himself? Some kids are fine with that so long as they can get to everything they need - snacks, toys, the remote control - while others really need the company.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [AlwaysLearning] Re: Sleep Habits","postDate":"1285508653","msgId":57503,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI4QzQ5MDQ0LTE2QjQtNEMwOS04MjA0LUQ0QjE1NDJBQjExMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGk3bW5udCtrZmFmQGVHcm91cHMuY29tPg==","referencesHeader":"PGk3bW5udCtrZmFmQGVHcm91cHMuY29tPg=="},"prevInTopic":57502,"nextInTopic":57505,"prevInTime":57502,"nextInTime":57504,"topicId":57496,"numMessagesInTopic":0,"msgSnippet":"-=-You get the idea, impossible...-=- If you say so. I thought there were suggestions made to change where you were. If it s impossible, discussing it on the","messageBody":"<div id=\"ygrps-yiv-19008589\">-=-You get the idea, impossible...-=-<br/>\n<br/>\nIf you say so.<br/>\n<br/>\nI thought there were suggestions made to change where you were.<br/>\n<br/>\nIf it&#39;s impossible, discussing it on the list won&#39;t help.  But  <br/>\npossibly it will help other people.<br/>\n<br/>\nOne good thing is that he&#39;s healthy, and you don&#39;t have to feed him  <br/>\nthrough a tube, and he can sleep (I&#39;m guessing) without machinery  <br/>\nbeing attached.  And no one stays three years old forever.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":311108332,"authorName":"evawitsel","from":"&quot;evawitsel&quot; &lt;evawitsel@...&gt;","profile":"evawitsel","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Sleep Habits","postDate":"1285493709","msgId":57502,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk3bjQ0ZCtycmszQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGk3bW5udCtrZmFmQGVHcm91cHMuY29tPg=="},"prevInTopic":57500,"nextInTopic":57503,"prevInTime":57501,"nextInTime":57503,"topicId":57496,"numMessagesInTopic":0,"msgSnippet":"My daughter is exactly the same age. She only falls asleep with the TV on when she is very very tired, too tired really. Otherwise she tries to stay awake as","messageBody":"<div id=\"ygrps-yiv-582563622\">My daughter is exactly the same age. She only falls asleep with the TV on when she is very very tired, too tired really. Otherwise she tries to stay awake as long as possible to keep watching TV. We only have one TV and it&#39;s in our living room. She watches TV until she gets tired and then I take her upstairs. If she wants to, she takes a bath, or we tidy our bedroom, or we fold some laundry. This helps her transition from being busy busy busy to being more relaxed. After brushing our teeth (I always brush mine at the same time, she likes that), I grab a pile of books and we read for another half hour or so. Then she falls asleep nursing.<br/>\n<br/>\nShe needs several &#39;steps of relaxing&#39; to help her fall asleep, from TV, to doing things together upstairs, to brushing our teeth, to reading books, to nursing and then falling asleep, I do everything more slowly and quietly. Maybe your son needs something like that too?<br/>\n<br/>\nWanting to eat late at night reminds me of my son. He&#39;s really hungry sometimes when we take him to bed, but I think he only notices he&#39;s hungry when he stops playing. I try to make sure he gets enough food during the day and that he gets lots of opportunities for running, talking and playing. This helps him go to sleep more easily, because if he is tired but has any &#39;play energy&#39; left, it takes him a long time to fall asleep.<br/>\n<br/>\nMaybe any of these things that we use to help our children fall asleep more easily when they are tired can help your son too.<br/>\n<br/>\nEva<br/>\nBerend (5) & Fiene (3)<br/>\n(from the Netherlands)</div>","specialLinks":[]},{"userId":171830749,"authorName":"nycartgal2003","from":"&quot;nycartgal2003&quot; &lt;mranzer@...&gt;","profile":"nycartgal2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Sleep Habits","postDate":"1285481021","msgId":57500,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk3bW5udCtrZmFmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDI4Rjk3Q0Y3LURGOTAtNDE2Mi1CMzFCLUM4NEFFOUVDQzhDQUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":57498,"nextInTopic":57502,"prevInTime":57499,"nextInTime":57501,"topicId":57496,"numMessagesInTopic":0,"msgSnippet":"There is a TV in the bedroom. What happens is, he ll nurse for awhile while he watches, then he ll want to eat, so I ll get him a snack and water. Then I need","messageBody":"<div id=\"ygrps-yiv-1684847646\">There is a TV in the bedroom. What happens is, he&#39;ll nurse for awhile while he watches, then he&#39;ll want to eat, so I&#39;ll get him a snack and water. Then I need to clean his hands, then he&#39;ll have to pee, then he&#39;ll get a burst of energy and start jumping on me on the bed. You get the idea, impossible to sleep while all this is happening.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; -=-Before we moved in May, we&#39;d read, shut the light, and go to sleep  <br/>\n&gt; around 10pm.<br/>\n&gt; Since the move, he wants to watch TV every night, which delays his  <br/>\n&gt; falling asleep, even when he shows all the signs of being tired.<br/>\n&gt; Many nights, I can feel him starting to fall asleep, and then he&#39;ll  <br/>\n&gt; sit up and say he&#39;s hungry. This happens on nights when he&#39;s eaten a  <br/>\n&gt; lot of food before bed, or when he has not.-=-<br/>\n&gt; <br/>\n&gt; Can you put on a movie that he knows well, that&#39;s peaceful and quiet,  <br/>\n&gt; and let him fall asleep while it&#39;s on?  Either in a bed near the TV,  <br/>\n&gt; or a player in his room?  If he sleeps with you, maybe make him a bed  <br/>\n&gt; by the TV instead, or if you could sleep on the couch in the room  <br/>\n&gt; where he is, and he could fall asleep there, soon everyone would be  <br/>\n&gt; asleep.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Sleep Habits","postDate":"1285479855","msgId":57498,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI4Rjk3Q0Y3LURGOTAtNDE2Mi1CMzFCLUM4NEFFOUVDQzhDQUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGk3bWliNytqdWsxQGVHcm91cHMuY29tPg==","referencesHeader":"PGk3bWliNytqdWsxQGVHcm91cHMuY29tPg=="},"prevInTopic":57496,"nextInTopic":57500,"prevInTime":57497,"nextInTime":57499,"topicId":57496,"numMessagesInTopic":0,"msgSnippet":"-=-Before we moved in May, we d read, shut the light, and go to sleep around 10pm. Since the move, he wants to watch TV every night, which delays his falling","messageBody":"<div id=\"ygrps-yiv-825658877\">-=-Before we moved in May, we&#39;d read, shut the light, and go to sleep  <br/>\naround 10pm.<br/>\nSince the move, he wants to watch TV every night, which delays his  <br/>\nfalling asleep, even when he shows all the signs of being tired.<br/>\nMany nights, I can feel him starting to fall asleep, and then he&#39;ll  <br/>\nsit up and say he&#39;s hungry. This happens on nights when he&#39;s eaten a  <br/>\nlot of food before bed, or when he has not.-=-<br/>\n<br/>\nCan you put on a movie that he knows well, that&#39;s peaceful and quiet,  <br/>\nand let him fall asleep while it&#39;s on?  Either in a bed near the TV,  <br/>\nor a player in his room?  If he sleeps with you, maybe make him a bed  <br/>\nby the TV instead, or if you could sleep on the couch in the room  <br/>\nwhere he is, and he could fall asleep there, soon everyone would be  <br/>\nasleep.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":171830749,"authorName":"nycartgal2003","from":"&quot;nycartgal2003&quot; &lt;mranzer@...&gt;","profile":"nycartgal2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Sleep Habits","postDate":"1285475495","msgId":57496,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGk3bWliNytqdWsxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":57498,"prevInTime":57495,"nextInTime":57497,"topicId":57496,"numMessagesInTopic":0,"msgSnippet":"My son Logan, who is almost four, has never been one of those kids who sleeps through the night. He nurses to sleep, and still wakes up to nurse  once or twice","messageBody":"<div id=\"ygrps-yiv-1899605579\">My son Logan, who is almost four, has never been one of those kids who sleeps through the night. He nurses to sleep, and still wakes up to nurse  once or twice most nights. <br/>\nHe does not have a set bed time, he goes to sleep when he&#39;s tired.<br/>\nBefore we moved in May, we&#39;d read, shut the light, and go to sleep around 10pm.<br/>\nSince the move, he wants to watch TV every night, which delays his falling asleep, even when he shows all the signs of being tired.<br/>\nMany nights, I can feel him starting to fall asleep, and then he&#39;ll sit up and say he&#39;s hungry. This happens on nights when he&#39;s eaten a lot of food before bed, or when he has not.<br/>\nIn the last few weeks, he&#39;s started wanting to go to sleep anywhere from 6-9pm. He&#39;ll sleep for a few hours, and then he wakes up wanting to eat and play, bursting with energy for anywhere from 2-6 hours. This past week he was up all night, going to sleep  at 6am a few times.<br/>\n<br/>\nMy husband and I are exhausted. Paul works from<br/>\n 4:30-2:00am,  so we can&#39;t sleep in shifts most nights.<br/>\nIt&#39;s extra hard the days I need to wake up early. I teach a few college courses, and do freelance work.<br/>\nSometimes I can nap with him, other days it&#39;s the only time I have to get work done.<br/>\n<br/>\nWhat have you done during a phase like this?<br/>\n<br/>\nMeryl</div>","specialLinks":[]}],"prevTopicId":57543,"nextTopicId":57571}}