{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Nancy from MI","from":"&quot;Nancy from MI&quot; &lt;hammondcentral@...&gt;","replyTo":"LIST","senderId":"Gm09xR8JXb56zgnyZ1z6XPfPPlCZhEztybUGsl9WrQdpAjMcLWmv6ljlKRLy43O6V_FmybFOHwyPzfzY6QYXikcvBorhAlH-R8dcJRku3fDPwaXBNg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Fwd:  FW: NYTimes.com Article: Teenagers Find Health Answers With a Cli ck","postDate":"985188519","msgId":17126,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk5YWhiNytiazBtQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":17125,"nextInTime":17127,"topicId":17126,"numMessagesInTopic":0,"msgSnippet":"Found this interesting article posted on another home schooling board. Great for teens! ~Nancy ... Teenagers Find Health Answers With a Click By BONNIE ROTHMAN","messageBody":"<div id=\"ygrps-yiv-1295276459\">Found this interesting article posted on another home schooling board. <br/>\n Great for teens!<br/>\n<br/>\n~Nancy<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In careaboutgirls@y..., &quot;Kemp, Susan&quot; &lt;AM4030@d...&gt; wrote:<br/>\nTeenagers Find Health Answers With a Click<br/>\n<br/>\n<br/>\nBy BONNIE ROTHMAN MORRIS<br/>\n<br/>\nEmily Davison, a 12-year-old seventh grader at the Trinity School in<br/>\nManhattan, used to think she was overweight. Recently, she changed<br/>\nher mind. Emily didn&#39;t lose a single pound to change her attitude.<br/>\n<br/>\n She went online and consulted iEmily, a new site devoted to<br/>\nhelping teenage girls - and not just ones named Emily - get answers<br/>\nto questions about physical and mental health. After reading<br/>\narticles on the site about healthy weight and body image, Emily<br/>\nrealized she wasn&#39;t fat after all.<br/>\n<br/>\n &quot;I read some of the articles about how a lot of girls who think<br/>\nthey&#39;re overweight aren&#39;t. Now I feel more comfortable about my<br/>\nweight,&quot; said Emily, who said she visited the site (www.iEmily.com)<br/>\nfor at least 30 minutes daily to get information about nutrition<br/>\nand fitness and to find solace from the stress she says she feels<br/>\nat school. A private company, iEmily is based in Boston and carries<br/>\nno advertising.<br/>\n<br/>\n Emily said that, up to now, she had not had any health education<br/>\nat school and, she admits, she has a lot of questions that need<br/>\nanswering. She said she could ask her mother about &quot;lot of things,&quot;<br/>\nbut there are some things she is too embarrassed to ask. Emily is<br/>\nnot unlike thousands of other adolescents, both boys and girls, who<br/>\nare turning for answers to their health questions to Web sites<br/>\nfocused on teenage health and written by medical professionals with<br/>\na view to providing balanced, factual information.<br/>\n<br/>\n In addition to the for-girls-only iEmily, the most comprehensive<br/>\nof these sites are TeenGrowth (www.teengrowth.com), the Web site<br/>\nfor the Pediatric Health Alliance, a group practice in Florida; the<br/>\nteenager section of KidsHealth site (www.kidshealth.org), which is<br/>\nunderwritten by the Nemours Foundation; and ZapHealth<br/>\n(www.zaphealth.com), a company based in Manhattan, the only site<br/>\namong these that carries advertising.<br/>\n<br/>\n Organized like interactive magazines, the sites include articles<br/>\non general, sexual and emotional health, as well as fitness,<br/>\nsports, family and safety issues, links to resources for more help,<br/>\nforums and, on two sites, chat rooms. The sites cover almost every<br/>\nhealth and wellness subject that occupies adolescents, from breast<br/>\nand penis size to pimples and dandruff, from crushes and French<br/>\nkissing to more serious issues like depression, drug abuse and<br/>\npregnancy.<br/>\n<br/>\n For teenagers, turning to the Web for health information is<br/>\nnatural since they are online anyway, playing games, sending e-<br/>\nmail and learning, according to a recent survey conducted by<br/>\nJupiter Communications and Media Metrix. That they spend an average<br/>\nof 15 minutes per visit to these health sites is no surprise to the<br/>\nexecutives who run them. &quot;It is blatantly obvious that teenagers<br/>\nwere an ignored population medically speaking,&quot; said Dr. F. Lane<br/>\nFrance, medical adviser to TeenGrowth. <br/>\n<br/>\n Teenagers have &quot;an insatiable curiosity about `me,&#39; &quot; said Kate<br/>\nKelly, author of &quot;The Complete Idiot&#39;s Guide to Parenting a<br/>\nTeenager.&quot;<br/>\n<br/>\n Just a few years ago, most teenagers would get the basics in<br/>\nhealth class and the rest of their health information (or<br/>\nmisinformation) from hurried conversations in school bathrooms.<br/>\nSometimes, they may have even asked their doctors. But, since many<br/>\nadolescents still see a pediatrician, who has a relationship with<br/>\nthe parent, not the patient, asking intimate questions is tricky,<br/>\nMs. Kelly said. For adolescents who wish to satisfy that insatiable<br/>\ncuriosity, the Web offers something a visit to the doctor&#39;s office<br/>\ndoesn&#39;t: privacy.<br/>\n<br/>\n &quot;If you have questions about stuff you can just go on and no one<br/>\nknows about it,&quot; said Elizabeth Anderson, 12, a seventh grader in<br/>\nBrookline, Mass., and an iEmily visitor. &quot;It&#39;s secret and has lots<br/>\nof information.&quot;<br/>\n<br/>\n Articles about issues of pressing interest to a teenage audience<br/>\nare abundant. ZapHealth, for instance, offers: &quot;Body Odor, a k a<br/>\nB.O.&quot; &quot;Am I Still a Virgin If I Use a Tampon?&quot; is on KidsHealth.<br/>\nFeatures on body piercing and tattoos are included on iEmily. <br/>\n<br/>\n &quot;Before I would go to girl magazines, which would have a page<br/>\ndedicated to specific questions, but of course these weren&#39;t my<br/>\nquestions, there were matters that didn&#39;t affect me,&quot; said Bhavi<br/>\nHansoty, 20, a sophomore at Vassar and a frequent visitor to<br/>\nZapHealth.com. She also serves on a panel the site consults when<br/>\ndeveloping material.<br/>\n<br/>\n Recently, Ms. Hansoty was considering getting her navel pierced.<br/>\nAfter reading the articles on body piercing on the site, she<br/>\nconsulted the feedback page where she read grueling accounts of the<br/>\npain, inflammation and infection experienced by others with pierced<br/>\nbelly buttons. Ms. Hansoty decided against the piercing. <br/>\n<br/>\n She said the real stories from real people that she found on the<br/>\nsite persuaded her to change her plans. In fact, the real action on<br/>\nthese sites happens in the interaction. At ZapHealth and iEmily,<br/>\nteenagers can talk to one another, offering advice in chat rooms on<br/>\ntopics as diverse as curing the frizzies and masturbation as a sin.<br/>\nRina Spence, who founded iEmily, said the site moderated all chats.<br/>\nZapHealth&#39;s chats are unmoderated, said Chelsea Farley, the site&#39;s<br/>\nfounder. There are no chat rooms on TeenGrowth .com or on<br/>\nKidsHealth.org/teen. <br/>\n<br/>\n While chatting is like being in a virtual school bathroom,<br/>\nbulletin boards and forums on the sites are places where teenagers<br/>\nask their most personal questions and have them answered by medical<br/>\nprofessionals. The questions are then posted, with all identifying<br/>\ndetails removed, for others to consult. Though each Web site urges<br/>\nvisitors with serious problems to get immediate help from a<br/>\ncounselor or physician, some teenagers - suicidal, drug-abusing or<br/>\npregnant - send S O S&#39;s to the site anyway. They are immediately<br/>\nand privately answered.<br/>\n<br/>\n Desperate e-mail messages are rare, though. Mostly, questions for<br/>\nthe site&#39;s medical professionals are of less urgent, though no less<br/>\npressing, matters. Often, teenagers just want reassurance that they<br/>\nare normal.<br/>\n<br/>\n And, as the letters come in, the sites continue to stockpile the<br/>\nanswers and make them available through searchable indexes.<br/>\n<br/>\n Carol Weston, who runs the GirlsTalk forum on iEmily and who is an<br/>\nauthor of seven books for teenage girls, has been answering letters<br/>\nfrom teenagers for 15 years. Mostly, the questions she receives<br/>\nstay the same from year to year. Her most enduring one: &quot;Does he<br/>\nlike me?&quot; <br/>\n<br/>\n When Emily Davison was hurt to discover that a boy she had a crush<br/>\non started going out with her best friend, she consulted iEmily.<br/>\nWhat she found helped a little, she said, but since she still felt<br/>\nbetrayed, she went to her mother. Talking to her mom, Emily said,<br/>\nwas the one thing that really helped.<br/>\n--- End forwarded message --- </span></blockquote></div>","specialLinks":[]}],"prevTopicId":17117,"nextTopicId":17121}}