{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":2448334,"authorName":"shantinik","from":"&quot;shantinik&quot; &lt;shantinik@...&gt;","profile":"shantinik","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"OT Tsunami","postDate":"1104104956","msgId":101762,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNxbmlscytrZjFmQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":101761,"nextInTime":101763,"topicId":101762,"numMessagesInTopic":0,"msgSnippet":"Dear homeschooling friends – By now, many of you have read about the tsunami that has just hit the coastal areas of the Bay of Bengal. I am particularly sad","messageBody":"<div id=\"ygrps-yiv-1765923839\">Dear homeschooling friends <br/>\n<br/>\nBy now, many of you have read about the tsunami that has just hit the<br/>\ncoastal areas of the Bay of Bengal. I am particularly sad to report<br/>\nthat areas of the coast of southeast India are in ruins.<br/>\n<br/>\nThis is the area in which my adopted Indian parents have been doing<br/>\nland reform/development work for the past 40 years, and also where<br/>\nAmerican homeschoolers have contributed much-needed funds to help<br/>\nbuild houses for people who were previously living in little more than<br/>\nmud and grass huts that would be destroyed during every monsoon, and<br/>\nto support 220 orphans. A wall of water 30-40 feet high hit and moved<br/>\nmore than 10 miles inland (where the orphanages are), destroying<br/>\neverything in its wake.. The mangroves, which had been the only<br/>\nnatural protection against such destruction, had all been cut down by<br/>\nmultinational/World Bank-backed projects in industrial shrimp farming.<br/>\n As of this writing, 1,100 people are reported dead in this district,<br/>\nand upwards of a million homeless. I am awaiting more direct word from<br/>\nmy mother or sister, but am unlikely to receive it anytime soon. (My<br/>\nsister is head of a pediatrics hospital in the region  I expect I<br/>\nwon&#39;t hear from her in weeks!),<br/>\n<br/>\nAs it turns out, my daughter (former homeschooler and now Smith<br/>\nCollege first-year Aliyah) and I were planning to leave for the area<br/>\non Tuesday evening. We would (and may) still go, though with plans to<br/>\nassist in the relief effort. But I expect the local airports will be<br/>\ncommandeered for relief aid, so we&#39;ll just have to see.<br/>\n<br/>\nIn the meantime, we have set up a relief fund. All proceeds from the<br/>\nsale of my book &quot;The Color of Freedom&quot; (which is an oral biography of<br/>\nmy parents, and the story of their work) were already going to their<br/>\nefforts, and can be purchased through my website at<br/>\nwww.skylarksings.com  Tax-deductible donations  cash, checks, or<br/>\ncredit cards  can be sent to me at the address on the site (if for<br/>\nmore than $500, checks should be made out to The Gandhian Foundation;<br/>\nif not, simply to Skylark Sings, as the funds will get there faster.)<br/>\nThe quickest way is simply to call me at 360 352-0506 (will be out<br/>\nthis evening, though), and I&#39;ll do what is necessary  we will wire<br/>\nthe combined contributions directly, and there will be no overhead to<br/>\ncover.<br/>\n<br/>\nThank you for your help and prayers.<br/>\n<br/>\nDavid<br/>\nwww.skylarksings.com</div>","specialLinks":[]}],"prevTopicId":101698,"nextTopicId":101777}}