{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Covert","from":"Covert &lt;covert@...-net.ne.jp&gt;","replyTo":"LIST","senderId":"bZtU-InEmO4ViqA_oyElQz1MC9lKRsIUjA0EfBrGKzOYcwrOs-sKtoaf-k7IgRYkuRimCFcxKAuXIBs7QD-VlhVd7t9qy6U","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Japanese alternative learning center","postDate":"961123901","msgId":9324,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAwNjE2MDI0Mi5MQUExMTY4NUBtYWlsLndhMi5zby1uZXQubmUuanA+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":9323,"nextInTime":9325,"topicId":9324,"numMessagesInTopic":0,"msgSnippet":"Hi all, Following is a notice about an upcoming book release -- and more importantly, about an alternative learning center in Kyoto, Japan. Let me stress that","messageBody":"<div id=\"ygrps-yiv-1322767880\">Hi all,<br/>\n<br/>\nFollowing is a notice about an upcoming book release -- and more <br/>\nimportantly, about an alternative learning center in Kyoto, Japan.<br/>\n<br/>\nLet me stress that I am not in the habit of reproducing press releases (I <br/>\nabhor them, generally speaking). But I felt this one warranted an <br/>\nexception since it does provide some useful background to the alternative <br/>\nlearning scene in Japan. This includes the homelearning and community <br/>\nlearning movements, and the Kyoto school mentioned here appears to be <br/>\nsupportive of such citizen-led movements in Japan.<br/>\n<br/>\nI am a Japan-based homelearning parent and have no affiliation at all <br/>\nwith the Kyoto center. My only motivation in reposting this message here <br/>\n(with permission of the author) is the hope that people in and outside <br/>\nJapan will more fully understand that home-based learning and other means <br/>\nof alternative learning are nowadays *slowly* becoming practical and <br/>\nworkable options to the mainstream school system here in Japan.<br/>\n<br/>\nI have recently met face to face with Dayle Bethel, originator of this <br/>\nrelease, in Kyoto and found him to be an individual with decades of work <br/>\nin the field of holistic learning in the US and Japan. As I understand <br/>\nit, he has been here in Japan for many, many years as head of the Kyoto <br/>\ncenter. He came here at a time when there were far fewer foreigners in <br/>\nJapan than there are now, let alone foreigners promoting the &quot;crazy&quot; <br/>\nconcept of alternative learning methods. But times are changing, and now <br/>\nthe Japanese public seems to be taking heed of the need for just such <br/>\nalternatives to conventional schooling.<br/>\n<br/>\nAnyway, the news media in Japan will reportedly be receiving this same <br/>\ninformation about the book and Kyoto center later in the summer, so we <br/>\nare getting a bit of a jump on them by sharing it here.<br/>\n<br/>\nI understand that Mr. Bethel has recently transferred to the TIUJ&#39;s <br/>\nsister center in Hawaii, so anyone wanting to get in touch with the Kyoto <br/>\nlearning center directly can do so through Mr. Motoshi Suzuki at the <br/>\ne-mail address noted at the bottom of this release.<br/>\n<br/>\nBrian Covert<br/>\nin Osaka, Japan<br/>\n<br/>\n-------------------------------<br/>\n-------------------------------<br/>\n<br/>\n<br/>\nPRESS RELEASE<br/>\n<br/>\nDayle M. Bethel  &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dmb19@...\">dmb19@...</a>-inet.or.jp&gt;<br/>\n<br/>\n<br/>\nJapanese University Included in New Book on<br/>\nWorld&#39;s Most Innovative Educational Institutions<br/>\n<br/>\n<br/>\nKYOTO -- Creating Learning Communities, just off the press of Solomon <br/>\nPublishing Company (New York, USA), was written, on-line, by an <br/>\ninternational coalition of professional educators and lay persons. The <br/>\nbook, which has been hailed by some pre-publication reviewers as possibly <br/>\nthe most revolutionary volume on education of the 20th century, proposes <br/>\na totally new way of thinking about and conducting education, from <br/>\nkindergarten to the university. In the words of editor Ron Miller in an <br/>\nintroduction entitled, &quot;From Schools to Learning Communities,&quot; the book <br/>\nreflects &quot;a new way of thinking about teaching and learning, about <br/>\ncurriculum and testing, indeed about the whole institution of schooling, <br/>\nthat during the last few years has begun to make a great deal of sense to <br/>\nthousands of parents and educators, and to a growing number of social <br/>\ncritics and futurists.&quot;<br/>\n<br/>\nThe International University Japan (TIUJ) in Kyoto is one of the <br/>\neducational institutions featured in &quot;Creating Learning Communities.&quot; <br/>\nTIUJ is this year celebrating the 25th anniversary of its founding in <br/>\n1975. Little noticed in Japan, it has quietly gone about its <br/>\nself-appointed task of creating a model of a restructured university <br/>\nsystem. That system, according to Motoshi Suzuki, TIUJ co-director, has <br/>\nthree unique features that set it apart from traditional universities:<br/>\n<br/>\n1. The student, rather than teachers and administrators, is responsible <br/>\nfor learning. Teachers serve as mentors and advisors who support, <br/>\nencourage, and share in creating an environment in which the student, <br/>\nmotivated by the joy, challenge and excitement of gaining new insights, <br/>\ncan pursue a program of learning jointly planned and agreed upon.<br/>\n<br/>\n2. The purpose of educational institutions, according to TIUJ&#39;s <br/>\neducational philosophy, is to introduce students to and enable their <br/>\ndirect involvement in the life, history, and planning for the future of <br/>\ntheir local community and bio-region and, at the university level, the <br/>\nplanet as a whole. The community is the learning environment. Educational <br/>\ninstitutions and organizations, whether they are called schools, centers, <br/>\nlibraries, or learning support groups, serve as learning  resources which <br/>\nstudents, of any age, and at any time, can utilize. The community, then, <br/>\nis the primary source of the curriculum, while books and other <br/>\nsecond-hand information, though important, are for the support of the <br/>\nstudent&#39;s own observations, study, and research.<br/>\n<br/>\n3. Each student pursues an individualized learning program within a <br/>\nhuman-scale educational structure, a semi-autonomous sub-unit of the <br/>\nuniversity, consisting of a maximum of 25 students, a program <br/>\nadvisor-facilitator, and mentors who are specialists in the areas or <br/>\nfields of learning in which the students are studying.<br/>\n<br/>\nWhile university education in Japan has changed little during the past 25 <br/>\nyears, community learning at the elementary and secondary levels has <br/>\nmushroomed, spurred by the rise of community parent and student support <br/>\ngroups and experimentation in a few public schools. The  Family and <br/>\nCommunity Learning Network in Nagoya [Japan] is an example of the former. <br/>\nOjiya Elementary School in Niigata Prefecture -- known  as the School <br/>\nwith Forest and Meadow -- is an example of a learning community within a <br/>\npublic school framework.<br/>\n<br/>\nThere is now a growing body of research findings which suggest that <br/>\ngraduates of alternative, community based learning centers are generally <br/>\nmore alert, more creative, more highly motivated, more responsible, and <br/>\nmore socially conscious than most graduates of traditional schools.<br/>\n<br/>\nAccording to Suzuki, it is now possible for students to learn in this <br/>\nkind of alternative, community learning environment from kindergarten <br/>\nthrough the university. Mr. Suzuki welcomes observations and questions <br/>\nfrom persons interested in finding out more about study in learning <br/>\ncommunities. His email address is: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:motoshi@...\">motoshi@...</a>-inet.or.jp.<br/>\n<br/>\n<br/>\n[END]</div>","specialLinks":[]}],"prevTopicId":9322,"nextTopicId":9296}}