{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":13,"messages":[{"userId":294520986,"authorName":"Joanna Murphy","from":"&quot;Joanna Murphy&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 2-3 yo behavior/interactions with family","postDate":"1239991646","msgId":44126,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzYWdndSticW1pQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEyOWJhNjY4OTdjMmQwODNkMTc0MDg3NDE0M2QxMjk4QGdtYWlsLmNvbT4="},"prevInTopic":44112,"nextInTopic":0,"prevInTime":44125,"nextInTime":44127,"topicId":44070,"numMessagesInTopic":0,"msgSnippet":"... For someone who doesn t have kids and doesn t get them at this point, being told you aren t good with kids can be very painful and distancing.  She","messageBody":"<div id=\"ygrps-yiv-1071242613\"><blockquote><span title=\"ireply\">&gt;  &gt;&gt;&gt;&gt; Anyways, I know that my sil has been hurt sometimes by my <br/>\n&gt; daughter&#39;s reaction and my DH hasn&#39;t helped with a couple of comments <br/>\n&gt; that hurt her about not being good with kids. So it has turned into a <br/>\n&gt; vicious cycle -- she is not interacting with Marisol, and Marisol <br/>\n&gt; reacts in kind. Marisol is actually VERY affectionate once you have <br/>\n&gt; gained her trust -- gives SUPER hugs and kisses, and now even says &quot;I <br/>\n&gt; love you!&quot; all the time. &lt;&lt;&lt;&lt;<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>For someone who doesn&#39;t have kids and doesn&#39;t &quot;get&quot; them at this point, being told you aren&#39;t &quot;good with kids&quot; can be very painful and distancing.  She might be feeling completely incapable of going there.  I&#39;m sure that comments like those really don&#39;t help the situation.  If there are ever mended fences, perhaps your hubby could offer her a few examples of ways to build a bridge with your daughter.<br/>\n<br/>\nI give concrete suggestions to some of my family members, like, &quot;Bring her a My Little Pony when you come to visit--she LOVES them!&quot;  It&#39;s inexpensive and easy to obtain, and my dd responds extremely well to tangible items.  When they follow a suggestion there is always a bridge built.  They just haven&#39;t figured out yet how to build the bridges on their own--but in this case it&#39;s not through any ill intentions.  But I try to give them something current that she&#39;s into that they can connect with her on.<br/>\n<br/>\nI think it&#39;s likely even easier with a 3 year old, because the world holds so many wonders, but for people not versed in &quot;little kid-ease&quot; it can be daunting.  As my kids get older, I feel less and less able to speak that language myself, and I&#39;ve had kids!<br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: 2-3 yo behavior/interactions with family","postDate":"1239978418","msgId":44112,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU0N0VCNjExLThDQzItNENDRC04Rjc4LTRBNzczQTVFMzBBRkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdzOXFyNSt2bGM3QGVHcm91cHMuY29tPg==","referencesHeader":"PGdzOXFyNSt2bGM3QGVHcm91cHMuY29tPg=="},"prevInTopic":44110,"nextInTopic":44126,"prevInTime":44111,"nextInTime":44113,"topicId":44070,"numMessagesInTopic":0,"msgSnippet":"-=-Because there were adults that really scared him and yet expected him to laugh and say hello, I also needed to voice up for him he doesn t like it when you","messageBody":"<div id=\"ygrps-yiv-1843346121\">-=-Because there were adults that really scared him and yet expected  <br/>\nhim to laugh and say hello, I also needed to voice up for him &quot;he  <br/>\ndoesn&#39;t like it when you yell BOO! when he walks in the door&quot; - said  <br/>\nto a six foot six man on behalf of a very small four year old.=-<br/>\n<br/>\nIt&#39;s amazing how awkward so many adults are talking to kids.<br/>\n<br/>\n-=- Some are tactics that others might call &#39;manners&#39; ...-=-<br/>\n<br/>\n&quot;Manners&quot; refers to the way people act--their mannerisms and  <br/>\nbehavors.   Some have good manners, involving expected courtesies and  <br/>\netiquette, and some have bad manners, and some have no idea what&#39;s  <br/>\nexpected so they might have awkward or inappropriate manners.<br/>\n<br/>\n-=-but he doesn&#39;t have to use them, or we might agree that I will say  <br/>\nhello/goodbye for him, and that he can run off and play. His choice.-=-<br/>\n<br/>\nI run interference for my kids sometimes still, and they&#39;re grown  <br/>\npeople. &lt;g&gt;<br/>\n<br/>\nOne way to think about how to advise children on courtesies is to  <br/>\nimagine you have a house guest from a culture so different that they  <br/>\ndon&#39;t know the very basic things.  If someone stuck out a hand to  <br/>\nshake, they wouldn&#39;t know what to do.   (Or think of Americans in  <br/>\nJapan, who are more likely than not to totally botch civil behavior.)   <br/>\nSo if you were going somewhere with your very-foreign friend, it would  <br/>\nbe a courtesy to him to let him know what people expect and why (if  <br/>\nyou know why, and if you don&#39;t know why try to avoid &#39;who knows--it&#39;s  <br/>\nstupid, but...&#39;).   If he chooses not to take your advice, then that&#39;s  <br/>\non him (or you might be less inclined to take him out and introduce  <br/>\nhim).   If he had no good advice from which to choose, that&#39;s on you.<br/>\n<br/>\nToo many times I&#39;ve heard parents damage their children&#39;s chance for  <br/>\nhappiness and success by not even TRYing to help them understand the  <br/>\nworld.   I&#39;ve heard parents say spelling doesn&#39;t make any sense, and  <br/>\nto spell however they want to, and anyone who doesn&#39;t like their  <br/>\nspelling isn&#39;t worth thinking about.  I&#39;ve heard parents tell kids  <br/>\nother people don&#39;t have the right to tell them what to do.   Hello!   <br/>\nOwners of stores?  Owners of homes?  Owners of restaurants?   They  <br/>\nhave not only a right but a duty to protect peace and property. I&#39;ve  <br/>\nheard parents say &quot;Wear whatever you want to&quot; without any information  <br/>\nabout expected weather, or the inappropriateness of wearing white to a  <br/>\nwedding (if you&#39;re not the bride) or pink to a funeral (unless it was  <br/>\na drag queen, maybe, who left such a request).<br/>\n<br/>\nSo one extreme is to try to force a child to accept whatever tacky  <br/>\nbehavior other adults and funny-smelling relatives come up with.<br/>\nThe other extreme is to tell him he NEVER has to accept or participate  <br/>\nin any social expectations.<br/>\n<br/>\nNeither is great.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/balance\">http://sandradodd.com/balance</a><br/>\nd<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":326908018,"authorName":"trude_flys","from":"&quot;trude_flys&quot; &lt;trude.la@...&gt;","profile":"trude_flys","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 2-3 yo behavior/interactions with family","postDate":"1239969445","msgId":44110,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzOXFyNSt2bGM3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdzN290byt1ZnNkQGVHcm91cHMuY29tPg=="},"prevInTopic":44106,"nextInTopic":44112,"prevInTime":44109,"nextInTime":44111,"topicId":44070,"numMessagesInTopic":0,"msgSnippet":"Hi Susan, I m usually a happy little lurker. Trust your child s ability to assess people. Children are often way better at it than adults because they aren t","messageBody":"<div id=\"ygrps-yiv-60175631\">Hi Susan,<br/>\n<br/>\nI&#39;m usually a happy little lurker.<br/>\n<br/>\nTrust your child&#39;s ability to assess people. Children are often way better at it than adults because they aren&#39;t distracted by any flowery polite language and instead see straight through the charade.<br/>\n<br/>\nMy son is a smaller than average (thus very cute to look at) and also very independant child. Around age 3, To help my son (so he that he would not keep getting hassled for a hug), I explained that he could take control of the situation. If he said hello and perhaps shook hands then the other person had no right to demand a hug. I did need to advocate for him and remind family and friends that he had said hello. For those adults that were too self absorbed to understand (how can a child make them feel bad - grow up), I buffered with a &quot;oh he rations hugs, even I don&#39;t get them often.&quot; I still need to do this for some slow learners.<br/>\nBecause there were adults that really scared him and yet expected him to laugh and say hello,  I also needed to voice up for him  &quot;he doesn&#39;t like it when you yell BOO! when he walks in the door&quot; - said to a six foot six man on behalf of a very small four year old.<br/>\n<br/>\nhe&#39;s now 7 and I still stand up for his right to determine who he interacts with and how. As he is growing older if he says that he isn&#39;t comfortable, I help him with different ways that he can look after his needs, and perhaps also be tactful (he notices people&#39;s reactions). He gets to choose which tactic he&#39;ll try out, and then whether or not he&#39;ll use that again. Some are tactics that others might call &#39;manners&#39; but he doesn&#39;t have to use them, or we might agree that I will say hello/goodbye for him, and that he can run off and play. His choice.<br/>\n<br/>\nIn so many ways he has rewarded my trust at unexpected times, as he talks to strangers, friends and relatives in his own way and in his own time. He has found a confident voice, not a voice for others expectations.<br/>\n<br/>\nTrude</div>","specialLinks":[]},{"userId":81228470,"authorName":"krissy8444","from":"&quot;krissy8444&quot; &lt;Chris@...&gt;","profile":"krissy8444","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 2-3 yo behavior/interactions with family","postDate":"1239955492","msgId":44106,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzOWQ3NCsxMGxtMEBlR3JvdXBzLmNvbT4=","inReplyToHeader":"PDczMDcwNzlGLUI2NDQtNENENC05REVCLTU0MkY4ODhGQUNBNkBzYmNnbG9iYWwubmV0Pg=="},"prevInTopic":44101,"nextInTopic":44110,"prevInTime":44105,"nextInTime":44107,"topicId":44070,"numMessagesInTopic":0,"msgSnippet":"Hi, My sil won t talk or interact with my children at family events because she s angry with me over a past disciplining issue in which she hit one of my","messageBody":"<div id=\"ygrps-yiv-893254245\">Hi,<br/>\nMy sil won&#39;t talk or interact with my children at family events because she&#39;s angry with me over a past disciplining issue in which she hit one of my children to get them NOT to hit.  Long story.  Anyway, I believe her treatment is a result of our relationship (mine and hers) and she projects it on to the kids.  She goes so far as to walk out of the room when I walk into it, and etc.<br/>\nI feel sad that my children don&#39;t have a relationship with her, but, frankly, I see it as her lost and absolutely appropriate that my kids don&#39;t respond to her.<br/>\nCheers,<br/>\nChristine</div>","specialLinks":[]},{"userId":182207143,"authorName":"Nancy Machaj","from":"Nancy Machaj &lt;nmachaj@...&gt;","profile":"nmachaj","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: 2-3 yo behavior/interactions with family","postDate":"1239938909","msgId":44101,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDczMDcwNzlGLUI2NDQtNENENC05REVCLTU0MkY4ODhGQUNBNkBzYmNnbG9iYWwubmV0Pg=="},"prevInTopic":44089,"nextInTopic":44106,"prevInTime":44100,"nextInTime":44102,"topicId":44070,"numMessagesInTopic":0,"msgSnippet":"... (not that you can force them!)-- but I am thinking that Marisol is old enough to start understanding and having conversations about what is appropriate","messageBody":"<div id=\"ygrps-yiv-901656030\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt; I don&#39;t believe in forcing kids to give out hugs and kisses etc<br/>\n </span></blockquote>(not that you can force them!)-- but I am thinking that Marisol is old<br/>\nenough to start understanding and having conversations about what is<br/>\nappropriate &quot;hello and goodbye&quot; behavior, and how her actions make<br/>\nother people feel. When do kids start to display &quot;empathy&quot; and are old<br/>\nenough to understand things like that? &lt;&lt;&lt;&lt;<br/>\n<br/>\n<br/>\nMy son who is 19 months loves to give &quot;high 5s&quot;, an open face hand  <br/>\nslap. Most everyone thinks its the cutest thing and its so much less  <br/>\ninvasive than a hug or kiss. He will give most anyone a high 5! We  <br/>\ndont make him hug or kiss, either. We, ourselves, dont hug and kiss  <br/>\neveryone!<br/>\n<br/>\nNancy<br/>\n<br/>\n<br/>\n*****<br/>\nblogging at:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://happychildhood.homeschooljournal.net\">http://happychildhood.homeschooljournal.net</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: 2-3 yo behavior/interactions with family","postDate":"1239911200","msgId":44089,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNBREE3NEQwLUYxQkYtNDBFMC04M0VDLTJCRkE2MjI1N0IzQUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdzN2w1ZytzZGhuQGVHcm91cHMuY29tPg==","referencesHeader":"PGdzN2w1ZytzZGhuQGVHcm91cHMuY29tPg=="},"prevInTopic":44087,"nextInTopic":44101,"prevInTime":44088,"nextInTime":44090,"topicId":44070,"numMessagesInTopic":0,"msgSnippet":"-=Your sis inlaw was giving a very mixed message of, I don t want anything to do with you, but you should still be considerate of social niceties since I m the","messageBody":"<div id=\"ygrps-yiv-1532208092\">-=Your sis inlaw was giving a very mixed message of, I don&#39;t want  <br/>\nanything<br/>\nto do with you, but you should still be considerate of social niceties<br/>\nsince I&#39;m the adult and your the child. Honestly, most children are<br/>\nsmart enough to avoid those kind of adults.-=-<br/>\n<br/>\nMost adults, too!<br/>\n<br/>\nThe &quot;obligation&quot; to visit family for holidays shouldn&#39;t include being  <br/>\nignored, and if relationships aren&#39;t friendly within a family, the  <br/>\nLAST person who should be held responsible is the three year old.<br/>\n<br/>\nWhen my kids were little we coached them about what to say and do.  We  <br/>\ndidn&#39;t &quot;make them&quot; do things, but we&#39;d say &quot;Remember to say thanks&quot; or  <br/>\n&quot;Talk to the hostess when you get there.&quot;    Most people (young or  <br/>\nold) prefer to know what&#39;s expected of them and what they can do to  <br/>\nsmooth an awkward moment.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":222835102,"authorName":"Verna","from":"&quot;Verna&quot; &lt;lalow@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 2-3 yo behavior/interactions with family","postDate":"1239906315","msgId":44087,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzN3Q2YitucGtqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEyOWJhNjY4OTdjMmQwODNkMTc0MDg3NDE0M2QxMjk4QGdtYWlsLmNvbT4="},"prevInTopic":44086,"nextInTopic":44089,"prevInTime":44086,"nextInTime":44088,"topicId":44070,"numMessagesInTopic":0,"msgSnippet":"This discussion reminds me of something that happened when my second son was about 2 1/2.  We went to my MIL and a cousin of my husbands was there.  This","messageBody":"<div id=\"ygrps-yiv-923588039\">This discussion reminds me of something that happened when my second son was about 2 1/2.  We went to my MIL and a cousin of my husbands was there.  This cousin is someone that my husband and I are not very fond of.  She is not a very genuine person and quite honestly gives me the creeps.  Anyway, she was trying to interact with my son and got down in his face and he kept hitting her with a paper towel roll on the head.  Rather than move away, she threatened him to take it away if he kept hitting her.  He didnt stop so she grabbed it and scrunched the thing up in a ball. (I didnt see all this, just found out what had happened right after it happened) He started crying.  I picked him up and took him in another room to calm him down and I guess since she thought she would be seen as the bad lady that made the little kid cry, she followed us and kept putting her face in his and trying to explain herself.  He finally reached up and smacked her, knocked her contact out of her eye.  While the rest of the family whipered about my ill mannered kid, I took him to the back bedroom and happily rocked him to sleep.<br/>\nAs an adult, when this woman would give me a hug, I would always let her, I mean we have to be polite right? Even if she creeps me out.  But from that moment on I vowed that if she ever tried to hug me again, I would not.  I will NEVER make my child hug someone.</div>","specialLinks":[]},{"userId":265299176,"authorName":"katherand@gmail.com","from":"katherand@...","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: 2-3 yo behavior/interactions with family","postDate":"1239905145","msgId":44084,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyOWJhNjY4OTdjMmQwODNkMTc0MDg3NDE0M2QxMjk4QGdtYWlsLmNvbT4=","inReplyToHeader":"PGdzN290byt1ZnNkQGVHcm91cHMuY29tPg==","referencesHeader":"PGdzN290byt1ZnNkQGVHcm91cHMuY29tPg=="},"prevInTopic":44081,"nextInTopic":44086,"prevInTime":44083,"nextInTime":44085,"topicId":44070,"numMessagesInTopic":0,"msgSnippet":"... reacts. I guess what is hard to understand is when you are being an example (for the ADULTS as much as or maybe even more than for the children!) and it is","messageBody":"<div id=\"ygrps-yiv-658357119\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt; I think that I am also thinking of stranger situations and how she <br/>\n </span></blockquote>reacts. I guess what is hard to understand is when you are being an <br/>\nexample (for the ADULTS as much as or maybe even more than for the <br/>\nchildren!) and it is just not being picked up on. &lt;&lt;&lt;&lt;<br/>\n<br/>\nThis is true with anybody, child or adult...  modeling only helps when <br/>\npeople are interested in the idea in the first place.  If someone <br/>\ndoesn&#39;t want to learn, maybe they don&#39;t feel the need to.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;&gt; Anyways, I know that my sil has been hurt sometimes by my <br/>\n </span></blockquote>daughter&#39;s reaction and my DH hasn&#39;t helped with a couple of comments <br/>\nthat hurt her about not being good with kids. So it has turned into a <br/>\nvicious cycle -- she is not interacting with Marisol, and Marisol <br/>\nreacts in kind. Marisol is actually VERY affectionate once you have <br/>\ngained her trust -- gives SUPER hugs and kisses, and now even says &quot;I <br/>\nlove you!&quot; all the time. &lt;&lt;&lt;&lt;<br/>\n<br/>\nYou could try to shield your sister in law from the consequences of not <br/>\nrelating with others and putting expectations on them --as though those <br/>\nrelationship exist in reality-- but that doesn&#39;t make one those <br/>\nrelationships authentic.  I can fantasize all day long that I am <br/>\nfriends with someone but my fantasy and whatever motions I make toward <br/>\nthat end are not what makes those things real.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;&gt; I did reach out to my sil with an email (and have gotten no <br/>\n </span></blockquote>response after 3 days), and would love to help them develop a <br/>\nrelationship.&lt;&lt;&lt;&lt;<br/>\n<br/>\nKarl has varying degrees of closeness and distance with extended family <br/>\nmembers, depending on lots of factors to do with each of those people.  <br/>\nI help Karl when he wants to know how to be friends with a cousin, for <br/>\ninstance.<br/>\n<br/>\nThe adults are a bit different.  Too much of a power difference makes <br/>\nhelping adults relate to your own children a bit dicey.  I don&#39;t agree <br/>\nwith it.  If my child wonders (verbally or nonverbally seems to) about <br/>\nsomething an adult is doing, saying or seems to be thinking, I explain <br/>\nto Karl what I can see about the situation so that I&#39;m empowering him <br/>\nto figure out these relationships and gauge for himself how close or <br/>\nfar he wants to be with people.<br/>\n<br/>\nThere&#39;s no need to this work for an adult who will likely be only <br/>\ninsulted at the insinuation that children have a choice in the matter <br/>\nabout family hugs and kisses.  I have steadily not &quot;confronted&quot; <br/>\nanything family say on the matter and simply kept it at me raising <br/>\nKarl.  The adults in these situations have already been raised, so <br/>\nthat&#39;s not my job.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;&gt; Honestly, up till now I&#39;ve kind of kept out of it because to me it <br/>\n </span></blockquote>is obvious -- you have to interact with a little kid (or any person for <br/>\nthat matter) to get them to like you! But maybe it is not so obvious to <br/>\nsome people. &lt;&lt;&lt;&lt;<br/>\n<br/>\nHonestly, I don&#39;t think it&#39;s my business to console or fix things up <br/>\nfor an adult unless I really feel that they want to know what I have to <br/>\nsay (which is *unlikely*).  I&#39;m not going to stop how I parent Karl and <br/>\nmake an exception for anybody.  And I have good reason for making that <br/>\ndecision.<br/>\n<br/>\n~Katherine</div>","specialLinks":[]},{"userId":335633701,"authorName":"DaBreeze21","from":"&quot;DaBreeze21&quot; &lt;susanmay15@...&gt;","profile":"DaBreeze21","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 2-3 yo behavior/interactions with family","postDate":"1239901944","msgId":44081,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzN290byt1ZnNkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdzN2w1ZytzZGhuQGVHcm91cHMuY29tPg=="},"prevInTopic":44077,"nextInTopic":44084,"prevInTime":44080,"nextInTime":44082,"topicId":44070,"numMessagesInTopic":0,"msgSnippet":"Thanks for all of the responses so far. Honestly they are exactly where my head was at, but I am so good at being devil s advocate and seeing the other side","messageBody":"<div id=\"ygrps-yiv-186065479\">Thanks for all of the responses so far. Honestly they are exactly where my head was at, but I am so good at being devil&#39;s advocate and seeing the &quot;other&quot; side (it&#39;s the Gemini in me :-) that it is good for me to hear what people here have to say. <br/>\n<br/>\nOne thing I really like about this list is how it has cleared up for me some things about little kids behavior. I know that it has been talked about before how some parents have gotten the idea that saying &quot;yes&quot; more, means letting their kids do anything they want anywhere. Which is why I got to thinking, maybe I am allowing a behavior from my daughter because I think it is her &quot;right&quot; when really I should be helping to guide her in a better direction. The &quot;goodbye&quot; situation with my sil didn&#39;t bother me that much because honestly I didn&#39;t even want to say goodbye to her after the way she treated us all day. But the &quot;hello&quot; earlier in the weekend I thought maybe I could have helped with. Marisol ran away and was making some funny &quot;animal&quot; noises. I have done all the things suggested too -- holding her and doing group hugs, modeling big hugs and happy hellos myself etc. I think that I am also thinking of stranger situations and how she reacts. I guess what is hard to understand is when you are being an example (for the ADULTS as much as or maybe even more than for the children!) and it is just not being picked up on.<br/>\n<br/>\nAnyways, I know that my sil has been hurt sometimes by my daughter&#39;s reaction and my DH hasn&#39;t helped with a couple of comments that hurt her about not being good with kids. So it has turned into a vicious cycle -- she is not interacting with Marisol, and Marisol reacts in kind. Marisol is actually VERY affectionate once you have gained her trust -- gives SUPER hugs and kisses, and now even says &quot;I love you!&quot; all the time. <br/>\n<br/>\nI did reach out to my sil with an email (and have gotten no response after 3 days), and would love to help them develop a relationship. Honestly, up till now I&#39;ve kind of kept out of it because to me it is obvious -- you have to interact with a little kid (or any person for that matter) to get them to like you! But maybe it is not so obvious to some people.<br/>\n<br/>\nI have NOT responded to my MIL about her email this morning about the pictures. I have had the same thought - to write something and not send it. I actually do pretty well with asserting myself (or confrontations, however you want to look at it.) but am wondering if this is a situation where it is worth it, or better left alone. If she brings it up again, or calls (like she said she was going to in her email) I may try to talk to her about it. One thing I have been thinking about is how having a child definitely complicates relationships, especially with your in-laws! I definitely think that there are comparisons being made to my older sil (different one) that has two kids, and how they parent. It isn&#39;t always easy doing things differently, but I definitely believe it is worth it!<br/>\n<br/>\nAnyways, thanks again. I think that this has helped me the most -- even more than talking with my family. I am also trying to work on my reactions to things and moving on without dwelling on things too much.<br/>\n<br/>\nSusan</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: 2-3 yo behavior/interactions with family","postDate":"1239898096","msgId":44077,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzN2w1ZytzZGhuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdzN2hkcytmODB0QGVHcm91cHMuY29tPg=="},"prevInTopic":44074,"nextInTopic":44081,"prevInTime":44076,"nextInTime":44078,"topicId":44070,"numMessagesInTopic":0,"msgSnippet":"... all day -- didn t talk to her, didn t play, NOTHING, no interaction at all. So honestly, I understand why Marisol didn t care that she was leaving or want","messageBody":"<div id=\"ygrps-yiv-1603301208\"><blockquote><span title=\"ireply\">&gt;&gt;&gt; The thing that gets me though, is that her Aunt did nothing with her<br/>\n </span></blockquote>all day -- didn&#39;t talk to her, didn&#39;t play, NOTHING, no interaction at<br/>\nall. So honestly, I understand why Marisol didn&#39;t care that she was<br/>\nleaving or want to say goodbye... But I am thinking that we can still<br/>\nwork on what is acceptable in general.&gt;&gt;&gt;<br/>\n<br/>\nIt sounds like your daughter behaved in a very appropriate way towards<br/>\nsomeone that had no interest in her.  You treat her like a real person,<br/>\nso of course she will act like one.  If I go to some social outing and<br/>\nthere is someone there that totally ignores me the whole time I&#39;m there,<br/>\neven if they know me, I wouldn&#39;t feel obligated to say goodbye to them<br/>\nwhen they left.  Your sis inlaw has some poor social etiquette, not your<br/>\ndaughter.  Adults set the precedent for how they want to interact with<br/>\nkids.  Clearly she doesn&#39;t want to interact.  Happily help your daughter<br/>\nplay with people that talk to her and befriend her, do group hugs while<br/>\nholding her if family is really into hugging, make sure you do<br/>\nre-introductions while holding her or down on her level by squatting<br/>\ndown with her to say &quot;hi&quot;.  A lot of adults will take that as a cue to<br/>\nsquatt down too, and it really does help.<br/>\n<br/>\nYour sis inlaw was giving a very mixed message of, I don&#39;t want anything<br/>\nto do with you, but you should still be considerate of social niceties<br/>\nsince I&#39;m the adult and your the child.  Honestly, most children are<br/>\nsmart enough to avoid those kind of adults.</div>","specialLinks":[]},{"userId":122460111,"authorName":"Tammy Curry","from":"Tammy Curry &lt;mamabeart00@...&gt;","profile":"mamabeart00","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] 2-3 yo behavior/interactions with family","postDate":"1239897115","msgId":44086,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI3MDQ3OS4zMzEzMy5xbUB3ZWI0NTMwOS5tYWlsLnNwMS55YWhvby5jb20+","inReplyToHeader":"PGdzN2hkcytmODB0QGVHcm91cHMuY29tPg==","referencesHeader":"PGdzN2hkcytmODB0QGVHcm91cHMuY29tPg=="},"prevInTopic":44084,"nextInTopic":44087,"prevInTime":44085,"nextInTime":44087,"topicId":44070,"numMessagesInTopic":0,"msgSnippet":"Susan, I can relate to your daughter s actions completely. While my daughter was gregarious from the get the go, as long as mommy was in plain sight, my son","messageBody":"<div id=\"ygrps-yiv-137080994\">Susan,<br/>\n<br/>\nI can relate to your daughter&#39;s actions completely. While my daughter was gregarious from the get the go, as long as mommy was in plain sight, my son only in the last 6-8 months has felt comfortable with people other than his immediate family (mom, dad, sister and uncle). We never tried to force him to hug anyone or say anything, I would ask him if he wanted to say good bye or hello, or whatever. His Pa-Pa would always be greeted and hugged and all that. As for his uncles and aunts (my brothers and their wives) we do not see them very often, so even now he is a little shy with them at first. The same reactions when we see friends of ours; if it is someone he that has made him uncomfortable in the past he takes a bit to warm up. Of course my family felt that I should force him to do these things and I always said no if he wasn&#39;t comfortable then I wasn&#39;t forcing the issue. So with a little monkey wrapped around me holding on as if he were drowning, I<br/>\n would turn so that he was on the opposite side of my body (sometimes he would let daddy hold him while I did this, other times it just had to be mommy) as I said hellos, good byes and give hugs and kisses on the cheek and that it would be it. Sometimes we would get to the car and he changed his mind. Other times he would already be involved in something else and not interested. <br/>\n<br/>\nWhen your daughter is ready she will interact with family with hellos, goodbyes, etc. If your SIL is not interacting with her at all then I wouldn&#39;t worry about it and being a bit mouthy myself, I would probably say and have said something to the effect of she doesn&#39;t know you to say any of those things. I know that traditionally it is expected of children but even before beginning our unschooling journey there were things that I just wouldn&#39;t force my kids to do, if I saw that they were uncomfortable. It might seem to hurt other people&#39;s feelings but I actually discovered it was more that they felt it was something expected of children and that children should always do as they were told with no respect towards the children&#39;s feelings what so ever. <br/>\n<br/>\nAs for now at 4 yrs old, no matter where we go he tends to greet everyone and start chattering with them as if he has known them his whole life and tells me that he has new friends. <br/>\n<br/>\n <br/>\nTammy Curry, Director of Chaos<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tammycurry.blogspot.com/\">http://tammycurry.blogspot.com/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://crazy-homeschool-adventures.blogspot.com/\">http://crazy-homeschool-adventures.blogspot.com/</a><br/>\n<br/>\n&quot;If a child is to keep alive his inborn sense of wonder, he needs the companionship of at least one adult who can share it, rediscovering with him the joy, excitement and mystery of the world we live in.&quot;<br/>\n<br/>\nRachel Carson<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"katherand@gmail.com","from":"katherand@...","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] 2-3 yo behavior/interactions with family","postDate":"1239896443","msgId":44074,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRkYzk4YWZhZTQ3ZThkYzU3MmZhMDE2NTkwZTQ5NzE5QGdtYWlsLmNvbT4=","inReplyToHeader":"PGdzN2hkcytmODB0QGVHcm91cHMuY29tPg==","referencesHeader":"PGdzN2hkcytmODB0QGVHcm91cHMuY29tPg=="},"prevInTopic":44070,"nextInTopic":44077,"prevInTime":44073,"nextInTime":44075,"topicId":44070,"numMessagesInTopic":0,"msgSnippet":"... (not that you can force them!)-- but I am thinking that Marisol is old enough to start understanding and having conversations about what is appropriate","messageBody":"<div id=\"ygrps-yiv-524505118\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt; I don&#39;t believe in forcing kids to give out hugs and kisses etc <br/>\n </span></blockquote>(not that you can force them!)-- but I am thinking that Marisol is old <br/>\nenough to start understanding and having conversations about what is <br/>\nappropriate &quot;hello and goodbye&quot; behavior, and how her actions make <br/>\nother people feel. When do kids start to display &quot;empathy&quot; and are old <br/>\nenough to understand things like that? &lt;&lt;&lt;&lt;<br/>\n<br/>\nThis varies greatly from child to child.  Even so, three is young, <br/>\nstill a baby really.  Many people expect and coerce children of that <br/>\nage to interact in ways that make absolutely no sense to them.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;&gt; The thing that gets me though, is that her Aunt did nothing with <br/>\n </span></blockquote>her all day -- didn&#39;t talk to her, didn&#39;t play, NOTHING, no interaction <br/>\nat all. So honestly, I understand why Marisol didn&#39;t care that she was <br/>\nleaving or want to say goodbye... But I am thinking that we can still <br/>\nwork on what is acceptable in general. &lt;&lt;&lt;&lt;<br/>\n<br/>\nWhen Karl was three, he said he understood what aunts and uncles are, <br/>\nbut I knew from other things he said and did he didn&#39;t.  Family <br/>\nrelationships take a while to understand.<br/>\n<br/>\nIt seems obvious to an adult that if you just say something, the <br/>\nsignificance translates with the words, but that&#39;s not true.  That&#39;s <br/>\nwhat teaching is based on.<br/>\n<br/>\nTeaching is not the same as learning.  Learning comes from experience <br/>\nover time and finding a place in one&#39;s internal &quot;map&quot; to put different <br/>\npieces of information so that the connections make sense and the <br/>\nvarious bits and pieces are actually useful in getting a person from <br/>\none place to another, to build a body of knowledge.<br/>\n<br/>\nI would say your daughter has no idea who this perfect stranger is <br/>\nthough she&#39;s an aunt.  Even if she understands what &quot;aunts&quot; are, it&#39;s <br/>\nno guarantee that she would want to relate to her since no trust has <br/>\nbeen developed between them yet.<br/>\n<br/>\n~Katherine</div>","specialLinks":[]},{"userId":335633701,"authorName":"DaBreeze21","from":"&quot;DaBreeze21&quot; &lt;susanmay15@...&gt;","profile":"DaBreeze21","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"2-3 yo behavior/interactions with family","postDate":"1239894268","msgId":44070,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdzN2hkcytmODB0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":44074,"prevInTime":44069,"nextInTime":44071,"topicId":44070,"numMessagesInTopic":0,"msgSnippet":"Over Easter we went home and stayed with my in-laws. Easter turned into a not fun at all day for me because my sister-in-law (sil) didn t talk to any of us","messageBody":"<div id=\"ygrps-yiv-685417242\">Over Easter we went home and stayed with my in-laws. Easter turned into a not fun at all day for me because my sister-in-law (sil) didn&#39;t talk to any of us (me, my husband - her brother! - or our, daughter 2.75 yo)<br/>\n<br/>\nI&#39;m not going to get into the whole situation but wanted to touch on some of the issues that seemed relevant to unschooling and that I have been thinking about as far as things I can do differently/better.<br/>\n<br/>\nMarisol will be 3 in July. She is definitely mommy&#39;s girl and we have respected that since she was a baby-- I am home with her and have hardly been away for more than a few hours at a time her whole life. She takes a lot of time to warm up to people -- family included.<br/>\n<br/>\nWhen she sees her Aunt (my sil) she often reacts by running away, or making noises etc. Not exactly a warm welcome. And goodbyes usually don&#39;t involve hugs and kisses which is what my in-laws of course are hoping for.<br/>\n<br/>\nI don&#39;t believe in forcing kids to give out hugs and kisses etc (not that you can force them!)-- but I am thinking that Marisol is old enough to start understanding and having conversations about what is appropriate &quot;hello and goodbye&quot; behavior, and how her actions make other people feel. When do kids start to display &quot;empathy&quot; and are old enough to understand things like that?<br/>\n<br/>\nThe thing that gets me though, is that her Aunt did nothing with her all day -- didn&#39;t talk to her, didn&#39;t play, NOTHING, no interaction at all. So honestly, I understand why Marisol didn&#39;t care that she was leaving or want to say goodbye... But I am thinking that we can still work on what is acceptable in general.<br/>\n<br/>\nAny thoughts or suggestions would be much appreciated!<br/>\n<br/>\nSusan</div>","specialLinks":[]}],"prevTopicId":44114,"nextTopicId":44016}}