{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","replyTo":"LIST","senderId":"ZdRL5DpKBk8NFxBiGDTGPHdhOGWu_p93Lxoxi6gQAyHquSsAjotiZ7aCKP2nBzbG3LpLjc53uzHtZhlrS-8tVrke7g","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Fw: Genetically Engineered Spider Toxin Threatens Butterflies and People","postDate":"964570612","msgId":11547,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAwNzI2MDA0MC5lNlEwZVRBMDk5NzlAc20wMTAxLnByb21lZGlhLm5ldD4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":11546,"nextInTime":11548,"topicId":11547,"numMessagesInTopic":0,"msgSnippet":"This is real folks, not an urban legend and it is good ol Monsanto at it again!  And, it is just this sort of thing that is responsible for the mad-cow","messageBody":"<div id=\"ygrps-yiv-1884259548\">This is real folks, not an urban legend and it is good ol&#39; Monsanto at it<br/>\nagain!  And, it is just this sort of thing that is responsible for the<br/>\nmad-cow disease in Europe (they ground up sheep carcasses to add protein to<br/>\nthe cow feed and the virus jumped the species barrier).<br/>\n<br/>\nLynda<br/>\n<br/>\n============== <br/>\n<blockquote><span title=\"qreply\"> &gt; Genetically Engineered Spider Toxin Threatens Butterflies and People<br/>\n&gt; <br/>\n&gt; For Immediate Release:  July 19, 20000<br/>\n&gt; <br/>\n&gt; Can a deadly spider replace chemical pesticides?  Could this be a<br/>\n&gt; threat to human livers and human health?<br/>\n&gt; <br/>\n&gt; Viruses given a gene for a toxin from one of the world&#39;s deadliest<br/>\n&gt; spiders could replace chemical pesticides, say researchers in the  US.<br/>\n&gt; They plan to carry out field trials, although there are fears about<br/>\n&gt; the wisdom of releasing such viruses.<br/>\n&gt; <br/>\n&gt; Glenn King of the University of Connecticut Health Center in<br/>\n&gt; Farmington and his colleagues recently identified a unique family of<br/>\n&gt; toxins in the venom of a funnel-web spider. These neurotoxins are<br/>\n&gt; lethal when injected into insect tissues, yet have no effect if eaten<br/>\n&gt; by insects or other animals (Nature Structural Biology, vol 7, p 505).<br/>\n&gt; <br/>\n&gt; King&#39;s team is now engineering the gene for one of these toxins into<br/>\n&gt; baculoviruses, common viruses that infect certain moths and<br/>\n&gt; butterflies, and have long been used as &quot;biopesticides.&quot; When the<br/>\n&gt; modified baculovirus infects a butterfly or moth, the insect&#39;s cells<br/>\n&gt; should start to produce the toxin, killing it faster than wild<br/>\n&gt; viruses. Because the host butterfly or moth) dies quickly, before much<br/>\n&gt; virus can replicate, the modified virus shouldn&#39;t persist in the<br/>\n&gt; environment, say the researchers.  Critics contend that the risk to<br/>\n&gt; butterfly and human populations and survival is not worth taking<br/>\n&gt; <br/>\n&gt; &quot;I welcome a potentially environmentally friendly pest control but<br/>\n&gt; it&#39;s abundantly clear we need to be more firm about risk issues,&quot;<br/>\n&gt; comments George McGavin, an entomologist at Oxford University. &quot;If we<br/>\n&gt; are not 100 per cent sure, it shouldn&#39;t be in the field.&quot;<br/>\n&gt; <br/>\n&gt; There have already been several field trials worldwide of<br/>\n&gt; baculoviruses given a gene for a scorpion toxin (New Scientist, 21<br/>\n&gt; January 1995, p 6). However, most of the scorpion toxin made in<br/>\n&gt; infected insects fails to fold into the correct shape, says King. By<br/>\n&gt; contrast, tests in bacteria suggest that almost 100 per cent of the<br/>\n&gt; spider toxin should fold properly, making the virus deadlier.<br/>\n&gt; <br/>\n&gt; King thinks engineering toxin genes into viruses is preferable to<br/>\n&gt; adding them to plants, such as Bt maize. Not only does it mean that<br/>\n&gt; people do not have to eat plants that produce insecticidal toxins, but<br/>\n&gt; only target insects will be affected, he says. &quot;These viruses can be<br/>\n&gt; exquisitely specific, right down to infecting individual species,&quot;<br/>\n&gt; King claims.  &quot;This means that only the pest insects will be killed<br/>\n&gt; whilst beneficial insects such as bees remain unaffected.&quot;<br/>\n&gt; <br/>\n&gt; However, critics fear that the virus will spread into the environment<br/>\n&gt; and affect other kinds of butterflies and moths.  &quot;A containment<br/>\n&gt; environment could not possibly hold a virus,&quot; says McGavin, who<br/>\n&gt; opposed trials of a scorpion toxin virus in Oxfordshire in the 1990s.<br/>\n&gt; &quot;If you could get a specific baculovirus it would be great, but<br/>\n&gt; baculoviruses do pass on {to other species}.&quot;<br/>\n&gt; <br/>\n&gt; &quot;This is problem that really concerns us,&quot; said Alan Moore of the<br/>\n&gt; Butterfly Gardeners Association, a local group that advocates for the<br/>\n&gt; conservation of butterflies and their habits.  This is at least the<br/>\n&gt; third time that Genetically Modified Organisms, GMOs have been<br/>\n&gt; targeted against butterflies.<br/>\n&gt; <br/>\n&gt; Bt-corn has genes from the bacterium Bacillus thuringiensis spliced<br/>\n&gt; into the plant genes and its toxin is carried by wind-driven pollen to<br/>\n&gt; the leaves of milkweed where they can poison monarch caterpillars<br/>\n&gt; feeding on milkweed.  &quot;I think this clearly shows transgenic corn<br/>\n&gt; could be a serious threat to monarchs,&quot; said Rebecca Goldburg, a<br/>\n&gt; senior scientist with the New York-based Environmental Defense Fund in<br/>\n&gt; a story published by the San Francisco Chronicle about Bt-corn . &quot;I<br/>\n&gt; doubt if it would push them over the edge by itself, but it adds<br/>\n&gt; substantially to the other risks they face.&quot;<br/>\n&gt; <br/>\n&gt; Moore makes the point that the industry states that Bt-corn alone<br/>\n&gt; could not push monarchs and other butterflies over the edge, but a<br/>\n&gt; combination of other Monsanto and industry innovations just might.<br/>\n&gt; &quot;Now we have Roundup ready crops and spider poison enhanced butterfly<br/>\n&gt; pathogens to deal with. Roundup ready crops are a direct threat in<br/>\n&gt; that they target milkweed, the monarch&#39;s host plant, as well as a<br/>\n&gt; whole spectrum of annual and perennial weeds for elimination.  Many of<br/>\n&gt; these weeds are host plants for other butterflies as well,&quot; says Moore<br/>\n&gt; <br/>\n&gt; There are also fears that the toxin gene might be transferred to other<br/>\n&gt; viruses. &quot;There is no instance of a toxin gene jumping from virus A to<br/>\n&gt; virus B,&quot; says Bruce Hammock of the University of California, Davis,<br/>\n&gt; who is also working on modified baculoviruses. &quot;But if it jumped, the<br/>\n&gt; new virus would become less effective.&quot;<br/>\n&gt; <br/>\n&gt; Jenny Cory of the Centre for Ecology and Hydrology in Oxford agrees<br/>\n&gt; transfer of the toxin gene is unlikely, but thinks further tests would<br/>\n&gt; be helpful. &quot;It&#39;s a vicious circle,&quot; she says, &quot;you have to do a risk<br/>\n&gt; assessment before you do the experiment but we don&#39;t know all the<br/>\n&gt; risks without doing field experiments in the first place.&quot;<br/>\n&gt; <br/>\n&gt;   &quot;Soon after GM virus were developed for insect control it was found<br/>\n&gt; that baculovirus were capable of infecting human liver cells,&quot; says<br/>\n&gt; Joe Cummins, Prof. Emeritus at the University of Western Ontario.<br/>\n&gt; &quot;For that reason baculovirus vectors were developed to treat liver<br/>\n&gt; disease. Interestingly, the fact that baculovirus can infect human<br/>\n&gt; liver cells seems to have been ignored by those developing the virus<br/>\n&gt; for commercial pest control. The following discussion will deal with<br/>\n&gt; the use of baculovirus vectors and their safety. I understand that<br/>\n&gt; there has been a great deal of pressure to hasten approval of the GM<br/>\n&gt; baculovirus for pest control.&quot;<br/>\n&gt; <br/>\n&gt; &quot;Ecological considerations for the impact of recombinant baculovirus<br/>\n&gt; insecticides have been studied extensively. Impact on non-target<br/>\n&gt; insects is extrapolated from insects of related phylogeny, a practice<br/>\n&gt; difficult to defend. The recombinant baculovirus were very persistent<br/>\n&gt; and capable of reshaping an ecosystem.&quot;<br/>\n&gt; <br/>\n&gt; &quot;Baculovirus is a circular DNA duplex, it replicates in the insect<br/>\n&gt; cell nucleus and replication is prone to the generation of defective<br/>\n&gt; genomes by deletion. The mode of virus replication seems to make the<br/>\n&gt; recombinant virus highly unpredictable and prone to generating<br/>\n&gt; potentially undesirable variants. This important finding has not yet<br/>\n&gt; influenced the risk analysis of recombinant baculovirus insecticides<br/>\n&gt; and gene therapy vectors.&quot;<br/>\n&gt; <br/>\n&gt; &quot;The most disconcerting finding is the one showing that replication of<br/>\n&gt; the baculovirus is inherently unpredictable, says Cummins. &quot;There may<br/>\n&gt; be some who believe that we should all have unlabelled liver gene<br/>\n&gt; therapy with our salads.<br/>\n&gt; <br/>\n&gt; &quot;We need to educate the American consumer on the threats of GMOs to<br/>\n&gt; human health and butterflies, says Moore.  That is why we have joined<br/>\n&gt; Bay Area Rage, Global Exchange, the Bay Area Seed Interchange Library,<br/>\n&gt; the Berkeley Ecology Center, and the Organic Consumers Association in<br/>\n&gt; bringing this issue before the public.  That is why we are here today<br/>\n&gt; at this Market Street Safeway in San Francisco.&quot;<br/>\n&gt; <br/>\n&gt; Prepared by New Scientist authors Mark Robins and Michael Le Page (New<br/>\n&gt; Scientist issue: 17th June 2000), Butterfly Gardeners director Alan<br/>\n&gt; Moore, and Prof. Joe Cummins of  University of Western Ontario </span></blockquote></div>","specialLinks":[]}],"prevTopicId":11508,"nextTopicId":11548}}