{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":0,"authorName":"susan","from":"susan &lt;fxfireob@...&gt;","replyTo":"LIST","senderId":"HUSBa2P1PI-hqlOAf7_WtjX2jM7xMHMXp4YSd2qiUIfzGWuf9wAq8vktxH_jCCeBYmT__qORcIzqrIYjhlaSBzQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] neighbor kid rant and question","postDate":"957809298","msgId":8459,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5MTcwMjZGLjIyRDlCMDREQGZsYXNoLm5ldD4=","referencesHeader":"PDkyLjQ4MWI2ZDEuMjY0NmYzOTdAYW9sLmNvbT4="},"prevInTopic":8458,"nextInTopic":0,"prevInTime":8458,"nextInTime":8460,"topicId":8449,"numMessagesInTopic":0,"msgSnippet":"hi, i guess my 2 cents would be set up ground rules w/ both your dd s and the neighbor girl.  you take the position of authority and say: we have a different ","messageBody":"<div id=\"ygrps-yiv-1765221223\">hi,<br/>\n<br/>\ni guess my 2 cents would be set up ground rules w/ both your dd&#39;s and the<br/>\nneighbor girl.  you take the position of authority and say: &#39;we have a different<br/>\nvalue structure then the one you are talking about, we value time together above<br/>\nall else.  i think it&#39;s wonderful that you have many beautiful things and i know<br/>\nmy dd&#39;s would love to have a horse but we do things a little different.&#39;  then<br/>\nexplain to her what you value and how your day looks.  that way you remove the<br/>\nelement of judging and comparing lifestyles and turn the situation to a learning<br/>\nexperience for the neighbor girl (broaden her horizons so to speak) and at the<br/>\nsame time &#39;disempower&#39; her because, as you have described this girl (and pop<br/>\nculture/ps re-inforces this), she appears to believe that because she was more<br/>\nmaterial things she is better (and perhaps more powerful) than those who have<br/>\nless.  the reality is it&#39;s apples and oranges and lifestyles and personal values<br/>\nare not comparable they just are.<br/>\n<br/>\nit&#39;s hard to know why people do what they do but if you set up some boundaries<br/>\nand this girl doesn&#39;t respect them (i.e. rubbing it in that she has things your<br/>\ndd&#39;s don&#39;t) she isn&#39;t being a friend and then you need to act.   it would be a<br/>\ngood lesson for your dd&#39;s learn how to discern who is being friendly and who is<br/>\nnot, as well as learn not to envy what other&#39;s have but to relish what they<br/>\nthemselves have.  we are on the poor side and my son is very aware that other<br/>\nhave things that we don&#39;t have (and vice versa), for both reasons of finance and<br/>\nlifestyle,  and he&#39;s learned to see the world differently and appreciate what we<br/>\nhave as a family.<br/>\n<br/>\ngood luck,<br/>\nsusan, thad<br/>\n& rene&#39; 4<br/>\naustin, tx<br/>\n&#39;unity through diversity&#39;<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolr2@...\">unschoolr2@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; Hi all,<br/>\n&gt;<br/>\n&gt; I have a question, I came to you all because many of you know how I feel<br/>\n&gt; about the things I am going to talk about.<br/>\n&gt;<br/>\n&gt; I have a problem with the neighbor girl. My ds and dd are 10 and 9. The<br/>\n&gt; neighbor girl is 13 and public schooled. Now I know many very sweet ps teens<br/>\n&gt; so please don&#39;t think I am being purely prejudice. I feel like an ogre when I<br/>\n&gt; say that I can&#39;t stand this girl. She is one of the most self centered people<br/>\n&gt; I have ever met, adult or child. Almost to the point of being sociopathic. I<br/>\n&gt; have tried to keep my children and her fairly separate over the past three<br/>\n&gt; years, simply because this girl welds the age thing over my children&#39;s heads<br/>\n&gt; so effectively. The power is not equal, you know what I mean? She is very<br/>\n&gt; manipulative and talks incessantly about what her parents buy her, how much<br/>\n&gt; her clothes cost, how she has a horse, (which my dd in the middle of a horse<br/>\n&gt; phase would love to have.) and I feel it is breeding discontent, in my<br/>\n&gt; daughter especially. We have chosen to live more deliberately. We have told<br/>\n&gt; our children many times why we live as we do, so that we can spend more time<br/>\n&gt; together, do more things together ect.<br/>\n&gt;<br/>\n&gt; For some reason my kids seem to hang on her every word. Which frustrates me<br/>\n&gt; to know end as I have tried to raise them outside the box. I am not an<br/>\n&gt; isolationist. I want my children to be exposed to a variety of ideas and<br/>\n&gt; people. But I am worried about the influence the girl will have on my<br/>\n&gt; daughter. They have plenty of friends but this girl is so close that it is<br/>\n&gt; hard. I am not especially welcoming to this child but she doesn&#39;t take the<br/>\n&gt; hint very well. I feel horrible..... she is just a child.... but really I<br/>\n&gt; don&#39;t feel like this is good for my DD who seems to be easily influenced.<br/>\n&gt;<br/>\n&gt; So the question. Do I just say enough is enough tell the neighbor lady<br/>\n&gt; sweetly that I feel her dughter is just too old to play with my daughter?<br/>\n&gt; Which, of course, is going to create horrible neighborhood relations. I have<br/>\n&gt; tried just keeping the kids otherwise occupied when she is around but I don&#39;t<br/>\n&gt; want to feel like I can&#39;t even let my kids out to play!!!!! LOL This girls<br/>\n&gt; best friend, across the street, will be moving away and summer is<br/>\n&gt; coming.......I see conflict ahead. Any advice???? Any at all??? Even if it is<br/>\n&gt; just to tell me how horrible I am for having such a deep dislike for a<br/>\n&gt; child??? &lt;g&gt;<br/>\n&gt; Thanks<br/>\n&gt; Teri<br/>\n&gt;<br/>\n&gt; ------------------------------------------------------------------------<br/>\n&gt; You have a voice mail message waiting for you at iHello.com:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://click.egroups.com/1/3555/11/_/448294/_/957716894/\">http://click.egroups.com/1/3555/11/_/448294/_/957716894/</a><br/>\n&gt; ------------------------------------------------------------------------<br/>\n&gt;<br/>\n&gt; Message boards, timely articles, a free newsletter and more!<br/>\n&gt; Check it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt; To Unsubscribe: mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@onelist.com\">Unschooling-dotcom-unsubscribe@onelist.com</a> </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"Marcy Ellis","from":"&quot;Marcy Ellis&quot; &lt;bravesoul69@...&gt;","replyTo":"LIST","senderId":"Ga0mNfTz8YnsMR-aMY3O1l6QtlqUBFS0wP2oVia49Mq1-W86bx4qegE-Hc4Pmpi1gtOSYaq9nzlHjyqgDkWXSRcioLDZ490HR6eZBJXy","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] neighbor kid rant and question","postDate":"957795107","msgId":8458,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAwNTA4MTQxMTQ3LjQ4OTIwLnFtYWlsQGhvdG1haWwuY29tPg=="},"prevInTopic":8457,"nextInTopic":8459,"prevInTime":8457,"nextInTime":8459,"topicId":8449,"numMessagesInTopic":0,"msgSnippet":"Teri, I don t think you re an ogre at all.  I guess we re all familiar with this kind of situation.   We moved here just last Nov.  And the kids have found ","messageBody":"<div id=\"ygrps-yiv-288048651\">Teri,<br/>\n<br/>\nI don&#39;t think you&#39;re an ogre at all.  I guess we&#39;re all familiar with this <br/>\nkind of situation.   We moved here just last Nov.  And the kids have found <br/>\nother short people to play with.  Wonderful!  However, we&#39;ve come to find <br/>\nout that the family directly behind us, across the alley, have a tendency <br/>\ntowards lying.<br/>\nI am not keen on lying.  First it was my son coming home telling me that C <br/>\nwas kinda mean and had lied to him about this or that.  So, I advised my son <br/>\nto play, have fun, but know that C is just this way.  If he should ever feel <br/>\nthat C is leading them into something &quot;wrong&quot; or is simply uncomfortable <br/>\naround C, that he&#39;s just to come home for a while.  Then my little girl was <br/>\nout playing when C&#39;s older sister came over to play with her.  The girl, K, <br/>\nis really too old for Mackenzie.  But, I thought, no big deal, they are <br/>\nwhere I could see them.  Well, after a while, Mackenzie and K came into the <br/>\nhouse.  M said that K asked her to go play at her house.  I agreed thinking <br/>\nthat after a short time, I&#39;d go get her.  My daughter&#39;s NEARLY 5, and K is <br/>\nabout 11.<br/>\nWell, I didn&#39;t have to go get her.  After a while, M came home and said &quot;I&#39;m <br/>\nhere, Mom, where are we going?&quot;  I told her we weren&#39;t going anywhere and <br/>\nasked her why she tho&#39;t we were.  She said that K&#39;s Mom had told her that <br/>\nshe had to go home now, cuz her Mom (me) was calling her and that we were <br/>\ngonna go somewhere.   I was livid!!!<br/>\nI told Mackenzie that I had not been calling for her; but that I DID want <br/>\nher home.  I told her that K was really too old for her and that I did not <br/>\nwant her to play with K anymore.  I then became the &quot;stand-in-friend&quot; for <br/>\nMackenzie...as there aren&#39;t any little girls her age in the neighborhood.<br/>\nAnyway,  I was so disgusted.  Gee, how difficult is it to use your brain and <br/>\ncome up with a statement like &quot;M....we have somethings we need to do today, <br/>\nyou&#39;ll have to go home now...&quot; or whatever???  But, God forbid we should <br/>\nover-exert ourselves mentally!!!   I nearly went over and banged on her <br/>\nback-door and explained just how low I felt that was.  Not only did she lie <br/>\nto a four yr. old, but involved ME in it as well.<br/>\nHOWEVER... I did not.  I had developed a bit of a bad attitude toward C <br/>\nalready.  And now, not holding his mother in high esteem.  I know better <br/>\nthan to think it&#39;s my job to &quot;save the world&quot;.  But, I believe very much <br/>\nthat, if we&#39;re willing, we can make a difference in our own little corner of <br/>\nthe world.  I also know my ability to annihilate others verbally when I&#39;m <br/>\nangry.  I have learned to use my powers for good and not for evil. (I hope.) <br/>\n  :)<br/>\nC had been in our home a few times, full of boastings and tall tales and I <br/>\nwas very smart-mouthed toward him.  My way of letting him know, I didn&#39;t buy <br/>\nhis &quot;stuff&quot;.  OBVIOUSLY, he can&#39;t help that he&#39;s being raised by an idiot.  <br/>\n:)  ha ha   It&#39;s a ferocious cycle.  I&#39;m sure she has reasons for having <br/>\nbecome a mindless, careless boob.<br/>\nAnyway....I do want to be a help to people (in general).  Now, me <br/>\npersonally, I&#39;m not open to people who&#39;re looking down their schnoz at me in <br/>\ndisgust.  I will not allow that person to help me in anyway.  None of us are <br/>\nopen to being rejected.  So,  I&#39;ve chosen to be kind and understanding.  I <br/>\nhaven&#39;t confronted the Mom, and won&#39;t unless it really is necessary.  As for <br/>\nC, well, the last time I saw him, he burst into my house unannouced, yelling <br/>\nfor my son.  I caught him, and told him that Josh wasn&#39;t home.  And very <br/>\ncalmly and politely (tho&#39; I could NOT believe the nerve of this kid to enter <br/>\nmy home without so much as a knock or ringing the doorbell), I said <br/>\n&quot;Charlie, please do NOT come into my house again without first knocking or <br/>\nringing the doorbell.&quot;<br/>\n&quot;I did ring the doorbell&quot; he said.  &quot;No, Charlie.  If you had, I would&#39;ve <br/>\nheard it.  From now on, you stay outside until I come to the door.  You&#39;ll <br/>\nhave to wait; but I promise if you ring the bell I WILL come.  Okay?!!!&quot;  I <br/>\ntold him.   He agreed.<br/>\nMy son still plays with C on occasion; but it&#39;s gotten to the point that <br/>\nI&#39;ve told Josh that he&#39;s only allowed to play with him when others are <br/>\naround.  Not alone.   And I&#39;ve told him that he isn&#39;t have to say anything <br/>\nmean or hurtful back at C.  He&#39;s the way he is and acting like him isn&#39;t <br/>\ngoing to help.<br/>\nDo what you feel is best for your children and explain to them why.  Even <br/>\npolitely telling the older girl the rules of your household and letting her <br/>\nknow she must abide by them when she&#39;s there.  Maybe making the rule that <br/>\nyour kids are only allowed around her at your home.<br/>\nYou are a kind and tho&#39;tful person.  You&#39;ll think of a way of protecting <br/>\nyour kids without crushing this other child.  And if the girl&#39;s Mom, is <br/>\nsomehow offended in the process, consider the source.  You have to do what <br/>\nis best for your family.<br/>\nWell, that&#39;s my 2 cents, for what it&#39;s worth.  :)  :)  :)<br/>\nHave a good day!<br/>\n~~~Marcy~~~<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolr2@...\">unschoolr2@...</a><br/>\n&gt;Reply-To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@egroups.com\">Unschooling-dotcom@egroups.com</a><br/>\n&gt;To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@egroups.com\">Unschooling-dotcom@egroups.com</a><br/>\n&gt;Subject: [Unschooling-dotcom] neighbor kid rant and question<br/>\n&gt;Date: Sun, 7 May 2000 12:28:07 EDT<br/>\n&gt;<br/>\n&gt;Hi all,<br/>\n&gt;<br/>\n&gt;I have a question, I came to you all because many of you know how I feel<br/>\n&gt;about the things I am going to talk about.<br/>\n&gt;<br/>\n&gt;I have a problem with the neighbor girl. My ds and dd are 10 and 9. The<br/>\n&gt;neighbor girl is 13 and public schooled. Now I know many very sweet ps <br/>\n&gt;teens<br/>\n&gt;so please don&#39;t think I am being purely prejudice. I feel like an ogre when <br/>\n&gt;I<br/>\n&gt;say that I can&#39;t stand this girl. She is one of the most self centered <br/>\n&gt;people<br/>\n&gt;I have ever met, adult or child. Almost to the point of being sociopathic. <br/>\n&gt;I<br/>\n&gt;have tried to keep my children and her fairly separate over the past three<br/>\n&gt;years, simply because this girl welds the age thing over my children&#39;s <br/>\n&gt;heads<br/>\n&gt;so effectively. The power is not equal, you know what I mean? She is very<br/>\n&gt;manipulative and talks incessantly about what her parents buy her, how much<br/>\n&gt;her clothes cost, how she has a horse, (which my dd in the middle of a <br/>\n&gt;horse<br/>\n&gt;phase would love to have.) and I feel it is breeding discontent, in my<br/>\n&gt;daughter especially. We have chosen to live more deliberately. We have told<br/>\n&gt;our children many times why we live as we do, so that we can spend more <br/>\n&gt;time<br/>\n&gt;together, do more things together ect.<br/>\n&gt;<br/>\n&gt;For some reason my kids seem to hang on her every word. Which frustrates me<br/>\n&gt;to know end as I have tried to raise them outside the box. I am not an<br/>\n&gt;isolationist. I want my children to be exposed to a variety of ideas and<br/>\n&gt;people. But I am worried about the influence the girl will have on my<br/>\n&gt;daughter. They have plenty of friends but this girl is so close that it is<br/>\n&gt;hard. I am not especially welcoming to this child but she doesn&#39;t take the<br/>\n&gt;hint very well. I feel horrible..... she is just a child.... but really I<br/>\n&gt;don&#39;t feel like this is good for my DD who seems to be easily influenced.<br/>\n&gt;<br/>\n&gt;So the question. Do I just say enough is enough tell the neighbor lady<br/>\n&gt;sweetly that I feel her dughter is just too old to play with my daughter?<br/>\n&gt;Which, of course, is going to create horrible neighborhood relations. I <br/>\n&gt;have<br/>\n&gt;tried just keeping the kids otherwise occupied when she is around but I <br/>\n&gt;don&#39;t<br/>\n&gt;want to feel like I can&#39;t even let my kids out to play!!!!! LOL This girls<br/>\n&gt;best friend, across the street, will be moving away and summer is<br/>\n&gt;coming.......I see conflict ahead. Any advice???? Any at all??? Even if it <br/>\n&gt;is<br/>\n&gt;just to tell me how horrible I am for having such a deep dislike for a<br/>\n&gt;child??? &lt;g&gt;<br/>\n&gt;Thanks<br/>\n&gt;Teri<br/>\n<br/>\n </span></blockquote>________________________________________________________________________<br/>\nGet Your Private, Free E-mail from MSN Hotmail at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.hotmail.com\">http://www.hotmail.com</a></div>","specialLinks":[]},{"userId":0,"authorName":"marbleface@aol.com","from":"marbleface@...","replyTo":"LIST","senderId":"8TKdF4UkE4IDwCh0gI1YHOH_nJ5bZ8OVop4543BXegKwS63AbCG0W4HyasBpwEBQfaWhw2MqibDD","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] neighbor kid rant and question","postDate":"957789559","msgId":8457,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY5LjRhN2FiMzAuMjY0ODBmNzdAYW9sLmNvbT4="},"prevInTopic":8456,"nextInTopic":8458,"prevInTime":8456,"nextInTime":8458,"topicId":8449,"numMessagesInTopic":0,"msgSnippet":"In a message dated 05/08/2000 11:00:41 AM !!!First Boot!!!, sulan@home.com writes: ","messageBody":"<div id=\"ygrps-yiv-479068862\">In a message dated 05/08/2000 11:00:41 AM !!!First Boot!!!, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sulan@...\">sulan@...</a> <br/>\nwrites:<br/>\n<br/>\n&lt;&lt;  Is there ever a time you are able to show the poor<br/>\n boy some kindness, as it is obvious he&#39;s really lacking in anyone caring<br/>\n for him.  When kids like that grow up they often become societal<br/>\n problems we will all have to deal with on some level.  Anything to help<br/>\n the poor child along a different path if at all possible?  I know, I<br/>\n know, easier said than done... <br/>\n <br/>\n Sonia &gt;&gt;<br/>\n<br/>\nYep.  He&#39;s at our house all the time.  But at arms length.  He&#39;s not as <br/>\nwelcome for as long as he would like -- which seems to be forever.  But I not <br/>\ngoing to adopt him :) so he just stops by and he plays and then I send him <br/>\n&quot;home&quot; -- I&#39;m pretty sure he never actually goes home from here.  As I said, <br/>\nI predict he ends up in prison.  Even in our middle class/working class <br/>\nnormal neighborhood, everybody knows where to go if you want drugs or other <br/>\ntrouble.  So, it shouldn&#39;t take him long.  There was another crop of these <br/>\nboys a few years back.  The oldest now has a job at the local supermarket.  <br/>\nThis after having been arrested several times and then finally becoming <br/>\nwhat-looks-to-be partially disabled due to a drug overdose.  This is <br/>\nconjecture on my part from knowing he and some other neighbor kids had to be <br/>\nrushed to the hospital from eating some sort of flower that is popular around <br/>\nhere and now he looks like a mini-hunchback and has apparently straightened <br/>\nout a little, gotten this job anyway.  His younger brother (9?) still roams <br/>\nthe street.  These are the children of one of the local police officers.  <br/>\nYep, I know it&#39;s a harsh old world out there and that this is one way kids <br/>\nget started in the job of screwing up their lives and it is, in my mind, very <br/>\nlargely the parents&#39; fault -- but I can&#39;t fix it.  I let the kid in to play <br/>\nsometimes but that&#39;s as far as it goes.<br/>\n<br/>\nNance</div>","specialLinks":[]},{"userId":0,"authorName":"george howard","from":"&quot;george howard&quot; &lt;geoalmac@...&gt;","replyTo":"LIST","senderId":"b4LpSPZGQ6N7p2QiseD1ZR3Erm6sf6lr2-iTcQ_fa55zRgmc9MFM2Z4P_MnsT7U7JWAxSgngv1toqw5P9708HTkdAGbaxsP_SrI","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] neighbor kid rant and question","postDate":"957729682","msgId":8449,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTQwMWJmYjg1ZiQwNGMwYTA4MCQyOWNmMTAxOEBwb3RsbmQxLm9yLmhvbWUuY29tPg==","referencesHeader":"PDkyLjQ4MWI2ZDEuMjY0NmYzOTdAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":8450,"prevInTime":8448,"nextInTime":8450,"topicId":8449,"numMessagesInTopic":0,"msgSnippet":"Hi Teri, it s obvious you feel guilty about having negative feelings about a child, but don t let that stand in the way of your continuing to do what is right","messageBody":"<div id=\"ygrps-yiv-631138569\">Hi Teri, it&#39;s obvious you feel guilty about having negative feelings about a<br/>\nchild, but don&#39;t let that stand in the way of your continuing to do what is<br/>\nright for your kids! I went to public school and although it was 20 years<br/>\nago I remember some 13 year old girls as being incredibly nasty. They seemed<br/>\nto delight in making other girls miserable.<br/>\nThe best way to talk to the girl&#39;s mother might be to take all the blame<br/>\nonto yourself, or your kids, rather than suggest anything unpleasant about<br/>\nher daughter. Maybe mention how mature and grown up her daughter is, and how<br/>\nthe combination of that and her &quot;material advantages&quot; is causing some real<br/>\nself-esteem problems for your daughter, who just can&#39;t compare with hers in<br/>\nall her wonderfullness. (Try not to snicker)<br/>\nNeighbor Mom will probably think to herself that it is understandable that<br/>\nher darling might be intimidating to others not so lucky, and explain to her<br/>\ndaughter that there will always be those who are jealous of her gifts. Of<br/>\ncourse, this wouldn&#39;t work if you can&#39;t keep a straight face. Best of<br/>\nLuck--Allison<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\nFrom: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolr2@...\">unschoolr2@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@egroups.com\">Unschooling-dotcom@egroups.com</a>&gt;<br/>\nSent: Sunday, May 07, 2000 9:28 AM<br/>\nSubject: [Unschooling-dotcom] neighbor kid rant and question<br/>\n<br/>\n<br/>\n&gt; Hi all,<br/>\n&gt;<br/>\n&gt; I have a question, I came to you all because many of you know how I feel<br/>\n&gt; about the things I am going to talk about.<br/>\n&gt;<br/>\n&gt; I have a problem with the neighbor girl. My ds and dd are 10 and 9. The<br/>\n&gt; neighbor girl is 13 and public schooled. Now I know many very sweet ps<br/>\nteens<br/>\n&gt; so please don&#39;t think I am being purely prejudice. I feel like an ogre<br/>\nwhen I<br/>\n&gt; say that I can&#39;t stand this girl. She is one of the most self centered<br/>\npeople<br/>\n&gt; I have ever met, adult or child. Almost to the point of being sociopathic.<br/>\nI<br/>\n&gt; have tried to keep my children and her fairly separate over the past three<br/>\n&gt; years, simply because this girl welds the age thing over my children&#39;s<br/>\nheads<br/>\n&gt; so effectively. The power is not equal, you know what I mean? She is very<br/>\n&gt; manipulative and talks incessantly about what her parents buy her, how<br/>\nmuch<br/>\n&gt; her clothes cost, how she has a horse, (which my dd in the middle of a<br/>\nhorse<br/>\n&gt; phase would love to have.) and I feel it is breeding discontent, in my<br/>\n&gt; daughter especially. We have chosen to live more deliberately. We have<br/>\ntold<br/>\n&gt; our children many times why we live as we do, so that we can spend more<br/>\ntime<br/>\n&gt; together, do more things together ect.<br/>\n&gt;<br/>\n&gt; For some reason my kids seem to hang on her every word. Which frustrates<br/>\nme<br/>\n&gt; to know end as I have tried to raise them outside the box. I am not an<br/>\n&gt; isolationist. I want my children to be exposed to a variety of ideas and<br/>\n&gt; people. But I am worried about the influence the girl will have on my<br/>\n&gt; daughter. They have plenty of friends but this girl is so close that it is<br/>\n&gt; hard. I am not especially welcoming to this child but she doesn&#39;t take the<br/>\n&gt; hint very well. I feel horrible..... she is just a child.... but really I<br/>\n&gt; don&#39;t feel like this is good for my DD who seems to be easily influenced.<br/>\n&gt;<br/>\n&gt; So the question. Do I just say enough is enough tell the neighbor lady<br/>\n&gt; sweetly that I feel her dughter is just too old to play with my daughter?<br/>\n&gt; Which, of course, is going to create horrible neighborhood relations. I<br/>\nhave<br/>\n&gt; tried just keeping the kids otherwise occupied when she is around but I<br/>\ndon&#39;t<br/>\n&gt; want to feel like I can&#39;t even let my kids out to play!!!!! LOL This girls<br/>\n&gt; best friend, across the street, will be moving away and summer is<br/>\n&gt; coming.......I see conflict ahead. Any advice???? Any at all??? Even if it<br/>\nis<br/>\n&gt; just to tell me how horrible I am for having such a deep dislike for a<br/>\n&gt; child??? &lt;g&gt;<br/>\n&gt; Thanks<br/>\n&gt; Teri<br/>\n&gt;<br/>\n&gt; ------------------------------------------------------------------------<br/>\n&gt; You have a voice mail message waiting for you at iHello.com:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://click.egroups.com/1/3555/11/_/448294/_/957716894/\">http://click.egroups.com/1/3555/11/_/448294/_/957716894/</a><br/>\n&gt; ------------------------------------------------------------------------<br/>\n&gt;<br/>\n&gt; Message boards, timely articles, a free newsletter and more!<br/>\n&gt; Check it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt; To Unsubscribe: mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@onelist.com\">Unschooling-dotcom-unsubscribe@onelist.com</a><br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"Tracy Oldfield","from":"&quot;Tracy Oldfield&quot; &lt;Tracy@...-online.co.uk&gt;","replyTo":"LIST","senderId":"jfvbzx_mVZNaLblBtpP8JzzdnH-LpTUDHFSTMLRHFANANUgbqnHHfAfTQVvyw2_cVpNnmQb-Aa0VsYbND_JngD6ftYCht_Azif7sKCOOPBog8hTBQ5J6_Wli","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] neighbor kid rant and question","postDate":"957729362","msgId":8451,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzMwMWJmYjg1ZiQ2MmM4ZTQ4MCRjNzQxOWZkNEBsaW5rMTA1MjY2Pg==","referencesHeader":"PDkyLjQ4MWI2ZDEuMjY0NmYzOTdAYW9sLmNvbT4gPDAwMTQwMWJmYjg1ZiQwNGMwYTA4MCQyOWNmMTAxOEBwb3RsbmQxLm9yLmhvbWUuY29tPg=="},"prevInTopic":8450,"nextInTopic":8456,"prevInTime":8450,"nextInTime":8452,"topicId":8449,"numMessagesInTopic":0,"msgSnippet":"I like this idea, but I don t think I d be able to keep my face straight :-)  What about the old killing her with kindness thing, actually invite her round,","messageBody":"<div id=\"ygrps-yiv-1173688652\">\n<html><head>\n \n \n<style></style>\n</head>\n \n<div><font size=\"2\">I like this idea, but I don&#39;t think I&#39;d be able to keep my \nface straight :-)&nbsp; What about the old &#39;killing her with kindness&#39; thing, \nactually invite her round, but while she&#39;s visiting, you stick to behaviour \nground rules like no gloating, etc, cos it makes others feel bad.&nbsp; I&#39;ve \njust finished re-reading Faber &amp; Mazlish&#39;s &#39;Siblings Without Rivalry&#39; and I \nthink that as long as she knows that it&#39;s not acceptable to you to behave that \nway, she might just hold off while she&#39;s in your presence.&nbsp; There was a \nsimilar discussion to this on another list, (different circumstances, but still) \nand the response I liked most was that the children could get together at the \nconcerned mum&#39;s house, but not at the other, it was a case of inadequate \nsupervision (in the eyes of the parent on the list)&nbsp; Treat her with \nrespect, but not at the expense of your own children.&nbsp; And no I don&#39;t think \nyou&#39;re an ogre to think this way about other children, there is one on my street \nwho I&#39;m not keen on either :-)</font></div>\n<div>&nbsp;</div>\n<div><font size=\"2\">Good Luck!</font></div>\n<div><font size=\"2\">Tracy</font></div>\n<blockquote><span title=\"qreply\"> <blockquote\n style=\"BORDER-LEFT:#000000 2px solid;MARGIN-LEFT:5px;MARGIN-RIGHT:0px;PADDING-LEFT:5px;PADDING-RIGHT:0px;\">\n  <div style=\"FONT:10pt arial;\">----- Original Message ----- </div>\n  <div\n style=\"BACKGROUND:#e4e4e4;FONT:10pt arial;\"><b>From:</b> \n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:geoalmac@...\" title=\"geoalmac@...\">george howard</a> \n  </div>\n  <div style=\"FONT:10pt arial;\"><b>To:</b> <a rel=\"nofollow\"\n target=\"_blank\" href=\"mailto:Unschooling-dotcom@egroups.com\"\n title=\"Unschooling-dotcom@egroups.com\">Unschooling-dotcom@egroups.com</a> </div>\n  <div style=\"FONT:10pt arial;\"><b>Sent:</b> Sunday, May 07, 2000 9:01 PM</div>\n  <div style=\"FONT:10pt arial;\"><b>Subject:</b> Re: [Unschooling-dotcom] \n  neighbor kid rant and question</div>\n  <div><br></div><tt>Hi Teri, it&#39;s obvious you feel guilty about having negative \n  feelings about a<br>child, but don&#39;t let that stand in the way of your \n  continuing to do what is<br>right for your kids! I went to public school and \n  although it was 20 years<br>ago I remember some 13 year old girls as being \n  incredibly nasty. They seemed<br>to delight in making other girls \n  miserable.<br>The best way to talk to the girl&#39;s mother might be to take all \n  the blame<br>onto yourself, or your kids, rather than suggest anything \n  unpleasant about<br>her daughter. Maybe mention how mature and grown up her \n  daughter is, and how<br>the combination of that and her &quot;material advantages&quot; \n  is causing some real<br>self-esteem problems for your daughter, who just can&#39;t \n  compare with hers in<br>all her wonderfullness. (Try not to \n  snicker)<br>Neighbor Mom will probably think to herself that it is \n  understandable that<br>her darling might be intimidating to others not so \n  lucky, and explain to her<br>daughter that there will always be those who are \n  jealous of her gifts. Of<br>course, this wouldn&#39;t work if you can&#39;t keep a \n  straight face. Best of<br>Luck--Allison<br></tt></blockquote></span></blockquote></html> \n</div>","specialLinks":[]},{"userId":0,"authorName":"marbleface@aol.com","from":"marbleface@...","replyTo":"LIST","senderId":"XYj6Y5me4BeJetO7XbabFKHkDe5A9IRQE_y1HUawE-9ksKyJLn6oGc1ngzpE9Ia4EQDwF1oIDUhR","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] neighbor kid rant and question","postDate":"957728624","msgId":8450,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDljLjM4NjZkOGEuMjY0NzIxNzBAYW9sLmNvbT4="},"prevInTopic":8449,"nextInTopic":8451,"prevInTime":8449,"nextInTime":8451,"topicId":8449,"numMessagesInTopic":0,"msgSnippet":"In a message dated 05/07/2000 4:29:13 PM !!!First Boot!!!, unschoolr2@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-601954988\">In a message dated 05/07/2000 4:29:13 PM !!!First Boot!!!, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolr2@...\">unschoolr2@...</a> <br/>\nwrites:<br/>\n<br/>\n&lt;&lt; Even if it is <br/>\n just to tell me how horrible I am for having such a deep dislike for a <br/>\n child??? &lt;g&gt;<br/>\n Thanks<br/>\n Teri &gt;&gt;<br/>\n<br/>\n<br/>\nNo.  You&#39;re not horrible.<br/>\n<br/>\nHow to tell tactfully tell someone they are not welcome?<br/>\n<br/>\nThis would work if the person on the receiving end was at all in tune with <br/>\nthe rest of the world and capable of receiving a tactful, subtle message.<br/>\n<br/>\nFor example.  We have a neighbor girl who I adore.  She is welcome at our <br/>\nhome at any time.  But then dinner comes or we are going out and it is time <br/>\nfor her to leave.  All I have to say is:  &quot;OK, K, we are going to be having <br/>\ndinner soon.&quot;  She says OK, see you later.  Thanks.  And she has the grace <br/>\nand manners to leave.<br/>\n<br/>\nShe had been raised properly by caring and intelligent and decent parents.<br/>\n<br/>\nThen there is N.  He is a little street urchin who, I predict, will end up in <br/>\nprison some day.  He is on the street allllll the time, his mother is never <br/>\nhome, I have never met her!, and he is &quot;watched&quot; by the mother&#39;s boyfriend <br/>\n(who I met once when I returned his 2 dogs who were wandering the streets.  I <br/>\nthink it is a pretty good description of this family to say that the dogs <br/>\nhave never again been seen just wandering the street but the 6 yo boy is out <br/>\nall the time!)  He is not yet so rowdy as to be a bad influence on my kids <br/>\nbut I am not expecting this to be a long-range friendship.<br/>\n<br/>\nIt would be completely useless for me to be subtle with N.  He does not take <br/>\nhints.  What I says to N is:  &quot;Go home.  It is 6:00 (no, not 9:00 -- as he <br/>\nhas told us this is the time he is expected home).  And you have to go home <br/>\nnow.&quot;<br/>\n<br/>\nYour neighbor is older.  But obviously has not been raised to respect or even <br/>\nbe aware of others.  I have other neighbors with teen children and they are <br/>\nlovely and considerate.  So I don&#39;t think it&#39;s a teen thing.  I think it&#39;s a <br/>\nwhole way of looking at the world.  Being self-centered or not.  Having been <br/>\nraised correctly or not.  Etc.<br/>\n<br/>\nSo ... my 2 cents (ha) is to forget about being subtle, forget about being <br/>\ngood friends with these neighbors, and get on with your own thought-out life. <br/>\n  Maybe I wouldn&#39;t agree with you about everything if we were neighbors, but <br/>\nmy kid would not be making the sort of remarks this girl has made, and I <br/>\nwouldn&#39;t expect you to put up with it if they were this rude.  Speak up.  <br/>\nTell her you don&#39;t talk like that in your house.  That you have other <br/>\ninterests.  That bragging isn&#39;t what you do.  Maybe it would be the first <br/>\ntime in her life anyone suggested there was something else to talk about.  <br/>\nMaybe she will storm off.  Big loss?  I don&#39;t think so.  Maybe her mom will <br/>\nget huffy.  Probably not.  Probably won&#39;t give a good darn.  But if she does, <br/>\nare you really this woman&#39;s bosom buddy anyway?  Probably not going to happen.<br/>\n<br/>\nWell, I vented.  Please excuse me.  I just wanted to say you don&#39;t have to <br/>\nput up with any sort of smart-alec behavior you don&#39;t approve of and, on the <br/>\nother hand, you are the one who has to speak up.<br/>\n<br/>\nGood luck.  It sounds unpleasant.  But your other choice is to be a doormat <br/>\nfor this boorish behavior.<br/>\n<br/>\nNance</div>","specialLinks":[]},{"userId":0,"authorName":"Sonia Ulan","from":"Sonia Ulan &lt;sulan@...&gt;","replyTo":"LIST","senderId":"cXwEk3XLgufPDcq-D6nPShmlgyk9rOrVExqP1Reqwkhnwrb3bLEcFK66fY-N2GvpHwtzCFvybLKtWbvjcQH5TdqI","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] neighbor kid rant and question","postDate":"957696502","msgId":8456,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5MTU0OUY2LjQ0NDMwQUIzQGhvbWUuY29tPg==","referencesHeader":"PDljLjM4NjZkOGEuMjY0NzIxNzBAYW9sLmNvbT4="},"prevInTopic":8451,"nextInTopic":8457,"prevInTime":8455,"nextInTime":8457,"topicId":8449,"numMessagesInTopic":0,"msgSnippet":"Hi Nance, This is ever-so-slightly off topic but my heart goes out to the deprived/neglected/abandoned street urchin you mentioned.  We actually have one of","messageBody":"<div id=\"ygrps-yiv-875095861\">Hi Nance,<br/>\n<br/>\nThis is ever-so-slightly off topic but my heart goes out to the<br/>\ndeprived/neglected/abandoned &quot;street urchin&quot; you mentioned.  We actually<br/>\nhave one of those on our street too.  I guess just about every<br/>\nneighbourhood does.  Is there ever a time you are able to show the poor<br/>\nboy some kindness, as it is obvious he&#39;s really lacking in anyone caring<br/>\nfor him.  When kids like that grow up they often become societal<br/>\nproblems we will all have to deal with on some level.  Anything to help<br/>\nthe poor child along a different path if at all possible?  I know, I<br/>\nknow, easier said than done... <br/>\n<br/>\nSonia<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:marbleface@...\">marbleface@...</a> wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; In a message dated 05/07/2000 4:29:13 PM !!!First Boot!!!, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolr2@...\">unschoolr2@...</a><br/>\n&gt; writes:<br/>\n&gt; <br/>\n&gt; &lt;&lt; Even if it is<br/>\n&gt;  just to tell me how horrible I am for having such a deep dislike for a<br/>\n&gt;  child??? &lt;g&gt;<br/>\n&gt;  Thanks<br/>\n&gt;  Teri &gt;&gt;<br/>\n&gt; <br/>\n&gt; No.  You&#39;re not horrible.<br/>\n&gt; <br/>\n&gt; How to tell tactfully tell someone they are not welcome?<br/>\n&gt; <br/>\n&gt; This would work if the person on the receiving end was at all in tune with<br/>\n&gt; the rest of the world and capable of receiving a tactful, subtle message.<br/>\n&gt; <br/>\n&gt; For example.  We have a neighbor girl who I adore.  She is welcome at our<br/>\n&gt; home at any time.  But then dinner comes or we are going out and it is time<br/>\n&gt; for her to leave.  All I have to say is:  &quot;OK, K, we are going to be having<br/>\n&gt; dinner soon.&quot;  She says OK, see you later.  Thanks.  And she has the grace<br/>\n&gt; and manners to leave.<br/>\n&gt; <br/>\n&gt; She had been raised properly by caring and intelligent and decent parents.<br/>\n&gt; <br/>\n&gt; Then there is N.  He is a little street urchin who, I predict, will end up in<br/>\n&gt; prison some day.  He is on the street allllll the time, his mother is never<br/>\n&gt; home, I have never met her!, and he is &quot;watched&quot; by the mother&#39;s boyfriend<br/>\n&gt; (who I met once when I returned his 2 dogs who were wandering the streets.  I<br/>\n&gt; think it is a pretty good description of this family to say that the dogs<br/>\n&gt; have never again been seen just wandering the street but the 6 yo boy is out<br/>\n&gt; all the time!)  He is not yet so rowdy as to be a bad influence on my kids<br/>\n&gt; but I am not expecting this to be a long-range friendship.<br/>\n&gt; <br/>\n&gt; It would be completely useless for me to be subtle with N.  He does not take<br/>\n&gt; hints.  What I says to N is:  &quot;Go home.  It is 6:00 (no, not 9:00 -- as he<br/>\n&gt; has told us this is the time he is expected home).  And you have to go home<br/>\n&gt; now.&quot;<br/>\n&gt; <br/>\n&gt; Your neighbor is older.  But obviously has not been raised to respect or even<br/>\n&gt; be aware of others.  I have other neighbors with teen children and they are<br/>\n&gt; lovely and considerate.  So I don&#39;t think it&#39;s a teen thing.  I think it&#39;s a<br/>\n&gt; whole way of looking at the world.  Being self-centered or not.  Having been<br/>\n&gt; raised correctly or not.  Etc.<br/>\n&gt; <br/>\n&gt; So ... my 2 cents (ha) is to forget about being subtle, forget about being<br/>\n&gt; good friends with these neighbors, and get on with your own thought-out life.<br/>\n&gt;   Maybe I wouldn&#39;t agree with you about everything if we were neighbors, but<br/>\n&gt; my kid would not be making the sort of remarks this girl has made, and I<br/>\n&gt; wouldn&#39;t expect you to put up with it if they were this rude.  Speak up.<br/>\n&gt; Tell her you don&#39;t talk like that in your house.  That you have other<br/>\n&gt; interests.  That bragging isn&#39;t what you do.  Maybe it would be the first<br/>\n&gt; time in her life anyone suggested there was something else to talk about.<br/>\n&gt; Maybe she will storm off.  Big loss?  I don&#39;t think so.  Maybe her mom will<br/>\n&gt; get huffy.  Probably not.  Probably won&#39;t give a good darn.  But if she does,<br/>\n&gt; are you really this woman&#39;s bosom buddy anyway?  Probably not going to happen.<br/>\n&gt; <br/>\n&gt; Well, I vented.  Please excuse me.  I just wanted to say you don&#39;t have to<br/>\n&gt; put up with any sort of smart-alec behavior you don&#39;t approve of and, on the<br/>\n&gt; other hand, you are the one who has to speak up.<br/>\n&gt; <br/>\n&gt; Good luck.  It sounds unpleasant.  But your other choice is to be a doormat<br/>\n&gt; for this boorish behavior.<br/>\n&gt; <br/>\n&gt; Nance<br/>\n&gt; <br/>\n&gt; ------------------------------------------------------------------------<br/>\n&gt; Would you like to save big on your phone bill -- and keep on saving<br/>\n&gt; more each month? Join beMANY! Our huge buying group gives you Long Distance<br/>\n&gt; rates which fall monthly, plus an extra $60 in FREE calls!<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://click.egroups.com/1/2567/11/_/448294/_/957728630/\">http://click.egroups.com/1/2567/11/_/448294/_/957728630/</a><br/>\n&gt; ------------------------------------------------------------------------<br/>\n&gt; <br/>\n&gt; Message boards, timely articles, a free newsletter and more!<br/>\n&gt; Check it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt; <br/>\n&gt; To Unsubscribe: mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@onelist.com\">Unschooling-dotcom-unsubscribe@onelist.com</a> </span></blockquote></div>","specialLinks":[]}],"prevTopicId":8446,"nextTopicId":8460}}