{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":0,"authorName":"Rhiahl@aol.com","from":"Rhiahl@...","replyTo":"LIST","senderId":"yNoOdGjjp6fjFQcNrQNiMDzq4NMhG6rMt4_GrGMQ8QlbMQ7KbeKN4FDU7tGvxx4eU-s9F2E","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Official Statement","postDate":"929745490","msgId":1190,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy44OC4xMTkwLjk1OTI2OTc0MEBlR3JvdXBzLmNvbT4="},"prevInTopic":1187,"nextInTopic":0,"prevInTime":1189,"nextInTime":1191,"topicId":1177,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/18/99 1:26:45 PM Pacific Daylight Time, tn-k4of5@if.rmci.net writes: ","messageBody":"<div id=\"ygrps-yiv-1361151199\">In a message dated 6/18/99 1:26:45 PM Pacific Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tn-k4of5@...\">tn-k4of5@...</a> writes:<br/>\n<br/>\n&lt;&lt;  I find our<br/>\n faith is better served at home, in private, in our hearts, minds and souls.<br/>\n  Amen to that. &gt;&gt;<br/>\n<br/>\nHeck of a lot safer too it appears.<br/>\n<br/>\nCharlotte</div>","specialLinks":[]},{"userId":0,"authorName":"Thomas and Nanci Kuykendall","from":"Thomas and Nanci Kuykendall &lt;tn-k4of5@...&gt;","replyTo":"LIST","senderId":"Jk67NTgHle_1wxff_5-6jsXxHuz5K1nSEGMrPHWuImxw3fcaQmu7iu-JBZIxlGddOoyB-ogbMUeAjcOW8mw3IGd1krtJK4j4HmF5nfQS5yElWx1kffnyaJw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Official Statement","postDate":"929737947","msgId":1187,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy44OC4xMTg3Ljk1OTI2OTc0MEBlR3JvdXBzLmNvbT4="},"prevInTopic":1177,"nextInTopic":1190,"prevInTime":1186,"nextInTime":1188,"topicId":1177,"numMessagesInTopic":0,"msgSnippet":"That horrific tale is an example of one of the very valid reasons that we (my family) demure from attending organized religious servies or being part of a","messageBody":"<div id=\"ygrps-yiv-1434331401\">That horrific tale is an example of one of the very valid reasons that we<br/>\n(my family) demure from attending organized religious servies or being part<br/>\nof a church organization.  When you seek validation from such, I feel you<br/>\nare also inviting judgement and manipulation of your personal life and<br/>\nbeliefs.  Frankly, who needs it?  <br/>\n<br/>\nNow don&#39;t get all upset folks, as I know many of you DO attend church and<br/>\nare members of various congregations and that it works for you.  If you are<br/>\nhappy there, I am happy for you.  What is important is to not let anyone<br/>\ndictate your beliefs or your lifestyle, or to judge you or manipulate you.<br/>\nWe personally find more reasons to stay away than to join in.  I find our<br/>\nfaith is better served at home, in private, in our hearts, minds and souls.<br/>\n Amen to that.<br/>\n<br/>\nNanci K. in Idaho</div>","specialLinks":[]},{"userId":0,"authorName":"Lisa Bugg","from":"&quot;Lisa Bugg&quot; &lt;LisaBugg@...&gt;","replyTo":"LIST","senderId":"SxSZlnYCzxf7nbOhmqywBDBA9WoPyUm-YAD04DPSSQE4Xsbnq8CGnXVq7pdb5pcGMBE5uq0iY0OJ0M1ODFE1WexIc3WZLE9FhC2HoAo","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Official Statement","postDate":"929709892","msgId":1177,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy44OC4xMTc3Ljk1OTI2OTc0MEBlR3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":1187,"prevInTime":1176,"nextInTime":1178,"topicId":1177,"numMessagesInTopic":0,"msgSnippet":"Here is the statement issued directly by Cheryl Lindsey-Seelhoff. Statement In early spring of 1994, after having published Gentle Spirit Magazine for five","messageBody":"<div id=\"ygrps-yiv-775128601\">Here is the statement issued directly by Cheryl Lindsey-Seelhoff.  <br/>\nStatement<br/>\n<br/>\nIn early spring of 1994, after having published Gentle Spirit Magazine for<br/>\nfive years, I experienced a crisis in my marriage which resulted  eventually<br/>\nin its dissolution.  My ex-husband had moved to another state,  and I had met<br/>\nthe man who is now my husband, Rick Seelhoff.   At the time, I was a member<br/>\nof Calvary Chapel of Tacoma. I asked to meet privately with  my then-pastor<br/>\nand his wife, Joe and Irene Williams, in April of 1994, for  confession and<br/>\nspiritual counsel.  The pastor and his wife assured me they would keep my<br/>\nfamily situation confidential.  After I met with them, I stopped attending<br/>\ntheir church and never attended their church again.<br/>\n<br/>\nMonths after I last attended church services at Calvary Chapel of Tacoma,  in<br/>\nthe days shortly before and just after my last public speaking  engagement at<br/>\nthe CHEO convention in Ohio, Pastor Williams and his wife received phone<br/>\ncalls from several leaders in the national conservative  Christian<br/>\nhomeschooling community, asking  for detailed, intimate information about my<br/>\npersonal life.  Pastor Williams and his wife provided that information.<br/>\nAmong the leaders who called requesting personal information about me were<br/>\nGregg Harris, Sue Welch, and the then-chair of CHEO, Michael Boutot.  I knew<br/>\nthese homeschooling leaders only very casually, in some cases, or not at all.<br/>\n None was my mentor in publishing or had been involved with the publication<br/>\nof  my magazine.  I  had no idea any of these leaders had been made aware of<br/>\nmy family circumstances or that  they were conducting any kind of<br/>\ninvestigation of me.  None of these leaders  attended any Calvary Chapel<br/>\nchurch, let alone my own church.  Gentle Spirit was not a nonprofit,<br/>\nreligious organization,  but a for-profit, private, family business concern.<br/>\n<br/>\nAfter the Williams spoke with these leaders, calls were placed to other<br/>\nprominent persons in the Christian homeschooling  community.   A decision was<br/>\nmade among some of these leaders that I be presented with a list of<br/>\nultimatums, which they called, &quot;proofs of repentance,&quot;  or have intimate<br/>\ndetails of my personal life disclosed nationally and publicly.  The &quot;proofs<br/>\nof  repentance&quot; I was to perform included not answering my telephone, turning<br/>\nover the contents  of my business and personal bank accounts to others, not<br/>\nhaving a post office box, never going anywhere alone, stepping down from my<br/>\nposition as  Editor and Publisher of Gentle Spirit, agreeing not to speak<br/>\npublicly,  agreeing  not to defend myself, firing my attorneys, withdrawing<br/>\nrestraining orders I had obtained to protect my family and business, and<br/>\nreplacing Gentle Spirit with Teaching Home Magazine.  At the time, I was the<br/>\nsole support of my family of 11 people, and Gentle Spirit Magazine provided<br/>\nall of our family&#39;s income.<br/>\n<br/>\nWhen I failed to comply with the &quot;proofs of repentance,&quot;  the Williams<br/>\ndrafted a &quot;letter of discipline.&quot;  They discussed the contents of the  letter<br/>\nof discipline with Sue Welch and Michael Farris of HSLDA.   The letter<br/>\nstated, among other things, that I was guilty of unrepentant adultery with<br/>\nlying, because I said I was repentant although I continued my relationship<br/>\nwith Rick, whom I married in 1995.  They read this letter of discipline<br/>\npublicly, against my will, at a Sunday morning church service months after I<br/>\nhad last attended the church. The pastor&#39;s wife, Irene Williams, read the<br/>\nletter of discipline over  the telephone to Sue Welch, Editor of Teaching<br/>\nHome Magazine, who  audiotaped the reading of the letter. Ms. Welch then<br/>\nasked the Williams to write a letter to her requesting her help in<br/>\ndisseminating the contents of  the letter of church discipline to leaders in<br/>\nthe homeschooling community.  Ms Welch also offered to the Williams the<br/>\nservices of her attorney,  Michael Farris, who spoke with the Williams<br/>\nseveral times by phone.  The  Williams provided the letter Sue Welch<br/>\nrequested, along with a copy of the  letter of discipline, and Sue Welch then<br/>\nfaxed and otherwise circulated  the letter of discipline to the chairpersons<br/>\nof more than 43 state  homeschooling organizations as well as many other<br/>\nleaders, publishers,  business persons,  and others in the homeschooling<br/>\nmarketplace.  The  information was circulated over a number of months by<br/>\nfacsimile, regular  mail, telephone, and via the internet.    In early 1995,<br/>\nan &quot;update&quot; was  provided in a newsletter sent out by Teaching Home staff to<br/>\nall state  homeschooling leaders.  Another magazine publisher, Mary Pride,<br/>\nwhom I  had never personally met and with whom I had never done business,<br/>\nalso paid a member of her staff to investigate my situation.  This staff<br/>\nmember contacted the Williams, Sue Welch, and others and asked intimate<br/>\nquestions about my personal life.   Gregg Harris also participated in the<br/>\nearly investigation  of my family&#39;s crisis, discussing my personal life with<br/>\nmy ex-husband, the  Williams, and Sue Welch.  I did not become aware of  Ms.<br/>\nWelch&#39;s , Mr.  Farris&#39;s, Mr. Harris&#39;s, Mary Pride&#39;s, Michael Farris&#39;s,  or<br/>\nother leaders&#39;  actions, in some instances, until  years  after the fact.<br/>\n<br/>\nIn the wake of the circulation of this information, I began  receiving<br/>\nletters from subscribers, columnists and advertisers who  canceled their<br/>\nsubscriptions, resigned as columnists or canceled their  advertisements.<br/>\nSome of these people demanded refunds.  Several different  homeschooling<br/>\npublications ran articles disclosing the contents of the Williams&#39; letter of<br/>\ndiscipline and other facts, some true, some untrue.   Ms Welch reimbursed the<br/>\npastor and his wife for the costs of the many telephone calls they received<br/>\nwhich resulted from the circulation of this letter.  As  the mother of nine<br/>\nand sole provider for my family via Gentle Spirit, these actions were<br/>\ndevastating to me.<br/>\n<br/>\nI subsequently attempted to do what I could to fulfill my obligations to<br/>\nsubscribers.  I mailed refunds, sent out back issues, at one point  attempted<br/>\nto publish Gentle Spirit in an e-mail loop, and finally I  established a<br/>\nwebsite.  At each turn I was met with intense opposition, as long as three<br/>\nyears after the fact,  so that I could not continue.<br/>\n<br/>\nFinally I despaired of ever being able to fulfill my obligations to<br/>\nsubscribers or to lead a normal life absent legal action.  At that point I<br/>\nfiled suit in Federal Court for the Western District of Washington against<br/>\nseveral defendants:  Calvary Chapel of Tacoma, Joe and Irene Williams,<br/>\nCalvary Chapel of Costa Mesa, The Teaching Home and Sue Welch, Gregg  Harris,<br/>\nChristian Home Educators of Ohio and its then-chairperson, and  Bill and Mary<br/>\nPride, alleging a number of causes of action, among them defamation, slander,<br/>\noutrage, interference with commerce, and violation of  the Sherman Antitrust<br/>\nAct of the United States.   We settled our claims  with Gregg Harris, Calvary<br/>\nChapel of Costa Mesa, CHEO, and the Prides  before trial for amounts which we<br/>\nagreed to keep confidential.  We did go to trial with Sue Welch, and after<br/>\neight days of trial, a unanimous jury found that Sue Welch and the Williams<br/>\nhad entered into an illegal conspiracy to restrain trade in  violation of the<br/>\nSherman Antitrust Act.  The jury found that I had been  damaged in the amount<br/>\nof $435,000.  Because damages awards in antitrust actions are automatically<br/>\ntrebled, I was entitled to receive in excess of  1.3 million dollars from Sue<br/>\nWelch.  In addition, I was entitled to  recover my attorneys&#39; fees and costs.<br/>\n<br/>\nSubsequent to the jury verdict, we settled our claims with Sue Welch for  an<br/>\namount which we have agreed not to disclose.<br/>\n<br/>\nWe then proceeded to trial in one remaining cause of action, interference<br/>\nwith commerce.  The sole defendants by this time were the Williams and<br/>\nCalvary Chapel of Tacoma.  Prior to trial, we settled with these remaining<br/>\ndefendants as well,  so that all of our claims against all of the  defendants<br/>\nhave now been resolved.<br/>\n<br/>\nThis information and the lawsuit are a matter of public record in Pierce<br/>\nCounty Superior Court  at Tacoma and in the US District Court for the Western<br/>\nDistrict of  Washington at Tacoma.<br/>\n<br/>\nEnd<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--------------------------------------------------</div>","specialLinks":[]}],"prevTopicId":1189,"nextTopicId":1165}}