{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":19,"messages":[{"userId":162707139,"authorName":"Kristina Kahney","from":"Kristina Kahney &lt;kkahney@...&gt;","profile":"kkahney","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: martial arts","postDate":"1106642567","msgId":102762,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwMTI1MDg0MjQ3Ljk5MjMxLnFtYWlsQHdlYjgxNTA5Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGN0M3A0MitxbWpmQGVHcm91cHMuY29tPg=="},"prevInTopic":102751,"nextInTopic":0,"prevInTime":102761,"nextInTime":102763,"topicId":102683,"numMessagesInTopic":0,"msgSnippet":"Thank you to all who took the time to respond to my martial arts question. We visited one class tonight (Karate Jutsu) and my son LOVED it. It was like a light","messageBody":"<div id=\"ygrps-yiv-675558813\">Thank you to all who took the time to respond to my martial arts question. We visited one class tonight (Karate Jutsu) and my son LOVED it. It was like a light switched on in him! I can&#39;t tell you how grateful I am for the recommendations. <br/>\n <br/>\nThe school (they call it a &quot;dojo&quot;....new words for me to learn!) seems nice, but I think we&#39;re going to just have to try it and see how it goes- and be willing to look elsewhere if it doesn&#39;t work out. The class he took had a dad with his two sons and they were a homeschooling family which was kind of nice. My son most liked being in a class with older boys and the cool black uniforms they wear :) <br/>\n <br/>\nThe class was pretty small (maybe 6 kids) and there was a nice place for parents to watch through a glass window, and even a little toy room for younger siblings there. The place has a nice, family feel, but I&#39;ll be watching to see how the instructers interact with him as we continue.<br/>\n <br/>\nJan, I&#39;m so sorry to read of the loss of your husband. I cannot imagine what a difficult time it must be for you and your children. My thoughts go out to you as you move forward in your new life.<br/>\nKristina<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":3501247,"authorName":"Janice Zindel","from":"&quot;Janice Zindel&quot; &lt;jzindel@...&gt;","profile":"jzindel5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: martial arts","postDate":"1106601922","msgId":102751,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGN0M3A0MitxbWpmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDUwMTIyMDQ1NzE1LjIzMjQyLnFtYWlsQHdlYjgxNTA1Lm1haWwueWFob28uY29tPg=="},"prevInTopic":102746,"nextInTopic":102762,"prevInTime":102750,"nextInTime":102752,"topicId":102683,"numMessagesInTopic":0,"msgSnippet":"... looking for a place so my almost 6 yo son can try some classes. I ve realized there are TONS of places and they all offer different types of martial arts. ","messageBody":"<div id=\"ygrps-yiv-2038259272\">Kristina wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; &lt;&lt;Have you ever had martial arts training?&gt;&gt;<br/>\n <br/>\n&gt; After hearing so many recommendatins for martial arts training I&#39;m <br/>\n </span></blockquote>looking for a place so my almost 6 yo son can try some classes. I&#39;ve <br/>\nrealized there are TONS of places and they all offer different types <br/>\nof martial arts.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Feelings clueless...any tips as to a &quot;type&quot; or what to look for at <br/>\n </span></blockquote>the place? Thanks.<br/>\n<br/>\nMy three children and I have been involved in martial arts for the <br/>\npast five years.  Noah, now 14, earned his Black Belt a year ago, <br/>\nand my 17 year old daughter earned her Black Belt a week ago.  My <br/>\nthirteen year old daughter will likely test for Black Belt in a few <br/>\nmonths or less, and I hope to test for Black in three weeks. My<br/>\nhusband passed away two months ago, and I so wish he could have <br/>\nlived to see Sarah and Linnea test; he was very proud of their<br/>\naccomplishments.   <br/>\n<br/>\nI would highly recommend observing classes.  Schools vary in the<br/>\namount of discipline they have.  Does the instructor(s) LIVE the <br/>\ntenets and pledges?  Do they correct students respectfully and in a <br/>\npositive fashion, or otherwise?  Take a good, long, hard look at the <br/>\ninstructor(s), their background, and exactly the type of martial art <br/>\nthey teach.  Our first instructor taught Tae Kwon Do with a little <br/>\nJudo and Hapki-do, but eventually changed to Pankration (sp?) which <br/>\nis far more physical and dangerous than some martial arts.  Also, <br/>\nhow organized are they in their teaching.  Our first instructor was <br/>\ngreat at sparring, but teaching of techniques was very hit and miss, <br/>\nand he would only test students when there were a lot ready; if you <br/>\nwere ready to test and no one else was, you waited quite awhile.  <br/>\nOur present instructor (formerly Asst. Instructor at previous school)<br/>\nalso teaches Tae Kwon Do with a little Judo & Hapki-do, and is very <br/>\norganized in teaching of techniques, there is some repetition at <br/>\ntimes, but that is how skills continue to improve.    <br/>\n   <br/>\nAlso, how many days a week do you plan to go to class.  Once a week<br/>\nis really not enough to remember what you are learning; twice is<br/>\nminimum at our school, to keep skills up.  More is better, especially<br/>\nas the children get older.  Our family?  We are there five nights a<br/>\nweek.  Monday through Thursday are regular classes.  Fridays are<br/>\nonce a month classes such as Forms Class, monthly Testing night, <br/>\nBlack Belt Club, and Sparring night.  She occasionally gets a <br/>\nweapons class in, too. <br/>\n<br/>\nHope you find a good martial arts school that will fit your children<br/>\nand family. -Jan Z., WI</div>","specialLinks":[]},{"userId":194790463,"authorName":"diana jenner","from":"diana jenner &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] martial arts","postDate":"1106446888","msgId":102746,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxRjMwQTI4LjMwNjA1MDRAc2lvLm1pZGNvLm5ldD4=","inReplyToHeader":"PDIwMDUwMTIyMDQ1NzE1LjIzMjQyLnFtYWlsQHdlYjgxNTA1Lm1haWwueWFob28uY29tPg==","referencesHeader":"PDIwMDUwMTIyMDQ1NzE1LjIzMjQyLnFtYWlsQHdlYjgxNTA1Lm1haWwueWFob28uY29tPg=="},"prevInTopic":102744,"nextInTopic":102751,"prevInTime":102745,"nextInTime":102747,"topicId":102683,"numMessagesInTopic":0,"msgSnippet":"... I ve enrolled my kids in Tae Kwon Do (they re 6 & 8).  We began at the gym where our local homeschooling group had arranged a daytime class at a","messageBody":"<div id=\"ygrps-yiv-44992425\">Kristina Kahney wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>&gt;  <br/>\n&gt;&lt;&lt;Have you ever had martial arts training?&gt;&gt;<br/>\n&gt;<br/>\n&gt;After hearing so many recommendatins for martial arts training I&#39;m looking for a place so my almost 6 yo son can try some classes. I&#39;ve realized there are TONS of places and they all offer different types of martial arts.<br/>\n&gt;<br/>\n&gt;Feelings clueless...any tips as to a &quot;type&quot; or what to look for at the place? Thanks.<br/>\n&gt;<br/>\n&gt;Kristina<br/>\n&gt;  <br/>\n&gt;<br/>\n </span></blockquote>I&#39;ve enrolled my kids in Tae Kwon Do (they&#39;re 6 & 8).  We began at the <br/>\ngym where our local homeschooling group had arranged a daytime class at <br/>\na substantial discount.  For the most part, we all enjoyed the classes <br/>\nthere... until too many kids got injured during non-TKD activities <br/>\n(Hannah broke her arm during TAG!).  We discovered the teacher was <br/>\nadding more PE-like activities for our /playground-deprived/ children <br/>\n:::wretch::::<br/>\nRecently we all moved to another gym, where the discount is not as deep, <br/>\nbut the Master is far more professional and has been involved in TKD <br/>\nsince he was a child in Korea.  The kids are all unlearning the bogus <br/>\nstuff from the other gym and newly learning TKD.  This works great for <br/>\nthe kids who are very serious about acheiving their Black Belt goals (it <br/>\nworks good for my kids who go for the movement and socializing, too)<br/>\n<br/>\nI&#39;d check with the local group first -- the daytime discount is <br/>\nincredible; next I&#39;d check with the &quot;Y.&quot;<br/>\n<br/>\n:) diana<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":192290539,"authorName":"Emile Snyder","from":"Emile Snyder &lt;unschooling@...&gt;","profile":"emiledsnyder","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] martial arts","postDate":"1106418337","msgId":102744,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExMDY0MTgzMzcuMTIxNjEuMzgwNC5jYW1lbEBiYXNhbHQ+","inReplyToHeader":"PDIwMDUwMTIyMDQ1NzE1LjIzMjQyLnFtYWlsQHdlYjgxNTA1Lm1haWwueWFob28uY29tPg==","referencesHeader":"PDIwMDUwMTIyMDQ1NzE1LjIzMjQyLnFtYWlsQHdlYjgxNTA1Lm1haWwueWFob28uY29tPg=="},"prevInTopic":102738,"nextInTopic":102746,"prevInTime":102743,"nextInTime":102745,"topicId":102683,"numMessagesInTopic":0,"msgSnippet":"... (Bit of a long response below, sorry for the ramble.) I would spend a little bit of time thinking about what you are looking for in the experience, then","messageBody":"<div id=\"ygrps-yiv-1313978860\">On Fri, 2005-01-21 at 20:57, Kristina Kahney wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; After hearing so many recommendatins for martial arts training I&#39;m looking for a place so my almost 6 yo son can try some classes. I&#39;ve realized there are TONS of places and they all offer different types of martial arts.<br/>\n&gt; <br/>\n&gt; Feelings clueless...any tips as to a &quot;type&quot; or what to look for at the place? Thanks.<br/>\n<br/>\n </span></blockquote>(Bit of a long response below, sorry for the ramble.)<br/>\n<br/>\nI would spend a little bit of time thinking about what you are looking<br/>\nfor in the experience, then call places and ask about observing a class<br/>\nor two.  Definitely go and check out the vibe before you commit to<br/>\nanything.  One caution, if you&#39;re primarily interested in quick self<br/>\ndefense skills, consider just taking a self defense class.  Any martial<br/>\nart will probably improve your self defense skills in the long run, but<br/>\nstudying with that focus will probably not be the most rewarding way to<br/>\nexperience the art.<br/>\n<br/>\nIn terms of what you&#39;re looking for... often people think of martial<br/>\narts styles being arranged on a soft -&gt; hard axis, where at the soft<br/>\nextreme you might have something like tai chi (as far as I know it&#39;s<br/>\nalmost always non-contact), and on the hard end thinks like mui tai<br/>\n(thai kick boxing), or jujitsu (in some Japanese arts there&#39;s a<br/>\ndistinction made between soft and hard forms using the -do or -jitsu<br/>\nending, so judo is the art studied for the throws and joint locks, while<br/>\njujitsu is the art studied for the joint breaks/more damaging forms).<br/>\n<br/>\nWhat&#39;s available will usually depend on how urban an area you are in;<br/>\nmost places will have karate (pretty hard), judo (medium soft?) or<br/>\ntaekwondo (again, more hard) schools.  If you&#39;re somewhere with a higher<br/>\npopulation density, you might find some less mainstream stuff, like<br/>\ncapoiera (a Brazilian form somewhere between dance and martial arts,<br/>\nthey do some really crazy gymnastic kind of moves).<br/>\n<br/>\nI&#39;ve spent some time with karate (briefly, elementary school aged),<br/>\naikido (most of junior high, high school, several years worth off and on<br/>\nsince), and taekwondo (a year or so post college).  So far aikido has<br/>\nbeen by far my favorite.  In aikido (at least in the dojo that I trained<br/>\nat -- USAF western region affiliated) the bulk of training was done in<br/>\npairs.  The teacher would invite a student to help him demonstrate a<br/>\ntechnique, would do it several times, at varying speeds, then the class<br/>\nwould pair up and practice it while the teacher would circulate and<br/>\npoint out problems/solutions as needed.  Techniques start with uke (the<br/>\none who is thrown) acting as the attacker, and nage (the one who throws)<br/>\nrecieves the attack and turns it into a throw or a joint lock.  You<br/>\nspend alot of time learning how to fall ;)  It makes for very exiting<br/>\npractices to watch or participate in once you have trained for awhile as<br/>\nthere is lots of people flying around on the mat.<br/>\n<br/>\nThe emphasis was on seeing/feeling a technique, so there was very little<br/>\nspeaking/explaining done, which was great for some learning styles,<br/>\nawful for others.  As students grow more skilled techniques move from<br/>\nthe more static variations (begining the technique where someone has<br/>\ngrabbed you) to active ones (the attack is a strike, with or without a<br/>\nweapon).<br/>\n<br/>\nI feel like aikido developed my sense of physicality much more than any<br/>\nof the more straight forward punch/kick/block stuff I&#39;ve been exposed<br/>\nto.  I also enjoyed studying a form that focused on giving me the option<br/>\nof appropriate level of response; most techniques can be executed<br/>\nanywhere on the continuum of: with the protection of the attacker in<br/>\nmind, through to the extremes of joint breaks/incapacitating strikes. <br/>\nAnd training is just fun!  You really feel like you and your partner are<br/>\nhelping each other ride the edge of your skill levels.<br/>\n<br/>\nMy experience with taekwondo was that class was usually less fun for me<br/>\nthan aikido; lots of time spent working on punches, kicks, blocks in<br/>\nlines by yourself.  Some time sparring (more fun) but even the sparring<br/>\nhas to be at lower energy that the aikido practice to prevent serious<br/>\ninjury, and even at the lower energy levels you get more injuries.  I<br/>\nhad a friend who trained in a kung fu school through his black belt<br/>\nlevel, and he really liked it but got sick of the level of pain you get<br/>\nwhen practicing such aggressive techniques, even when being careful.<br/>\n<br/>\nAgain, sorry for the rambling.  Hope it helps,<br/>\n-emile</div>","specialLinks":[]},{"userId":162707139,"authorName":"Kristina Kahney","from":"Kristina Kahney &lt;kkahney@...&gt;","profile":"kkahney","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"martial arts","postDate":"1106369835","msgId":102738,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwMTIyMDQ1NzE1LjIzMjQyLnFtYWlsQHdlYjgxNTA1Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PEJFMTY0NDZDLjMwNjNGJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":102730,"nextInTopic":102744,"prevInTime":102737,"nextInTime":102739,"topicId":102683,"numMessagesInTopic":0,"msgSnippet":"Fetteroll   After hearing so many recommendatins for martial arts training I m looking for","messageBody":"<div id=\"ygrps-yiv-763755149\">Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>&gt;  <br/>\n&lt;&lt;Have you ever had martial arts training?&gt;&gt;<br/>\n<br/>\nAfter hearing so many recommendatins for martial arts training I&#39;m looking for a place so my almost 6 yo son can try some classes. I&#39;ve realized there are TONS of places and they all offer different types of martial arts.<br/>\n<br/>\nFeelings clueless...any tips as to a &quot;type&quot; or what to look for at the place? Thanks.<br/>\n<br/>\nKristina<br/>\n<br/>\n<br/>\n&#92;<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Hitting is just NOT okay (was: curbing undesi...","postDate":"1106325869","msgId":102730,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzZi5iMzFjZDdjLjJmMjI4YjZkQGFvbC5jb20+"},"prevInTopic":102726,"nextInTopic":102738,"prevInTime":102729,"nextInTime":102731,"topicId":102683,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/21/05 2:01:51 AM, dezigna@comcast.net writes: ","messageBody":"<div id=\"ygrps-yiv-1137494053\">In a message dated 1/21/05 2:01:51 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dezigna@...\">dezigna@...</a> writes:<br/>\n<br/>\n&lt;&lt; Wouldn&#39;t it be great if you could help your child learn to recognize a<br/>\npossibly dangerous situation and learn how to avoid it or escape from it, so<br/>\nthat either submission or violent posturing was avoidable also?  &gt;&gt;<br/>\n<br/>\nKirby, who&#39;s 18 now, has been studying karate since he was nine.  He&#39;s told <br/>\nme three stories of situations in which other people might have been tempted to <br/>\nfight or flee.  In each one, he used words and soothing humor.  He didn&#39;t <br/>\nshow fear, because he wasn&#39;t afraid, but he also didn&#39;t use agression, because he <br/>\nwas confident.<br/>\n<br/>\nI highly recommend martial arts, and it&#39;s something you the mom could do with <br/>\nyour daughter, too.  There is a philosophy that goes along with the best <br/>\nschools, of peace-making and defense, of being whole and centered.<br/>\n<br/>\nReading some Alice Miller, at least website summaries and discussions or <br/>\ninterviews (whole books aren&#39;t necessary, honestly) might give you a good idea of <br/>\nhow you yourself can begin to see your childhood in a way that will create <br/>\nanother tool in your tool box.  Understanding how you came to be the way you are <br/>\ncan give you a set of dos and don&#39;ts to use when deciding how to act now with <br/>\nyour daughter, so that you&#39;re neither blindly perpetuating the past nor living <br/>\nin opposition to the past, but making each decision from a thoughtful <br/>\nawareness of how things work.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Hitting is just NOT okay (was:\tcurbing undesi...","postDate":"1106303549","msgId":102726,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJFMTY0NDZDLjMwNjNGJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDIwMDUwMTIwMTc1NjI5LjM4MTQxLnFtYWlsQHdlYjQwOTEwLm1haWwueWFob28uY29tPg=="},"prevInTopic":102725,"nextInTopic":102730,"prevInTime":102725,"nextInTime":102727,"topicId":102683,"numMessagesInTopic":0,"msgSnippet":"... Have you ever had martial arts training? Rather than wishing your daughter could have real confidence in a fight wouldn t it serve them better to work","messageBody":"<div id=\"ygrps-yiv-314697575\">on 1/20/05 12:56 PM, Inna Manni at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SpinFrog@...\">SpinFrog@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He has a different<br/>\n&gt; perspective than a person who has training but who has never fought<br/>\n&gt; unrestricted by rules. I see it and I cannot help but respect it and<br/>\n&gt; wish for my daughter to have it.<br/>\n<br/>\n </span></blockquote>Have you ever had martial arts training?<br/>\n<br/>\nRather than wishing your daughter could have real confidence in a fight<br/>\nwouldn&#39;t it serve them better to work toward a life where they never had to<br/>\nworry about whether they could handle themselves in a fight?<br/>\n<br/>\nYou seem to be trying to figure out a better way to live in the box you&#39;re<br/>\nin rather than finding a way out of the box.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Re: Hitting is just NOT okay (was: curbing undesi...","postDate":"1106297988","msgId":102725,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PGNzbjM2aCtjMjBqQGVHcm91cHMuY29tPg=="},"prevInTopic":102715,"nextInTopic":102726,"prevInTime":102724,"nextInTime":102726,"topicId":102683,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-752675001\">&lt;&lt;&lt;&lt;maybe now that she is only 3, it seems ok for her to get an adult to <br/>\nhelp. but if she learns to run to adults for her troubles with other <br/>\nkids, when will that end? when she is 10 or 12 and talking isn&#39;t <br/>\nworking, and she has grown up believing in total non-violence, will <br/>\nshe just stand there and be hurt, and not know what to do? i did. and <br/>\ni don&#39;t want her to be like that.<br/>\n<br/>\non the other hand, my husband was raised to never let anybody hit him <br/>\nwithout hitting them back. his father told him that if he was scared <br/>\nthat a particular person was about to hit him, he should hit them <br/>\nfirst. he is confident that he can handle himself and knows how he <br/>\nwould react in a dangerous situation, because he has been there so <br/>\nmany times. i wish my parents had taught me how to stand up for <br/>\nmyself as well.&gt;&gt;&gt;&gt;<br/>\n<br/>\nIt doesn&#39;t &quot;seem&quot; OK. It *is* OK. She will know what to do later *because*<br/>\nof the good help she has been given. From your own story, you were not given<br/>\ngood help or offered a plethora of strategies and choices, and that is why<br/>\nyou now feel inadequate when faced with conflict. <br/>\n<br/>\nThese extremes of being either an abjectly fearful person or what is<br/>\neffectively the bravado of a violent person who lands the first punch, are<br/>\n*not* the only choices. Self-assertiveness need not be the same as<br/>\naggression. Kids who &quot;always hit&quot; are often labelled and avoided at the park<br/>\nor in playgroups.<br/>\n<br/>\nNotice that your father-in-law was promoting a violent reaction *to fear*,<br/>\nwhile you have grown up also living in fear of being hurt that you are now<br/>\ncarrying over to your child. I wonder if you are mistaking confidence for<br/>\naggression borne of a deep fear of being vulnerable. I believe that many<br/>\nmen, especially if they grew up in violent homes or homes without an<br/>\nattentive, loving male presence, are afraid of their own softness or ability<br/>\nto show gentleness, seeing it as weakness. They often find it hard to accept<br/>\nor show love also.<br/>\n<br/>\nWouldn&#39;t it be great if you could help your child learn to recognize a<br/>\npossibly dangerous situation and learn how to avoid it or escape from it, so<br/>\nthat either submission or violent posturing was avoidable also? One of the<br/>\ngreat results of Unschooling is that our children usually trust us to give<br/>\nthem accurate and reasoned information, including about how to deal with<br/>\ndifficult or dangerous situations. They can come to us for help in finding<br/>\nsafe ways to achieve their desires or goals, instead of feeling the need to<br/>\nengage in risky behaviors. It is so important to me that Jayn (5) feel that<br/>\nshe can *always* approach me for help with other people especially if they<br/>\nare pushing her beyond her comfort level. <br/>\n<br/>\nWere you and your dh really in the same kind of violent situations? From<br/>\nyour description it is possible that your dh grew up in an abusive<br/>\nhousehold, or a terrifying locale of some violent subculture. <br/>\n<br/>\nIt is very hard to show or model what one does not know or understand<br/>\noneself. I urge you to go to www.naturalchild.org and read some of the<br/>\narticles there, most especially &quot;Helping Children Heal From Emotional Hurts&quot;<br/>\n(also for your own childhood), and then explore some of Alice Miller&#39;s<br/>\nwritings about the nature of societal violence and its roots in childhood.<br/>\nAnother source of useful information might be Non-violent Communication -<br/>\nbut I don&#39;t have those websites at my fingertips. I&#39;m certain someone else<br/>\nwill be able to post them, unless you find links at Sandra&#39;s site.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.830 / Virus Database: 565 - Release Date: 1/6/2005</div>","specialLinks":[]},{"userId":192290539,"authorName":"Emile Snyder","from":"Emile Snyder &lt;unschooling@...&gt;","profile":"emiledsnyder","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"inspiring if wacky &quot;turn your passion into your life&quot; guy","postDate":"1106254773","msgId":102713,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExMDYyNTQ3NzIuMTIwODguOTcyLmNhbWVsQGJhc2FsdD4=","inReplyToHeader":"PDE1Ny40ODg3MGMwOS4yZjIxNWI0ZEBhb2wuY29tPg==","referencesHeader":"PDE1Ny40ODg3MGMwOS4yZjIxNWI0ZEBhb2wuY29tPg=="},"prevInTopic":102711,"nextInTopic":102715,"prevInTime":102712,"nextInTime":102714,"topicId":102683,"numMessagesInTopic":0,"msgSnippet":"This guy makes some amazing stacked card structures.  Guinness record at 17, went on to do architecture, still going... http://www.cardstacker.com/ Interesting","messageBody":"<div id=\"ygrps-yiv-1104761091\">This guy makes some amazing stacked card structures.  Guinness record at<br/>\n17, went on to do architecture, still going...<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cardstacker.com/\">http://www.cardstacker.com/</a><br/>\n<br/>\nInteresting to see people *way* off the beaten path ;)<br/>\n<br/>\n-emile</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Hitting is just NOT okay (was: curbing undesi...","postDate":"1106248013","msgId":102711,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1Ny40ODg3MGMwOS4yZjIxNWI0ZEBhb2wuY29tPg=="},"prevInTopic":102710,"nextInTopic":102713,"prevInTime":102710,"nextInTime":102712,"topicId":102683,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/20/2005 11:14:00 AM Mountain Standard Time, SpinFrog@yahoo.com writes: -=-I was scared to fight, unsure of myself - not because of some","messageBody":"<div id=\"ygrps-yiv-1451929167\">In a message dated 1/20/2005 11:14:00 AM Mountain Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SpinFrog@...\">SpinFrog@...</a> writes:<br/>\n-=-I was scared to<br/>\nfight, unsure of myself - not because of some noble notion that<br/>\nnon-violence is better. -=-<br/>\n<br/>\n<br/>\nNon-violence is better legally.<br/>\nIt&#39;s better physically.<br/>\nIt&#39;s better spiritually and emotionally.<br/>\n<br/>\nNoble notions are good and desirable things. <br/>\nI like it when my children have noble notions.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Hitting is just NOT okay (was: curbing undesi...","postDate":"1106247936","msgId":102710,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlMi4zMzg3OTQxNC4yZjIxNWIwMEBhb2wuY29tPg=="},"prevInTopic":102709,"nextInTopic":102711,"prevInTime":102709,"nextInTime":102711,"topicId":102683,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/20/2005 11:14:00 AM Mountain Standard Time, SpinFrog@yahoo.com writes: -=-I like Sandra s approach too. Violence should be the very last ","messageBody":"<div id=\"ygrps-yiv-1791364877\">In a message dated 1/20/2005 11:14:00 AM Mountain Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SpinFrog@...\">SpinFrog@...</a> writes:<br/>\n-=-I like Sandra&#39;s approach too. Violence should be the very last<br/>\noption. But it should definately be an option. That&#39;s all I was<br/>\ntrying to say. -=-<br/>\n<br/>\nI don&#39;t think my approach makes it &quot;definitely an option.&quot;<br/>\nIt makes it a possibly eventuality.  That&#39;s true even of murder, though.  A <br/>\npossible eventuality isn&#39;t a recommendation.  It was &quot;don&#39;t do this UNLESS <br/>\nother remedies have been applied.&quot;<br/>\n<br/>\n-=-It&#39;s funny you should mention jail time, because my husband&#39;s father<br/>\nspent half his life in jail.-=-<br/>\n<br/>\nSo that&#39;s definitely an option for your kids, you think?<br/>\nI had an uncle who did a stint for armed robbery, got out and robbed a store <br/>\nbecause it was easier than finding an apartment.   It&#39;s not that I&#39;m clueless <br/>\nabout prison.  I think it&#39;s a think to be avoided.  Like hitting.<br/>\n<br/>\n-=-But have you ever been in a real fight? He has been in<br/>\nmany, and what he brings is the kind of self-confidence and attitude<br/>\nthat can only be gotten from real experience. He has a different<br/>\nperspective than a person who has training but who has never fought<br/>\nunrestricted by rules. I see it and I cannot help but respect it and<br/>\nwish for my daughter to have it. -=-<br/>\n<br/>\nConfidence?<br/>\nTere are many ways to gain confidence, and many MANY confident people who <br/>\nhave never been in a fight.<br/>\n<br/>\n-=-As a teenager, I have been in MANY<br/>\nsituations where I found various alternatives to violence. But it was<br/>\nbecause nobody ever talked to me about such things - -=-<br/>\n<br/>\nI don&#39;t think that&#39;s what you mean to write.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":31740294,"authorName":"Inna Manni","from":"Inna Manni &lt;SpinFrog@...&gt;","profile":"spinfrog","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Hitting is just NOT okay (was: curbing undesi...","postDate":"1106243789","msgId":102709,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwMTIwMTc1NjI5LjM4MTQxLnFtYWlsQHdlYjQwOTEwLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PEJFMTUwQzYzLjMwNTlCJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":102707,"nextInTopic":102710,"prevInTime":102708,"nextInTime":102710,"topicId":102683,"numMessagesInTopic":0,"msgSnippet":"Joyce, I like Sandra s approach too. Violence should be the very last option. But it should definately be an option. That s all I was trying to say. It s funny","messageBody":"<div id=\"ygrps-yiv-1290055017\">Joyce,<br/>\n<br/>\nI like Sandra&#39;s approach too. Violence should be the very last<br/>\noption. But it should definately be an option. That&#39;s all I was<br/>\ntrying to say. <br/>\n<br/>\nIt&#39;s funny you should mention jail time, because my husband&#39;s father<br/>\nspent half his life in jail. I can see the point in what you are<br/>\nsaying, about other options and the confidence gained from martial<br/>\narts training. But have you ever been in a real fight? He has been in<br/>\nmany, and what he brings is the kind of self-confidence and attitude<br/>\nthat can only be gotten from real experience. He has a different<br/>\nperspective than a person who has training but who has never fought<br/>\nunrestricted by rules. I see it and I cannot help but respect it and<br/>\nwish for my daughter to have it. As a teenager, I have been in MANY<br/>\nsituations where I found various alternatives to violence. But it was<br/>\nbecause nobody ever talked to me about such things - besides saying<br/>\n&#39;just ignore them&#39; and &#39;don&#39;t use violence&#39; - because I was scared to<br/>\nfight, unsure of myself - not because of some noble notion that<br/>\nnon-violence is better. I don&#39;t want my daughter to grow up believing<br/>\nherself weak and a coward. <br/>\n<br/>\n--Inna<br/>\n<br/>\n<br/>\n--- Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; While parents may step in and solve a problem, like stopping kids<br/>\n&gt; from<br/>\n&gt; hitting each other, that&#39;s just the beginning. The rest should be<br/>\n&gt; talking to<br/>\n&gt; the kids on the side to figure out what would have worked better.<br/>\n&gt; The parent<br/>\n&gt; should be oriented towards helping the child figure out how to<br/>\n&gt; handle<br/>\n&gt; situations for themselves.<br/>\n&gt; <br/>\n&gt; And it will end because kids want to be independent. My daughter<br/>\n&gt; asked me to<br/>\n&gt; solve arithmetic problems for her when she was younger but now she<br/>\n&gt; does them<br/>\n&gt; herself and gets upset if someone blurts out the answer before<br/>\n&gt; she&#39;s done.<br/>\n&gt; <br/>\n&gt; &gt; when she is 10 or 12 and talking isn&#39;t<br/>\n&gt; &gt; working, and she has grown up believing in total non-violence,<br/>\n&gt; will<br/>\n&gt; &gt; she just stand there and be hurt, and not know what to do?<br/>\n&gt; <br/>\n&gt; She will know if her parents have helped her figure out the options<br/>\n&gt; that<br/>\n&gt; would have worked better when she was in conflicts before.<br/>\n&gt; <br/>\n&gt; Not hitting isn&#39;t the same as total non-violence. In fact Sandra<br/>\n&gt; said her<br/>\n&gt; kids *could* hit after the tried talking and then getting an adult.<br/>\n&gt; <br/>\n&gt; Not hitting (as a first course of action) means there are better<br/>\n&gt; options.<br/>\n&gt; &quot;Don&#39;t hit,&quot; is like &quot;Don&#39;t do school.&quot; When people first hear of<br/>\n&gt; unschooling, taking away school leaves a vacuum. And yet there&#39;s a<br/>\n&gt; world<br/>\n&gt; full of opportunities that exist when someone &quot;doesnt do school&quot;.<br/>\n&gt; Which is<br/>\n&gt; something that lists like this can help with.<br/>\n&gt; <br/>\n&gt; There&#39;s a world full of options that fill the vacuum of &quot;don&#39;t<br/>\n&gt; hit.&quot;<br/>\n&gt; Standing there and letting someone hit you isn&#39;t in the top 10!<br/>\n&gt; <br/>\n&gt; &gt; i did. and <br/>\n&gt; &gt; i don&#39;t want her to be like that.<br/>\n&gt; <br/>\n&gt; Did your parents help you talk about other options you had when you<br/>\n&gt; had<br/>\n&gt; conflicts? Were you unschooled so that you had a sympathetic adult<br/>\n&gt; to help<br/>\n&gt; you figure out what else to do?<br/>\n&gt; <br/>\n&gt; &gt; his father told him that if he was scared<br/>\n&gt; &gt; that a particular person was about to hit him, he should hit them<br/>\n&gt; &gt; first.<br/>\n&gt; <br/>\n&gt; That&#39;s a philosophy that can get people put in jail if they follow<br/>\n&gt; through.<br/>\n&gt; <br/>\n&gt; &gt; i wish my parents had taught me how to stand up for<br/>\n&gt; &gt; myself as well.<br/>\n&gt; <br/>\n&gt; Martial arts can help with this a lot. You can start right now. (I<br/>\n&gt; started<br/>\n&gt; it as an adult. You don&#39;t need to be Bruce Lee for it to work! ;-)<br/>\n&gt; I wasn&#39;t<br/>\n&gt; great but even with my low level of &quot;physical intelligence&quot; the gap<br/>\n&gt; between<br/>\n&gt; a beginner and where I was when I stopped going was *huge*.) The<br/>\n&gt; *best*<br/>\n&gt; thing about martial arts isn&#39;t developing the ability to hurt<br/>\n&gt; someone before<br/>\n&gt; they hurt you. It&#39;s developing the confidence that you *could*<br/>\n&gt; defend<br/>\n&gt; yourself. When you are confident you&#39;re more capable than somene<br/>\n&gt; else then<br/>\n&gt; it&#39;s very easy to walk away from a confrontation.<br/>\n&gt; <br/>\n&gt; It&#39;s *way* better way to learn confidence than being told to stand<br/>\n&gt; up for<br/>\n&gt; yourself and hit someone.<br/>\n&gt; <br/>\n&gt; Joyce<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n\t\t<br/>\n </span></blockquote>__________________________________ <br/>\nDo you Yahoo!? <br/>\nYahoo! Mail - Easier than ever with enhanced search. Learn more.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://info.mail.yahoo.com/mail_250\">http://info.mail.yahoo.com/mail_250</a></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Hitting is just NOT okay (was: curbing undesi...","postDate":"1106239003","msgId":102707,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlLjNkMzk0MDU5LjJmMjEzODFiQGFvbC5jb20+"},"prevInTopic":102704,"nextInTopic":102709,"prevInTime":102706,"nextInTime":102708,"topicId":102683,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/19/2005 8:22:06 PM Mountain Standard Time, SpinFrog@yahoo.com writes: -=-it s true, if she hits, she will be hit in return. it will hurt","messageBody":"<div id=\"ygrps-yiv-715478013\">In a message dated 1/19/2005 8:22:06 PM Mountain Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SpinFrog@...\">SpinFrog@...</a> writes:<br/>\n-=-it&#39;s true, if she hits, she will be hit in return. it will hurt and <br/>\nthere will be bad feelings. hitting is never a real solution, but <br/>\nthere are situations when it needs to be done, because if you do not, <br/>\nyou will always wonder. -=-<br/>\n<br/>\n<br/>\nYou&#39;ll always wonder what?<br/>\nWhether your life would have been better had you hit someone?<br/>\n<br/>\n-=-maybe now that she is only 3, it seems ok for her to get an adult to <br/>\nhelp.-=-<br/>\n<br/>\nShe should always, until the day she dies, be able to ask help of other <br/>\nhumans.<br/>\n<br/>\n-=-when she is 10 or 12 and talking isn&#39;t <br/>\nworking, and she has grown up believing in total non-violence, will <br/>\nshe just stand there and be hurt, and not know what to do?=-<br/>\n<br/>\nIf until then she has been encouraged to hit, why would she stop just because <br/>\nshe was 10 or 12?  Maybe she&#39;ll continue on thinking it&#39;s as cool as anything <br/>\nto hit her own kids.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/spanking\">http://sandradodd.com/spanking</a><br/>\n<br/>\n-=-i wish my parents had taught me how to stand up for <br/>\nmyself as well. <br/>\n-=-<br/>\n<br/>\nA person can stand up for herself with words and with the removal of herself <br/>\nfrom a situation or getting others involved.<br/>\n<br/>\nA person can learn to defuse situations earlier, before any hitting starts.<br/>\n<br/>\nA person who believes hitting is a good idea can go to prison where she will <br/>\nlearn all KINDS of things she can&#39;t get out of.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":163750020,"authorName":"tuckervill2@aol.com","from":"tuckervill2@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Hitting is just NOT okay (was: curbing undesi...","postDate":"1106232002","msgId":102704,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFmMy40NTEwMTM5LjJmMjExY2MyQGFvbC5jb20+"},"prevInTopic":102703,"nextInTopic":102707,"prevInTime":102703,"nextInTime":102705,"topicId":102683,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/19/2005 9:22:06 PM Central Standard Time, SpinFrog@yahoo.com writes: maybe  now that she is only 3, it seems ok for her to get an adult to","messageBody":"<div id=\"ygrps-yiv-1275801365\">In a message dated 1/19/2005 9:22:06 PM Central Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SpinFrog@...\">SpinFrog@...</a> writes:<br/>\n<br/>\nmaybe  now that she is only 3, it seems ok for her to get an adult to <br/>\nhelp. but  if she learns to run to adults for her troubles with other <br/>\nkids, when will  that end? when she is 10 or 12 and talking isn&#39;t <br/>\nworking, and she has  grown up believing in total non-violence, will <br/>\nshe just stand there and be  hurt, and not know what to do? i did. and <br/>\ni don&#39;t want her to be like  that.<br/>\n<br/>\n<br/>\n<br/>\n~~~<br/>\n <br/>\nThere are more options between hitting back and standing there and taking  <br/>\nit.  Would you really just stand there and talk while someone is hitting  you?  <br/>\nWouldn&#39;t you try to get away, at least?  If a man tried to  overpower you on <br/>\nthe street, and you saw someone nearby who could help, wouldn&#39;t  you call out <br/>\nto them?  If you got away and he chased you, wouldn&#39;t you go  to the nearest <br/>\nperson who you thought could help?  <br/>\n <br/>\nWouldn&#39;t you go to your husband if he was nearby?  Sure, you&#39;ll say  your <br/>\nhusband will try to hit the guy.  But wouldn&#39;t it be better if he  called the <br/>\npolice instead, and then there was justice so it didn&#39;t happen to  anyone else?<br/>\n <br/>\nYour child should have the same kind of help, no matter how old she  is.  <br/>\n <br/>\nKaren<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Hitting is just NOT okay (was:\tcurbing undesi...","postDate":"1106223667","msgId":102703,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJFMTUwQzYzLjMwNTlCJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGNzbjM2aCtjMjBqQGVHcm91cHMuY29tPg=="},"prevInTopic":102697,"nextInTopic":102704,"prevInTime":102702,"nextInTime":102704,"topicId":102683,"numMessagesInTopic":0,"msgSnippet":"... While parents may step in and solve a problem, like stopping kids from hitting each other, that s just the beginning. The rest should be talking to the","messageBody":"<div id=\"ygrps-yiv-1725353795\">on 1/19/05 8:57 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SpinFrog@...\">SpinFrog@...</a> at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SpinFrog@...\">SpinFrog@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; maybe now that she is only 3, it seems ok for her to get an adult to<br/>\n&gt; help. but if she learns to run to adults for her troubles with other<br/>\n&gt; kids, when will that end?<br/>\n<br/>\n </span></blockquote>While parents may step in and solve a problem, like stopping kids from<br/>\nhitting each other, that&#39;s just the beginning. The rest should be talking to<br/>\nthe kids on the side to figure out what would have worked better. The parent<br/>\nshould be oriented towards helping the child figure out how to handle<br/>\nsituations for themselves.<br/>\n<br/>\nAnd it will end because kids want to be independent. My daughter asked me to<br/>\nsolve arithmetic problems for her when she was younger but now she does them<br/>\nherself and gets upset if someone blurts out the answer before she&#39;s done.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; when she is 10 or 12 and talking isn&#39;t<br/>\n&gt; working, and she has grown up believing in total non-violence, will<br/>\n&gt; she just stand there and be hurt, and not know what to do?<br/>\n<br/>\n </span></blockquote>She will know if her parents have helped her figure out the options that<br/>\nwould have worked better when she was in conflicts before.<br/>\n<br/>\nNot hitting isn&#39;t the same as total non-violence. In fact Sandra said her<br/>\nkids *could* hit after the tried talking and then getting an adult.<br/>\n<br/>\nNot hitting (as a first course of action) means there are better options.<br/>\n&quot;Don&#39;t hit,&quot; is like &quot;Don&#39;t do school.&quot; When people first hear of<br/>\nunschooling, taking away school leaves a vacuum. And yet there&#39;s a world<br/>\nfull of opportunities that exist when someone &quot;doesnt do school&quot;. Which is<br/>\nsomething that lists like this can help with.<br/>\n<br/>\nThere&#39;s a world full of options that fill the vacuum of &quot;don&#39;t hit.&quot;<br/>\nStanding there and letting someone hit you isn&#39;t in the top 10!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; i did. and <br/>\n&gt; i don&#39;t want her to be like that.<br/>\n<br/>\n </span></blockquote>Did your parents help you talk about other options you had when you had<br/>\nconflicts? Were you unschooled so that you had a sympathetic adult to help<br/>\nyou figure out what else to do?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; his father told him that if he was scared<br/>\n&gt; that a particular person was about to hit him, he should hit them<br/>\n&gt; first.<br/>\n<br/>\n </span></blockquote>That&#39;s a philosophy that can get people put in jail if they follow through.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; i wish my parents had taught me how to stand up for<br/>\n&gt; myself as well.<br/>\n<br/>\n </span></blockquote>Martial arts can help with this a lot. You can start right now. (I started<br/>\nit as an adult. You don&#39;t need to be Bruce Lee for it to work! ;-) I wasn&#39;t<br/>\ngreat but even with my low level of &quot;physical intelligence&quot; the gap between<br/>\na beginner and where I was when I stopped going was *huge*.) The *best*<br/>\nthing about martial arts isn&#39;t developing the ability to hurt someone before<br/>\nthey hurt you. It&#39;s developing the confidence that you *could* defend<br/>\nyourself. When you are confident you&#39;re more capable than somene else then<br/>\nit&#39;s very easy to walk away from a confrontation.<br/>\n<br/>\nIt&#39;s *way* better way to learn confidence than being told to stand up for<br/>\nyourself and hit someone.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":70027997,"authorName":"Mary","from":"Mary &lt;maryw80@...&gt;","profile":"maryw80","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Hitting is just NOT okay (was: curbing undesi...","postDate":"1106223002","msgId":102715,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwMTIwMTIxMDAyLjY0MjU4LnFtYWlsQHdlYjMwNTEwLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGNzbjM2aCtjMjBqQGVHcm91cHMuY29tPg=="},"prevInTopic":102713,"nextInTopic":102725,"prevInTime":102714,"nextInTime":102716,"topicId":102683,"numMessagesInTopic":0,"msgSnippet":"It is so hard to tell our children how to handle this stuff. Either way they can pay: In VA, if a middle school student hits OR hits back, the school is","messageBody":"<div id=\"ygrps-yiv-728376055\">It is so hard to tell our children how to handle this stuff. Either way they can pay:<br/>\n <br/>\nIn VA, if a middle school student hits OR hits back, the school is mandated to call the police. A police report is filed with the childrens names on it. It is up to the discretion of the police officer whether to file a petition with the court or not. If the officer does file, the child(ren) are brought up on &quot;assault and battery&quot; charges. If the child(ren) are 14 yrs or older, they are charged as adults.<br/>\n <br/>\nBTW, the &quot;assault&quot; does not have to be vicious. It can be a half hearted gesture to get a big mouth to stop his verbal abuse. Even if you have documentation that another student has been verbally attacking your child since the beginning of school, the child can be charged. Even if you have documentation that you&#39;ve reported it, the child can be charged.<br/>\n <br/>\nThis is the information given to me by a local In-take Officer. You haven&#39;t lived until you know what the term &quot;In-take Officer&quot; means. She showed me her case load. She is overwhelmed with B&A charges on minors. She&#39;s three months behind the petitions. This means your 12 yr old son can hit/hit back someone at school, and be asked to be accountable for it six months later. By then, the two kids in question are friends.<br/>\n <br/>\nI asked her what happened to mediation. When we were in school, if two kids didn&#39;t get along, they had to spend the day together. We had to eat lunch together, clean the blackboard together, help each other with our seatwork. We were so sick of each other by the end of the day, we were willing to pledge sisterhood if need be. Now, the kids aren&#39;t allowed to talk it out. Nothing is ever resolved between the kids at all. But, the kids end up with a police record.<br/>\n <br/>\nThey can teach No Drugs, Sexuality, Good Touches and Bad Touches, Fire Safety in Your Home....but they aren&#39;t allowed to mediate disputes. I was angry at first, then I realized it was my fault. Ignorance of the law is no excuse. I had no idea this was mandated in my state, but it was my job to know. It&#39;s my fault because my kids had no business being taught in age-segregated classrooms with 35+ kids with one poor teacher. It&#39;s my fault because the minute they came home telling me about the weekly &quot;lock-downs&quot;, I knew better. It&#39;s my fault because the first time my boys came home speaking some sort of street-english, I was accountable. Especially when I spoke to the teachers at Open-House and it was their English the boys were learning to speak.<br/>\n <br/>\nI&#39;ll quit now. I&#39;m getting off-topic. Sorry, I am really concerned about this. Take care, Mary<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SpinFrog@...\">SpinFrog@...</a> wrote:<br/>\n<br/>\n<br/>\nit&#39;s true, if she hits, she will be hit in return. it will hurt and <br/>\nthere will be bad feelings. hitting is never a real solution, but <br/>\nthere are situations when it needs to be done, because if you do not, <br/>\nyou will always wonder. <br/>\n<br/>\nmaybe now that she is only 3, it seems ok for her to get an adult to <br/>\nhelp. but if she learns to run to adults for her troubles with other <br/>\nkids, when will that end? when she is 10 or 12 and talking isn&#39;t <br/>\nworking, and she has grown up believing in total non-violence, will <br/>\nshe just stand there and be hurt, and not know what to do? i did. and <br/>\ni don&#39;t want her to be like that.<br/>\n<br/>\non the other hand, my husband was raised to never let anybody hit him <br/>\nwithout hitting them back. his father told him that if he was scared <br/>\nthat a particular person was about to hit him, he should hit them <br/>\nfirst. he is confident that he can handle himself and knows how he <br/>\nwould react in a dangerous situation, because he has been there so <br/>\nmany times. i wish my parents had taught me how to stand up for <br/>\nmyself as well. <br/>\n<br/>\nperhaps the way his father did it was too harsh, but it gave him <br/>\nstrength and self-confidence i lack. <br/>\n<br/>\n--inna<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, tuckervill2@a... wrote:<br/>\n&gt; Seriously, though, do you think the person who hit her originally <br/>\nis going  <br/>\n&gt; to then just not hit her again?  Where does it end?  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&quot;List Posting Policies&quot; are provided in the files area of this group. <br/>\n<br/>\nVisit the Unschooling website and message boards: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nYahoo! Groups Links<br/>\n<br/>\n   To visit your group on the web, go to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UnschoolingDiscussion/\">http://groups.yahoo.com/group/UnschoolingDiscussion/</a><br/>\n  <br/>\n   To unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n  <br/>\n   Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n Take care, Mary (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.geocities.com/maryw80)\">http://www.geocities.com/maryw80)</a> <br/>\n<br/>\n <br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\n Yahoo! Search presents - Jib Jab&#39;s &#39;Second Term&#39;<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":31740294,"authorName":"SpinFrog@yahoo.com","from":"SpinFrog@...","profile":"spinfrog","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Hitting is just NOT okay (was: curbing undesi...","postDate":"1106186257","msgId":102697,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNzbjM2aCtjMjBqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzYy5hZmMxMWJiLjJmMWZhZmIxQGFvbC5jb20+"},"prevInTopic":102684,"nextInTopic":102703,"prevInTime":102696,"nextInTime":102698,"topicId":102683,"numMessagesInTopic":0,"msgSnippet":"it s true, if she hits, she will be hit in return. it will hurt and there will be bad feelings. hitting is never a real solution, but there are situations when","messageBody":"<div id=\"ygrps-yiv-556696573\">it&#39;s true, if she hits, she will be hit in return. it will hurt and <br/>\nthere will be bad feelings. hitting is never a real solution, but <br/>\nthere are situations when it needs to be done, because if you do not, <br/>\nyou will always wonder. <br/>\n<br/>\nmaybe now that she is only 3, it seems ok for her to get an adult to <br/>\nhelp. but if she learns to run to adults for her troubles with other <br/>\nkids, when will that end? when she is 10 or 12 and talking isn&#39;t <br/>\nworking, and she has grown up believing in total non-violence, will <br/>\nshe just stand there and be hurt, and not know what to do? i did. and <br/>\ni don&#39;t want her to be like that.<br/>\n<br/>\non the other hand, my husband was raised to never let anybody hit him <br/>\nwithout hitting them back. his father told him that if he was scared <br/>\nthat a particular person was about to hit him, he should hit them <br/>\nfirst. he is confident that he can handle himself and knows how he <br/>\nwould react in a dangerous situation, because he has been there so <br/>\nmany times. i wish my parents had taught me how to stand up for <br/>\nmyself as well. <br/>\n<br/>\nperhaps the way his father did it was too harsh, but it gave him <br/>\nstrength and self-confidence i lack. <br/>\n<br/>\n--inna<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, tuckervill2@a... wrote:<br/>\n&gt; Seriously, though, do you think the person who hit her originally <br/>\nis going  <br/>\n&gt; to then just not hit her again?  Where does it end? </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Hitting is just NOT okay (was: curbing undesi...","postDate":"1106143581","msgId":102684,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU5LjFmNTljMGU0LjJmMWZjMzVkQGFvbC5jb20+"},"prevInTopic":102683,"nextInTopic":102697,"prevInTime":102683,"nextInTime":102685,"topicId":102683,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/19/2005 3:33:23 AM Mountain Standard Time, SpinFrog@yahoo.com writes: i agree that it s not ok to hit someone simply out of frustration. ","messageBody":"<div id=\"ygrps-yiv-1814415512\">In a message dated 1/19/2005 3:33:23 AM Mountain Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SpinFrog@...\">SpinFrog@...</a> writes:<br/>\n<br/>\ni agree that it&#39;s not ok to hit someone simply out of frustration. <br/>\nbut i am not sure about saying that it&#39;s NEVER ok to hit. if some kid <br/>\nhits my daughter, i don&#39;t want her to run to me and point them out, i <br/>\nwant her to hit them back. maybe first give them the benefit of <br/>\nyelling &#39;hey, don&#39;t hit me&#39; in case it was an accident and they might <br/>\nmake some gesture of apology.. <br/>\n---------------------<br/>\n<br/>\nThere are better responses than yelling and hitting, whether it was an <br/>\naccident or not.<br/>\n<br/>\nOur policy here when kids were little was first talk, then get a grownup to <br/>\nhelp, and if that doesn&#39;t work *then* you can hit.  It never got to step three <br/>\n(though Kirby had hope it would sometimes, I think).<br/>\n<br/>\nI agree that &quot;never hit&quot; would be a bad rule for someone to review in a case <br/>\nin which an attack or abduction were taking place.   Being hit by another <br/>\nlittle kid is not one of those cases.   And an apology or lack thereof isn&#39;t a <br/>\nreason to decide whether to hit or not.  She could just get away from the kid who <br/>\nhit her and let him calm down.  If the police stop someone for a road rage <br/>\nmoment, it won&#39;t matter if they say &quot;The other guy didn&#39;t apologize.&quot;<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":163750020,"authorName":"tuckervill2@aol.com","from":"tuckervill2@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Hitting is just NOT okay (was: curbing undesi...","postDate":"1106138545","msgId":102683,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzYy5hZmMxMWJiLjJmMWZhZmIxQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":102684,"prevInTime":102682,"nextInTime":102684,"topicId":102683,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/19/2005 4:33:32 AM Central Standard Time, SpinFrog@yahoo.com writes: if some  kid hits my daughter, i don t want her to run to me and","messageBody":"<div id=\"ygrps-yiv-1972119133\">In a message dated 1/19/2005 4:33:32 AM Central Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SpinFrog@...\">SpinFrog@...</a> writes:<br/>\n<br/>\nif some  kid <br/>\nhits my daughter, i don&#39;t want her to run to me and point them out, i  <br/>\nwant her to hit them back. <br/>\n<br/>\n<br/>\n~~~<br/>\n <br/>\nThat&#39;s how wars are started.<br/>\n <br/>\nSeriously, though, do you think the person who hit her originally is going  <br/>\nto then just not hit her again?  Where does it end?  It doesn&#39;t, it  just <br/>\nescalates until someone gets hurt and relationships are damaged and  playgroups are <br/>\ndestroyed.  <br/>\n <br/>\nSomeone has to realize that revenge and retribution are not the  answer.  I <br/>\nwant it to be my child.<br/>\n <br/>\nKaren<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":102760,"nextTopicId":102774}}