{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":10,"messages":[{"userId":31740294,"authorName":"SpinFrog@yahoo.com","from":"SpinFrog@...","profile":"spinfrog","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Hitting is just NOT okay (was: curbing undesirable behavior)","postDate":"1106104209","msgId":102678,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNza2oyaCtkNWpzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc4LjZhODZmZGE5LjJmMWE5YmRlQGFvbC5jb20+"},"prevInTopic":102651,"nextInTopic":0,"prevInTime":102677,"nextInTime":102679,"topicId":102625,"numMessagesInTopic":0,"msgSnippet":"i agree that it s not ok to hit someone simply out of frustration. but i am not sure about saying that it s NEVER ok to hit. if some kid hits my daughter, i","messageBody":"<div id=\"ygrps-yiv-2090784802\">i agree that it&#39;s not ok to hit someone simply out of frustration. <br/>\nbut i am not sure about saying that it&#39;s NEVER ok to hit. if some kid <br/>\nhits my daughter, i don&#39;t want her to run to me and point them out, i <br/>\nwant her to hit them back. maybe first give them the benefit of <br/>\nyelling &#39;hey, don&#39;t hit me&#39; in case it was an accident and they might <br/>\nmake some gesture of apology.. <br/>\n<br/>\n--inna<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, SandraDodd@a... wrote:<br/>\n&gt; I would tell him too, truthfully, that there are people in jail and <br/>\nprison  <br/>\n&gt; for just hitting another person.  There are people who are older <br/>\nwho hit  <br/>\n&gt; strangers and they get hit back HARD or shot.  Hitting is just NOT  <br/>\nokay to do, <br/>\n&gt; it&#39;s not safe, it&#39;s not right. </span></blockquote></div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: curbing undesirable behavior","postDate":"1105900954","msgId":102651,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYzMDM4RjBGLTY3RUUtMTFEOS04OUJDLTAwMEE5NTdFRkU0NkBtYWMuY29tPg==","inReplyToHeader":"PDUuMi4xLjEuMi4yMDA1MDExNjA5NDcyNy4wMjQwYzAwOEBwb3AzLmRpcmVjd2F5LmNvbT4=","referencesHeader":"PDUuMi4xLjEuMi4yMDA1MDExNjA5NDcyNy4wMjQwYzAwOEBwb3AzLmRpcmVjd2F5LmNvbT4="},"prevInTopic":102648,"nextInTopic":102678,"prevInTime":102650,"nextInTime":102652,"topicId":102625,"numMessagesInTopic":0,"msgSnippet":"... That s so interesting! I have tried - with increasing success as the kids have gotten older - NOT to tell them things they already know as if I don t think","messageBody":"<div id=\"ygrps-yiv-704861313\">On Jan 16, 2005, at 7:37 AM, Shannon Entin wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; No, but I do repeat myself often. I am also too long-winded, but <br/>\n&gt; working on<br/>\n&gt; this. I feel like there&#39;s so much contradictory info when it comes to<br/>\n&gt; parenting! Some say repetition is needed for children to learn, others <br/>\n&gt; say<br/>\n&gt; it will just make the child &quot;turn off.&quot;<br/>\n<br/>\n </span></blockquote>That&#39;s so interesting! I have tried - with increasing success as the <br/>\nkids have gotten older - NOT to tell them things they already know as <br/>\nif I don&#39;t think they remember. First, it is annoying and I don&#39;t want <br/>\nmy kids to think of me as annoying. Second, it isn&#39;t useful information <br/>\nif they KNOW it already, so why say it? Mostly, though, it is because I <br/>\nthink it undermines their own sense of responsibility. I&#39;ve seen kids <br/>\ndoing something - something I KNOW they know is not appropriate. They <br/>\nkeep watching their parent, waiting to see if the parent will say <br/>\nanything, as if it is the parent saying something that makes it okay or <br/>\nnot okay. I&#39;ve heard kids say, &quot;But you didn&#39;t tell me not to,&quot; as if <br/>\nthat made something okay for them to do EVEN though they knew, <br/>\nthemselves, that it wasn&#39;t.<br/>\n<br/>\nI try really hard to offer information rather than tell them what to <br/>\ndo, too. Remember to think about what THEY are thinking inside their <br/>\nown head in response to what you&#39;re saying.<br/>\n<br/>\nWhat we WISH - what parents often imagine the kids are thinking in <br/>\nresponse to: &quot;Pick up your towel and hang it up, please,&quot; is &quot;Oh yes, I <br/>\nshould pick up this towel right now and hang it up nicely because then <br/>\nit&#39;ll be nice and dry and clean next time I want to use it and my mom <br/>\nwon&#39;t have so much laundry to do and the house will look neater and it <br/>\nis a good habit to put things away right away, not leave them for <br/>\nlater, because we all know how later sometimes never comes and I&#39;m so <br/>\nglad my mom reminded me to put this towel away.&quot; &lt;G&gt;<br/>\n<br/>\nReality:<br/>\n<br/>\n&quot;Pick up that towel and hang it up.&quot; (&quot;You don&#39;t have to order me <br/>\naround like that.&quot;) Coercion always feels bad - always creates some <br/>\namount of resistance.<br/>\n<br/>\n&quot;The towel is wet and will make the carpet wet and it&#39;ll get moldy.&quot; <br/>\n(&quot;How many times have you told me that, do you think I&#39;m stupid or <br/>\nwhat? And I really don&#39;t think that little bit of wetness is going to <br/>\nmake the carpet moldy anyway, so you&#39;re either not very smart or you&#39;re <br/>\nexaggerating.&quot;)<br/>\n<br/>\n&quot;Pick the towel up NOW, please.&quot; (&quot;Sheesh, can&#39;t it wait one minute? <br/>\nYou&#39;re so impatient. Can&#39;t you see I&#39;m in the middle of something? <br/>\nDon&#39;t you trust me to come back and do it in a second?&quot; &quot;Don&#39;t you <br/>\nthink what I&#39;m doing now is more important than picking up a stupid <br/>\ntowel?&quot;)<br/>\n<br/>\n&quot;Pick up the towel and hang it up so it&#39;ll be nice and dry next time <br/>\nyou want it. PIcking things up when we first drop them is a lot easier <br/>\nthan having to around clean up everything later. Isn&#39;t it nicer when <br/>\nthe house is neat and orderly. Putting things away means they&#39;re there <br/>\nwhen you need them later.&quot; (How many TIMES do you have to say these <br/>\nthings to me? Do you think I can&#39;t hear or what?&quot; &quot;Blah blah blah blah <br/>\nblah blah blah....&quot;)<br/>\n<br/>\nNone of those are the kinds of things we want our kids to be thinking <br/>\nin response to what we say to them.<br/>\n<br/>\nSo - if our kid keeps dropping wet towels on the carpet, what do we do?<br/>\n<br/>\nWhat would you say to another adult who was walking away leaving their <br/>\nwet towel on the carpet?<br/>\nPossibly, lightly and casually, remind them as they walk away? &quot;Don&#39;t <br/>\nforget your towel.&quot; Or - even more likely - just pick it up - maybe <br/>\nhand it to them and say, &quot;Oh, here is your towel.&quot; (&quot;Whoops - I almost <br/>\nforgot it.&quot;)<br/>\n<br/>\nOr - maybe a questioning tone - &quot;Do you want to take your towel?&quot; (&quot;Oh <br/>\n- yeah, thanks.&quot;)<br/>\n<br/>\nOFTEN - if the kid is busy, &quot;I&#39;ll hang up your towel for you.&quot; <br/>\n(&quot;Thanks.&quot;)  Took some practice to say that without sounding annoyed - <br/>\njust helpful.<br/>\n<br/>\nA good exercise to get better at this stuff is to try to say just one <br/>\nword. Yep - ONE word. In a nice tone.<br/>\n<br/>\n&quot;Towel.&quot; (Huh? Towel? What? Oh yeah - she means I should pick up my <br/>\ntowel and hang it up.&quot;)<br/>\n<br/>\nI really suggest trying the one word approach. It can be a real <br/>\neye-opener and change the atmosphere of a home a LOT.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":207138431,"authorName":"kish95@aol.com","from":"kish95@...","profile":"kirstenfredericks","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: curbing undesirable behavior","postDate":"1105894556","msgId":102648,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMuM2M4YWJkZTUuMmYxYmY2OWNAYW9sLmNvbT4="},"prevInTopic":102646,"nextInTopic":102651,"prevInTime":102647,"nextInTime":102649,"topicId":102625,"numMessagesInTopic":0,"msgSnippet":"Hi Shannon- I just wanted to offer some possible advice.  I missed the post that said how old your son is, but I m guessing he s around 3 1/2 by his behavior.","messageBody":"<div id=\"ygrps-yiv-539416022\">Hi Shannon- I just wanted to offer some possible advice.  I missed the post <br/>\nthat said how old your son is, but I&#39;m guessing he&#39;s around 3 1/2 by his <br/>\nbehavior.  His behavior is fairly developmentally correct, while it may seem <br/>\nextreme.  But there is still a chance that this could be part of his temperament and <br/>\na book like The Explosive Child offers an excellent method for helping <br/>\nchildren cope with frustration, and finding collaborative solutions.  Because your <br/>\nson is young and doesn&#39;t have the language he needs to tell you what is wrong, <br/>\nyour skills of intuition and empathy are going to be critical.  Then you may <br/>\nneed to provide your son with the language, using some trial and error.  For <br/>\nexample, with the nursing and watching TV scenario.  You correctly figured out <br/>\nthat he was choosing an activity that you couldn&#39;t possibly do while nursing.  <br/>\nFrom your perspective, this is antagonistic.  From his, he&#39;s just testing you <br/>\nto see if his needs are as important to you as the baby&#39;s.  You could start by <br/>\nsaying to him, &quot;You must feel like Baby gets a lot of Mommie&#39;s attention <br/>\nbecause he&#39;s nursing.  I bet you wish you could have Mommy all to yourself again.&quot;  <br/>\nFirst empathize- this will take practice and he may not get it right away.  <br/>\nThen, after helping him name his feelings, find a solution.  It might require <br/>\nputting the baby down for 5-10 minutes, if he&#39;s not shrieking, or promising to <br/>\ndo something just with your son, say during the babies nap.  &quot;Hey babies sure <br/>\ntake a lot of time and work, maybe you can help me soothe him while he nurses <br/>\nhimself to sleep- then we can do something together.&quot;  Yes- you can keep <br/>\nrepeating the Don&#39;t hit mantra, but most likely your son already knows its not OK <br/>\nto hit, he just doesn&#39;t have the other tools to resapond to his frustration.  <br/>\nSo instead, he&#39;s frustrated AND convinced that he&#39;s a bad, unlovable boy <br/>\nbecause he&#39;s hitting.  Try also, The Challenging Child, by Stanley Greenspan, which <br/>\nadvocates&quot;floor time&quot; with each of your children.  But really- The Explosive <br/>\nChild, by Dr. Ross Green is the best.  Wow that was long- hope it helps.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":183835305,"authorName":"Shannon Entin","from":"Shannon Entin &lt;entinfamily@...&gt;","profile":"scrapbookershan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: curbing undesirable behavior","postDate":"1105889831","msgId":102646,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMi4xLjEuMi4yMDA1MDExNjA5NDcyNy4wMjQwYzAwOEBwb3AzLmRpcmVjd2F5LmNvbT4=","inReplyToHeader":"PDExMDU4NDI4NDMuMTY1NC41MjEyNC5tMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":102637,"nextInTopic":102648,"prevInTime":102645,"nextInTime":102647,"topicId":102625,"numMessagesInTopic":0,"msgSnippet":"First I d like to say that I love this list - what a great source of ... No, but I do repeat myself often. I am also too long-winded, but working on this. I","messageBody":"<div id=\"ygrps-yiv-716746480\">First I&#39;d like to say that I love this list - what a great source of <br/>\nsupport and ideas!  My responses to various posts below:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Six isn&#39;t too young to talk to him like a person.  Are you using set  phrases<br/>\n&gt;in a sing-songy voice?<br/>\n<br/>\n </span></blockquote>No, but I do repeat myself often. I am also too long-winded, but working on <br/>\nthis. I feel like there&#39;s so much contradictory info when it comes to <br/>\nparenting! Some say repetition is needed for children to learn, others say <br/>\nit will just make the child &quot;turn off.&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I would tell him too, truthfully, that there are people in jail and prison<br/>\n&gt;for just hitting another person.<br/>\n<br/>\n </span></blockquote>I have done this. Asked him what he thought would happen if I hit our <br/>\nneighbor, and explained that the neighbor would call the police and I would <br/>\ngo to jail. My son thought about that for a moment, but it didn&#39;t seem to <br/>\nmake a big impact and certainly didn&#39;t stop future hitting incidents.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I wouldn&#39;t ignore the hitting though, either.<br/>\n<br/>\n </span></blockquote>I wasn&#39;t clear when I said I would &quot;ignore&quot; him. I do not stand there and <br/>\nlet him hit me. I make it clear that it&#39;s NOT ok to behave this way and I <br/>\nmove away from him to protect myself. By &quot;ignore&quot; I meant &quot;walk away.&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Also - I talked to my explosive child a lot about what she felt like in<br/>\n&gt;the moments before she exploded and that seemed to really help<br/>\n<br/>\n </span></blockquote>My son doesn&#39;t (can&#39;t?) talk about his feelings. If I bring the issues up <br/>\nwhen he is calm, he will say &quot;I don&#39;t know&quot; or &quot;I can&#39;t remember.&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Some kids are very much more<br/>\n&gt;easily frustrated with the usual minor things that happen in life -<br/>\n&gt;like mom pulling the wrong jam out of the refrigerator.<br/>\n&gt;Most of the work to stop the hitting and screaming is done when the<br/>\n&gt;child is NOT hitting and screaming. Partly it is the parent being more<br/>\n&gt;alert to what kinds of things lead to it - and heading them off and<br/>\n&gt;helping the child anticipate them too.<br/>\n<br/>\n </span></blockquote>This is my challenge.  Many times I can recognize what will set him off. <br/>\nBut then there are times when I can&#39;t. Example: I am nursing the baby and <br/>\nhe is sitting next to me watching TV, everything is fine. Then a commercial <br/>\nwill come on (or the show is over) and it&#39;s like he suddenly realizes I am <br/>\nnursing the baby and not sitting there waiting to execute his next command. <br/>\nSo he&#39;ll just growl at me or punch me. Not a tantrum or meltdown, just a <br/>\nfrustrated punch out of the blue. Typically, I will try to put words to his <br/>\nfeelings, acknowledging that he may be bored and why don&#39;t we read a book <br/>\nor play cards or something else I can do while nursing. His response is <br/>\nusually to ask to do something he *knows* I can&#39;t do while nursing. It&#39;s <br/>\nvery antagonistic - almost as if he&#39;s *looking* for a reason to get mad.<br/>\n<br/>\nQuestion: If I try to avert possibly volatile situations and tip-toe around <br/>\nhim, will he learn to handle frustration?  Or will he just learn that Mommy <br/>\nwill &quot;make everything ok?&quot; Example:  He knows that I know the *right* way <br/>\nto cut/prepare his food. So when Dad has to make his food, he lashes out <br/>\nand insists Mommy has to do it. And he often gets angry and hits when dh & <br/>\nI are talking (presumably because no one is paying attention to him). <br/>\nDoesn&#39;t he need to learn that he can not *always* be the center of <br/>\nattention? I mean, my husband and I can&#39;t hold all our conversations until <br/>\nhe goes to bed in hopes that this will head off an outburst.<br/>\n<br/>\n~Shannon</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: curbing undesirable behavior","postDate":"1105823110","msgId":102637,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI0NTgxMTdBLTY3MzktMTFEOS04OUJDLTAwMEE5NTdFRkU0NkBtYWMuY29tPg==","inReplyToHeader":"PGZjLmFhNmIwZmYuMmYxYWFkYmRAYW9sLmNvbT4=","referencesHeader":"PGZjLmFhNmIwZmYuMmYxYWFkYmRAYW9sLmNvbT4="},"prevInTopic":102633,"nextInTopic":102646,"prevInTime":102636,"nextInTime":102638,"topicId":102625,"numMessagesInTopic":0,"msgSnippet":"... How about a turkey?  We had a turkey running around at our park day a few weeks ago - yeah, a turkey. (We do not live in a place where turkeys run","messageBody":"<div id=\"ygrps-yiv-438067752\">On Jan 15, 2005, at 9:32 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I have no compunctions about yelling &quot;NO&quot; even to a really little  <br/>\n&gt; child.  If<br/>\n&gt; a neighbor came into the yard and was hitting my kid or my dog  or even<br/>\n&gt; kicking my car, I wouldn&#39;t even BEGIN to say, &quot;Harry, I can see you&#39;re <br/>\n&gt;  frustrated,<br/>\n&gt; but it&#39;s not really okay to hit.  Harry, could you stop?   Harry, <br/>\n&gt; let&#39;s talk.&quot;<br/>\n<br/>\n </span></blockquote>How about a turkey? &lt;BEG&gt;<br/>\nWe had a turkey running around at our park day a few weeks ago - yeah, <br/>\na turkey. (We do not live in a place where turkeys run around wild.)<br/>\n<br/>\nIt was tame - and kids around 4 to 6 years old were chasing it and <br/>\nthrowing sand right in its face. I didn&#39;t know the kids (it wasn&#39;t the <br/>\nkids in our group). The adults who were with those kids were all at a <br/>\ntable - half watching. There was no way that they weren&#39;t aware - but <br/>\nthey were ignoring. I stood between the adults and the kids, facing the <br/>\nkids and said, &quot;Stop NOW!&quot; Very strongly, but not too loud. They <br/>\nstopped but were just obviously waiting until I turned my back to start <br/>\nup again. Some of us herded the turkey away from the playground and <br/>\neventually one of our group took it over to the nearby animal shelter.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: curbing undesirable behavior","postDate":"1105810365","msgId":102633,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZjLmFhNmIwZmYuMmYxYWFkYmRAYW9sLmNvbT4="},"prevInTopic":102632,"nextInTopic":102637,"prevInTime":102632,"nextInTime":102634,"topicId":102625,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/15/2005 10:22:42 A.M. Mountain Standard Time, mamaaj2000@yahoo.com writes: -=-Same  thing with hitting another child--it doesn t matter","messageBody":"<div id=\"ygrps-yiv-1520623483\">In a message dated 1/15/2005 10:22:42 A.M. Mountain Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mamaaj2000@...\">mamaaj2000@...</a> writes:<br/>\n<br/>\n-=-Same  thing with hitting <br/>\nanother child--it doesn&#39;t matter that he doesn&#39;t like  me picking him <br/>\nup when he&#39;s mad, the hitting has to  stop.-=-<br/>\n <br/>\n<br/>\nI have no compunctions about yelling &quot;NO&quot; even to a really little  child.  If <br/>\na neighbor came into the yard and was hitting my kid or my dog  or even <br/>\nkicking my car, I wouldn&#39;t even BEGIN to say, &quot;Harry, I can see you&#39;re  frustrated, <br/>\nbut it&#39;s not really okay to hit.  Harry, could you stop?   Harry, let&#39;s talk.&quot;<br/>\n <br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] curbing undesirable behavior","postDate":"1105810052","msgId":102632,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFmMi40MmQ0MzI0LjJmMWFhYzg0QGFvbC5jb20+"},"prevInTopic":102631,"nextInTopic":102633,"prevInTime":102631,"nextInTime":102633,"topicId":102625,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/15/2005 9:56:15 A.M. Mountain Standard Time, pamsoroosh@mac.com writes: -=-I  really think that to just stay calm and address the jam","messageBody":"<div id=\"ygrps-yiv-21345728\">In a message dated 1/15/2005 9:56:15 A.M. Mountain Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a> writes:<br/>\n<br/>\n-=-I  really think that to just stay calm and address the jam issue, in the <br/>\nface  of being screamed at and hit and kicked, is not a good idea. I <br/>\nthink the  sandwich and jam become a secondary issue at that point and I <br/>\ndon&#39;t think  calmly and sweetly responding with, &quot;Oh, you prefer another <br/>\nkind of jam,&quot;  is responsive to what is really happening in that  <br/>\nsituation.-=-<br/>\n<br/>\n<br/>\n------------------<br/>\n <br/>\nI agree.<br/>\n <br/>\nThe mom could have let him pick his jam in advance.<br/>\nThe mom could have asked him to help.<br/>\n <br/>\nIf it were me, I would pointedly put down all implements of sandwich making  <br/>\nentirely, so the kid saw that sandwich making had been suspended until yelling <br/>\n stopped.<br/>\n <br/>\n-=-Parents with kids who do this can often head it off if they&#39;ll take a  <br/>\nLOT of time and make an effort to not add to the frustration of the <br/>\nkid.  ALWAYS ask questions - never assume. &quot;So you want peanut butter <br/>\nand jelly?  What kind of jelly? Lots of it or a little? Do you want your <br/>\nsandwich cut in  half this way or that way?&quot; And so on.-=-<br/>\n <br/>\nYes.  And REALLY pay attention to the child.<br/>\n <br/>\nWhen I&#39;ve seen the worst such melt-downs myself, the mom was talking to  <br/>\nother moms, or being on the phone, or somehow just pretending to listen to the  <br/>\nkid out of the corner of her awareness without really stopping the other  <br/>\nactivity and looking right at her child and being (with all her being, thought,  <br/>\nfocus) with him.  FIVE SECONDS of real attention can avert a rage.<br/>\n <br/>\n-=-I think parents should stay kind and caring - but be very clear, too,  <br/>\n&quot;Sweetheart, I&#39;m not going to let you hit me or kick me. I REALLY want  <br/>\nto help you out, but first you absolutely must stop hitting and kicking  <br/>\nand then we&#39;ll TALK about what&#39;s frustrating you so much and we&#39;ll find  <br/>\na solution.&quot; -=-<br/>\n <br/>\nToo many words.<br/>\n <br/>\nA frustrated human (even an adult) whose mind is spinning can&#39;t hear  all <br/>\nthat.  It will infuriate him more.<br/>\n <br/>\n&quot;STOP. Talk.  Breathe and talk.&quot;<br/>\nThat&#39;s my recommendation if someone wants a scripted message.<br/>\n <br/>\n-=- When NOT in a hitting situation, <br/>\nsay, &quot;So, I noticed that when  we&#39;re getting ready to go out, that&#39;s a <br/>\ntime that is really stressful and we  often have blow-ups then. I&#39;m <br/>\nthinking about what we can do to make those  times easier. Like, I was <br/>\nthinking that I could give you more information  about when we&#39;re going <br/>\nto be going places and what we&#39;re going to be doing.  What do you think? <br/>\nAny other ideas?&quot; -=-<br/>\n <br/>\nMaybe the mom could just TRY the things she thinks will work andnot make it  <br/>\nthe child&#39;s responsibility to help her figure out how to be an attentive and  <br/>\nprepared mom. <br/>\n <br/>\n<br/>\n-=-&quot;Or maybe we could have some clothes picked out every <br/>\nday to be  those clothes you&#39;ll wear when we&#39;re going out, so you don&#39;t <br/>\nhave to try to  pick them out when it is already time to go.&quot; And so on.<br/>\n-=-<br/>\n <br/>\nA mom having had that thought should act on the thought.  If clothes  or <br/>\nfinding shoes are an issue, the night before or an hour before, the mom  should <br/>\nsay &quot;What are you going to wear?  Where is it?&quot; and help the child  get the <br/>\nclothes into a found, available state.  If the child doesn&#39;t know  where his coat <br/>\nis, the mom probably doesn&#39;t either.  Until such age as a  child doesn&#39;t need <br/>\nthe mom&#39;s help anymore (even if that&#39;s 20 years old), the mom  should help and <br/>\nnot blame the kid for not knowing where something is or not  knowing what he <br/>\nwants to wear, etc.<br/>\n <br/>\n-=Also - I talked to my explosive child a lot about what she felt like in  <br/>\nthe moments before she exploded and that seemed to really help - what  <br/>\nsigns to look for that her anger or frustration level was reaching a  <br/>\ncritical point -=-<br/>\n <br/>\nThat&#39;s what I meant by something is happening just before the  hitting.  I <br/>\ncould see the signs in Kirby.  He would tighten up.   His face and posture would <br/>\nget hard, like he was on the alert for the coming  last straw.  And so I <br/>\nwould try to back him back to a point where he could  handle another five or six <br/>\nfrustrations, not just help him maintain his &quot;last  straw&quot; status.<br/>\n <br/>\nEmotional explosions follow emotional build-ups.  Parents who  habitually <br/>\nignore the buildup and then try to figure out how to manage the  volcanic <br/>\nactivity might work on being better managers of the peace of their  families.<br/>\n <br/>\nIt has been years since Kirby has had any scenes of frustration, but he  used <br/>\nto.  We worked to give him tools to use so that he could sense his own  <br/>\nbuilding emotions, and philosophical ideas and principles that helped him see  the <br/>\nvalue in being calmer and more understanding.  It didn&#39;t happen all in  one <br/>\nyear, but it did happen.  (Karate helped too, and that&#39;s another  standing <br/>\nrecommendation as far as I&#39;m concerned for any child who lashes out  physically:  <br/>\nmartial arts training in a school that emphasizes  character, control, defense <br/>\nand the history of the form.)<br/>\n <br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78615010,"authorName":"mamaaj2000","from":"&quot;mamaaj2000&quot; &lt;mamaaj2000@...&gt;","profile":"mamaaj2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: curbing undesirable behavior","postDate":"1105809629","msgId":102631,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNzYmpjdCtlZDA4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFGRjQxMTkyLTY3MTYtMTFEOS04OUJDLTAwMEE5NTdFRkU0NkBtYWMuY29tPg=="},"prevInTopic":102629,"nextInTopic":102632,"prevInTime":102630,"nextInTime":102632,"topicId":102625,"numMessagesInTopic":0,"msgSnippet":"... Good point. Most of what I ve dealt with has been one outburst, so we could move ahead with a calm-down period and then talking. But yeh, a growth spurt at","messageBody":"<div id=\"ygrps-yiv-2096408601\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, pam sorooshian <br/>\n&lt;pamsoroosh@m...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I just think it is a really really bad <br/>\n&gt; idea for parents to let their kids keep on hitting and kicking them.<br/>\n<br/>\n </span></blockquote>Good point. Most of what I&#39;ve dealt with has been one outburst, so we <br/>\ncould move ahead with a calm-down period and then talking. But yeh, a <br/>\ngrowth spurt at 3.5 had ds hitting and hitting, so I would sometimes <br/>\ntake dd into the kitchen and close the gate. Yes, I want to find a <br/>\nway to deal with the situation without adding more negative emotions, <br/>\nbut not at the expense of getting hit again. Same thing with hitting <br/>\nanother child--it doesn&#39;t matter that he doesn&#39;t like me picking him <br/>\nup when he&#39;s mad, the hitting has to stop.<br/>\n<br/>\n--aj</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] curbing undesirable behavior","postDate":"1105808070","msgId":102629,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFGRjQxMTkyLTY3MTYtMTFEOS04OUJDLTAwMEE5NTdFRkU0NkBtYWMuY29tPg==","inReplyToHeader":"PDc4LjZhODZmZGE5LjJmMWE5YmRlQGFvbC5jb20+","referencesHeader":"PDc4LjZhODZmZGE5LjJmMWE5YmRlQGFvbC5jb20+"},"prevInTopic":102625,"nextInTopic":102631,"prevInTime":102628,"nextInTime":102630,"topicId":102625,"numMessagesInTopic":0,"msgSnippet":"... I wouldn t ignore the hitting though, either. Sometimes I see parents just try to keep working through on whatever the situation is that is causing him to","messageBody":"<div id=\"ygrps-yiv-950979479\">On Jan 15, 2005, at 8:16 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;You cannot hit&quot; isn&#39;t good information.  Obviously he CAN hit.   He&#39;s <br/>\n&gt; doing<br/>\n&gt; it regularly.<br/>\n&gt; And ignoring him? If he NEEDS attention, it&#39;s a need.  Withholding  <br/>\n&gt; attention<br/>\n&gt; from a kid who needs attention is like withholding food from a kid who <br/>\n&gt;  needs<br/>\n&gt; food, or the bed from a kid who&#39;s sleepy.<br/>\n<br/>\n </span></blockquote>I wouldn&#39;t ignore the hitting though, either. Sometimes I see parents <br/>\njust try to keep working through on whatever the situation is that is <br/>\ncausing him to hit - just pretending they don&#39;t even notice that they <br/>\nare being pummeled in the meantime.<br/>\n<br/>\nExample: mom is fixing a sandwich that the child requested and the <br/>\nchild thinks the mom is about to put on the wrong kind of jam. The <br/>\nchild starts screaming and hitting and kicking the mom - &quot;NOOOOO , not <br/>\nthat kind you KNOW I don&#39;t want that KIND why do you always put the <br/>\nwrong kind on......&quot;.<br/>\n<br/>\nI really think that to just stay calm and address the jam issue, in the <br/>\nface of being screamed at and hit and kicked, is not a good idea. I <br/>\nthink the sandwich and jam become a secondary issue at that point and I <br/>\ndon&#39;t think calmly and sweetly responding with, &quot;Oh, you prefer another <br/>\nkind of jam,&quot; is responsive to what is really happening in that <br/>\nsituation. I&#39;m not advocating punishment or anything - just that going <br/>\non as if this is business as usual is sending a very very poor piece of <br/>\ninformation to the kid. Sandra said, for example, that when people are <br/>\nolder and they lash out like that, they can get hit back, hard, or even <br/>\nshot. So a mom who pretends it isn&#39;t even happening - or ineffectually <br/>\nsays, sweetly, &quot;Honey, I don&#39;t like it when you hit me. Now (even <br/>\nthough she is STILL being attacked) what kind of jam would you like?&quot; <br/>\nis really teaching the kid that hitting and screaming ARE the best ways <br/>\nto quickly get what he wants.<br/>\n<br/>\nThere are obviously other things going on with kids who are hitting and <br/>\nscreaming at their parents like that. Some kids are very much more <br/>\neasily frustrated with the usual minor things that happen in life - <br/>\nlike mom pulling the wrong jam out of the refrigerator. And they need a <br/>\nTON of help to learn to handle frustration. But it truly is NOT helpful <br/>\nto them for parents to tolerate hitting and screaming at them, either.<br/>\n<br/>\nParents with kids who do this can often head it off if they&#39;ll take a <br/>\nLOT of time and make an effort to not add to the frustration of the <br/>\nkid. ALWAYS ask questions - never assume. &quot;So you want peanut butter <br/>\nand jelly? What kind of jelly? Lots of it or a little? Do you want your <br/>\nsandwich cut in half this way or that way?&quot; And so on.<br/>\n<br/>\nIt is hard.<br/>\n<br/>\nAnd a parent can only do so much - with other kids and other demands on <br/>\nthem, they can&#39;t make life completely frustration-free for their child.<br/>\n<br/>\nI think parents should stay kind and caring - but be very clear, too, <br/>\n&quot;Sweetheart, I&#39;m not going to let you hit me or kick me. I REALLY want <br/>\nto help you out, but first you absolutely must stop hitting and kicking <br/>\nand then we&#39;ll TALK about what&#39;s frustrating you so much and we&#39;ll find <br/>\na solution.&quot; Or, sometimes, it helps with littler kids to say, &quot;Do not <br/>\nhit me - say &quot;I AM FRUSTRATED&quot; instead.&quot; Helping them have the exact <br/>\nwords to say when those intense and out of control feelings arise, is <br/>\noften really effective.<br/>\n<br/>\nI also don&#39;t think ignoring them is a good idea - that comes from the <br/>\nbehaviorist idea of &#39;extinguishing&#39; a negative behavior by not <br/>\nresponding to it. It is a Skinnerian conditioning technique. In fact, I <br/>\nthink other things should stop and the behavior itself should be the <br/>\nfocus. If the child won&#39;t let you hold them - then just standing there <br/>\ngently waiting might be good. Lecturing isn&#39;t good. If you say <br/>\nsomething once, don&#39;t keep repeating it in different ways. That&#39;s just <br/>\nmore frustration and irritation and the child will stop listening <br/>\nanyway.If they won&#39;t stop hitting or kicking you, I&#39;d go behind a <br/>\nclosed door to protect myself. I just think it is a really really bad <br/>\nidea for parents to let their kids keep on hitting and kicking them.<br/>\n<br/>\nMost of the work to stop the hitting and screaming is done when the <br/>\nchild is NOT hitting and screaming. Partly it is the parent being more <br/>\nalert to what kinds of things lead to it - and heading them off and <br/>\nhelping the child anticipate them too. When NOT in a hitting situation, <br/>\nsay, &quot;So, I noticed that when we&#39;re getting ready to go out, that&#39;s a <br/>\ntime that is really stressful and we often have blow-ups then. I&#39;m <br/>\nthinking about what we can do to make those times easier. Like, I was <br/>\nthinking that I could give you more information about when we&#39;re going <br/>\nto be going places and what we&#39;re going to be doing. What do you think? <br/>\nAny other ideas?&quot; &quot;Or maybe we could have some clothes picked out every <br/>\nday to be those clothes you&#39;ll wear when we&#39;re going out, so you don&#39;t <br/>\nhave to try to pick them out when it is already time to go.&quot; And so on.<br/>\n<br/>\nAlso - I talked to my explosive child a lot about what she felt like in <br/>\nthe moments before she exploded and that seemed to really help - what <br/>\nsigns to look for that her anger or frustration level was reaching a <br/>\ncritical point and what to do immediately (like breathing deeply three <br/>\ntimes before doing anything else).<br/>\n<br/>\nHard stuff.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"curbing undesirable behavior","postDate":"1105805790","msgId":102625,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc4LjZhODZmZGE5LjJmMWE5YmRlQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":102629,"prevInTime":102624,"nextInTime":102626,"topicId":102625,"numMessagesInTopic":0,"msgSnippet":"-=-I ve tried punishment in the sense of taking things away (no  treats for two days, Gameboy taken away, etc.) and this does not seem to  affect him.-=- It","messageBody":"<div id=\"ygrps-yiv-386578565\">-=-I&#39;ve tried punishment in the sense <br/>\nof taking things away (no  treats for two days, Gameboy taken away, etc.) <br/>\nand this does not seem to  affect him.-=-<br/>\n <br/>\nIt does affect him, but not in a way that makes things better.<br/>\n <br/>\n&quot;Treats&quot;?  Treats is a dangerous concept anyway.<br/>\n <br/>\n <br/>\n<br/>\n-=- So I am trying now to simply ignore <br/>\nit and just tell him &quot;You can  not hit&quot; and moving away from him. Yes, he <br/>\nwill follow me, but if it&#39;s my  attention he&#39;s after, hopefully he will see <br/>\nthat hitting is not the way to  get it. I suppose it will just take time, <br/>\nlike anything else!-=-<br/>\n <br/>\n&quot;You cannot hit&quot; isn&#39;t good information.  Obviously he CAN hit.   He&#39;s doing <br/>\nit regularly.<br/>\nAnd ignoring him? If he NEEDS attention, it&#39;s a need.  Withholding  attention <br/>\nfrom a kid who needs attention is like withholding food from a kid who  needs <br/>\nfood, or the bed from a kid who&#39;s sleepy.<br/>\n <br/>\nSomething is happening before he hits. That&#39;s what I think you should look  <br/>\nat. Maybe it&#39;s that something is NOT happening.<br/>\n <br/>\nOthers here might have suggestions of books that would help you, but I  think <br/>\nignoring him is a really bad thing, and &quot;withholding treats&quot; sounds like  <br/>\nconditioning and that&#39;s not the way to go if you want him to understand and  <br/>\nthink, rather than to perform behaviors (like a trained animal).<br/>\n <br/>\nSix isn&#39;t too young to talk to him like a person.  Are you using set  phrases <br/>\nin a sing-songy voice?   Are you reciting rules and policies  that he&#39;s <br/>\nlearned to tune out instead of speaking to him in the moment as one  person to <br/>\nanother?   <br/>\n <br/>\nI would tell him too, truthfully, that there are people in jail and prison  <br/>\nfor just hitting another person.  There are people who are older who hit  <br/>\nstrangers and they get hit back HARD or shot.  Hitting is just NOT  okay to do, <br/>\nit&#39;s not safe, it&#39;s not right.<br/>\n <br/>\nBut if his life is too frustrating for him, try to alleviate his  frustration.<br/>\n <br/>\nSandra<br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":102676,"nextTopicId":102666}}