{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Recording is now available Re: [AlwaysLearning] Confession Of A Spanker On The Road To Recovery","postDate":"1297490992","msgId":59684,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExQzc4NjdDLUREODUtNDIwNy1CRDYyLUFGMDcxMTgwRTU0OUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGloaHZxdCtzNWtsQGVHcm91cHMuY29tPg==","referencesHeader":"PGloaHZxdCtzNWtsQGVHcm91cHMuY29tPg=="},"prevInTopic":59145,"nextInTopic":0,"prevInTime":59683,"nextInTime":59685,"topicId":59129,"numMessagesInTopic":0,"msgSnippet":"-=- I stopped hitting, using time outs and punishments for bad behavior 4 months ago after going to the California Home School Conference and seeing Sandra","messageBody":"<div id=\"ygrps-yiv-1484566710\">-=- I stopped hitting, using time outs and punishments for bad behavior 4 months ago after going to the California Home School Conference and seeing Sandra Dodd speak on partnerships in the family. As soon as I walked out I went to the counter and bought her book The Big Book of Unschooling and read it (four months later I am still reading it again and again). During the course of her one hour speech I was able to see, really see, how every single situation where there was a power struggle that ended with Austin being punished could have been avoided. And how it was ME! who was the problem. Not my beautiful son. <br/>\n<br/>\n-=-Is that talk available to see online somewhere? Maybe you or someone here could find it for you and you could watch it after your kids are all nestled in bed. If not, then please read this. <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/partners/child\">http://sandradodd.com/partners/child</a> it was huge for me in changing the way I thought. Still think sometimes. I keep it up in my favorites on my browser and read it when I am feeling challenged.-=-<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.hscconferenceshop.com/node/5\">http://www.hscconferenceshop.com/node/5</a><br/>\nIt&#39;s a download, and you need to make an account to buy it, but it&#39;s now available.    <br/>\n<br/>\nThere is another one from the same conference: <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.hscconferenceshop.com/node/4\">http://www.hscconferenceshop.com/node/4</a><br/>\n<br/>\n(Thanks, Pam Sorooshian, for the information.)<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":287815876,"authorName":"dezignarob","from":"&quot;dezignarob&quot; &lt;dezigna@...&gt;","profile":"dezignarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Confession Of A Spanker On The Road To Recovery","postDate":"1295828655","msgId":59145,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGloaWdyZitka2toQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGloaHZxdCtzNWtsQGVHcm91cHMuY29tPg=="},"prevInTopic":59144,"nextInTopic":59684,"prevInTime":59144,"nextInTime":59146,"topicId":59129,"numMessagesInTopic":0,"msgSnippet":"Oh my goodness, you didn t sign your name, but I want to give you a big hug and say brava for writing this post. This is the kind of thing that Sandra means","messageBody":"<div id=\"ygrps-yiv-1036625786\">Oh my goodness, you didn&#39;t sign your name, but I want to give you a big hug and say brava for writing this post.<br/>\n<br/>\nThis is the kind of thing that Sandra means when she says, &quot;Old timers see new writers come along and share a dazzling point or<br/>\na particularly good insight&quot;. At least it seems to be for me.<br/>\n<br/>\nReading once again that it&#39;s about ME, not about my child, my reactions, not her behavior, create the quality of the peace in my home - that&#39;s a really important for me to hear and re-learn.<br/>\n<br/>\nI have wise words posted around my house too, where I see them. But it&#39;s been a while since I refreshed those little signs. They have started to blend into the clutter. I bet if I make some new ones, I&#39;ll become more mindful of them again.<br/>\n<br/>\n(Still mulling over the volcano image from that other thread...)<br/>\n<br/>\nRobyn L. Coburn<br/>\nCertified SDU Scrapbooking Instructor<br/>\nwww.robyncoburn.blogspot.com<br/>\nwww.iggyjingles.blogspot.com<br/>\nwww.allthingsdoll.blogspot.com</div>","specialLinks":[]},{"userId":263488403,"authorName":"hmbpie","from":"&quot;hmbpie&quot; &lt;heatherpie@...&gt;","profile":"hmbpie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Confession Of A Spanker On The Road To Recovery","postDate":"1295826345","msgId":59144,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGloaWVqOStmdGxmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEEwMUUwRjZBLTA1MjgtNDlFRS05QjVGLTVCRDBGMTFFODNDM0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":59136,"nextInTopic":59145,"prevInTime":59143,"nextInTime":59145,"topicId":59129,"numMessagesInTopic":0,"msgSnippet":"=It was recorded.  I called again to check and see if it s available yet.  Not yet.= That s a bummer because it was so powerful.  I just walked in to that","messageBody":"<div id=\"ygrps-yiv-1793843900\">=It was recorded.  I called again to check and see if it&#39;s available yet.  Not yet.=<br/>\n<br/>\nThat&#39;s a bummer because it was so powerful.  I just walked in to that session thinking I was going to get some tools on how to be a better parent and a better homeschooler. I had no idea who you were or that you were a huge voice out there for unschoolers. I had NO IDEA my whole life would change! If you can&#39;t watch or listen to that talk then I totally recommend reading the Big Book of Unschooling if you are new to the idea or haven&#39;t quite grapsed it yet.  It is still changing my life 4 months after the conference.<br/>\n<br/>\n <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; -=<br/>\n&gt; &gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; Is that talk available to see online somewhere? Maybe you or someone here could find it for you and you could watch it after your kids are all nestled in bed. -=-<br/>\n&gt; &gt; <br/>\n&gt; &gt; <br/>\n&gt; It was recorded.  I called again to check and see if it&#39;s available yet.  Not yet.<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Confession Of A Spanker On The Road To Recovery","postDate":"1295821388","msgId":59136,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEwMUUwRjZBLTA1MjgtNDlFRS05QjVGLTVCRDBGMTFFODNDM0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGloaHZxdCtzNWtsQGVHcm91cHMuY29tPg==","referencesHeader":"PGloaHZxdCtzNWtsQGVHcm91cHMuY29tPg=="},"prevInTopic":59129,"nextInTopic":59144,"prevInTime":59135,"nextInTime":59137,"topicId":59129,"numMessagesInTopic":0,"msgSnippet":"-= ... It was recorded.  I called again to check and see if it s available yet.  Not yet. [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-1327753150\">-=<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; <br/>\n&gt; Is that talk available to see online somewhere? Maybe you or someone here could find it for you and you could watch it after your kids are all nestled in bed. -=-<br/>\n&gt; <br/>\n&gt; <br/>\n </span></blockquote>It was recorded.  I called again to check and see if it&#39;s available yet.  Not yet.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":263488403,"authorName":"hmbpie","from":"&quot;hmbpie&quot; &lt;heatherpie@...&gt;","profile":"hmbpie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Confession Of A Spanker On The Road To Recovery","postDate":"1295811229","msgId":59129,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGloaHZxdCtzNWtsQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":59136,"prevInTime":59128,"nextInTime":59130,"topicId":59129,"numMessagesInTopic":0,"msgSnippet":"I think it s important to call spanking what it is.  Hitting.  I was a hitter.  When Austin was born I said I would NEVER, EVER HIT him.  Then one day I wanted","messageBody":"<div id=\"ygrps-yiv-1986993195\">I think it&#39;s important to call spanking what it is.  Hitting.  I was a hitter.  When Austin was born I said I would NEVER, EVER HIT him.  Then one day I wanted him to help me clean his room (he was probably 2. I know, ridiculous.). He didn&#39;t want to so it turned into a power struggle and when I told him to go to the corner, he bit me and I hit him and continued to do so for the next 6 years. I stopped hitting, using time outs and punishments for bad behavior 4 months ago after going to the California Home School Conference and seeing Sandra Dodd speak on partnerships in the family.  As soon as I walked out I went to the counter and bought her book The Big Book of Unschooling and read it (four months later I am still reading it again and again).  During the course of her one hour speech I was able to see, really see, how every single situation where there was a power struggle that ended with Austin being punished could have been avoided. And how it was ME! who was the problem.  Not my beautiful son. <br/>\n<br/>\nIs that talk available to see online somewhere?  Maybe you or someone here could find it for you and you could watch it after your kids are all nestled in bed.  If not, then please read this.  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/partners/child\">http://sandradodd.com/partners/child</a>  it was huge for me in changing the way I thought.  Still think sometimes.  I keep it up in my favorites on my browser and read it when I am feeling challenged.<br/>\n<br/>\n <br/>\n<br/>\nI hit, used time outs and punishments for 6 years and only four months ago I stopped so my memory for why those things were used is still fresh, they are just no longer justified.  I can understand where the poster is because I was just there.  I think she&#39;s looking for a when X happens do Y solution.  It&#39;s probably all she&#39;s ever known.  It&#39;s all I ever knew 4 months ago.  I have read a ton of traditional parenting books over the years trying to find the ONE that had a solution on how to get my strong willed child in line, how to make me the perfect parent, how to do it right and quickly.  I never found it until I came to unschooling.  I say it was a quick fix because once I quit looking at my child as the problem and started looking inward things were able to start being fixed.  I was the problem which I can fix. My son was NOT the problem.  <br/>\n<br/>\n <br/>\n<br/>\nSometimes Austin being hit still comes out in his play.  He&#39;ll say things to me like &quot;You&#39;re going to get a spanking.&quot; Or I&#39;ve heard him while he is playing say things like, &quot;If you don&#39;t stop doing X then you are going to get a spanking.&quot; Or &quot;You&#39;re going to get a spanking if you don&#39;t stop that&quot; It makes me sick to my stomach and makes my heart sink.  Then I usually go to him and say &quot;I am so sorry that I ever hit you.&quot; Then he says, &quot;You should be!&quot; And he&#39;s right.  I should be!<br/>\n<br/>\n <br/>\n<br/>\nKnowing what I know now I can see how in every single situation where Austin was hit could have been avoided by communication, attention and revising what was expected of him.  There was never one instance where I can say he deserved it or that it was the only solution I had left.    <br/>\n<br/>\n <br/>\n<br/>\nWhen I first started reading about unschooling I kept a notebook by my computer and wrote down the changes I wanted to make so they would be there for me to see through the day.  First one was &quot;Pay attention to see if he is hungry, tired or feeling unloved&quot;.  Second was &quot;Say YES!!&quot;  Those two got me through the first month with amazing &quot;results&quot;.<br/>\n<br/>\n <br/>\n<br/>\nWe still have the occasional power struggle but hitting him when it happens isn&#39;t even a thought that crosses my mind because it isn&#39;t even an option.  He hasn&#39;t done anything where I would feel justified in hitting him.  I haven&#39;t sent him to a time out although that one has popped into my head a couple times but I just STOP and THINK instead of react. I SLOW DOWN.  <br/>\n<br/>\n <br/>\n<br/>\nThe poster wants to know what to do instead of hitting that will work with consistency and quickly.  Communication, attention, patience, compassion and empathy.  Slowing down and being mindful and peaceful in the interactions you have with your child.  If your child is screaming when you have a headache communication like, &quot;Hey babe I have a really bad headache right now would you mind keeping it down until it goes away&quot;.  Or some attention, try to figure out why he is screaming and maybe say something like &quot;Do you want to come lay with me and watch a movie snuggled on the couch or ___insert some other quiet activity.&quot;  Be patient, it may not work the first time but when you are consistently meeting his needs he will be much more likely to be considerate of yours.  But if you are hitting him then how can he feels like you care how he feels? Be empathetic, he may be bored.  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/BoredNoMore\">http://sandradodd.com/BoredNoMore</a> Oh, and drink some water.  You may be dehydrated.  I once read it&#39;s the most common cause of headaches.<br/>\n<br/>\n <br/>\n<br/>\nSo to the poster I would say there is no when X happens do Y.  You won&#39;t find that here.  You have been given what you need in order to stop spanking here.  I have seen it! YOU have to change the way YOU think.  YOU are the one that needs to change not your children.  They will change, as Austin has, once he felt safe and REALLY and TRUELY felt loved unconditionally and his needs were being met but you have to take hitting, time outs and punishments off the table for that to begin.  I would also say as a newcomer that if I got anything wrong in my post someone will point it out and disect it and HELP me. It&#39;s all in how you look at it.  Try on some new eyes.</div>","specialLinks":[]}],"prevTopicId":59601,"nextTopicId":59648}}