{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":77522235,"authorName":"Julie Bogart","from":"&quot;Julie Bogart&quot; &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Can I get some help with unschooling high school? Anyone do this? (m)","postDate":"1059756731","msgId":77877,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJnZTVycitldnVpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGJnZGxibitubmQ5QGVHcm91cHMuY29tPg=="},"prevInTopic":77871,"nextInTopic":0,"prevInTime":77876,"nextInTime":77878,"topicId":77871,"numMessagesInTopic":0,"msgSnippet":"... luv2homeschool1998  wrote: In the past 5 years we haven t ... is ... Mine struggled with it too. It IS boring for the ones not","messageBody":"<div id=\"ygrps-yiv-786657411\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-Discussion@yahoogroups.com\">Unschooling-Discussion@yahoogroups.com</a>, <br/>\n&quot;luv2homeschool1998&quot; &lt;fkgrawburg@e...&gt; wrote:<br/>\nIn the past 5 years we haven&#39;t <br/>\n<blockquote><span title=\"ireply\"> &gt; exactly unschooled totally, but for science he just explored his <br/>\n&gt; interests. This year for grade 9 we bought Apologia Biology. He <br/>\n </span></blockquote>is <br/>\n<blockquote><span title=\"ireply\"> &gt; really having a struggle with it. <br/>\n<br/>\n </span></blockquote>Mine struggled with it too. It IS boring for the ones not interested. <br/>\nMy oldest, now, just reads (rather, devours) Popular Science and <br/>\nDiscovery magazines every month. Amazingly, he knows a ton <br/>\nabout science that I have never thought he&#39;d retain.<br/>\n<br/>\nI had to let go of my feeling that he must learn science in a <br/>\ntraditional manner. The hardest part has been thinking through <br/>\ncollege admissions. We have discussed this a lot. He decided <br/>\nto study biology in a co-op class (to do the dissections) but isn&#39;t <br/>\ninterested at all in chemistry and is on pins and needles to study <br/>\nphysics once his math is up to par.<br/>\n<br/>\nMy daughter (13, almost 14) is at this same point in her <br/>\ndilemma. She isn&#39;t interested in science at all. So does she have <br/>\nto do it? We&#39;re exploring the possiblities/options and I&#39;ll follow <br/>\nher lead. If she decides not to do any science in high school, <br/>\nthen she&#39;ll make that choice and face whatever she needs to for <br/>\ncollege.<br/>\n<br/>\n&quot;What About College?&quot; by Cafi Cohen helped me relax A LOT <br/>\nabout admissions requirements. You might want to pick that up.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Can he explore his interests in high school as well as public <br/>\n </span></blockquote>school? <br/>\n<br/>\nMy kids are doing a combo. They like the social aspects of public <br/>\nschool and some of the electives. But they aren&#39;t doing any &quot;core&quot; <br/>\nclasses there. So they have the option of going part time here in <br/>\nOhio. And they do pursue their interests at home in all the other <br/>\ntime they have. Works well for us.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The only thing I am worried about for him is math and that he <br/>\n </span></blockquote>can <br/>\n<blockquote><span title=\"ireply\"> &gt; spell and write properly. I really don&#39;t care about the rest. Is this <br/>\n&gt; the wrong attitude?<br/>\n<br/>\n </span></blockquote>I think we all worry and each one of us worries about different <br/>\nthings. I&#39;ve spent far too many precious hours of my life worrying <br/>\nabout math. I worried when I took math and now I worry for my <br/>\nolder kids. My dh said the other night, &quot;Give it up.&quot; He was so <br/>\nright. I went to my son (16) and told him that I&#39;m done riding him <br/>\nabout math. He can take it or not, get any grade, he can have <br/>\ntutoring that I&#39;ll pay for if he needs it, but I will no longer hover <br/>\nover him. He was relieved. The truth is, he wants to go into <br/>\ncomputer science. If this field really does appeal to him, the <br/>\npressure of success in that industry may depend on his math. <br/>\nWhen he comes to that core conclusion, he&#39;ll get the math.<br/>\n<br/>\nSo I&#39;ve let it go.<br/>\n<br/>\nWriting? I teach writing online to homeschooling families. The <br/>\nmain thing I can say is this. Kids whose mothers worry about <br/>\ntheir kids writing tend to produce kids who either hate to write or <br/>\nlifeless, stiff writers. Mothers who back off, spend tons of time <br/>\ntalking with their children, read lots of good literature and where <br/>\nwriting that is produced is enjoyed and read tend to produce <br/>\nbetter writers.<br/>\n<br/>\nThe keys for writing are simple: writing is about communicating <br/>\neffectively in written language. That comes from relaxed, <br/>\nnon-pressured opportunities to write (email, IMing, sending <br/>\nnotes to friends, song lyrics, poems, short stories...) that kids <br/>\ninitiate. Kids who are comfortable expressing themselves in <br/>\nwritten language (no matter how poor the quality of actual <br/>\nwriting) will be able to be taught writing forms at the time they <br/>\nneed them (high school or college). When they see that they are <br/>\nready to learn, teaching them is easy.<br/>\n<br/>\nhere&#39;s a link to my website for some articles that may help you to <br/>\nbreathe and let go of that anxiety:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bravewriter.com\">http://www.bravewriter.com</a><br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Thanks for any help you can give to me.<br/>\n<br/>\n </span></blockquote>I hope this has been helpful. I really understand how you feel. I&#39;ve <br/>\nonly converted to unschooling fully in the last eight months. It&#39;s a <br/>\nbig switch and it&#39;s easy to let other homeschooling families <br/>\nundermine your confidence when you listen to them rattle off all <br/>\nthe requirements they think their kids need.<br/>\n<br/>\nTurn a deaf ear and look at your child. Who is he? What is he <br/>\nlearning? Celebrate that and college will sort itself out.<br/>\n<br/>\nJulie B</div>","specialLinks":[]},{"userId":88457762,"authorName":"luv2homeschool1998","from":"&quot;luv2homeschool1998&quot; &lt;fkgrawburg@...&gt;","profile":"luv2homeschool1998","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Can I get some help with unschooling high school? Anyone do this? (m)","postDate":"1059739831","msgId":77871,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJnZGxibitubmQ5QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":77877,"prevInTime":77870,"nextInTime":77872,"topicId":77871,"numMessagesInTopic":0,"msgSnippet":"I live in Ontario, Canada (where we don t have to report to anyone) and have a 13yos who is very bright and it seems every time I buy a science book for him it","messageBody":"<div id=\"ygrps-yiv-2055644796\">I live in Ontario, Canada (where we don&#39;t have to report to anyone) <br/>\nand have a 13yos who is very bright and it seems every time I buy a <br/>\nscience book for him it is so boring. In the past 5 years we haven&#39;t <br/>\nexactly unschooled totally, but for science he just explored his <br/>\ninterests. This year for grade 9 we bought Apologia Biology. He is <br/>\nreally having a struggle with it. He is an excellent reader, but is <br/>\nhaving a hard time remembering what the definitions mean and what <br/>\nthings like an autotroph, etc. is.<br/>\n<br/>\nCan he explore his interests in high school as well as public school? <br/>\nThe only thing I am worried about for him is math and that he can <br/>\nspell and write properly. I really don&#39;t care about the rest. Is this <br/>\nthe wrong attitude?<br/>\n<br/>\nThanks for any help you can give to me.</div>","specialLinks":[]}],"prevTopicId":77859,"nextTopicId":77457}}