{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Used clothes, consumerism, kids (was Christians, I don&#39;t know why)","postDate":"1050084115","msgId":64212,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJmLjMwNzY1M2M4LjJiYzg1ZDEzQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":64211,"nextInTime":64213,"topicId":64212,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/11/03 9:28:41 AM, sorcha-aisling@insight.rr.com writes: ","messageBody":"<div id=\"ygrps-yiv-1663416085\">In a message dated 4/11/03 9:28:41 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sorcha-aisling@...\">sorcha-aisling@...</a> writes:<br/>\n<br/>\n&lt;&lt; I also shop for my children in used clothing and toy stores.  I<br/>\nfrequently find things that are brand new, even in their original<br/>\npackage or with tags still attached.  In affluent neighborhoods, parents<br/>\noverbuy and the kids never even use some of the stuff.  &gt;&gt;<br/>\n<br/>\nWe got Holly $35 worth of clothes in a thrift store the other day.<br/>\n<br/>\nSeven pieces.<br/>\n<br/>\nFour of those still had the store tags on them.  Two we didn&#39;t notice until <br/>\nwe got home.<br/>\n<br/>\nWell the pink and white jeans didn&#39;t have the new tags, but the inspection <br/>\npaper was in the front pocket, never been washed, and that&#39;s how we knew that <br/>\nwas new.  <br/>\n<br/>\nShe&#39;s thrilled with her haul!   Some of the items had been $40 new.  Looked <br/>\nlike someone&#39;s grandma had bought a girl two matching fancy shirts the girl <br/>\ndidn&#39;t like, because two colors of the same shirt were on the rack, all tags <br/>\nintact.  Holly got one, not both, at $4.<br/>\n<br/>\nI love that my kids are willing to wear whatever.<br/>\n<br/>\nKirby was told he should wear solid red or black to work, or shirts with a <br/>\ncollar (he doesn&#39;t want to), or t-shirts with logos of things they sell <br/>\nthere.   He&#39;s had things from time to time, but the games went out of print.  <br/>\nSo at Christmas I hunted around the internet and bought him t-shirts with <br/>\nlogos of some current games.  Since that expensive time (but fun, and <br/>\nappreciated), he has gotten NINE free shirts from working Magic tournaments <br/>\nor from card-set releases.   I can&#39;t believe the number of t-shirts he has <br/>\nnow, and is still wearing thinning things he&#39;s had for five years.  They <br/>\nstretch along with him.  But because he doesn&#39;t go to school, nobody&#39;s saying <br/>\n&quot;Kirby, you&#39;ve been wearing this shirt since 7th grade, don&#39;t wear it <br/>\nanymore,&quot; or &quot;THIS shirt isn&#39;t cool, why are you wearing it?&quot;   <br/>\n<br/>\nMarty was at the thrift store the other day and some youngish two-year <br/>\nveteran struck up a conversation with Marty so he could insult him for <br/>\nwearing camouflage pants.  Because the 22 year old had been in the service <br/>\nand Marty was only 14, he took it upon himself to tell Marty that it was <br/>\ndisgraceful for him/Marty to be wearing those.    I found out about it later. <br/>\n Marty was amused, not embarrassed or insulted.  Because Marty hasn&#39;t grown <br/>\nup with the kids at school telling him what to wear or not to wear, he has a <br/>\nlarge amount of calm mental health about what he wears.  And that saves us <br/>\nlots of money! (among other advantages)<br/>\n<br/>\nThe reason he has camo pants is Keith&#39;s work did a family paint-ball weekend <br/>\nand the boys had nothing good for paintball, so went to the military surplus <br/>\nstore.  Marty LOVED the pants, and has gotten two more pairs since.<br/>\n<br/>\nUnschooling has ended up being SO much more than how they learn to read and <br/>\ndo math.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":38799,"nextTopicId":64213}}