{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":443923164,"authorName":"CASS KOTRBA","from":"&quot;CASS KOTRBA&quot; &lt;caskot@...&gt;","profile":"cass.kotrba","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] tween/teen perspective","postDate":"1393002861","msgId":73763,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJMVTE3My1EUzVDREU5NDAxQTUzQUMxMUM3MDA0MEM0ODUwQHBoeC5nYmw+","inReplyToHeader":"PEFGRjgyNkQ2LURDQUQtNDAxNS05MDg3LTVGQ0ZGN0JDNTBBMkBjb21jYXN0Lm5ldD4=","referencesHeader":"PEFGRjgyNkQ2LURDQUQtNDAxNS05MDg3LTVGQ0ZGN0JDNTBBMkBjb21jYXN0Lm5ldD4="},"prevInTopic":73762,"nextInTopic":0,"prevInTime":73762,"nextInTime":73764,"topicId":73613,"numMessagesInTopic":0,"msgSnippet":"-=-  I know this is what has prompted me to try and convince her unschooling is the way to go, but I do recognize she needs to come to that on her own.  She","messageBody":"<div id=\"ygrps-yiv-957513929\">\n<html><head>\n \n<style></style>\n \n</head> \n\n \n<div>\n<div>-=-&nbsp; I know this is what has prompted me to try and convince her \nunschooling is the way to go, but I do recognize she needs to come to that on \nher own.&nbsp; She knows it is an option but I am am not pushing it \n(anymore)&nbsp; It would seem that despite the obvious stressors school \npresents, it does not outweigh the social aspect, at least not yet. -=-</div>\n<div>&nbsp;</div>\n<div>Leaving the known for the unknown is pretty scary.&nbsp; Even if your mom \nis reassuring you that the unknown will be better.&nbsp; School is the focus of \nher life right now &amp; those things seem monumentally \nimportant.&nbsp;&nbsp;She&#39;s being asked to give that up without knowing what is \nin store for her.&nbsp;&nbsp; Help her discover that home will be rich and \nrewarding.&nbsp; Once she discovers that she is gaining more than she is losing \nshe will probably&nbsp;be able to relax &amp; let go.&nbsp; </div>\n<div>&nbsp;</div>\n<div>Try&nbsp;to&nbsp;find a way for her&nbsp;to get her feet wet&nbsp;with \nbeing home without the pressure of making a final decision.&nbsp; How about if \nyou tell the school you are going on vacation next week (or the week after) and \nask them to send home her homework so she won&#39;t feel like she&#39;s falling \nbehind.&nbsp;&nbsp;It&#39;s not lying to the school.&nbsp; You are taking a \nvacation, you are just doing it at home.&nbsp; Use that week to relax, unwind, \ntalk about things,&nbsp;have fun.&nbsp; Maybe come up with some fun \n&quot;educational&quot; things for her to do so&nbsp;she can&nbsp;see that the environment \nshe will be in&nbsp;is better than the one she is leaving while at the same time \nreducing her fear that she will fall behind her peers.&nbsp; Give her an idea of \nwhat she can expect when she comes home without the pressure of making a \ndecision.</div>\n<div>&nbsp;</div>\n<div>I have 2 children &amp; my daughter came home first.&nbsp;&nbsp;In the \nbeginning we&nbsp;&quot;did school&quot; and that felt reassuring to both of us.&nbsp; We \ndidn&#39;t just do a 180 degree turn, we eased into it.&nbsp; We really enjoyed \nhaving that time together.&nbsp; It showed us both that she could learn more at \nhome,&nbsp;in a relaxed fun environment, focusing on things she enjoyed.&nbsp; \nShe said she was interested in ancient Egypt so I recorded a bunch of \ndocumentaries and each day we&#39;d watch something together &amp; I&#39;d come up with \nrelated activities for her to do.&nbsp; If she didn&#39;t want to do an activity I \ncame up with I would not push it.&nbsp; It was really fun.&nbsp; I think the \npart that made it fun was having time to hang out &amp; do stuff \ntogether.&nbsp;</div>\n<div>&nbsp;</div>\n<div>Her younger brother felt pretty fearful about coming home but when he saw \nhow much fun we were having and contrasted that to how miserable he felt he \ndecided to come home, too.&nbsp; Each morning we would &quot;do school&quot; for a couple \nof hours before they wandered off to their other interests.&nbsp; I bought a \nglobe,&nbsp;a&nbsp;microscope &amp; some excavating kits like this:&nbsp; <a rel=\"nofollow\"\n title=\"http://www.amazon.com/s/ref=nb_sb_noss?url=search-alias%3Daps&amp;field-keywords=mammoth+excavating+kit\"\n target=\"_blank\" href=\"http://www.amazon.com/s/ref=nb_sb_noss?url=search-alias%3Daps&amp;field-keywords=mammoth+excavating+kit\">http://www.amazon.com/s/ref=nb_sb_noss?url=search-alias%3Daps&amp;field-keywords=mammoth+excavating+kit</a>&nbsp;.&nbsp; \nWe&#39;d&nbsp;watch documentaries &amp; then do activities on the same topic when \npossible.&nbsp; It helped them feel confident that they were learning and it \ngave us something to focus on to quiet our fears.&nbsp; Over time they became \nmore &amp; more involved with their own interests and the &quot;school at home&quot; part \ndropped off.</div>\n<div>&nbsp;</div>\n<div>If her social life is the thing that is getting&nbsp;your \ndaughter&nbsp;through her school experience then it no doubt seems hugely \nimportant to her.&nbsp; Show her that she will still be able to keep&nbsp;the \nfriends and extra curricular activities that are important to her.&nbsp; For my \nson those things seemed really important at first.&nbsp; Now that he has so many \nother passions and interests those things have&nbsp;replaced his fear of what he \nmight be missing.&nbsp; He still gets together with some of his friends from \nschool but now he appreciates that he has control over who he sees, when and how \noften.</div>\n<div>&nbsp;</div>\n<div>BTW - the school puts a huge emphasis on how many absences you can have \nbefore getting into trouble but it has been my experience that this is just a \nboogey man.&nbsp; We missed more than the allowed days one year &amp; I&#39;ve seen \nother families do it, too, without repercussions.&nbsp; As long as you \ncommunicate with them &amp; let them know that the absences are unavoidable you \nshould be fine.</div>\n<div>&nbsp;</div>\n<div>Good luck!</div>\n<div>Cass</div></div></html></div>","specialLinks":[]},{"userId":352156964,"authorName":"Tara Chowaniec","from":"Tara Chowaniec &lt;chowaniec46@...&gt;","profile":"tarachowaniec@ymail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] tween/teen perspective","postDate":"1392979975","msgId":73762,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFGRjgyNkQ2LURDQUQtNDAxNS05MDg3LTVGQ0ZGN0JDNTBBMkBjb21jYXN0Lm5ldD4="},"prevInTopic":73743,"nextInTopic":73763,"prevInTime":73761,"nextInTime":73763,"topicId":73613,"numMessagesInTopic":0,"msgSnippet":"Thank you to all who have provided some insight into my question, it really is helpful to have different perspectives and shake things up.  Here are some parts","messageBody":"<div id=\"ygrps-yiv-87862953\">Thank you to all who have provided some insight into my question, it really is helpful to have different perspectives and shake things up.  Here are some parts that really resonated:<br/>\n<br/>\nSandra said<br/>\n -=-Deschooling isn&#39;t going to work if you&#39;re &quot;studying,&quot; even if it&#39;s studying unschooling.-=-<br/>\n<br/>\nYikes! That was hard to read, because it was so true.  I think I was trying to put together some kind of sales pitch/presentation and was definitely approaching it in a very school like manner; deschooling really is a process.<br/>\n<br/>\nAlso from Sandra<br/>\n-=-YOU (the mom) should read a little, try a little, wait (weeks) watch (her) but don&#39;t talk about it it much-=-<br/>\n<br/>\nYes, something I need to remind myself of daily (hourly)<br/>\n<br/>\nFrom Debbie:<br/>\n-=-But school or no, you can incorporate some unschooling principles into your life to the benefit of your family.-=-<br/>\n<br/>\nThat is good advice, and we have always been relaxed about food/bedtime/clothes/tv/computer, we can continue that and expand as needed<br/>\n<br/>\n-=-It sounds like her social needs are a high priority for her at the moment.  Value what is important to her and look for ways to enhance those aspects of her life.-=-<br/>\n<br/>\nThat is the core of the issue.  The part I struggle with is reacting to her sometimes weekly anxiety/worry that happens regarding school.  I will give an example that happened last night.  After she had went to bed, she called me back in her room about an hour later, she was crying/couldn’t fall asleep because she had misplaced her writing journal in class.  She was pretty panicked that she would not find it and would have to begin the essay all over, which she would have difficulty doing.  She went on to say she was embarrassed b/c she was the only one still writing in a journal (everyone else had moved on to final copies) and she did not want to draw attention by having to look around the class for her journal.  She said the teacher would not help her look for it and feared the teacher would punish her.  So there was a lot of fear and shame happening and I would say this happens several times a month regarding some aspect of school.  I sat with her and we talked about solutions, she asked me to get in touch with her teacher, which I will.  I tried to assure her that this is not anything anyone should be punished for and there is no merit in anyone finishing anything sooner than anyone else (she loves creative writing but with these United states common core standards, there has been more of a focus on non fiction writing, and there are of course timelines in which you have to finish things in school)<br/>\n<br/>\nI feel like there is only so much reassuring I can do as the school system is what it is.  This is not the first time I have had to intervene and although the teachers are quick to respond and can be helpful, there is a consistent theme of them telling me she needs to be more independent, one even said she asks for clarification too frequently on class assignments (!?!)  I know this is what has prompted me to try and convince her unschooling is the way to go, but I do recognize she needs to come to that on her own.  She knows it is an option but I am am not pushing it (anymore)  It would seem that despite the obvious stressors school presents, it does not outweigh the social aspect, at least not yet.<br/>\n<br/>\n<br/>\nLastly, I find this quote by Pam Sorooshian especially helpful:<br/>\n&quot;One interaction at a time. Just make the next interaction a relationship-building one. Don&#39;t worry about the one AFTER that, until IT becomes &quot;the next one.&quot; —Pam Sorooshian<br/>\n<br/>\nThank you again for the input, this group serves well :-)<br/>\n<br/>\nTara</div>","specialLinks":[]},{"userId":459359078,"authorName":"D. Regan","from":"&quot;D. Regan&quot; &lt;oregano3@...&gt;","profile":"persea112","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] tween/teen perspective","postDate":"1392828703","msgId":73743,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERCNDQ1NjIxLTYzNTUtNDY0Qy05RUNELTM5OTlEM0RBMkZCMEBiaWdwb25kLmNvbT4=","inReplyToHeader":"PGxkbDE3ZitxcWs2MmdAWWFob29Hcm91cHMuY29tPg==","referencesHeader":"PGxkbDE3ZitxcWs2MmdAWWFob29Hcm91cHMuY29tPg=="},"prevInTopic":73738,"nextInTopic":73762,"prevInTime":73742,"nextInTime":73744,"topicId":73613,"numMessagesInTopic":0,"msgSnippet":"-=-she is somewhat hesitant to leave school culture-=- Don t try to persuade her.  Let her make her own choice.  Unschooling isn t about having the children","messageBody":"<div id=\"ygrps-yiv-1163526197\"><html><head><base></head><div><font face=\"Georgia\"><span style=\"font-size:13px;line-height:15px;\"><span class=\"ygrps-yiv-1163526197Apple-style-span\" style=\"font-family:Helvetica;line-height:normal;font-size:medium;\">-=-she is somewhat hesitant to leave school culture-=-</span></span></font></div><div><font face=\"Georgia\"><span style=\"font-size:13px;line-height:15px;\"><span class=\"ygrps-yiv-1163526197Apple-style-span\" style=\"font-family:Helvetica;line-height:normal;font-size:medium;\"><br></span></span></font></div><div><font face=\"Georgia\"><span style=\"font-size:13px;line-height:15px;\"><span class=\"ygrps-yiv-1163526197Apple-style-span\" style=\"font-family:Helvetica;line-height:normal;font-size:medium;\">Don&#39;t try to persuade her. &nbsp;Let her make her own choice. &nbsp;</span></span></font>Unschooling isn&#39;t about having the children home so that you can &#39;unschool them&#39;.&nbsp;</div><div><font face=\"Georgia\"><span style=\"font-size:13px;line-height:15px;\"><span class=\"ygrps-yiv-1163526197Apple-style-span\" style=\"font-family:Helvetica;line-height:normal;font-size:medium;\"><br></span></span></font></div><div><font face=\"Georgia\"><span style=\"font-size:13px;line-height:15px;\"><span class=\"ygrps-yiv-1163526197Apple-style-span\" style=\"font-family:Helvetica;line-height:normal;font-size:medium;\">-=-</span></span></font>I am trying to compile some videos and shorter articles/blogs/quotes as she can be overwhelmed with reading-=-</div><div><br></div><div>Are those videos and articles something she&#39;s interested in? &nbsp;I find it a bit hard to understand why a parent would give a child who &quot;can be overwhelmed with reading&quot;, any articles to read &quot;that discuss unschooling&quot;. &nbsp;&nbsp;Perhaps you yourself are interested in unschooling. &nbsp;Instead of trying to bring her around to your point of view, bring some of the aspects of unschooling which appeal to you, into your home now whether she&#39;s at school or not.</div><div><br></div><div>One of the fundamental principles of unschooling, is supporting children in exploring what they&#39;re interested in exploring. &nbsp;You&#39;ve mentioned that she&#39;s &quot;somewhat hesitant to leave school culture&quot; and is concerned about &quot;the loss of common ground with school friends&quot;. &nbsp;It sounds like her social needs are a high priority for her at the moment. &nbsp;Value what is important to her and look for ways to enhance those aspects of her life.</div><div><br></div><div>In supporting her in what she&#39;s interested in, you will be getting closer to unschooling and its benefits, than if you persuade her to quit school. &nbsp; Persuasion doesn&#39;t help learning or relationships.</div><div><br></div><div>-=-she is definitely concerned about *not learning*-=-</div><div><br></div><div>Your own deschooling could help her. &nbsp;You can take some steps in that direction while still supporting your daughter at school. &nbsp;Listen, observe, notice and reflect more. &nbsp;Notice how you and others, learn. &nbsp;It will all help loosen school-grown beliefs. &nbsp;As you make progress with deschooling, it will give your daughter a home environment in which there are broader ways of thinking about things like learning, education and success; and a softer place in which to explore options.&nbsp;</div><div><br></div><div>It does all take time, and by the time children are tweens there are complexities which aren&#39;t there for people coming to unschooling with young children. &nbsp; But school or no, you can incorporate some unschooling principles into your life to the benefit of your family. &nbsp;&nbsp;</div><div>:)</div><div>Debbie.</div><div><div><br></div></div></html></div>","specialLinks":[]},{"userId":270927662,"authorName":"janine davies","from":"janine davies &lt;daviesj69@...&gt;","profile":"kessykoo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] tween/teen perspective","postDate":"1392820430","msgId":73738,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERVQjEyNC1XNTFCMjcwRjE0RTgzM0JGNzc2OEIzMEE2OUIwQHBoeC5nYmw+","inReplyToHeader":"PDlGNTM5NkMwLTA4NjktNEM2NC04QUVDLTUwQkRBMkQ1Q0Y2REBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGxkbDE3ZitxcWs2MmdAWWFob29Hcm91cHMuY29tPiw8OUY1Mzk2QzAtMDg2OS00QzY0LThBRUMtNTBCREEyRDVDRjZEQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":73735,"nextInTopic":73743,"prevInTime":73737,"nextInTime":73739,"topicId":73613,"numMessagesInTopic":0,"msgSnippet":"My 11yr old son said just this morning -  Another thing I love about not going to school anymore is that when is was half term we used to rush around,","messageBody":"<div id=\"ygrps-yiv-616913281\"><html>\n<head>\n<style><!--\n#ygrps-yiv-616913281 .ygrps-yiv-616913281hmmessage P\n{\nmargin:0px;padding:0px;}\n#ygrps-yiv-616913281 .ygrps-yiv-616913281hmmessage\n{\nfont-size:12pt;font-family:Calibri;}\n--></style></head>\n<div dir='ltr'><font face=\"Verdana\">My 11yr old son said just this&nbsp;morning - &quot; Another thing I love about not going to school anymore is that when is was half term we used to rush around, stressed, trying to fit everything in, and see everyone, and it was always must do this, must do that...now its calm and chilled&quot; &nbsp;&quot;I love my life and my awesome family&quot;&nbsp;</font><div><font face=\"Verdana\">Made me incredible happy and joyous, but also as he said it i felt a shudder - because thats exactly what we used to do, and&nbsp;I&#39;m not sure&nbsp;any of us really remember much of it either….</font><div><font face=\"Verdana\"><br></font></div><div><font face=\"Verdana\">Janine<br id=\"ygrps-yiv-616913281FontBreak\"></font><br><br><div><div><br></div><div><div><div><font class=\"ygrps-yiv-616913281ecxApple-style-span\" face=\"&#39;Comic Sans MS&#39;\" size=\"3\"><br></font></div></div></div></div><br><br><div><hr id=\"ygrps-yiv-616913281stopSpelling\">To: AlwaysLearning@yahoogroups.com<br>From: Sandra@...<br>Date: Tue, 18 Feb 2014 22:42:10 -0700<br>Subject: Re: [AlwaysLearning] tween/teen perspective<br><br>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<span>&nbsp;</span>\n\n\n<div id=\"ygrps-yiv-616913281ecxygrp-mlmsg\" style=\"\">\n  <div id=\"ygrps-yiv-616913281ecxygrp-msg\" style=\"\">\n\n\n    <div id=\"ygrps-yiv-616913281ecxygrp-text\">\n\n\n      I keep coming back to this. &nbsp;Sorry to be disjoint.<br><div><br></div><div>-=-<span style=\"background-color:rgb(255, 255, 255);font-family:Georgia;font-size:13px;\">&nbsp;This is for my 11-year-old daughter with whom we&#39;re discussing unschooling with (she is somewhat hesitant to leave school culture).-=-</span></div><div><span style=\"background-color:rgb(255, 255, 255);font-family:Georgia;font-size:13px;\"><br></span></div><div><span style=\"background-color:rgb(255, 255, 255);font-family:Georgia;font-size:13px;\">If she doesn&#39;t want to leave school, why not just let her stay until she herself wants to come home?</span></div><div><span style=\"background-color:rgb(255, 255, 255);font-family:Georgia;font-size:13px;\"><br></span></div><div><span style=\"background-color:rgb(255, 255, 255);font-family:Georgia;font-size:13px;\">If she&#39;s home against her will, that can keep things from working. &nbsp;It&#39;s one of the worst things about school—lack of choice.</span></div><div><span style=\"background-color:rgb(255, 255, 255);font-family:Georgia;font-size:13px;\"><br></span></div><div><font face=\"Georgia\"><span style=\"font-size:13px;\">Sandra</span></font></div><br>\n\n    </div>\n\n\n\n    <div style=\"color:#fff;height:0;\"></div>\n\n\n\n\n\n\n  <style><!--\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxygrp-mkp {\nborder:1px solid #d8d8d8;font-family:Arial;padding:0 10px;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxygrp-mkp hr {\nborder:1px solid #d8d8d8;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxygrp-mkp #ygrps-yiv-616913281ecxhd {\ncolor:#628c2a;font-size:85%;font-weight:700;line-height:122%;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxygrp-mkp #ygrps-yiv-616913281ecxads {\n}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxygrp-mkp .ygrps-yiv-616913281ecxad {\npadding:0 0;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxygrp-mkp .ygrps-yiv-616913281ecxad p {\n}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxygrp-mkp .ygrps-yiv-616913281ecxad a {\ncolor:#0000ff;text-decoration:none;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxygrp-sponsor #ygrps-yiv-616913281ecxygrp-lc {\nfont-family:Arial;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxygrp-sponsor #ygrps-yiv-616913281ecxygrp-lc #ygrps-yiv-616913281ecxhd {\nfont-weight:700;font-size:78%;line-height:122%;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxygrp-sponsor #ygrps-yiv-616913281ecxygrp-lc .ygrps-yiv-616913281ecxad {\npadding:0 0;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxactions {\nfont-family:Verdana;font-size:11px;padding:10px 0;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxactivity {\nbackground-color:#e0ecee;font-family:Verdana;font-size:10px;padding:10px;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxactivity span {\nfont-weight:700;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxactivity span:first-child {\ntext-transform:uppercase;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxactivity span a {\ncolor:#5085b6;text-decoration:none;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxactivity span span {\ncolor:#ff7900;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxactivity span .ygrps-yiv-616913281ecxunderline {\ntext-decoration:underline;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass .ygrps-yiv-616913281ecxattach {\nclear:both;display:table;font-family:Arial;font-size:12px;padding:10px 0;width:400px;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass .ygrps-yiv-616913281ecxattach div a {\ntext-decoration:none;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass .ygrps-yiv-616913281ecxattach img {\nborder:none;padding-right:5px;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass .ygrps-yiv-616913281ecxattach label {\ndisplay:block;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass .ygrps-yiv-616913281ecxattach label a {\ntext-decoration:none;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass blockquote {\n}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass .ygrps-yiv-616913281ecxbold {\nfont-family:Arial;font-size:13px;font-weight:700;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass .ygrps-yiv-616913281ecxbold a {\ntext-decoration:none;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass dd.ygrps-yiv-616913281ecxlast p a {\nfont-family:Verdana;font-weight:700;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass dd.ygrps-yiv-616913281ecxlast p span {\nfont-family:Verdana;font-weight:700;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass dd.ygrps-yiv-616913281ecxlast p span.ygrps-yiv-616913281ecxyshortcuts {\n}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass div.ygrps-yiv-616913281ecxattach-table div div a {\ntext-decoration:none;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass div.ygrps-yiv-616913281ecxattach-table {\nwidth:400px;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass div.ygrps-yiv-616913281ecxfile-title a, #ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass div.ygrps-yiv-616913281ecxfile-title a:hover {\ntext-decoration:none;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass div.ygrps-yiv-616913281ecxphoto-title a, #ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass div.ygrps-yiv-616913281ecxphoto-title a:hover {\ntext-decoration:none;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass div#ygrps-yiv-616913281ecxygrp-mlmsg #ygrps-yiv-616913281ecxygrp-msg p a span.ygrps-yiv-616913281ecxyshortcuts {\nfont-family:Verdana;font-size:10px;font-weight:normal;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass .ygrps-yiv-616913281ecxgreen {\ncolor:#628c2a;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass .ygrps-yiv-616913281ecxMsoNormal {\n}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxphotos div {\nwidth:72px;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxphotos div div {\nborder:1px solid #666666;height:62px;overflow:hidden;width:62px;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxphotos div label {\ncolor:#666666;font-size:10px;overflow:hidden;text-align:center;white-space:nowrap;width:64px;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxreco-category {\nfont-size:77%;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxreco-desc {\nfont-size:77%;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass .ygrps-yiv-616913281ecxreplbq {\n}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxygrp-actbar div a:first-child {\npadding-right:5px;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxygrp-mlmsg {\nfont-size:13px;font-family:Arial, helvetica, clean, sans-serif;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxygrp-mlmsg table {\nfont-size:inherit;font:100%;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxygrp-mlmsg select, #ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass input, #ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass textarea {\nfont:99% Arial, Helvetica, clean, sans-serif;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxygrp-mlmsg pre, #ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass code {\nfont:115% monospace;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxygrp-mlmsg * {\nline-height:1.22em;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxygrp-mlmsg #ygrps-yiv-616913281ecxlogo {\npadding-bottom:10px;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxygrp-msg p a {\nfont-family:Verdana;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxygrp-msg p#ygrps-yiv-616913281ecxattach-count span {\ncolor:#1E66AE;font-weight:700;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxygrp-reco #ygrps-yiv-616913281ecxreco-head {\ncolor:#ff7900;font-weight:700;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxygrp-reco {\npadding:0px;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxygrp-sponsor #ygrps-yiv-616913281ecxov li a {\nfont-size:130%;text-decoration:none;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxygrp-sponsor #ygrps-yiv-616913281ecxov li {\nfont-size:77%;list-style-type:square;padding:6px 0;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxygrp-sponsor #ygrps-yiv-616913281ecxov ul {\npadding:0 0 0 8px;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxygrp-text {\nfont-family:Georgia;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxygrp-text p {\n}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxygrp-text tt {\nfont-size:120%;}\n\n#ygrps-yiv-616913281 .ygrps-yiv-616913281ExternalClass #ygrps-yiv-616913281ecxygrp-vital ul li:last-child {\nborder-right:none !important;}\n\n--></style></div></div></div> \t\t \t   \t\t  </div> \n</div></div></html></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] tween/teen perspective","postDate":"1392788530","msgId":73735,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlGNTM5NkMwLTA4NjktNEM2NC04QUVDLTUwQkRBMkQ1Q0Y2REBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGxkbDE3ZitxcWs2MmdAWWFob29Hcm91cHMuY29tPg==","referencesHeader":"PGxkbDE3ZitxcWs2MmdAWWFob29Hcm91cHMuY29tPg=="},"prevInTopic":73734,"nextInTopic":73738,"prevInTime":73734,"nextInTime":73736,"topicId":73613,"numMessagesInTopic":0,"msgSnippet":"I keep coming back to this.  Sorry to be disjoint. -=- This is for my 11-year-old daughter with whom we re discussing unschooling with (she is somewhat","messageBody":"<div id=\"ygrps-yiv-2137484712\"><html><head></head>I keep coming back to this. &nbsp;Sorry to be disjoint.<div><br></div><div>-=-<span style=\"background-color:rgb(255, 255, 255);font-family:Georgia;font-size:13px;line-height:15px;\">&nbsp;This is for my 11-year-old daughter with whom we&#39;re discussing unschooling with (she is somewhat hesitant to leave school culture).-=-</span></div><div><span style=\"background-color:rgb(255, 255, 255);font-family:Georgia;font-size:13px;line-height:15px;\"><br></span></div><div><span style=\"background-color:rgb(255, 255, 255);font-family:Georgia;font-size:13px;line-height:15px;\">If she doesn&#39;t want to leave school, why not just let her stay until she herself wants to come home?</span></div><div><span style=\"background-color:rgb(255, 255, 255);font-family:Georgia;font-size:13px;line-height:15px;\"><br></span></div><div><span style=\"background-color:rgb(255, 255, 255);font-family:Georgia;font-size:13px;line-height:15px;\">If she&#39;s home against her will, that can keep things from working. &nbsp;It&#39;s one of the worst things about school—lack of choice.</span></div><div><span style=\"background-color:rgb(255, 255, 255);font-family:Georgia;font-size:13px;line-height:15px;\"><br></span></div><div><font face=\"Georgia\"><span style=\"font-size:13px;line-height:15px;\">Sandra</span></font></div></html></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] tween/teen perspective","postDate":"1392786648","msgId":73734,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJDRjAzNEEyLTM1RTUtNEYxMC1BRjlBLTA4MEE2MzJBRjQwNUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDBEQjlBQjhDLTBGMjgtNDdGRS1CNzE2LTI4QjdCNEM4MkVCMkBjb21jYXN0Lm5ldD4=","referencesHeader":"PDBEQjlBQjhDLTBGMjgtNDdGRS1CNzE2LTI4QjdCNEM4MkVCMkBjb21jYXN0Lm5ldD4="},"prevInTopic":73704,"nextInTopic":73735,"prevInTime":73733,"nextInTime":73735,"topicId":73613,"numMessagesInTopic":0,"msgSnippet":"-=-We have had a huge rash of snow days here, so it has been a good opportunity to breath it all in, so to speak, and have some open discussions.  I am trying","messageBody":"<div id=\"ygrps-yiv-1411353373\">-=-We have had a huge rash of snow days here, so it has been a good opportunity to breath it all in, so to speak, and have some open discussions.  I am trying to compile some videos and shorter articles/blogs/quotes as she can be overwhelmed with reading.  -=-<br/>\n<br/>\nDo you mean to find videos and quotes about unschooling?<br/>\nI don&#39;t think you should do that. Don&#39;t burden her with learning your &quot;teaching method&quot; (such as it is—it&#39;s &quot;the open classroom&quot; method of the late 60&#39;s and early 1970&#39;s).<br/>\n<br/>\nIt would be much better to suggest that you just take a breatk from anything academic until next August or September.  Have a long, clear space to just be.  Deschooling isn&#39;t going to work if you&#39;re &quot;studying,&quot; even if it&#39;s studying unschooling.<br/>\n<br/>\nYOU (the mom) should read a little, try a little, wait (weeks) watch (her) but don&#39;t talk about it it much.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":352156964,"authorName":"Tara Chowaniec","from":"Tara Chowaniec &lt;chowaniec46@...&gt;","profile":"tarachowaniec@ymail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: tween/teen perspective","postDate":"1392727312","msgId":73704,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBEQjlBQjhDLTBGMjgtNDdGRS1CNzE2LTI4QjdCNEM4MkVCMkBjb21jYXN0Lm5ldD4="},"prevInTopic":73620,"nextInTopic":73734,"prevInTime":73703,"nextInTime":73705,"topicId":73613,"numMessagesInTopic":0,"msgSnippet":"... Thank you for that feedback, she is definitely concerned about *not learning* and the loss of common ground with school friends.  I should mention we","messageBody":"<div id=\"ygrps-yiv-663047180\"><blockquote><span title=\"ireply\">&gt;&gt;She might feel like she&#39;s going to be stuck being &quot;in charge&quot; of her own education - a daunting prospect! Or she might feel like there&#39;s a really big disconnect - I mean, last year school was Good and now it&#39;s not? Now even a well structured curriculum is Bad? What&#39;s up with that? Why should she abandon six or more years of hard work because you want to fly kites and play video games?&gt;&gt;<br/>\n<br/>\n </span></blockquote>Thank you for that feedback, she is definitely concerned about *not learning* and the loss of common ground with school friends.  I should mention we homeschooled for a year, last year and she said she felt like she needed to be challenged more and chose to go to 5th grade.  She struggles with all of the academic classes, has been labeled “learning disabled” and I am worried now that she equates learning with something that should be difficult and a struggle.<br/>\n<br/>\nWe have had a huge rash of snow days here, so it has been a good opportunity to breath it all in, so to speak, and have some open discussions.  I am trying to compile some videos and shorter articles/blogs/quotes as she can be overwhelmed with reading.<br/>\n<br/>\nThanks,<br/>\nTara</div>","specialLinks":[]},{"userId":154304522,"authorName":"","from":"&lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: tween/teen perspective","postDate":"1392479321","msgId":73620,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGxkbzI4cCsxbmllbGdiQFlhaG9vR3JvdXBzLmNvbT4=","inReplyToHeader":"PGxkbDE3ZitxcWs2MmdAWWFob29Hcm91cHMuY29tPg==","referencesHeader":"PGxkbDE3ZitxcWs2MmdAWWFob29Hcm91cHMuY29tPg=="},"prevInTopic":73613,"nextInTopic":73704,"prevInTime":73619,"nextInTime":73621,"topicId":73613,"numMessagesInTopic":0,"msgSnippet":"Rather than pushing unschooling, make her holidays wonderful and inviting and promise more of the same. If the social aspect of school is important to her,","messageBody":"<div id=\"ygrps-yiv-2108231926\">Rather than pushing unschooling, make her holidays wonderful and inviting and promise more of the same. If the social aspect of school is important to her, that&#39;s something you&#39;ll need to find ways to continue - so actively look for homeschool groups in &nbsp;your area so you can introduce her around during the next vacation period as well as planning on getting her together with her school friends on a regular basis.&nbsp;<br><br>If she&#39;s worried about the academics, that&#39;s something to take seriously, too. Remember that she&#39;s had a loooooot of pressure from school that Education is the most important thing in the world - and you&#39;re suggesting pulling all that out from under her feet. She might feel like she&#39;s going to be stuck being &quot;in charge&quot; of her own education - a daunting prospect! Or she might feel like there&#39;s a really big disconnect - I mean, last year school was Good and now it&#39;s not? Now even a well structured curriculum is Bad? What&#39;s up with that? Why should she abandon six or more years of hard work because you want to fly kites and play video games?<br><br>In that sense, it might help her to connect - or at least see videos of - unschooling teens and young adults rather than kids her own age. If you can&#39;t find videos, you can read stories of what other grown and nearly-grown unschoolers are doing to use as reassurance: college, jobs, travel, relationships... all normal grownup stuff, and they didn&#39;t have to go to school to do it.&nbsp;<div><br></div><div><a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/teen/\">http://sandradodd.com/teen/</a><br></div><div><br></div><div><a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/listen/\">http://sandradodd.com/listen/</a><br></div></div>","specialLinks":[]},{"userId":352156964,"authorName":"","from":"&lt;chowaniec46@...&gt;","profile":"tarachowaniec@ymail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"tween/teen perspective","postDate":"1392380555","msgId":73613,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGxkbDE3ZitxcWs2MmdAWWFob29Hcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":73620,"prevInTime":73612,"nextInTime":73614,"topicId":73613,"numMessagesInTopic":0,"msgSnippet":"Hello,  I was wondering if anyone had any links to videos/articles (preferably videos) that discuss unschooling from a tween/teen perspective.  This is for my","messageBody":"<div id=\"ygrps-yiv-1890846155\">Hello,&nbsp;<div>I was wondering if anyone had any links to videos/articles (preferably videos) that discuss unschooling from a tween/teen perspective. &nbsp;This is for my 11-year-old daughter with whom we&#39;re discussing unschooling with (she is somewhat hesitant to leave school culture). Something along the lines of Holly Dodd on youtube, that was great! &nbsp;</div><div><br></div><div>Thanks,</div><div>Tara<br><div><br></div></div></div>","specialLinks":[]}],"prevTopicId":73716,"nextTopicId":73758}}