{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":12,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Money and buying stuff","postDate":"1322846230","msgId":64051,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3RDJCRkM3LTZCODAtNDkwQi1BNDU1LTJCRDk5RUE1N0JFRkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpiYW1rbitjZDF0QGVHcm91cHMuY29tPg==","referencesHeader":"PGpiYW1rbitjZDF0QGVHcm91cHMuY29tPg=="},"prevInTopic":64050,"nextInTopic":0,"prevInTime":64050,"nextInTime":64052,"topicId":63980,"numMessagesInTopic":0,"msgSnippet":"-=-If we see learning potential in everything that our kids are interested in, how do we differentiate between spending money and educational expenses? I m","messageBody":"<div id=\"ygrps-yiv-1665160696\">-=-If we see learning potential in everything that our kids are interested in, how do we differentiate between spending money and educational expenses? I&#39;m asking this as I&#39;ve been wondering about how to go about doing pocket money thing.-=-<br/>\n<br/>\nWith our kids, if it seemed like educational expense, we would buy it.<br/>\nTheir allowance was for them to save or spend, but for buying things they didn&#39;t need to ask us about.  If there was something they wanted that I didn&#39;t want to buy, that was an allowance matter.  If there was something they wanted that I saw as a good investment in learning (for them and the rest of the family), then I&#39;d usually just buy it.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Money and buying stuff","postDate":"1322846083","msgId":64050,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpiYjEyMys1MTg5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpiYW1rbitjZDF0QGVHcm91cHMuY29tPg=="},"prevInTopic":64046,"nextInTopic":64051,"prevInTime":64049,"nextInTime":64051,"topicId":63980,"numMessagesInTopic":0,"msgSnippet":"... ***************** Educational expenses can be a helpful analogy for parents new to unschooling, who may have spent money in the past on school supplies","messageBody":"<div id=\"ygrps-yiv-586202620\">&quot;t_guyonvarch&quot; &lt;titiskarweni@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; If we see learning potential in everything that our kids are interested in, how do we differentiate between spending money and educational expenses?<br/>\n </span></blockquote>*****************<br/>\n<br/>\n&quot;Educational expenses&quot; can be a helpful analogy for parents new to unschooling, who may have spent money in the past on school supplies or curricula or &quot;educational materials&quot; (or assumed they would) - that&#39;s why I put it in quotes, since unschooling isn&#39;t really about education.<br/>\n<br/>\nOver time, though, it&#39;s good for those ideas to drop by the wayside! Nowadays I don&#39;t think in terms of &quot;educational expenses&quot; but I do think of things like paper and tape the way I do clothes and... maybe not staple foods but that next-step-up kind of food. But then, my kids use a lot of paper and tape ;) So another way of thinking about those kinds of expenses is regularity - it may make sense to have a video game budget separate from &quot;spending money&quot; the same way you&#39;d pay for a magazine subscription without taking it out of a child&#39;s allowance.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I&#39;m asking this as I&#39;ve been wondering about how to go about doing pocket money thing. <br/>\n </span></blockquote>*****************<br/>\n<br/>\nYou don&#39;t necessarily Have To give an allowance - it really depends on your kid and your situation. Mo (10) doesn&#39;t have an allowance at the moment. She gets some money from extended family as gifts and otherwise I let her know how much extra is in the family budget. George is self-employed, so while I have regular pay check we also have &quot;surges&quot; of money and times when cash is limited, so the budget varies. <br/>\n<br/>\nDoes your kid Want pocket money?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;So far, I&#39;ve been happy to get my son whatever toys/food, etc he asked as I don&#39;t think they are excessive so far, and they are always related to things he is interested in, so I always thought they are educational expenses.<br/>\n </span></blockquote>****************<br/>\n<br/>\nAnd over time that can become &quot;happy to help my son get what he wants (within the family budget)&quot; without worrying about what&#39;s excessive and what&#39;s related to learning. But if he wants some pocket money of his own - some kids do, others don&#39;t care - give him some with no strings attached. <br/>\n<br/>\nBut I&#39;m wondering about this phrases &quot;related to things he is interested in&quot; - if he wants something, is he not interested? That&#39;s where I would think it could help to give him money rather than setting him up to ask, if you&#39;re valuing some things as &quot;whimsy=no&quot; and others as &quot;serious interest=yes&quot;. Give him money to spend as he likes, but at the same time budget for longer term interests the way you do your Own long term interests. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":29148328,"authorName":"t_guyonvarch","from":"&quot;t_guyonvarch&quot; &lt;titiskarweni@...&gt;","profile":"t_guyonvarch","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Money and buying stuff","postDate":"1322835415","msgId":64046,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpiYW1rbitjZDF0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpiM3E2ais4Nzh1QGVHcm91cHMuY29tPg=="},"prevInTopic":64038,"nextInTopic":64050,"prevInTime":64045,"nextInTime":64047,"topicId":63980,"numMessagesInTopic":0,"msgSnippet":"... If we see learning potential in everything that our kids are interested in, how do we differentiate between spending money and educational expenses? I m","messageBody":"<div id=\"ygrps-yiv-1772920688\"><blockquote><span title=\"ireply\">&gt; &gt;&gt;arts and craft materials<br/>\n&gt; <br/>\n&gt; I don&#39;t include those as part of &quot;spending money&quot; - they&#39;re more like clothes and shoes, things the kids need, or &quot;educational expenses&quot; if you like. <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>If we see learning potential in everything that our kids are interested in, how do we differentiate between spending money and educational expenses? I&#39;m asking this as I&#39;ve been wondering about how to go about doing pocket money thing. So far, I&#39;ve been happy to get my son whatever toys/food, etc he asked as I don&#39;t think they are excessive so far, and they are always related to things he is interested in, so I always thought they are educational expenses. And food is, well, food is necessary for our well being, including any snack he likes. <br/>\n<br/>\nThanks.</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Money and buying stuff","postDate":"1322777797","msgId":64038,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpiOHVjNStjdWlqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpiNGYwOSt0ZzQ1QGVHcm91cHMuY29tPg=="},"prevInTopic":64019,"nextInTopic":64046,"prevInTime":64037,"nextInTime":64039,"topicId":63980,"numMessagesInTopic":0,"msgSnippet":"... **************** To some extent, it depends on how you come by your numbers. If there s  *always* extra money you can pull from other places - easily -","messageBody":"<div id=\"ygrps-yiv-1387536202\">&quot;keeliereader&quot; &lt;keeliebean@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I&#39;m still a bit confused - if we have a set budget for Jack but then there is always extra money for this and that from my budget, won&#39;t that continue to confuse him? Espeically as in those moments I&#39;m stuck using my internal formula as to whether I &#39;should&#39; buy it for him or not. <br/>\n </span></blockquote>****************<br/>\n<br/>\nTo some extent, it depends on how you come by your numbers. If there&#39;s  *always* extra money you can pull from other places - easily - then it may be worth giving a bigger allowance/spending budget to your son, in order to take yourself out of the equation to a greater extent. But it doesn&#39;t hurt to do a bit of juggling now and then and help your kid buy something he wants in the moment - it lets him see you being generous and kind in a way that&#39;s very real and immediate to him. That&#39;s one of the ways kids come to value generosity!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Is it really okay to support him by buying everything he wants (if I could)<br/>\n </span></blockquote>****************<br/>\n<br/>\nIt helps to get real about that idea - it is Not Possible to buy a young child everything he wants, no matter how much money you have. They want the day to be longer, for it to stop raining Now, for noodles to grow on trees and real leprechauns to be found at the end of the rainbow. It&#39;s hard to be a little kid! They don&#39;t have many skills or much knowledge yet, and the world is mostly not built to accommodate them. There&#39;s no need to teach little kids they can&#39;t always get what they want, its abundantly clear to them every day. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Is it really okay to support him by buying everything he wants (if I could) - when some of those things are passing whims?<br/>\n </span></blockquote>*****************<br/>\n<br/>\nIs learning a passing whim? Kids learn about the world in very direct ways. They Do in order to learn. So they learn about making decisions by making them. They learn about buying and spending by going to the store and shopping. Buying something isn&#39;t Just about the thing, its about the whole process of making financial decisions - and that&#39;s Not something you can teach! You can offer information, share your own thoughts when appropriate, give suggestions, but you son will learn to make choices by making them. <br/>\n<br/>\nAdults do a great many things whimsically. It&#39;s the holiday season and shops are filled with a special kind of adult whimsy ;) Little children aren&#39;t more whimsical than adults, if anything the opposite is true. They&#39;re more wholehearted. They want what they want when they want it - they don&#39;t have the ability to &quot;delay gratification&quot; yet and it isn&#39;t something to learn so much as to grow into. If anything, making kids wait and saying no keeps them wanting longer - limits make things more valuable. Limiting buying in general makes Things more valuable. All the adults squabbling over discount toasters and sweaters this time of year were raised with spending limits imposed by their parents. It didn&#39;t make them less materialistic.<br/>\n<br/>\nIt can be helpful to think of the good qualities you&#39;d like to see in your child and act on those things. If you hope your child will be generous, be more generous to him, directly. If you hope he&#39;ll be thoughtful, be more thoughtful in ways he can see and relate to. That&#39;s the problem with ideas like &quot;I don&#39;t want him to think he can always have what he wants&quot; - it sets you up to say No without knowing what to support, what to say yes to. What&#39;s the good quality you hope  to inspire? Responsibility? Lots and lots of &quot;nos&quot; don&#39;t feel responsible to the person on the receiving end. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m also curious about parents who encourage their kids to split their money - some for spending, some for saving, some for charity. Is this too controlling?<br/>\n </span></blockquote>*******************<br/>\n<br/>\nStep away from the idea of controlling for a moment and see it from a child&#39;s point of view. If it&#39;s something the child is excited about, then its a Great idea! But otherwise, its a big fat cheat. Mom says &quot;you have x dollars, but no, you don&#39;t because you Have To give some way and you Can&#39;t spend this other percentage right away.&quot; That&#39;s not the sort of set up for generosity or responsibility. <br/>\n<br/>\nIf your child Wants to save, help him find ways to do that. It helped Ray to have a bank account so the money he was saving wasn&#39;t in his pocket. He liked the delay of having to go to the bank and get his money out. Mo hasn&#39;t had a reason to save, yet, so I don&#39;t know how she&#39;ll go about it. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I think I will also start logging his spending so he can see what he has bought but also to allow him to borrow against his future allowance. I can see him racking up a big debt!<br/>\n </span></blockquote>****************<br/>\n<br/>\nThat has the potential to set you up as a big meanie! He won&#39;t see it the way you will, he&#39;ll see mommy gave him the money and then turned around and started saying No and blaming him. It won&#39;t matter how much you explain, it will backfire and undermine his trust in you. If you&#39;re going to do the &quot;borrow&quot; thing, make it a dollar or two against next time. If you can afford to &quot;lend&quot; him more or on a regular, then it&#39;s better to increase his allowance and once again take yourself out of the mix. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":246186758,"authorName":"Sarah","from":"&quot;Sarah&quot; &lt;yahoo@...&gt;","profile":"sarahlexis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Money and buying stuff","postDate":"1322653887","msgId":64019,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpiNTVidisxZW10QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpiM3E2ais4Nzh1QGVHcm91cHMuY29tPg=="},"prevInTopic":64018,"nextInTopic":64038,"prevInTime":64018,"nextInTime":64020,"topicId":63980,"numMessagesInTopic":0,"msgSnippet":"We have a money jar and a chart for Jack (6) and Charlie (4). The jar counts the money up and they colour in another bar of their chart for every pound they","messageBody":"<div id=\"ygrps-yiv-1136211867\">We have a money jar and a chart for Jack (6) and Charlie (4). The jar counts the money up and they colour in another bar of their chart for every pound they save. We mark on the chart when they&#39;ll have enough for various things they want. We put in coins whenever we have it and it soon mounts up without impacting on our (rather tight!) budget. <br/>\n<br/>\nIt has really helped them see progress towards the things they want, and to evaluate relative worth (will they buy the cheap Lego mini figure now, or wait till they can afford the Nerf gun?). When we&#39;re going to a shop now I usually set a budget and if they don&#39;t spend it they can put it in their jar- so they don&#39;t have to buy something they don&#39;t really want in order to benefit.<br/>\n<br/>\nIt allows for us to be generous, but gives them control.<br/>\n<br/>\nSarah<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Meredith&quot; &lt;plaidpanties666@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; &quot;keeliereader&quot; &lt;keeliebean@&gt; wrote:<br/>\n&gt; &gt;&gt; When we have these conversations, I think &#39;well you can&#39;t have everything you want&#39; and &#39;money doesn&#39;t grow on trees&#39;. I don&#39;t say it...but I&#39;m a loss as to what to say.<br/>\n&gt; ****************<br/>\n&gt; <br/>\n&gt; It helps a lot to be really clear about what the budget is- I mean it helps Kids a lot to have a number to work with. There can be a little flex in that number, but part of what makes finances and shopping confusing to kids is that adults tend to make spending decisions based on a kind of vague internal formula which uses a Lot of emotional data. So kids are stuck asking for lots and lots of things to try and figure out how this decision works. Giving a concrete number lets kids figure out their own spending decisions without getting bogged down in your issues ;)<br/>\n&gt; <br/>\n&gt; When you&#39;re getting ready to go into a store, tell him how much he can spend there. Help him keep track. For awhile, when Mo was little, I&#39;d give her play money which represented her real budget - that way I could write a check or whatever and we didn&#39;t have to worry about Mo setting the money down somewere - which she tended to do. But eventually she could &quot;hold the numbers in her head&quot; and didn&#39;t need the prop-money any more. <br/>\n&gt; <br/>\n&gt; &gt; I posted on another list about this saying that we had $10-15 dollars a week alloted to his &#39;expenses&#39; and lots of people said that was too much for a 3 yr old.<br/>\n&gt; ********************<br/>\n&gt; <br/>\n&gt; If it&#39;s something you can afford, its not too much. It&#39;s nice if you can give enough money that a child can save if they want to And still spend a little if they want. But since you Have a number already, work with that. If he wants to save up for things that are too much, help him do that. Alternately, he might like to &quot;borrow&quot; against next weeks cash - that&#39;s something to consider, although that&#39;s going to be hard for a 3yo to understand, especially the next week! <br/>\n&gt; <br/>\n&gt; Something else to keep in mind is that you don&#39;t have to take him everywhere. It&#39;s often better to only take a young child to places where he can reasonably afford what he wants. </span></blockquote></div>","specialLinks":[]},{"userId":235040567,"authorName":"Rebecca Allen","from":"&quot;Rebecca Allen&quot; &lt;rebannallen@...&gt;","profile":"quinnannalisesmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Money and buying stuff","postDate":"1322645238","msgId":64018,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpiNHN0bStvNzYzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpiMmxjZytqZjF2QGVHcm91cHMuY29tPg=="},"prevInTopic":64017,"nextInTopic":64019,"prevInTime":64017,"nextInTime":64019,"topicId":63980,"numMessagesInTopic":0,"msgSnippet":"My daughter, Quinn, is 6 years old now and is only now starting to grasp or show an interest in having her own money to spend.  She currently has (2) one","messageBody":"<div id=\"ygrps-yiv-1537923954\">My daughter, Quinn, is 6 years old now and is only now starting to grasp or show an interest in having her own money to spend.  She currently has (2) one dollar bills under her pillow.  She does have a wallet and piggy bank, but under her pillow is where she wants to keep those dollars for now.  She has asked to receive money for her next birthday in six months.  That&#39;s the extent of her interest at this time, so we have not given her an allowance.<br/>\n<br/>\nWe (her parents) do have a loose budget for spending on her toy shopping and other things she chooses and separate money for art supplies, books, games and other toys she might not choose herself but I think she will probably enjoy.  For a couple years it seemed she would only choose plushies when shopping, so I especially made efforts to make sure we had other new things in the house.  <br/>\n<br/>\nWhen my daughter has collected specific toys, she has made lists by drawing the items or asking me to write the items, sometimes two pages long.  We would sometimes go to websites each day to look at the various items. That was a way to window shop without actually going to stores.  It also seemed to help her prioritize her shopping.<br/>\n<br/>\n-=-His dad (who often buys him little things and has gone out of his way more than once to go and find the toy he wanted) feels stressed when he sees the house filling up with cheap toys. So I wonder how to balance their conflicting needs.-=-<br/>\n<br/>\nClutter can be stressful for some people.  I have experience with that. :)  One of our financial costs of unschooling has been storage.  It&#39;s not something I thought about at the beginning, but we keep accumulating lots of cool stuff!  Bookcases, cabinets, toy bins, baskets, and other ways of organizing toys and supplies might make things less stressful. <br/>\n<br/>\nAbout cheap toys...dollar store toys can be fun.  Are you accumulating cheap toys due to the $5 allowance?  I wouldn&#39;t expect a 3 year old to have the patience to save up for more expensive toys.  If you can afford to spend more than $5 per week, then go ahead and spend more if that means better quality and it&#39;s important to his father.  Or do both if you can afford it. My daughter sometimes wants a new toy each week, but I think of our supplies and other toys budget in a monthly kind of way.<br/>\n<br/>\nLast year, my daughter really liked collecting Hello Kitty and other Sanrio brand dolls and other items.  My husband often took her to the Sanrio store on Saturdays.  It was their special daddy-daughter time.  Quinn often picked out a doll in the $10 range.  Sometimes she spun the $1 prize wheel for pencils and such and got a few stickers and pieces of candy.  Other times she picked out something closer to $20, so it evened out or my husband told her they would wait a couple weeks before returning.  They spent a lot of time looking at the items in the store and thinking about what she wanted to get &quot;next time.&quot;  (Sometimes I was invited along, so I witnessed this.) She often changed her mind by the next week.  If she wanted to buy a toy during the week, we gave her that option OR to get a toy on Saturday.  She usually chose to wait.<br/>\n<br/>\nFor a few years, Quinn was very into collecting things and getting new toys often.  She still likes to collect, but she has become more selective.  She and my husband often spend their special times playing  video games or going to a playground rather than shopping.  Her Christmas list is much shorter this year.  <br/>\n<br/>\nMaybe your son will always want lots of toys or maybe he will change in that respect.  You really can&#39;t know for sure, but for now it sounds like he wants lots of toys.  So get him what you can today!<br/>\n<br/>\nRebecca</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Money and buying stuff","postDate":"1322634194","msgId":64017,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM3OUUxOEEyLUEwNTgtNDU3QS1CREVBLTQxMUJGMzc0REI0QUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpiNGYwOSt0ZzQ1QGVHcm91cHMuY29tPg==","referencesHeader":"PGpiNGYwOSt0ZzQ1QGVHcm91cHMuY29tPg=="},"prevInTopic":64014,"nextInTopic":64018,"prevInTime":64016,"nextInTime":64018,"topicId":63980,"numMessagesInTopic":0,"msgSnippet":"-=-I m also curious about parents who encourage their kids to split their money - some for spending, some for saving, some for charity. Is this too","messageBody":"<div id=\"ygrps-yiv-547675479\">-=-I&#39;m also curious about parents who encourage their kids to split their money - some for spending, some for saving, some for charity. Is this too controlling?-=-<br/>\n<br/>\nI think it&#39;s too controlling.  Why give it to them if you&#39;re not REALLY giving it to them?  It&#39;s kind of sadistic.<br/>\n<br/>\n-=- I think I will also start logging his spending so he can see what he has bought but also to allow him to borrow against his future allowance. I can see him racking up a big debt! <br/>\n-=-<br/>\n<br/>\nThat sounds terrible.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":363268824,"authorName":"keeliereader","from":"&quot;keeliereader&quot; &lt;keeliebean@...&gt;","profile":"keeliereader","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Money and buying stuff","postDate":"1322630985","msgId":64014,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpiNGYwOSt0ZzQ1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpiM3E2ais4Nzh1QGVHcm91cHMuY29tPg=="},"prevInTopic":64005,"nextInTopic":64017,"prevInTime":64013,"nextInTime":64015,"topicId":63980,"numMessagesInTopic":0,"msgSnippet":"Thanks for the links Sandra - I ve read the first link before but hadn t made it to the second link. that was really helpful. ... OKay, I see why Jack would be","messageBody":"<div id=\"ygrps-yiv-1965592706\">Thanks for the links Sandra - I&#39;ve read the first link before but hadn&#39;t made it to the second link. that was really helpful. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;It helps a lot to be really clear about what the budget is- I mean it helps Kids a lot to have a number to work with. There can be a little flex in that number, but part of what makes finances and shopping confusing to kids is that adults tend to make spending decisions based on a kind of vague internal formula which uses a Lot of emotional data. So kids are stuck asking for lots and lots of things to try and figure out how this decision works. Giving a concrete number lets kids figure out their own spending decisions without getting bogged down in your issues ;)&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>OKay, I see why Jack would be confused and I really like what you wrote. I&#39;m still a bit confused - if we have a set budget for Jack but then there is always extra money for this and that from my budget, won&#39;t that continue to confuse him? Espeically as in those moments I&#39;m stuck using my internal formula as to whether I &#39;should&#39; buy it for him or not. <br/>\n<br/>\nI think that maybe this is more about my fears that I&#39;m not helping him by buying everything he wants - while he seems to be in this period of many wants. Is it really okay to support him by buying everything he wants (if I could) - when some of those things are passing whims?<br/>\n<br/>\nI&#39;m also curious about parents who encourage their kids to split their money - some for spending, some for saving, some for charity. Is this too controlling?<br/>\n<br/>\nI like the idea of play money. I think I will also start logging his spending so he can see what he has bought but also to allow him to borrow against his future allowance. I can see him racking up a big debt!</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Money and buying stuff","postDate":"1322609683","msgId":64005,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpiM3E2ais4Nzh1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpiMmxjZytqZjF2QGVHcm91cHMuY29tPg=="},"prevInTopic":63985,"nextInTopic":64014,"prevInTime":64004,"nextInTime":64006,"topicId":63980,"numMessagesInTopic":0,"msgSnippet":"... **************** It helps a lot to be really clear about what the budget is- I mean it helps Kids a lot to have a number to work with. There can be a","messageBody":"<div id=\"ygrps-yiv-331759639\">&quot;keeliereader&quot; &lt;keeliebean@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; When we have these conversations, I think &#39;well you can&#39;t have everything you want&#39; and &#39;money doesn&#39;t grow on trees&#39;. I don&#39;t say it...but I&#39;m a loss as to what to say.<br/>\n </span></blockquote>****************<br/>\n<br/>\nIt helps a lot to be really clear about what the budget is- I mean it helps Kids a lot to have a number to work with. There can be a little flex in that number, but part of what makes finances and shopping confusing to kids is that adults tend to make spending decisions based on a kind of vague internal formula which uses a Lot of emotional data. So kids are stuck asking for lots and lots of things to try and figure out how this decision works. Giving a concrete number lets kids figure out their own spending decisions without getting bogged down in your issues ;)<br/>\n<br/>\nWhen you&#39;re getting ready to go into a store, tell him how much he can spend there. Help him keep track. For awhile, when Mo was little, I&#39;d give her play money which represented her real budget - that way I could write a check or whatever and we didn&#39;t have to worry about Mo setting the money down somewere - which she tended to do. But eventually she could &quot;hold the numbers in her head&quot; and didn&#39;t need the prop-money any more. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I posted on another list about this saying that we had $10-15 dollars a week alloted to his &#39;expenses&#39; and lots of people said that was too much for a 3 yr old.<br/>\n </span></blockquote>********************<br/>\n<br/>\nIf it&#39;s something you can afford, its not too much. It&#39;s nice if you can give enough money that a child can save if they want to And still spend a little if they want. But since you Have a number already, work with that. If he wants to save up for things that are too much, help him do that. Alternately, he might like to &quot;borrow&quot; against next weeks cash - that&#39;s something to consider, although that&#39;s going to be hard for a 3yo to understand, especially the next week! <br/>\n<br/>\nSomething else to keep in mind is that you don&#39;t have to take him everywhere. It&#39;s often better to only take a young child to places where he can reasonably afford what he wants. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;arts and craft materials<br/>\n<br/>\n </span></blockquote>I don&#39;t include those as part of &quot;spending money&quot; - they&#39;re more like clothes and shoes, things the kids need, or &quot;educational expenses&quot; if you like. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Money and buying stuff","postDate":"1322576511","msgId":63985,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERDNkU4NDgxLTA4NjktNDc2NC04OTc5LTVDNDdFMzI3RjQ2RkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpiMmxjZytqZjF2QGVHcm91cHMuY29tPg==","referencesHeader":"PGpiMmxjZytqZjF2QGVHcm91cHMuY29tPg=="},"prevInTopic":63983,"nextInTopic":64005,"prevInTime":63984,"nextInTime":63986,"topicId":63980,"numMessagesInTopic":0,"msgSnippet":"Oh!  I found another page that wasn t connected to the first one. http://sandradodd.com/math/allowance I ll go and put links back and forth between those. ","messageBody":"<div id=\"ygrps-yiv-1210373032\">Oh!  I found another page that wasn&#39;t connected to the first one.  <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/math/allowance\">http://sandradodd.com/math/allowance</a><br/>\n<br/>\nI&#39;ll go and put links back and forth between those.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Money and buying stuff","postDate":"1322574839","msgId":63983,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJGNDQxOUFELTUwNjItNDgxQi1BRDFCLTE1Q0QzRjkyMURGOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpiMmxjZytqZjF2QGVHcm91cHMuY29tPg==","referencesHeader":"PGpiMmxjZytqZjF2QGVHcm91cHMuY29tPg=="},"prevInTopic":63980,"nextInTopic":63985,"prevInTime":63982,"nextInTime":63984,"topicId":63980,"numMessagesInTopic":0,"msgSnippet":"-=-He doesn t seem that interested in having his own money, although he is enjoying playing with coins at home. I think maybe because the concept of money is","messageBody":"<div id=\"ygrps-yiv-795175146\">-=-He doesn&#39;t seem that interested in having his own money, although he is enjoying playing with coins at home. I think maybe because the concept of money is still confusing for him - or perhaps because he sees that there is always more money in my wallet. -=-<br/>\n<br/>\nI think five or six is as early as he might understand money that way.<br/>\n<br/>\nHere are some good parts from previous discussions:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/money\">http://sandradodd.com/money</a><br/>\n<br/>\nThere are links to other things.  Some of the unschooling voices links might not work anymore, and I&#39;m not vouching for all those either, but still,  it&#39;s a trail you might follow for ideas!<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":363268824,"authorName":"keeliereader","from":"&quot;keeliereader&quot; &lt;keeliebean@...&gt;","profile":"keeliereader","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Money and buying stuff","postDate":"1322571984","msgId":63980,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpiMmxjZytqZjF2QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":63983,"prevInTime":63979,"nextInTime":63981,"topicId":63980,"numMessagesInTopic":0,"msgSnippet":"Hello, I m looking for a bit more clarity around money and my 3 year old son. Until recently it s been easy to buy him what he wants. A Hot Wheels car at the","messageBody":"<div id=\"ygrps-yiv-1777161101\">Hello, <br/>\n<br/>\nI&#39;m looking for a bit more clarity around money and my 3 year old son. Until recently it&#39;s been easy to buy him what he wants. A Hot Wheels car at the supermarket to sweeten the shop, choosing the odd toy from the Op Shop (second-hand/thrift store). We also use our toy library and regular library for books and DVDs. He doesn&#39;t see much advertising because he only watches DVDs and Youtube videos. <br/>\n<br/>\nSuddenly his interest in buying or having toys has expanded substantially. I started giving him an allowance of $5 a week to spend as he likes. There is additional money in our budget for other little things. <br/>\n<br/>\nHe doesn&#39;t seem that interested in having his own money, although he is enjoying playing with coins at home. I think maybe because the concept of money is still confusing for him - or perhaps because he sees that there is always more money in my wallet. <br/>\n<br/>\nWhen he asks for things, sometimes I say something like &#39;oh yes, it would be great to have that&#39;. He doesn&#39;t like that response. With Christmas coming up I&#39;ve suggested adding things to his Christmas list - this sometimes works although not sure what will happen when everything he asked for does not arrive (he has a very good memory!). <br/>\n<br/>\nThere have been a few meltdowns over us not going to buy toys straight away. <br/>\n<br/>\nWhen we have these conversations, I think &#39;well you can&#39;t have everything you want&#39; and &#39;money doesn&#39;t grow on trees&#39;. I don&#39;t say it...but I&#39;m a loss as to what to say. I don&#39;t know where the line is between suporting him in acquiring the things he wants and him understanding that we can&#39;t buy him everything he wants. I want to encourage a sense of abundance. But I don&#39;t know how with materials things. His dad (who often buys him little things and has gone out of his way more than once to go and find the toy he wanted) feels stressed when he sees the house filling up with cheap toys. So I wonder how to balance their conflicting needs. <br/>\n<br/>\nHe also loses interest in his new things very quickly. This seems to be part of his approach/learning style (?) as he devours new DVDs for a week then moves on to something new. <br/>\n<br/>\nI posted on another list about this saying that we had $10-15 dollars a week alloted to his &#39;expenses&#39; and lots of people said that was too much for a 3 yr old. But it soon goes - $5 allowance, a small car here, a ride, arts and craft materials, the occasional new Thomas train. And it doesn&#39;t seem that much compared to our adult income. <br/>\n<br/>\nI really don&#39;t know how best to support him and I&#39;m also experiencing some discomfort around him continually asking for things. <br/>\n<br/>\nAny advice gratefully received. <br/>\nThanks, <br/>\nKeelie</div>","specialLinks":[]}],"prevTopicId":64041,"nextTopicId":63962}}