{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","replyTo":"LIST","senderId":"zGyLlj5aDB7hflzEbbkGQec1DXMRjGkwVwwNsJ6dtbBW6EFZQXfU8dN1Q8mPzMC18lhIGrUcEij3TtORrnGUQ3iJYB-xpPTM9cg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest Number 1492","postDate":"1000988351","msgId":26072,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI3Q0Y1NkZGLjE3MjAlZmV0dGVyb2xsQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDEwMDA5ODAzMTMuNDA1LjQ5MjY1LmwxMEB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":26071,"nextInTime":26073,"topicId":26072,"numMessagesInTopic":0,"msgSnippet":"... The beginning is in reply to you, then it branches off to the types of things I d suggest *generally* as unschooling ways to approach writing for *any*","messageBody":"<div id=\"ygrps-yiv-935992103\">on 9/20/01 6:05 AM, Bridget E Coffman &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:rumpleteasermom@...\">rumpleteasermom@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Sorry to sound flippant.  But go read her whole post.  She is talking<br/>\n&gt; directly to me just as I am talking to you.  Whether she intended the<br/>\n&gt; list of suggestions only for me is up for questioning and I&#39;ll concede<br/>\n&gt; that it is a general list and very useful.<br/>\n<br/>\n </span></blockquote>The beginning is in reply to you, then it branches off to the types of<br/>\nthings I&#39;d suggest *generally* as unschooling ways to approach writing for<br/>\n*any* teen. (Note the change of pronouns and nouns from the more specific<br/>\nyou to more general &quot;a child&quot; and &quot;she&quot; rather than &quot;your daughter&quot; and so<br/>\non.<br/>\n<br/>\nIt was probably confusing to return to &quot;you&quot; by putting the quotes at the<br/>\nbottom. They were originally at the top where they belonged, but as the<br/>\nwriting evolved they interrupted the flow of ideas. They were more for<br/>\nreferences sake by the end of the evolution of the writing, preferenced by<br/>\n&quot;BTW&quot; since they were an aside.<br/>\n<br/>\nHere&#39;s my original post so no one has to go digging. Not that, at this<br/>\npoint, anyone else not involved really cares ;-)<br/>\n<br/>\non 9/17/01 5:27 PM, Bridget E Coffman &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:rumpleteasermom@...\">rumpleteasermom@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; That&#39;s all well and good Brenda, but I&#39;ve been told that what we are<br/>\n&gt; doing cannot possibly be unschooling because we sat down together and<br/>\n&gt; worked out a way for the housework to get done without one person having<br/>\n&gt; to pick up the slack left by the other 4.<br/>\n<br/>\n </span></blockquote>This very much misrepresents the exchange. Or the entire disucssion was a<br/>\nmisunderstanding about what people were saying was not unschooling.<br/>\n<br/>\nI pulled the quotes from your original message that were being objected to.<br/>\nThey were about *academics*. You didn&#39;t explain (despite the fact that I<br/>\nposted them twice and asked twice) how it could be child-led, uncoerced,<br/>\nnatural learning if you&#39;re determining that a specific amount must be done<br/>\nin order for the learning to take place. I *understand* that you have this<br/>\non your chores chart. I *understand* you put it there for convenience sake.<br/>\n<br/>\nBut for those trying to understand how kids can learn what *they* need to<br/>\nknow (as opposed to what others say they need to know) by pursuing what<br/>\ninterests them, it is confusing if someone says it&#39;s unschooling to insist<br/>\nthat something needs to be learned in a particular way.<br/>\n<br/>\nTo me, an unschooling approach would be to give a child information she&#39;s<br/>\nlacking in order to make an informed choice. For instance, let her know that<br/>\ncolleges *may* expect more writing than she&#39;s used to. (It really depends on<br/>\nthe college and the course of study she pursues.) She may or may not feel<br/>\nthat&#39;s a problem.<br/>\n<br/>\nIf she does, there are many ways to approach it. She could take a community<br/>\ncollege course. She could find a program and go through it on her own. She<br/>\ncould post to message boards. She could find pen pals. She could write in a<br/>\njournal. She could write articles for the local paper. She could write to<br/>\nsome students at the colleges she&#39;s thinking of and *ask* how much writing<br/>\nis involved. (Colleges generally have some students who volunteer to host<br/>\nothers.) Or other options. She could ask mom to remind her.<br/>\n<br/>\nIf *she* insists writing 500 words each week is the best approach and *she*<br/>\ninsists she needs someone to *make* her do it each week and punish her if<br/>\nshe doesn&#39;t, then that&#39;s an area to discuss.<br/>\n<br/>\nIt might be motherly (or following your heart or &quot;common sense&quot; or whatever<br/>\nyou&#39;d care to label it nor not label it) to insist it is a problem and she<br/>\nneeds to do something about it. And if someone wants to do that, then they<br/>\nshould do that. But it&#39;s unfair to others trying to understand unschooling<br/>\nto call it unschooling.<br/>\n<br/>\nIt would be unschooling to know that she&#39;s the best judge of who she is and<br/>\nwhat *she* needs and to know that she needs to make the decisions that feel<br/>\nright for her. If she later finds out the decision had consequences she<br/>\nhadn&#39;t anticipated, then she&#39;s learned something else and can then reassess<br/>\nthe problem and seek a new solution.<br/>\n<br/>\nThe best way to learn to write is by writing for real, personally meaningful<br/>\nreasons. If the kids aren&#39;t writing without someone reminding them, then it<br/>\nisn&#39;t real or personally meaningful to them. It may be a &quot;chore&quot; they choose<br/>\nover cleaning the toilet, but it isn&#39;t child led learning anymore than<br/>\nchoosing an apple over dog food is child-led eating.<br/>\n<br/>\nThe best way to write a lot is by having real deadlines for real reasons.<br/>\nShe&#39;ll be getting those (sort of) in college. (Only sort of because the<br/>\nconsequences are all made up. Unlike in the business world, neither the<br/>\nworld nor the college will be a better or worse place if a paper is or isn&#39;t<br/>\nturned in. Colleges have to make up consequences -- grades -- so that there<br/>\nare consequences to doing or not doing homework.) There will be a real<br/>\nreason for doing the writing to a certain standard and she will have full<br/>\nfreedom to do it or not do it, knowing the consequences are not negotiable.<br/>\n<br/>\nTo me, anyway, writing as a chore is even further removed from real actions<br/>\nbeing tied to real consequences since the chore consequences don&#39;t depend<br/>\nspecifically on the writing. The purpose of writing should be to communicate<br/>\nsomething to someone else for a real reason. (As I&#39;m doing here.) Not to<br/>\nfulfill a word limit. The consequences of writing well or not writing well<br/>\nare not gaining or losing car privileges (or whatever) but communicating or<br/>\nnot communicating. Writing in order to get 500 words onto the page won&#39;t<br/>\nhave the same result as writing because *the writer wants* to change<br/>\nsomeone&#39;s mind about something, or tell them something they didn&#39;t know<br/>\nbefore.<br/>\n<br/>\nBTW, here&#39;s the quotes:<br/>\n<br/>\nthe word &quot;MY&quot; in &quot;as long as it meets my basic standards of HOW MUCH.&quot; (in<br/>\nreference to writing each week.)<br/>\n<br/>\nthe words &quot;have to&quot; in &quot;they have to write (physically)&quot;<br/>\n<br/>\nAnd there was another quote a few days later that said your daughter<br/>\n(paraphrasing since I&#39;ve emptied my deleted items folder) &quot;had to get used<br/>\nto writing this much in college each week.&quot;<br/>\n<br/>\nJoyce</div>","specialLinks":[]}],"prevTopicId":26064,"nextTopicId":26006}}