{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":91586765,"authorName":"Dona Baker","from":"&quot;Dona Baker&quot; &lt;donabak@...&gt;","profile":"donabak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: I need your sage advice","postDate":"1022087686","msgId":37268,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTQwMWMyMDFiNCQyYzRlZDRhMCQ5MGJlZGU0MkBhYi5oc2lhLnRlbHVzLm5ldD4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":37267,"nextInTime":37269,"topicId":37268,"numMessagesInTopic":0,"msgSnippet":"Marji and List: I read your post with great empathy. Your experience is reminiscent of ones that I have had with my kids and those of other parents I know.","messageBody":"<div id=\"ygrps-yiv-844305247\">Marji and List:<br/>\n<br/>\nI read your post with great empathy. Your experience is reminiscent of ones that I have had with my kids and those of other parents I know.  The best advice I have ever been given when faced with my kids&#39; frustration is to simply listen and repeat back to them what they are experiencing.<br/>\n<br/>\nI have an example that happened to me just this last weekend. I was volunteering at my son&#39;s drama school and my 12 year old son and two other younger boys (about age 8) were playing in the waiting room until their class started.<br/>\n<br/>\nThe boys started getting active and they chased each other into a cloakroom that was adjoining the drama room. Their movement in the cloakroom knocked down a ladder in the drama room. An assistant came out of the drama room and decided that one of the eight year olds (the boy that many of the staff and parents have dubbed a &quot;problem child&quot;) was to blame for the incident.<br/>\n<br/>\nNo matter how much another mother and I tried to explain that all three boys were responsible, the assistant continued to berate only the one eight year old. The boy finally became so frustrated he burst into tears and ran screaming from the room.<br/>\n<br/>\nI waited about 10 seconds and then I went out into the hall to find him. As soon as he saw me, he started telling me, &quot;I didn&#39;t do it on purpose. I wasn&#39;t the only one who was playing in the coat room.&quot; All I said to him was, &quot;You WEREN&#39;T the only one playing in the coat room and I hear you didn&#39;t mean to knock the ladder down.&quot;<br/>\n<br/>\nThe boy stopped and had a surprised look on his face. He then continued to tell me how unfair it felt to be blamed. I parrotted back everything he said with emphasis - &quot;It IS unfair to be the only one blamed when there were two other boys with you.&quot;<br/>\n<br/>\nIn less than two minutes he had stopped crying, he made one last comment and then looked at me and said, &quot;That&#39;s it. That&#39;s all I have to say. I can go back in now.&quot;<br/>\n<br/>\nWe went back to the waitiing room and I sat in a chair. A few moments later, the boy came over to me with a book in his hand. He asked me if he could sit on my knee and read to me. He sat still and read for 15 minutes until his class was ready to start. This is the child who, his mother tells me, has had teachers tell her that they suspect a behavioral disorder. Hmmm, I have to wonder if it is the child or the process that is being used with him, that is the problem. He certainly responded well to the reflective listening.<br/>\n<br/>\nMany of you probably recognize this technique. It is explained very well in Adele Faber&#39;s book, How to Talk so Kids will Listen, How to Listen so Kids Will Talk. I especially like Faber&#39;s book because she tells exactly how to do the process, gives real examples and then has practise exercises. The book was designed as a whole-learning experience.<br/>\n<br/>\nAnother book that I have been reading lately that I think has some good suggestions and messages about kids learning how to read and write, although I caution the author sends her children to school and is definitely NOT an unschooler, is called: Raising Lifelong Learners: A Parent&#39;s Guide by Lucy Calkins.<br/>\n<br/>\nI wish you and Liam success, Marji.<br/>\n<br/>\nVery kindly,  Dona Baker<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":37267,"nextTopicId":37273}}