{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"Ashling Ranch","from":"&quot;Ashling Ranch&quot; &lt;Ashling@...&gt;","replyTo":"LIST","senderId":"4bCftv4OA1FnybCO7A1cWidpbqmWHLlLFI2i5e2BxIaC-2IwpJ5SVFRCSfwyHutouPNgBVvaeVoHXIZi0P4jF4d2C3e1FiZB","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Race","postDate":"968252159","msgId":12891,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGMwMWMwMTgxMiQ5NDJiMDg2MCQ3ZDI5NTQzZkBjb21wdXRlcj4="},"prevInTopic":12875,"nextInTopic":0,"prevInTime":12890,"nextInTime":12892,"topicId":12875,"numMessagesInTopic":0,"msgSnippet":"Hi Misty, I m rather new to the group also.  Your post on the AAH list was most helpful during one of the flame wars that occurred not too long ago.  The ","messageBody":"<div id=\"ygrps-yiv-355125653\">Hi Misty,<br/>\n<br/>\nI&#39;m rather new to the group also.  Your post on the AAH list was most<br/>\nhelpful during one of the flame wars that occurred not too long ago.  The<br/>\npoints you made about race are good and have made me more reflective and<br/>\nopen to the possibility that racists can change.  I grew up in Mississippi<br/>\nand got into several scrapes because I wasn&#39;t going to put up with the junk<br/>\nracists used to say and do (and sometimes still say, if not blatantly do)!<br/>\nThings haven&#39;t changed all that much in some parts of the South.  My husband<br/>\ntells a story of traveling to Mississippi from Texas  (for a family funeral)<br/>\nat the time of JFK&#39;s death.   In fact, they were on there way to<br/>\nPhiladelphia, MS.<br/>\n<br/>\nMany people were thrilled to see JFK fall.  Apparently the flags were not at<br/>\nhalf staff in MS and many kids cheered in schools around the state when his<br/>\nassassination was announced on the intercom.<br/>\n<br/>\nSomethings have changed----but not nearly enough.  Periodically, I return to<br/>\nthe state and think somewhat wistfully of moving back to some of the family<br/>\nland.  Then I encounter another blatant racists and come to my senses!<br/>\nThanks for sharing the uplifting story about your father.  There does appear<br/>\nto be hope!<br/>\n<br/>\nMelodie<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Ashling@...\">Ashling@...</a></div>","specialLinks":[]},{"userId":0,"authorName":"athterath@newmail.net","from":"athterath@...","replyTo":"LIST","senderId":"9km27LsxIF8VH4wE14G0RiClCPARhwn5HIT-gq_bDzQgfe9bsQZ-26ydVdTT58lGlCl5rV2Gks5M4RrX","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Race","postDate":"968235507","msgId":12875,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5QjYxOUYzLjRDMjBFM0M5QG5ld21haWwubmV0Pg==","referencesHeader":"PDAwMDUwMWMwMTc3ZiQ5NTY1M2ZlMCQwNjhmM2VhNkB3dnVzLm9yZz4="},"prevInTopic":0,"nextInTopic":12891,"prevInTime":12874,"nextInTime":12876,"topicId":12875,"numMessagesInTopic":0,"msgSnippet":"In all seriousness, do you think it s possible for someone who is racist to the bone to change?  (I know you said stupid, not racist...but it is sometimes","messageBody":"<div id=\"ygrps-yiv-47446375\">&quot;In all seriousness, do you think it&#39;s possible for someone who is<br/>\nracist to the bone to change?  (I know you said stupid, not racist...but<br/>\nit is sometimes interchangeable)&quot;<br/>\n<br/>\nI don&#39;t know whether he was ever racist &quot;to the bone&quot;, but my father<br/>\nonce told me that when JFK was shot he was glad. . .one less<br/>\nn****r-lover in the world.  He said it with a great deal of regret,<br/>\nlooking back on the boy (well, teen-ager) he was then from the<br/>\nperspective of the man he&#39;s become.  He&#39;s now a great advocate for<br/>\nracial tolerance and embraces the students of the school at which he is<br/>\nguidance counselor (98% are African- and/or Latin- American) with love<br/>\nand respect.  Several of them have mentioned that he changed their views<br/>\non the &quot;White race&quot; single-handedly (he was the first pale-face they<br/>\never met who DIDN&#39;T look down on them).  And he goes to great lengths to<br/>\nmake sure the teachers and staff of the school, as well as the students,<br/>\nare educated on a great many topics (like aspects of history and<br/>\ngeography having to do with persons of the students&#39; rather than the<br/>\nadministration&#39;s ethnic backgrounds) which were never addressed at the<br/>\nschool before he got there.  My best friend jokingly calls him her<br/>\n&quot;White daddy&quot;, and he considers her an extra daughter.  When I told him<br/>\nwe&#39;d decided that if anything happened to us she&#39;d be the one to raise<br/>\nmy son, he applauded it as an excellent choice and said she was just who<br/>\nhe would have chosen.  He didn&#39;t even mention her hot-cocoa coloring. .<br/>\n.it&#39;s not what&#39;s important to him, any more.<br/>\n<br/>\nWhat did it for him was intimate exposure.  It started when he was in<br/>\nhis early teens, and started spending summers with his grandparents and<br/>\nthe African-American woman who helped out with the housework they<br/>\ncouldn&#39;t do anymore, and escalated when he entered the Navy and found<br/>\nhimself in a mixed company.  (When push came to shove, the unit split<br/>\ninto two social groups along geographic rather than race lines. . .he<br/>\nand the other White Southerners decided they&#39;d rather hang out with the<br/>\nOTHER Southerners than the damn Yankees.)  He got to really know some<br/>\npeople of color then, and after then, and gradually came to see that the<br/>\nattitudes about race he&#39;d been taught growing up, the ones that were<br/>\nuniversally accepted in Memphis and Mississippi in the 1950s and early<br/>\n60s when his worldview was being formed, were simply unfounded.  By the<br/>\ntime I hit highschool, he didn&#39;t have any objection to my dating across<br/>\nrace lines, though he felt it important to mention that I might want to<br/>\nmove out of the South if I decided to have &quot;mixed&quot; children.  And today,<br/>\nhe proudly points out pictures of his uncles and grandfather and states<br/>\nhis conviction that we, ourselves, must be mixed (there&#39;s a &quot;missing&quot;<br/>\ngreat-grandfather on his side, and that&#39;s his theory as to why granny&#39;s<br/>\nlips stayed sealed).  It certainly doesn&#39;t show in me (I&#39;m another<br/>\nglow-in-the-dark type), but he&#39;s probably right; my grandmother&#39;s<br/>\nbrother looks eerily like Gregory Hinds after a few weeks of summer sun.<br/>\nMost of his cousins would like to string him up (no, I&#39;m not joking).<br/>\nMaybe they never had the opportunity he had to learn first-hand how<br/>\nwrong what they were all taught is.  Maybe it takes a kind of openness<br/>\nthat he has and they don&#39;t.  Maybe the spirits of our ancestors picked<br/>\nhim out specially to work on the hatred and bigotry into which he was<br/>\nborn.  Maybe he just got lucky.  I don&#39;t know how or why he was able to<br/>\novercome his racism.  But he did.<br/>\n<br/>\nSo I, for one, not only believe but KNOW it&#39;s possible to change that<br/>\nkind of thinking. . .though only in yourself.<br/>\n<br/>\nMisty Blagg<br/>\n<br/>\nP.S.--I&#39;m new to the group and will try to get to an intro soon.  I just<br/>\nthought I had to answer this question.</div>","specialLinks":[]}],"prevTopicId":12889,"nextTopicId":12705}}