{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Covert","from":"Covert &lt;covert@...&gt;","replyTo":"LIST","senderId":"UcpS7POQZOyC31UGUjuqGmA-WN6b7EVwOT-_C5bcCYEBtAEWNOqu-bkZYZ3D-FiKmO6eHDoszB_Gl_QowHW6REFhN42dfw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Japan homelearning article -- another one!","postDate":"968195336","msgId":12821,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAwOTA1MjMwOS5JQUEwMzE0MUBzbXRwMi5kdGkubmUuanA+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":12820,"nextInTime":12822,"topicId":12821,"numMessagesInTopic":0,"msgSnippet":"Hi all, We re on a roll here in Japan with homelearning stories in the news! On Aug. 28, the Asahi Evening News ran a large spread on homelearning in Japan,","messageBody":"<div id=\"ygrps-yiv-545869711\">Hi all,<br/>\n<br/>\nWe&#39;re on a roll here in Japan with homelearning stories in the news!<br/>\n<br/>\nOn Aug. 28, the Asahi Evening News ran a large spread on homelearning in <br/>\nJapan, and just a few days ago, the Daily Yomiuri newspaper followed up <br/>\nwith a hefty story on the same subject.<br/>\n<br/>\nA word or two of forewarning about the Daily Yomiuri article that follows:<br/>\n<br/>\nThe story appears generally well-written and researched. But there is one <br/>\nglaring omission. The writer fails to note that the new &quot;Homeschool <br/>\nSupport Association of Japan&quot; (HoSA), a nonprofit organization, is <br/>\nneither independent nor neutral. It was created recently by a very much <br/>\nfor-profit corporation called Atmark, which is also mentioned in the <br/>\nstory. Mr. Kozo Hino, a Japanese businessman, serves as a head of both <br/>\nAtmark and HoSA.<br/>\n<br/>\nSome of us in the homelearning community in Japan are wary of this setup: <br/>\nOn the one hand, the Homeschool Support Association of Japan is <br/>\n*officially* supported by a long list of Japanese companies and <br/>\neducational institutions (read: schools). At the same time, the HoSA is <br/>\nofficially endorsed by one -- count &#39;em ONE -- genuine, longtime <br/>\nhomelearning parent in Japan, and that is Ms. Yoshiko Kubo, who is <br/>\nfeatured in the story. Moreover, the HoSA has one -- count &#39;em ONE -- <br/>\noverseas homelearning advocate on its official supporters list, and that <br/>\nis Mr. Christopher Klicka, senior counsel of the US-based Home School <br/>\nLegal Defense Association. All of this can be confirmed (in Japanese) at <br/>\nthe HoSA website at:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.homeschool.ne.jp/Hosa/yakuin.html\">http://www.homeschool.ne.jp/Hosa/yakuin.html</a><br/>\n<br/>\nIt is also more than a little unsettling that such a questionable <br/>\norganization as the HoSA, as stated in the story below, sees its function <br/>\nas &quot;investigating exactly how many homeschoolers there are in Japan and <br/>\nworking on ways to bring them together.&quot;<br/>\n<br/>\nAs for the motives of Atmark, HoSA&#39;s parent company, in providing its <br/>\nInternet-based learning services to prospective homelearning clients: It <br/>\nis quite ironic -- and very revealing -- that the Atmark spokesperson in <br/>\nthe following story quotes a need for Japanese workers to be more <br/>\ncompetitive with American ones. It is ironic because Atmark itself, a <br/>\nJapanese for-profit corporation, has recently made its debut in the <br/>\nworldwide home-education market by forming a tie-up with a U.S. <br/>\neducation-related organization, the Alger Learning Center & Independence <br/>\nHigh School (www.independent-learning.com), based in Washington state, <br/>\nUSA. Not to mention that Atmark/HoSA has been seeking support from the <br/>\ncontroversial, US-based HSLDA. And they say *politics* makes strange <br/>\nbedfellows....  <br/>\n<br/>\nAnd then there is the intimidating, almost threatening, talk in the <br/>\nfollowing story about the Japanese Ministry of Education&#39;s stance on <br/>\nhomelearning. For the record, folks: The Education Ministry has taken no <br/>\nOFFICIAL position on home education in Japan one way or the other, as far <br/>\nas we are aware. (Education Ministry officials do, however, love to speak <br/>\n&quot;unofficially&quot; and without being named, as in this newspaper story, so <br/>\nthat nobody is held accountable for any statement about home-based <br/>\neducation that comes out of the ministry&#39;s offices. Clever, eh?)<br/>\n<br/>\nWhile it is true that under current statutes, parents in Japan do have a <br/>\nlegal obligation (reportedly at the risk of being fined) to make sure <br/>\ntheir children get a proper education, Japanese homelearning families are <br/>\neasily getting around that stipulation by letting their children -- <br/>\nrather than the parents -- make the ultimate decision to leave the public <br/>\nschool system and learn at home.<br/>\n<br/>\nTrue, as the story states, the ministry has not given its legal blessing <br/>\nyet to homelearning in Japan. But it is also true that the ministry is <br/>\ngenerally not standing in the way of those families who opt to learn at <br/>\nhome. Harassment of homelearning families in Japan by the Ministry of <br/>\nEducation is indeed rare at present.<br/>\n<br/>\nOK, enough forewarning, now on to the news....<br/>\n<br/>\nEnjoy,<br/>\n<br/>\nBrian Covert<br/>\n(KnoK NEWS)<br/>\nin Osaka, Japan<br/>\n<br/>\n--------------------------------<br/>\n<br/>\n[Daily Yomiuri - 2 Sept. 2000]<br/>\n<br/>\n<br/>\nSTAY-AT-HOME KIDS SHUNNING THE SYSTEM<br/>\n<br/>\n<br/>\nBy Tim Large<br/>\nDaily Yomiuri Staff Writer<br/>\n<br/>\nFor Yoshiko Kubo, it was the bullying that clinched it. During two weeks <br/>\nof teacher training at the local middle school, the mother of two saw <br/>\nenough nastiness to put her off the school system for good. &quot;The teachers <br/>\nwere doing everything they could to stop it, but there was terrible <br/>\nbullying -- during class, everywhere, every day,&quot; she said. &quot;I decided <br/>\nthere was no way I could send my daughters there.&quot;<br/>\n<br/>\nSo Kubo chose to do what until recently was almost unheard of in Japan: <br/>\neducate her children herself at home.<br/>\n<br/>\nSix years later, Asuka and Sakura, 12 and 9, respectively, find turning <br/>\nup to class as easy as tumbling out of bed. Though they are officially <br/>\nregistered at the local primary school, neither has knownthe chime of the <br/>\nrecess bell or the squeak of chalk upon a blackboard. But, according to <br/>\ntheir mother, they are noworse off for that.<br/>\n<br/>\n&quot;At regular school, everything is decided by adults,&quot; said Kubo, who <br/>\nworks evenings at a cram school in Chiba Prefecture. &quot;There&#39;s a schedule: <br/>\nDo this, do that, follow the rules. Homeschooled children have to take <br/>\nresponsibility for themselves.&quot;<br/>\n<br/>\nShe went on to describe a typical day. Getting up in the morning whenever <br/>\nthey want, Asuka and Sakura take turns making breakfast and doing the <br/>\ndishes. They then settle down in a room of their choice to do their daily <br/>\nassignments: arithmetic, English, geography, science. Fifteen or 20 <br/>\nminutes is usually sufficient to complete a given exercise. Kubo and the <br/>\nchildren&#39;s grandparents are on hand to answer questions.<br/>\n<br/>\nAfternoons are for reading at the local library (or going on field trips <br/>\nto museums and galleries). Kubo is confident that by engrossing <br/>\nthemselves in books for up to three hours a day, they will stretch their <br/>\nlanguage skills and pick up a wealth of knowledge on the way.<br/>\n<br/>\nBy and large, the point is to follow their own noses, she added. If <br/>\nsomething strikes them as interesting, they have the freedom, motivation <br/>\nand investigative skills to pursue it for all it&#39;s worth.<br/>\n<br/>\n&quot;At the moment, my eldest is interested in weaving. She wanted to make a <br/>\nbig loom, so the other day we bought all the materials. Now, every <br/>\nmorning, it&#39;s clackity-clackity-clack,&quot; she said.<br/>\n<br/>\nWhile unusual, Asuka and Sakura are not unique. Nobody knows exactly how <br/>\nmany children are being taught at home in Japan, but unofficial estimates <br/>\nput the figure at somewhere between 2,000 and 3,000. What is clear is <br/>\nthat the trend is growing.<br/>\n<br/>\nStatistically speaking, their numbers are hidden among the swelling ranks <br/>\nof Japan&#39;s &quot;truant&quot; population. According to the Education Ministry, a <br/>\nrecord 130,000 primary and middle school students were registered as <br/>\nabsent from school for 30 days or more in 1999.<br/>\n<br/>\nMost discussions of absenteeism focus on bullying, delinquency and <br/>\npsychological problems among juveniles. Certainly, a good many families <br/>\nopt for homeschooling by default. It is a last resort for children who <br/>\nsimply will not -- or cannot -- go to school.<br/>\n<br/>\nYet, there is a growing awareness that increasing numbers are shunning <br/>\nthe school system for proactive reasons.<br/>\n<br/>\nKubo&#39;s family is a case in point. True, it was the bullying she witnessed <br/>\nwhile training for her teacher&#39;s certificate that settled the matter. But <br/>\nshe had long been interested in homeschooling, she said, ever since an <br/>\nAmerican friend raved about its benefits.<br/>\n<br/>\nTo be sure, she is not alone in feeling that Japan&#39;s rigid school system <br/>\nis ill-equipped for the job of fostering creative, responsible <br/>\nindividuals. Aside from the national soul-searching sparked by the recent <br/>\nphenomenon of so-called classroom breakdown, the received wisdom is that <br/>\nthe times themselves demand new paradigms for learning. This feeling was <br/>\nreflected in a proposal for the introduction of a three-day school week <br/>\nby former Prime Minister Keizo Obuchi&#39;s private advisory council in <br/>\nJanuary.<br/>\n<br/>\n&quot;The most important question to ask of education is how far and how <br/>\nrichly children are being stretched,&quot; said education critic and former <br/>\nschoolteacher Naoki Ogi. &quot;It&#39;s not as simple as saying, &#39;You&#39;ve got to go <br/>\nto school.&#39;&quot;<br/>\n<br/>\nJun Adachi, an adviser at Atmark Learning Inc., a company specializing in <br/>\nalternative approaches to education, agreed. &quot;We&#39;re no longer looking for <br/>\nfactory workers who show up on time and don&#39;t say anything and just obey <br/>\nthe rules,&quot; he said. &quot;To compete with American workers, we need better <br/>\nthinkers, and the school system doesn&#39;t seem to generate enough of them.&quot;<br/>\n<br/>\nIn April, Atmark Learning launched Inter-Highschool, an online curriculum <br/>\ntailored specifically for homeschoolers. The Internet school currently <br/>\nboasts about 30 enrollees.<br/>\n<br/>\n&quot;We are trying to offer a different type of skill set, and we think that <br/>\nhomeschooling is the way to generate that,&quot; Adachi said.<br/>\n<br/>\nDespite the general feeling that reform is sorely needed, homeschooling <br/>\nfamilies still find themselves up against a wall of opposition. There is <br/>\nthe legal question, for starters. Under the School Education Law, parents <br/>\ncan be prosecuted for failing to see that their children attend school, <br/>\nthough such cases are rare.<br/>\n<br/>\nHome-education advocates counter that the Constitution is on their side. <br/>\nThey point out that while Article 26 states that citizens &quot;shall be <br/>\nobligated to have all boys and girls under their protection receive <br/>\nordinary education,&quot; it does not specify where this &quot;ordinary education&quot; <br/>\nshould take place.<br/>\n<br/>\nCut off from the real world?<br/>\n<br/>\nThe Education Ministry, meanwhile, refuses to recognize homeschooling as <br/>\na valid alternative to the nation&#39;s system of compulsory education. A <br/>\nreason commonly cited is that children schooled at home are denied the <br/>\nvaluable socialization that takes place in the classroom and in the <br/>\nplayground.<br/>\n<br/>\n&quot;Learning is not just about filling your head with knowledge,&quot; a ministry <br/>\nofficial commented. &quot;It&#39;s about hearing what your friends think. It&#39;s <br/>\nabout realizing that people have different opinions.&quot;<br/>\n<br/>\nKubo herself admitted this was one of her greatest concerns. While her <br/>\ndaughters are not hermetically sealed from the outside world -- they have <br/>\nmade buddies at swimming club, for example -- they do sometimes wish they <br/>\nhad more friends, she said.<br/>\n<br/>\nChristopher Klicka, senior counsel for the Virginia-based Home School <br/>\nLegal Defense Association, rejects the socialization argument on the <br/>\ngrounds that club and community activities offer ample opportunities to <br/>\nmix with others. He also said a little bit of protection could be a good <br/>\nthing.<br/>\n<br/>\n&quot;There&#39;s a lot of negative socialization that goes on, and there&#39;s <br/>\npositive socialization,&quot; he said. &quot;Homeschoolers excel in positive <br/>\nsocialization.&quot;<br/>\n<br/>\nKlicka, who has defended thousands of homeschooling families in the <br/>\nUnited States in legal conflicts, cited one court case in which a <br/>\nprosecutor argued that children taught at home &quot;don&#39;t have the <br/>\nopportunity to meet up with the bully in the class and have to deal with <br/>\nthat. And we&#39;re like, is that a big advantage to be able to meet with a <br/>\nbully?&quot;<br/>\n<br/>\nThe author of &quot;Home Schooling: The Right Choice&quot; was in Tokyo last month <br/>\nto advise the recently launched Home School Support Association of Japan <br/>\n(Hosa), a nonprofit organization set up to champion the rights of <br/>\nhomeschooling families. The association is currently investigating <br/>\nexactly how many homeschoolers there are in Japan and working on ways to <br/>\nbring them together.<br/>\n<br/>\n&quot;When I began my work 15 years ago, it was only legal in five (U.S.) <br/>\nstates to teach children at home, and now it&#39;s legal in all 50 states,&quot; <br/>\nsaid Klicka, who has homeschooled his own seven children. &quot;The parents in <br/>\nAmerica went through much to win a very basic and fundamental right...and <br/>\nour hope is that Japan can avoid the mistakes that we had in America, <br/>\nthat this does not have to be a battle.&quot;<br/>\n<br/>\nIt will be if critics have their way. Aside from the knotty issue of <br/>\nsocialization, opponents of homeschooling question whether most parents <br/>\nare pedagogically and economically able to take over the job of schools.<br/>\n<br/>\nTsuyoshi Suzuki, assistant professor of education philosophy at Aichi <br/>\nUniversity of Education, agrees with homeschooling in principle. But he <br/>\nargues that as long as it is available only to a minority of families, it <br/>\ncannot be considered a realistic alternative to the school system.<br/>\n<br/>\n&quot;To a certain extent, it depends on parents having high incomes, having a <br/>\nhigh level of education themselves and being able to take responsibility <br/>\n(for their children&#39;s learning) right to the end. In Japan, many of the <br/>\npeople who are removing their kids from the school system are not <br/>\nespecially like that,&quot; he said.<br/>\n<br/>\nHome-education advocates point to a recent study of more than 20,000 U.S. <br/>\nstudents to make their case. According to &quot;The Scholastic and Demographic <br/>\nCharacteristics of Home School Students in 1998,&quot; on average, U.S. <br/>\nhomeschoolers outperform their public school counterparts by 30 to 37 <br/>\npercentile points on national standardized achievement tests across all <br/>\nsubjects. Parents&#39; educational background, teaching credentials and <br/>\nincome levels have no substantive impact on academic performance, the <br/>\nreport concludes. What is more, a high percentage of homeschoolers go on <br/>\nto prestigious universities or start their own businesses.<br/>\n<br/>\nSuch findings come as encouragement to Kubo, who, for all her conviction, <br/>\nsometimes feels she is stumbling in the dark.<br/>\n<br/>\n&quot;When I first started six years ago, there was hardly any information <br/>\nabout homeschooling in Japan,&quot; she said. &quot;I didn&#39;t know anyone who was <br/>\nactually doing homeschooling.&quot;<br/>\n<br/>\nShe added: &quot;I think I&#39;m doing the right thing, but sometimes I can&#39;t help <br/>\nwondering.&quot;<br/>\n<br/>\n<br/>\n[Copyright 2000 - The Yomiuri Shimbun]</div>","specialLinks":[]}],"prevTopicId":12810,"nextTopicId":12786}}