{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1512150,"authorName":"Peggy","from":"Peggy &lt;peggy@...&gt;","profile":"waptia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Reading, writing and video games?","postDate":"1022378877","msgId":7306,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNDRjA0MzdELkY4N0Q2MzVDQGxpbm1heC5zYW8uYXJpem9uYS5lZHU+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":7305,"nextInTime":7307,"topicId":7306,"numMessagesInTopic":0,"msgSnippet":"Interesting... Peggy Reading, writing and video games? From HBS Working Knowledge Special to CNET News.com May 19, 2002, 6:00 AM PT ","messageBody":"<div id=\"ygrps-yiv-591041334\">Interesting... <br/>\n<br/>\nPeggy<br/>\n<br/>\n<br/>\nReading, writing and video games?<br/>\nFrom HBS Working Knowledge <br/>\nSpecial to CNET News.com<br/>\nMay 19, 2002, 6:00 AM PT<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://news.com.com/2009-1023-917284.html\">http://news.com.com/2009-1023-917284.html</a> <br/>\n<br/>\nJohn Seely Brown has had an epiphany. <br/>\n<br/>\nIn the past year and a half, the knowledge expert and chief scientist of Xerox<br/>\nsaid he&#39;s gained a new respect--indeed an awe--for screen language. <br/>\n<br/>\nAnd what is screen language? It&#39;s simply the vernacular of digital culture,<br/>\nthe way technology is increasingly put in the service of human imagination in<br/>\nsophisticated ways. For the shorthand version, just think of any teenager&#39;s<br/>\nnatural affinity for instant messaging, video games, movies, open source, and<br/>\neBay. <br/>\n<br/>\nHow can that affinity be tapped, and how can those abilities be understood and<br/>\napplied to lifelong learning? <br/>\n<br/>\nAs Seely Brown told a group of about 20 educators who attended his talk at<br/>\nHarvard Business School on April 29, &quot;If you can&#39;t deal with screen language,<br/>\nyou are not literate!&quot; <br/>\n<br/>\nLacing his message with wit and a copiously illustrated slide presentation,<br/>\nSeely Brown offered his thoughts on the new wave of knowledge transfer to<br/>\neducators who came to HBS for a three-day program in adult and distance<br/>\nlearning. The program, held April 28 to April 30 and organized by the HBS<br/>\nDivision of Research, included sessions on designing interactive learning<br/>\nactivities and issues in adult learning. Seely Brown, who gave the kick-off<br/>\nspeech, is also the director of the Palo Alto Research Center (PARC) and the<br/>\nauthor (with Paul Duguid) of &quot;The Social Life of Information.&quot; <br/>\n<br/>\nAccording to Seely Brown, there is a new kind of digital divide now, and it is<br/>\nthe divide between faculty and students. Faculty, stuck in yesterday&#39;s analog<br/>\nworld, are confronted with students who arrive nicely fluent in digital<br/>\ntechnology and the virtues of hyperspeed. Students already have a handle on<br/>\nhow to convey their emotional states electronically. It&#39;s up to adults to<br/>\nlearn that vernacular, he said. Educators who create programs for adult<br/>\nlearning and distance learning need to apply the vernacular and deepen and<br/>\nstrengthen these new means of communication. <br/>\n<br/>\nA cold medium?  As an engineer, Seely Brown has continually battled the<br/>\nproblem of how to convey context through technology that only deals in<br/>\ncontent. The content side is easy. At PARC, for instance, one of the great<br/>\nideas that fell flat was to invite well-known individuals to address a PARC<br/>\nforum every Thursday afternoon. The speeches were to be Webcast throughout the<br/>\npremises so 300 PARC employees could follow them at their workstations. <br/>\n<br/>\n&quot;Efficiency is not the same as effectiveness,&quot; Seely Brown said to the HBS<br/>\nparticipants. It was disconcerting for speakers to arrive at the huge<br/>\nauditorium, he said, find only four or five people sitting there and be told,<br/>\n&quot;It&#39;s OK, you&#39;ve got X number of eyeballs on the Webcast. So you can feel good<br/>\nnow.&quot; <br/>\n<br/>\nNo one enjoys talking into thin air; a good speaker, like an actor, is always<br/>\nengaged in conversation with the audience during the performance. That sense<br/>\nof unleashing a dialogue between the speaker and the audience was lost with<br/>\nWebcasting, Seely Brown said. <br/>\n<br/>\nThe experience taught him how important both content and context are to<br/>\nlearning, and how desirable yet elusive it is to find a way to facilitate that<br/>\ninterplay. &quot;Technology is not good at context today,&quot; Seely Brown said. <br/>\n<br/>\nOne intriguing exception is offered by the Linux open-source movement. With<br/>\nLinux, programmers write code to be read by their peers all over the world. In<br/>\ncrafting the code, they build on each other&#39;s progress. The system is a form<br/>\nof &quot;cognitive apprenticeship,&quot; Seely Brown said, because a programmer who<br/>\nwants to be part of the Linux community adapts to the style and tastes of how<br/>\nLinux works. The aesthetic--the context--underlying this building process, not<br/>\njust the fact of code itself, is worth taking seriously, he said. <br/>\n<br/>\nReading the screen language Delving into screen language is another promising<br/>\nstart for sharing knowledge through both content and context. <br/>\n<br/>\nSeveral methods Seely Brown has witnessed in the past year have greatly<br/>\nimpressed him, although he admitted it was a hard sell for a long time. &quot;I<br/>\nmust have been a dinosaur. I thought hypertext was a joke. I hated video<br/>\ngames; I thought they were a complete waste of time.&quot; <br/>\n<br/>\nHe met three people who encouraged him to adjust his attitude: Stephanie<br/>\nBarish, of the Annenberg Center for Communication, at the University of<br/>\nSouthern California; Shigeru Miyagawa of MIT, a specialist in technology,<br/>\nlanguage and culture; and J.C. Herz, author of &quot;Joystick Nation: How<br/>\nVideogames Ate Our Quarters, Won Our Hearts, and Rewired Our Minds.&quot; They<br/>\nchallenged him to think about experiments in new media and about how media<br/>\nmight fundamentally alter how people communicate among themselves as well as<br/>\nwith students. <br/>\n<br/>\nOne project of Barish&#39;s, for example, coaxed undergraduates and graduate<br/>\nstudents to think about more than mastering some fun tools. Students had to<br/>\nwrite their term papers in a multimedia language. Print was not allowed. The<br/>\nproject included not just film students but also students of humanities such<br/>\nas history, philosophy, English, and women&#39;s studies. <br/>\n<br/>\nAt the start of a women&#39;s literature course, for instance, the students were<br/>\nasked to pick a feminist they admired, find four photographs that expressed<br/>\nthe power of that particular woman, and write a very simple paragraph under<br/>\neach photograph to explain why they chose the photo. Said Seely Brown, &quot;The<br/>\nbeauty of doing that is that in the visual world you have no room for caveats<br/>\nor commas or qualifiers or parentheses. In fact, Picasso does not traffic in<br/>\ncommas...It&#39;s so very clear what he wanted to say.&quot; <br/>\n<br/>\nOther classroom projects included making an &quot;interpretive film&quot; around a<br/>\nfavorite poem, and creating a composite image with Photoshop to reveal<br/>\nimportant aspects of the students&#39; autobiographies. The latter project was not<br/>\ncomplete until students went to the front of the class and explained to their<br/>\nclassmates what they were trying to express through the images. <br/>\n<br/>\nAt HBS, Seely Brown was quizzed by several participants on whether images have<br/>\na tendency to distort information. Art images can be deceptive, observed one<br/>\neducator. While it is good to approach media with an open mind, and while many<br/>\nstudents can indeed learn some &quot;nifty&quot; techniques that yield seemingly<br/>\nimpressive results, real--as opposed to surface--learning requires navigating<br/>\nmuch tougher terrain. <br/>\n<br/>\nAnother educator said she was troubled by the prospect of summing up a<br/>\nfeminist&#39;s complex life story in four photographs. Much can be captured in a<br/>\nphoto, but &quot;much is lost&quot; as well, she said. <br/>\n<br/>\nSeely Brown accepted their reservations to a degree. However, he said, none of<br/>\nthese projects constituted &quot;a final event&quot; in the learning process. Rather,<br/>\nthey provided a powerful entryway to engage hearts and minds. The real<br/>\nlearning of students in the Photoshop project he mentioned, for example, was<br/>\nnot the creation of composite photos but the remarkable experience of getting<br/>\nup in front of their classmates and discussing their autobiographies. <br/>\n<br/>\nThe Web is a medium that &quot;honors&quot; multiple forms of intelligence and has tools<br/>\nthat amplify and express content as well as contextual aspects of emotion,<br/>\npassion and feeling, he observed. &quot;I&#39;m not saying you can&#39;t do that with text.<br/>\nBut I&#39;m saying, &#39;Here is the vernacular. We aren&#39;t paying much attention to<br/>\nhow that vernacular could enable us to open up forms of communication,<br/>\nexpression and so on.&#39; That, I think, is going to become increasingly<br/>\nimportant.&quot; Improvements in technology will make such forms of communication<br/>\neasier and easier to do. <br/>\n<br/>\n&quot;I spent my life reading corporate memos that were written so they couldn&#39;t be<br/>\nmisread. And I&#39;ll tell you, every department reads them differently,&quot; Seely<br/>\nBrown said. Image texts and music texts are similarly open to interpretation,<br/>\nhe allowed. &quot;The real catch for me is not that this is an end in itself. I&#39;m<br/>\nnot arguing that we should never have text qua print text. I&#39;m suggesting that<br/>\nthis may be a powerful way in for kids in terms of appreciating more their<br/>\nvernacular, in order then to be able to open up experiences, get a more<br/>\nexpressive medium...and then build on that.&quot; <br/>\n<br/>\nCultivating a sense for different vernaculars and how we use them is something<br/>\nwe don&#39;t think much about, he added. <br/>\n<br/>\n <br/>\nClick here for Harvard Business School&#39;s information portal. <br/>\n<br/>\n© Copyright 2002 President and Fellows of Harvard College</div>","specialLinks":[]}],"prevTopicId":7301,"nextTopicId":7277}}