{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":2528863,"authorName":"Anna","from":"&quot;Anna&quot; &lt;ambdkf@...&gt;","profile":"ambdkf92","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"It finally clicked","postDate":"1034600742","msgId":46302,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFvZWZmNis0NHZjQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":46301,"nextInTime":46303,"topicId":46302,"numMessagesInTopic":0,"msgSnippet":"I am new to this board, having just heard about it at the SC Schools Out Support Conference.  On the way home I had an incredible moment of realization that I","messageBody":"<div id=\"ygrps-yiv-700505441\">I am new to this board, having just heard about it at the SC Schools <br/>\nOut Support Conference.  On the way home I had an incredible moment <br/>\nof realization that I wanted to share.<br/>\n<br/>\nAt the conference, two adult unschoolers where discussed.  The first <br/>\nwas a young man, who at 18, decided he wanted to attend college.  He <br/>\ntook the necessary steps, got into the college of his choice where <br/>\nhe was on the deans list through out, graduated and is currently <br/>\nfollowing his passion.   I have to say I liked this story.  It was <br/>\nwhat I wanted to hear.  Since reading my first John Holt book, two <br/>\nyears ago, I fell in love with unschooling.  My kids had been trying <br/>\nto show me this all along but it took reading the book for it to <br/>\nclick.  I knew it was for us, BUT I really wanted their educational <br/>\njourney to include college.  I felt it was important for our society <br/>\nand for growth and development.   Later at the conference, we were <br/>\ntold about a young woman who, at 19, traveled across the country, <br/>\nfound an apartment, a job and was taking some classes.  At <br/>\norientation for her new job she was mistaken for a 30 year old <br/>\nbecause of her poise and confidence.  I thought this was a nice <br/>\nstory too.  Later that day, my sister was talking about a family <br/>\nfriend.  He was publicly schooled, did what was expected, high <br/>\ngrades, etc.  He went on to college where he maintained a high GPA.  <br/>\nHe did this by dropping any class he wasn&#39;t going to succeed in, <br/>\ngiving no thought to the class, just the grade.  He now lives at <br/>\nhome with his mom, she thought that was best, works the same job he <br/>\nhas had since high school and has no plans to leave.  They <br/>\nconstantly fight and bicker, yet his fear of failure paralyzes him <br/>\nto experience life.  After mulling over all of this a bit, it <br/>\nfinally hit me!!! I don&#39;t want my children to go to college, I want <br/>\nmy children to live life and pursue their passions.  If that <br/>\nincludes a trip to college, fine, if not just as fine!  Now many of <br/>\nyou may be saying `duh&#39; about now:) but this was huge for me.  <br/>\n<br/>\nI know that some of the speakers and organizers of the conference <br/>\nfrequent this board.  I wanted them to know how they had touched <br/>\nme.   It was so wonderful to be surrounded by people that love and <br/>\nrespect kids and young adults.  It was refreshing and reaffirming.   <br/>\nI can&#39;t thank them enough for what they have given me and this was <br/>\njust one example.  I had many other such moments, too many to <br/>\ndescribe.  <br/>\n<br/>\nQuick background for me, I have two girls almost 3 and almost 5.  We <br/>\nhave been enjoying our unschooling journey since birth and look <br/>\nforward to many enjoyable years ahead. <br/>\n<br/>\nAnna <br/>\nAfton 5 in Jan<br/>\nRaelin 3 in Dec</div>","specialLinks":[]}],"prevTopicId":46159,"nextTopicId":46274}}