{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Tony & Donna","from":"&quot;Tony & Donna&quot; &lt;turnkeyim@...&gt;","replyTo":"LIST","senderId":"qJeXpM-5dUo7t5HAhdxJjRIBPSOEUc_Zn5Rt6sirSRQjkrD_LVkSHpV6QkezYotvv52hzzTR6f5Co6O5w1TkX3wXwNhXkfFxxccllV6g","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Free Loaded Athlon or PIII Computer System Plus Free Internet Access","postDate":"949555304","msgId":6122,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4zOTkuNjEyMi45NTkyNjk3NDZAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":6121,"nextInTime":6123,"topicId":6122,"numMessagesInTopic":0,"msgSnippet":"GET A LOADED PENTIUM III OR AMD ATHLON PC AND A 21 MONITOR FOR NO MONEY OUT OF YOUR OWN POCKET PLUS 100% FREE INTERNET ACCESS. Have you ever wondered how some","messageBody":"<div id=\"ygrps-yiv-2071798367\">GET A LOADED PENTIUM III OR AMD ATHLON PC AND A 21&quot; MONITOR FOR NO MONEY OUT <br/>\nOF YOUR OWN POCKET PLUS 100% FREE INTERNET ACCESS. <br/>\n<br/>\nHave you ever wondered how some companies are able to give away thousands of <br/>\n&quot;free&quot; computers? How can they possibly do this? The answer is simple: by selling <br/>\nadvertising. They are not really &quot;giving&quot; you anything. What they are doing is <br/>\nproviding you with a vehicle to view their paid ads. Generally, you receive a <br/>\ncheap, obsolete computer and a small monitor. They fill that small monitor with <br/>\nadvertising for which they are paid handsomely. They end up making many times <br/>\nthe cost of the computer for the ads YOU view. <br/>\n<br/>\nTURNKEY INTERNET MARKETING COMPANIES PAY YOU DIRECTLY FOR VIEWING THEIR ADS. <br/>\nBy contrast, rather than giving you a cheap computer and forcing you to view <br/>\nads, a new type of company called Turnkey Internet Marketing will pay you cash <br/>\nfor having their advertising banners on your screen when you want them there. <br/>\nThese companies are becoming very popular with advertisers because their ads <br/>\nare highly targeted. And they pay you very well for having them on your screen! <br/>\nTypically, users receive around 50 cents per hour for having a small ad banner <br/>\non their screen. Users can make more money by running banners from more than <br/>\none company simultaneously. By using a large monitor, you could easily run enough <br/>\nof these banners at once to pay for a loaded PC and 19&quot; or even 21&quot; monitor! <br/>\n$100 per month will be easy to generate from your own surf time alone in the <br/>\ncoming months. What you end up with at the end of the month is enough money to <br/>\npay for whatever computer you want, with money to spare! <br/>\n<br/>\nA COMPUTER OF YOUR CHOICE IS GREAT, BUT IT GETS MUCH BETTER!<br/>\n<br/>\nIn addition to paying you well for having their ad banners on your screen, Turnkey <br/>\nInternet Marketing companies will pay you exceptionally well for referring others. <br/>\nOne can literally earn thousands of dollars per month in this manner. Most Turnkey <br/>\nInternet Marketing companies pay from between three and six referral levels. <br/>\nYOUR OWN WEB PAGE WILL ALLOW YOU TO MAKE EVEN MORE MONEY.  Plus never pay for <br/>\nInternet access again. <br/>\n<br/>\nFor complete details please visit our web site at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://freeturnkey.resourcez.com\">http://freeturnkey.resourcez.com</a> <br/>\nPlease be patient, our web site has been experiencing heavy traffic.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nTurnkey Internet Marketing -- your key to financial success on the Internet. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://freeturnkey.resourcez.com\">http://freeturnkey.resourcez.com</a></div>","specialLinks":[]}],"prevTopicId":6072,"nextTopicId":6123}}