{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":58,"messages":[{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Help Please","postDate":"1295765608","msgId":59101,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGluNGpYNmhHV1I3bS1jeTZyUHpUdDlIdDk2OSsrQVpnS2lzZmpEc0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDM0NTguNDcwMTIucW1Ad2ViMTEwNDA4Lm1haWwuZ3ExLnlhaG9vLmNvbT4=","referencesHeader":"PEFBTkxrVGlrN2tXTWtxM2VVN0ZRYVI5czVwM0ptR2RFYngtT09QMlFhbWVaZUBtYWlsLmdtYWlsLmNvbT4JPDY4NTVEMTY4LTMwNDktNDQ5Ni05NEUyLTY4OUZEMkMwRUI1OUB2ZXJpem9uLm5ldD4JPEFBTkxrVGk9VmpURTFUTG52eFV4c1FjRXZuVS1hdnFRS3VhOGZrMUNSejM9cUBtYWlsLmdtYWlsLmNvbT4JPDE4ODQ4Ni44MDAxNC5xbUB3ZWIxMTA0MTIubWFpbC5ncTEueWFob28uY29tPgk8QUFOTGtUaT1ES0pjVFdpY2JkLXY1LTdHaWFMMDlqMDNqaTYxS1ZpOTNGKzU2QG1haWwuZ21haWwuY29tPgk8MzQ1OC40NzAxMi5xbUB3ZWIxMTA0MDgubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":59100,"nextInTopic":59102,"prevInTime":59100,"nextInTime":59102,"topicId":59071,"numMessagesInTopic":0,"msgSnippet":"***I don t spank her often at all though. When she comes up and pops my arm, that can t be a learned behavior because I don t ever smack her in that manner.***","messageBody":"<div id=\"ygrps-yiv-1359156797\">***I don&#39;t spank her often at all though. When she comes up and pops my arm,<br/>\nthat can&#39;t be a learned behavior because I don&#39;t ever smack her in that<br/>\nmanner.***<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;How do you know this?  If you are so sure that you know exactly how and<br/>\n </span></blockquote>what a<br/>\nchild learns from various things, then unschooling may not work well.<br/>\n Children<br/>\nlearn all kinds of things that parents aren&#39;t aware of, they pass on<br/>\nbehaviors<br/>\nthat they aren&#39;t aware they are passing on.  Unschooling takes awareness.&lt;&lt;&lt;<br/>\n<br/>\nYes. Parenting takes awareness and if the parenting gets more up to speed,<br/>\nthat will make room for the unschooling.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;***I don&#39;t spank her often at all though. When she comes up and pops my<br/>\n </span></blockquote>arm,<br/>\nthat can&#39;t be a learned behavior because I don&#39;t ever smack her in that<br/>\nmanner.***&lt;&lt;&lt;<br/>\n<br/>\nIf there is mutual equality and respect, and if hitting of a certain type is<br/>\nacceptable behavior, and if the only way to do hitting right is to warn the<br/>\nhittee by stating reasons and then applying the hit in the acceptable cool<br/>\ncalm manner, how about this?<br/>\n<br/>\nIf the child were to apply her smack in that manner, would that really be<br/>\nwhat you want?<br/>\n<br/>\nI&#39;m going to assume that you feel as I do and that it&#39;s not what you&#39;re<br/>\nafter from yourself or your child. I think that much is clear.<br/>\n<br/>\nFrom that point, I think the first thing to do is to tell your child that<br/>\nwhenever you have hit her, it has been wrong every time. That you didn&#39;t<br/>\nknow what to do and that you&#39;re not wanting to do that anymore. See what she<br/>\nsays or does in response.<br/>\n<br/>\nLook at your child. Be still. Sit there with the unknown long enough to get<br/>\nback into the flow of an open honest parent-child relationship of mutual<br/>\nrespect and equality. And then don&#39;t return to hitting ever again. Set that<br/>\noption off the table.<br/>\n<br/>\nI chose to do that, Arsh. I grew up being hit and yelled at. I didn&#39;t know<br/>\nany other way just like my parents didn&#39;t know. I put that idea of hitting<br/>\nmy child out of my head. Sometimes I lashed out without thinking and<br/>\nimmediately apologized, remembering that it was not an option! Relinquishing<br/>\nthe yelling took far longer because it was even more indelibly ingrained.<br/>\n<br/>\nI agree that getting more tools in the toolbox takes a while. Absolutely. It<br/>\nwill take time and learning the ideas.<br/>\n<br/>\nStart with mutual respect and that means no hitting the kid. If your child<br/>\nhits you or someone else, you can offer a delicious really nice puffy pillow<br/>\nto hit the couch with. And if that&#39;s not enough (it isn&#39;t for Karl who is 7<br/>\n1/2), offer something that&#39;s fine to wack on and a plastic play hammer or<br/>\nget some of those foam swords and spar together. Hitting is developmental<br/>\nand also a human desire sometimes. Let the children have that sensory<br/>\nexperience of jostling fun and whee!!! and the cathartic pleasure of banging<br/>\npots and pans as loudly as they like. Wear earplugs if you want or clap your<br/>\nhands over your ears and make a game out of that too!<br/>\n<br/>\nRight now you are in this mindset that your children are to be taught and<br/>\nmade outwardly peaceful in order for unschooling to take off.<br/>\n<br/>\nInstead, begin the way unschooling goes. Don&#39;t teach. Come go with and learn<br/>\nalong with your child. Your own child.<br/>\n<br/>\nDon&#39;t make the children responsible for each other. Each mother&#39;s child is<br/>\nher own to enjoy and to joy in. It will have ups and downs and lulls and<br/>\ndashes. You will have things in common and also solitary interests. And if<br/>\nyou do it right, you and your child can be friends that stopped the yelling<br/>\nand hitting, and lived well right on through.<br/>\n<br/>\n~Katherine<br/>\n<br/>\nParaphrasing a quote (somebody got the credit? and hope I don&#39;t botch it):<br/>\nYour past may not make you proud ... But hey, your future is spotless!<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Help Please","postDate":"1295764905","msgId":59099,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYwMDQ5OS41MzgzOC5xbUB3ZWIxMTA0MTEubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PEFBTkxrVGltNU9lVFhGckpWQkNLeWQ4eTNBQkNzWE5CYW9NemVKU1F3M0J3a0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrN2tXTWtxM2VVN0ZRYVI5czVwM0ptR2RFYngtT09QMlFhbWVaZUBtYWlsLmdtYWlsLmNvbT4gPEFBTkxrVGk9dG5Tcl9MRy1aNCtieHhmV1I4d1k3N2lueVZITUhoYW5QSmNfYUBtYWlsLmdtYWlsLmNvbT4gPEFBTkxrVGltNU9lVFhGckpWQkNLeWQ4eTNBQkNzWE5CYW9NemVKU1F3M0J3a0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":59098,"nextInTopic":59100,"prevInTime":59098,"nextInTime":59100,"topicId":59071,"numMessagesInTopic":0,"msgSnippet":"***ANd this is where I usually get the Just talk to them part.*** Little kids need less talk and more action.  Not punishment, but direct problem solving. ","messageBody":"<div id=\"ygrps-yiv-1470063422\">***ANd this is where I usually get the &quot;Just talk to them&quot; part.***<br/>\n<br/>\nLittle kids need less talk and more action.  Not punishment, but direct problem <br/>\nsolving.<br/>\n<br/>\n*** So what about<br/>\nwhen we&#39;ve tried months of non-spanking with just talking, explaining,<br/>\nrespectful conversations and rare alternate punishments like brief time-out<br/>\nor &quot;turn abouts&quot; like just now, as I was typing, my R kept trying to stop K<br/>\nfrom watching a movie by moving the screen each time he sat down just out of<br/>\nthinking it was amusing to frustrate him. As a fair punishment, we decided<br/>\nthat she then was the one that couldn&#39;t watch the movie. This teaches her to<br/>\nthink about how she makes others feel (since we explain that while enacting<br/>\nsaid punishment).***<br/>\n<br/>\nDirect problem solving in this scenario might be coming from the assumption that <br/>\nR wasn&#39;t moving the screen to frustrate K.  Did both kids WANT to watch a movie <br/>\nand did both of them want to watch THAT movie?  What else could be going on at <br/>\nthe same time as movie watching.  What kinds of things keep little hands busy <br/>\nand away from monitors?  What could YOU have done in that moment?  Could you <br/>\nhave sat down with her and snuggled her?  Could you have gotten bowls of popcorn <br/>\nor other movie related comforts?  Hands on parenting should be more of that and <br/>\nless of hands smacking bottoms.  It requires MORE attention, not time outs away <br/>\nfrom attention.  Punishing a little kid for doing little kid things seems <br/>\nterribly unfair if there are no adults there helping her find better things to <br/>\ndo with her little kid needs of touching and manipulating things.<br/>\n<br/>\n***We&#39;re just trying to teach our kids how to be nice to their friends and<br/>\nfamily, love each other and play together without hurting anyone, destroying<br/>\nthings that aren&#39;t theirs, or being exceptionally inconsiderate.<br/>\nI don&#39;t *think *that&#39;s expecting too much of any child. I don&#39;t *feel *it is<br/>\ntoo much either.***<br/>\n<br/>\nI don&#39;t think you can teach these things.  These things are learned behavior <br/>\nthrough kindness.  If you are, parent and child, on the same team, and one team <br/>\nmember is failing, then the whole team fails.  By helping kids learn how to be <br/>\nkind and gentle, you need to BE kind and gentle.  Kids feel things so deeply, <br/>\neven body language disapproval is felt keenly.  Personally, I think behavioral <br/>\nexpectations are inconsiderate of actual needs of children.<br/>\n<br/>\n***That is something I addressed with his parents when he stole food in the<br/>\nhouse. I think it&#39;s hard for them to determine his limits on food because<br/>\nthe child DOES have autism spectrum disorder and he has a tendency to GORGE<br/>\nhimself if given all the food he wants, even to the point of feeling sick<br/>\nor vomiting. They try to limit him SOME on food so he doesn&#39;t do that. It&#39;s<br/>\nnot like they limit him heavily however.***<br/>\n<br/>\nOkay, BUT, you&#39;ve described him as being autistic and the one very basic things <br/>\nbeing autism that I know of, is that autistic children are VERY sensitive, so <br/>\neven a teeny tiny amount of limits and control might feel pretty huge to him. <br/>\n That&#39;s the way it goes with some kids, even a little is felt as an enormous <br/>\nburden.  They feel it in words and actions, AND body language.<br/>\n<br/>\nIf a parent says even ONE single word about food that is negative or about <br/>\nlimiting or controlling because of... _______... that child might feel it <br/>\nexponentially.  I&#39;ve seen HUGE damage done to kids in that manner.  Parents who <br/>\nreally care and really want what&#39;s best for their kids will say things about <br/>\nfood in front of their kids, unhealthy and damaging things, and they aren&#39;t even <br/>\naware of the damage it&#39;s doing to that person right there in the room with them. <br/>\n The kids feel it, you can see it in their reactions.<br/>\n<br/>\n***The only time K gets told not to<br/>\ncry is when he &quot;yucks it up&#39; to get attention after a punishment. He will<br/>\ntry to act like something is worse than it is so someone will pity him.***<br/>\n<br/>\nThat&#39;s because the ONE person who shouldn&#39;t hurt him has hurt him.  He is <br/>\nplaying a victim because he IS one.  He&#39;ll continue to do that until he doesn&#39;t <br/>\nfeel victimized by the people who love and care for him.<br/>\n<br/>\nI have a child who cries a LOT.  She&#39;s 9 and she still cries a LOT.  Sometimes <br/>\nit&#39;s tiring and causes me to feel impatient, but if I can&#39;t suck up my own <br/>\nfeelings about it, how can I ever expect her to?  I&#39;m a grown up, she is a <br/>\nchild.  I am the one who turns around and counts in breaths of air and turns <br/>\nback around with love.  Only then can I find out what the heck is bothering her <br/>\nand sometimes it&#39;s something super simple that she was unable to articulate and <br/>\nsometimes it something huge that happened days or weeks ago that she&#39;s still <br/>\nprocessing and it comes to the surface.  I can&#39;t even imagine telling her to <br/>\nstop crying over something so huge that&#39;s clearly caused her pain.  There have <br/>\nbeen times that I&#39;ve asked her to breathe so that I can understand, or to take <br/>\ndown the volume a bit so that it doesn&#39;t hurt me.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":194427255,"authorName":"Julie","from":"&quot;Julie&quot; &lt;jmarkoski@...&gt;","profile":"jmarkoski","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Help Please","postDate":"1295762704","msgId":59100,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGloZ2dlZytzcGo4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGk9X0grdnU0MnZWaWdvblM5ekh3WVA2dV9xQ29EUDlaVEg5LWt4UEBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":59099,"nextInTopic":59101,"prevInTime":59099,"nextInTime":59101,"topicId":59071,"numMessagesInTopic":0,"msgSnippet":"I m mostly a lurker but I really can t understand your line of reasoning. You insist you are open to change and claim that how you are doing things IS NOT","messageBody":"<div id=\"ygrps-yiv-1305828503\">I&#39;m mostly a lurker but I really can&#39;t understand your line of reasoning. You insist you are open to change and claim that how you are doing things IS NOT WORKING. But the you have this view of how things MUST be. You are very attached to the idea of mutual respect and are insisting on it, and demanding it and the 3 and 6 year olds are showing you at every turn that this hope/ideal/expectation of yours is not within their abilities.  <br/>\n<br/>\nIt&#39;s like you&#39;re asking &quot;how can I make them respect me&quot; but you&#39;re not respecting the developmental limitation they have that makes it IMPOSSIBLE for them to even understand your viewpoint. They can&#39;t take your needs into account until they develop the capacity for empathy and the ability to see a situation from another&#39;s point of view. How will they develop empathy? From being empathized with consistently over time. How else would they learn it?<br/>\n<br/>\nYou are not going to get mutual respect from a 3 year old. Your daughter is your equal in importance, but not in power. That&#39;s why you can hit her when you are unhappy with her but she is probably not allowed to hit you ever, even as a  &quot;last resort&quot; when she runs through her small repertoire of means to express her frustrations.<br/>\n<br/>\nI find myself frustrated with my 3 year olds behavior a lot. I find myself sometimes blaming him for being contrary or moody. But when I take the effort to really examine what&#39;s causing the most recent issue, it comes back to a few reliable things every time...i&#39;m the one being contrary or impatient and I have unrealistic expectations.  When I pay attention, I often come to the realization that I am expecting him to handle the situation better than I am with my advanced capabilities. He&#39;s screaming from frustration and I&#39;m screaming at him in frustration. The difference?  He is out of tools and is doing the best he can. I have no such excuse. I have a whole toolbox of metods to handle all sorts of things, borne out of 39 years of experience on earth. I can take a deep breath, dig in the toolbox and find something else...empathy, distraction, an apology, a humorous mea culls that turns the situation from tears to laughter. I can provide a change of scenery, a hug or my lap. I can get down to his level rather than towering threateningly over him (I think it&#39;s important symbolism that he can&#39;t rise up to my level in height or maturity).<br/>\n<br/>\nI think your root issue is this idea of equals and mutual respect. It will be hard to make changes without turning this idea inside out. Meet reality where it is. A thought that &quot;this is the way things need to be in this house&quot; when it&#39;s NOT that way is unproductive at best a destructive at worst. You are very insistent to this line of thought and should examine why you are, in the face of a very different reality.<br/>\n<br/>\nIf you really want to be open to advice, I&#39;d suggest two things: be willing to question your core ideas (no sacred cows); and, ask more specific questions rather than esoteric ones. Give a scenario, painting as complete of a picture as you can. Say how you reacted and tell the outcome. Ask for how to handle it better next time. And don&#39;t tell people what type of advice you&#39;re willing to hear.<br/>\n<br/>\nJulie M<br/>\nJames, 5<br/>\nTyler, 3<br/>\nAudrey,  18 months<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Arsh &lt;arsieiuni@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; That&#39;s not at all how we look at it though.<br/>\n&gt; We make decisions together.<br/>\n&gt; Our child is just as important a part of the family as any other member.<br/>\n&gt; <br/>\n&gt; Why do I keep running into people though who think that if I don&#39;t make her<br/>\n&gt; the queen instead of an equal that I obviously make her lesser instead.<br/>\n&gt; I see this all over the place.<br/>\n&gt; <br/>\n&gt; We believe in EQUAL and MUTUAL respect. I believe that meas we respect her<br/>\n&gt; needs and feelings and she should respect our needs and feelings too. I know<br/>\n&gt; that can&#39;t be forced and we don&#39;t try to demand respect, but it&#39;s something<br/>\n&gt; we hope to incite via giving her a family and home she will naturally<br/>\n&gt; respect.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Arsh<br/>\n&gt; <br/>\n&gt; On Sat, Jan 22, 2011 at 10:29 PM, Jenny Cyphers &lt;jenstarc4@...&gt; wrote:<br/>\n&gt; <br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; ***I believe in MUTUAL respect.***<br/>\n&gt; &gt;<br/>\n&gt; &gt; Here&#39;s the thing with mutual respect in regards to the parent child<br/>\n&gt; &gt; relationship: It&#39;s something that is learned by being modeled. If a child<br/>\n&gt; &gt; grows up in a home where they are respected, as being younger, less able,<br/>\n&gt; &gt; but<br/>\n&gt; &gt; equally as important, they WILL grow up to be respectful people. Often what<br/>\n&gt; &gt; a<br/>\n&gt; &gt; parent means when they say mutual respect, is that the parents should be<br/>\n&gt; &gt; able to<br/>\n&gt; &gt; get exactly what they want and the kids should respect that because that&#39;s<br/>\n&gt; &gt; how<br/>\n&gt; &gt; it is, and then the parents can then go about helping the kids get some of<br/>\n&gt; &gt; their<br/>\n&gt; &gt; needs met. When in actuality, it really should be exactly the opposite of<br/>\n&gt; &gt; that.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; [Non-text portions of this message have been removed]<br/>\n&gt; &gt;<br/>\n&gt; &gt;  <br/>\n&gt; &gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Help Please","postDate":"1295762688","msgId":59098,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM0NTguNDcwMTIucW1Ad2ViMTEwNDA4Lm1haWwuZ3ExLnlhaG9vLmNvbT4=","inReplyToHeader":"PEFBTkxrVGk9REtKY1RXaWNiZC12NS03R2lhTDA5ajAzamk2MUtWaTkzRis1NkBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrN2tXTWtxM2VVN0ZRYVI5czVwM0ptR2RFYngtT09QMlFhbWVaZUBtYWlsLmdtYWlsLmNvbT4gPDY4NTVEMTY4LTMwNDktNDQ5Ni05NEUyLTY4OUZEMkMwRUI1OUB2ZXJpem9uLm5ldD4gPEFBTkxrVGk9VmpURTFUTG52eFV4c1FjRXZuVS1hdnFRS3VhOGZrMUNSejM9cUBtYWlsLmdtYWlsLmNvbT4gPDE4ODQ4Ni44MDAxNC5xbUB3ZWIxMTA0MTIubWFpbC5ncTEueWFob28uY29tPiA8QUFOTGtUaT1ES0pjVFdpY2JkLXY1LTdHaWFMMDlqMDNqaTYxS1ZpOTNGKzU2QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":59097,"nextInTopic":59099,"prevInTime":59097,"nextInTime":59099,"topicId":59071,"numMessagesInTopic":0,"msgSnippet":"***I don t spank her often at all though. When she comes up and pops my arm, that can t be a learned behavior because I don t ever smack her in that manner.***","messageBody":"<div id=\"ygrps-yiv-27830115\">***I don&#39;t spank her often at all though. When she comes up and pops my arm,<br/>\nthat can&#39;t be a learned behavior because I don&#39;t ever smack her in that<br/>\nmanner.***<br/>\n<br/>\nHow do you know this?  If you are so sure that you know exactly how and what a <br/>\nchild learns from various things, then unschooling may not work well.  Children <br/>\nlearn all kinds of things that parents aren&#39;t aware of, they pass on behaviors <br/>\nthat they aren&#39;t aware they are passing on.  Unschooling takes awareness.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Help Please","postDate":"1295762540","msgId":59097,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDRDg4REEzQjBEREUwOC0xQTg4LUY2RURAd2VibWFpbC1tMDEyLnN5c29wcy5hb2wuY29tPg==","inReplyToHeader":"PEFBTkxrVGltNU9lVFhGckpWQkNLeWQ4eTNBQkNzWE5CYW9NemVKU1F3M0J3a0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrN2tXTWtxM2VVN0ZRYVI5czVwM0ptR2RFYngtT09QMlFhbWVaZUBtYWlsLmdtYWlsLmNvbT48QUFOTGtUaT10blNyX0xHLVo0K2J4eGZXUjh3WTc3aW55VkhNSGhhblBKY19hQG1haWwuZ21haWwuY29tPiA8QUFOTGtUaW01T2VUWEZySlZCQ0t5ZDh5M0FCQ3NYTkJhb016ZUpTUXczQndrQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":59096,"nextInTopic":59098,"prevInTime":59096,"nextInTime":59098,"topicId":59071,"numMessagesInTopic":0,"msgSnippet":"... From: Arsh  ... to them, trying to understand their reasoning, their side, etc, and seeing no change in a behavior that is HARMFUL or","messageBody":"<div id=\"ygrps-yiv-1551377557\">-----Original Message-----<br/>\nFrom: Arsh &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:arsieiuni@...\">arsieiuni@...</a>&gt;<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;No. Absolutely not. We spank because it&#39;s a last resort after trying to talk<br/>\n </span></blockquote>to them, trying to understand their reasoning, their side, etc, and seeing<br/>\nno change in a behavior that is HARMFUL or DESTRUCTIVE.&lt;&lt;&lt;<br/>\n-=-=-=-=-<br/>\nDo you see that spanking IS harmful and destructive?<br/>\n-=-=-=-=-<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;This isn&#39;t just about getting the behavior we want, but about protecting our<br/>\n </span></blockquote>children from harm and from destroying our valuables.&lt;&lt;&lt;<br/>\n<br/>\n-=-=-=-=-=-<br/>\nWhat&#39;s more valuable than your children? Serioulsy?<br/>\n<br/>\n-=-=-=-=-<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;No. It&#39;s really not convenient. None of us enjoy stopping the fun we&#39;re<br/>\n </span></blockquote>having and having to spank a child because they are disrupting the rest of<br/>\nthe group&#39;s fun and peace. It&#39;s not convenient.&lt;&lt;&lt;<br/>\n-=-=-=-=-=-<br/>\nCan you see how it would be more convenient to stop the behavior *before* it gets to that point?<br/>\n-=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;With my daughter, R, it does seem to work in CERTAIN circumstances. When she<br/>\n </span></blockquote>has gotten into a REALLY bad mood and has REALLY gotten into a rough<br/>\nattitude, a spanking and then a nap will almost ALWAYS act as a sort of<br/>\n&quot;reset button&quot;.&lt;&lt;&lt;&lt;<br/>\n-=-=-=-=-=-<br/>\nThe thing is, you catch it BEFORE it gets to the &quot;really bad mood&quot; or &quot;really rough attitude.&quot; If you see her getting cranky, feed her, help her sleep, rub her back---find what works, what she NEEDS.<br/>\nMy guess is that she really just needed the nap, not the spanking.<br/>\n-=-=-=-=-=-=- <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;We never do this angry. We do it as gently as we can and<br/>\n </span></blockquote>explain to her why it&#39;s happening.&lt;&lt;&lt;&lt;<br/>\n-=-=-=-=-=-<br/>\nHow does one hit someone gently?<br/>\nAnd WHY would anyone NOT do it in anger? I mean: I get lashing out when you have no more tools in your toolbox. But hitting when cool, calm, and collected is revolting.<br/>\nThe key is to collect more tools.<br/>\n-=-=-=-=-<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;But I don&#39;t like it and I&#39;m not stuck on it. If there is a better way, I<br/>\n </span></blockquote>will always try for a better way.  I&#39;m NOT attached to spanking without<br/>\nreason. I am just looking for the best way for our family.&lt;&lt;&lt;<br/>\n-=-=-=-=-=-<br/>\nFrankly, this is how you should have started out. &quot;Help me NOT spank.&quot; You chose to tell us to not lecture you about it and that you were fine with your choice  to spank. <br/>\nTotally changes how folks here will react.<br/>\n-=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;It&#39;s like it goes from A) You are currently spanking and you should stop. to<br/>\n </span></blockquote>C) Congrats you stopped! Without a B) This is how you handle things INSTEAD<br/>\nof spanking.&lt;&lt;&lt;&lt;&lt;<br/>\n-=-=-=-=-=-<br/>\nWe&#39;re ALL about &quot;this is how you handle things instead of spanking.&quot; But they are situational. There&#39;s no blanket solution---other than find the *cause*, be proactive, don&#39;t let it escalate.<br/>\n-=-=-=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;ANd this is where I usually get the &quot;Just talk to them&quot; part. So what about<br/>\n </span></blockquote>when we&#39;ve tried months of non-spanking with just talking, explaining,<br/>\nrespectful conversations and rare alternate punishments like brief time-out<br/>\nor &quot;turn abouts&quot; like just now, as I was typing, my R kept trying to stop K<br/>\nfrom watching a movie by moving the screen each time he sat down just out of<br/>\nthinking it was amusing to frustrate him.&lt;&lt;&lt;&lt;<br/>\n-=-=-=-=-=-<br/>\nQUIT TYPING! Sit down with them. Find out what he&#39;s really getting out of it. Make some snacks. Someone go home.<br/>\n-=-=-=-=-=-=-<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;As a fair punishment, we decided<br/>\n </span></blockquote>that she then was the one that couldn&#39;t watch the movie. This teaches her to<br/>\nthink about how she makes others feel (since we explain that while enacting<br/>\nsaid punishment).&lt;&lt;&lt;&lt;<br/>\n-=-=-=-=-=-<br/>\nNo. That might be what you *think* you&#39;re teaching, but what she&#39;s LEARNING is that she should be sneaky and/or lie to you and/or punish others when they do things that don&#39;t suit her.<br/>\n-=-=-=-=-=-=-<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;Sometimes that kind of alternative works. Other times, it DOESN&#39;t. And<br/>\n </span></blockquote>that&#39;s where I get stuck and that&#39;s where K&#39;s mom gets stuck.&lt;&lt;&lt;&lt;<br/>\n-=-=-=-=-<br/>\nBecause it DIDN&#39;T work. It was just a punishment she couldnt get out of---and it was better than getting hit.<br/>\n-=-=-=-=-=-<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;So what then?<br/>\n </span></blockquote>What do you do when talking doesn&#39;t work and spanking doesn&#39;t work and<br/>\nalternative punishments don&#39;t work?&lt;&lt;&lt;&lt;&lt;<br/>\n-=-=-=-=-<br/>\nYou&#39;re talking too much. Quit with the words explaining WHY she should act as you think she should. Start looking at her and reading between the lines. Be proactive: see the signs. Signs that she&#39;s<br/>\ngetting hungry, tired, smothered.<br/>\n-=-=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;We&#39;re just trying to teach our kids how to be nice to their friends and<br/>\n </span></blockquote>family, love each other and play together without hurting anyone, destroying<br/>\nthings tat aren&#39;t theirs, or being exceptionally inconsiderate.&lt;&lt;&lt;&lt;<br/>\n-=-=-=-=-=-=-<br/>\nThat&#39;s what you&#39;re trying to teach. That&#39;s NOT what she&#39;s learning.<br/>\nWhat she&#39;s learning is that she can&#39;t trust you . That you have all the power. That she is worthy of hitting.<br/>\n-=-=-=-=-=-<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;I don&#39;t *think *that&#39;s expecting too much of any child. I don&#39;t *feel *it is<br/>\n </span></blockquote>too much either.&lt;&lt;&lt;<br/>\n-=-=-=-=-=-<br/>\nYou&#39;re wrong. <br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;We&#39;ve spent the better part of a week talking about this and reading<br/>\n </span></blockquote>articles about it together, discussion what we&#39;ve learned and trying to find<br/>\nalternatives. We all generally agree with it. I just don&#39;t know how to<br/>\ntransition from spanking on what we feel is &quot;need&quot; to not spanking without<br/>\nleaving our kids to behave in ways that are really not safe or sane.&lt;&lt;&lt;<br/>\n-=-=-=-=-=-=-<br/>\nDon&#39;t leave your kids. Ever. Be by their sides every moment. Help them navigate. Quit kaffee klatsching and BE with them.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;We have tried offering more and more attention and group fun, but the bad<br/>\n </span></blockquote>behavior goes on without obvious reason.&lt;&lt;&lt;<br/>\n-=-=-=-=-<br/>\nLook for the less obvious: sleepy eyes, hungry tummy, exhausted temper. <br/>\n-=-=-=-=-=&gt;&gt;&gt;Though I do notice it doesn&#39;t tend<br/>\nto happen when we are all very focused on fun activities. Of course, the<br/>\nkids have to give us some time to do things too like cooking or picking up<br/>\nand it&#39;s often during these times when we need them to play and not<br/>\nmisbehave that we see the worst behaviors. :(&lt;&lt;&lt;&lt;<br/>\n-=-=-=-=-=-=-<br/>\nTake the damned HINT! It&#39;s OBVIOUS to me!<br/>\n<br/>\n-=-=-=-=-=-=-<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;This was more carelessness than aggression I think. He twisted a koosh toy<br/>\n </span></blockquote>until it was nearly broken in half. That&#39;s a good example.<br/>\nOr absentmindedly banging something on the carpet and not realizing he&#39;s<br/>\nbreaking it.<br/>\nIt&#39;s just a lack of attention and care given for something that belongs to<br/>\nsomeone else.&lt;&lt;&lt;&lt;<br/>\n-=-=-=-<br/>\nIt&#39;s a lack of attention on your part. Pay more attention. Use your hand as the bang-ee. Help him learn how hard he can hit. Find sturdier things he can bang with/on.<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;We do NOT make them feel bad for crying. The only time K gets told not to<br/>\n </span></blockquote>cry is when he &quot;yucks it up&#39; to get attention after a punishment. He will<br/>\ntry to act like something is worse than it is so someone will pity him. Then<br/>\nhe&#39;s told not to do that because it&#39;s deception, not because it bothers us<br/>\nor annoys us or anything.&lt;&lt;&lt;&lt;<br/>\n-=-=-=-=-<br/>\nIt&#39;s not deception; it&#39;s COMMUNICATION. LISTEN!<br/>\n<br/>\n<br/>\n<br/>\n ~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\n&quot;There is no single effort more radical in its potential for saving the world than a transformation of the way we raise our children.&quot; Marianne Williamson<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Help Please","postDate":"1295762438","msgId":59096,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYxMDIzNi4yMDk1OC5xbUB3ZWIxMTA0MTAubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PEFBTkxrVGlreHFHWGhtYmstV1FKNnR1UWU4cU9YMlJoM2cyckJUb1RMWm9rMEBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrN2tXTWtxM2VVN0ZRYVI5czVwM0ptR2RFYngtT09QMlFhbWVaZUBtYWlsLmdtYWlsLmNvbT4gPDEyNzgyNC45OTYyNi5xbUB3ZWIxMTA0MTMubWFpbC5ncTEueWFob28uY29tPiA8QUFOTGtUaT1URz1RTDFteXBvdDVNMS16UmgyajUrTTdwYTIyTVBhMGdjNW10QG1haWwuZ21haWwuY29tPiA8QUFOTGtUaWt4cUdYaG1iay1XUUo2dHVRZThxT1gyUmgzZzJyQlRvVExab2swQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":59095,"nextInTopic":59097,"prevInTime":59095,"nextInTime":59097,"topicId":59071,"numMessagesInTopic":0,"msgSnippet":"***How can we stop spanking?*** The easiest answer is: STOP SPANKING!  Simply don t do it. I think you are trying to ask, but not doing so.. What should I do","messageBody":"<div id=\"ygrps-yiv-1568525946\">***How can we stop spanking?***<br/>\n<br/>\nThe easiest answer is: STOP SPANKING!  Simply don&#39;t do it.<br/>\n<br/>\nI think you are trying to ask, but not doing so.. &quot;What should I do instead of <br/>\nspanking when I don&#39;t like something my child is doing?&quot;<br/>\n<br/>\nSeveral people have answered that.  You need to first be committed to not <br/>\nspanking, then be aware of child development and what is appropriate <br/>\nexpectations of various ages, then look at the individual child and see what <br/>\nTHAT child is capable of.  Clearly the older child is not at all capable of NOT <br/>\nyelling and being loud, so don&#39;t set him up to fail in an environment that he <br/>\nwill fail in.  Don&#39;t have him indoors when a baby is sleeping.  Apply that idea <br/>\nto everything.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Help Please","postDate":"1295762135","msgId":59095,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYyOTgzNi42MjM3Ny5xbUB3ZWIxMTA0MTMubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PEFBTkxrVGk9VEc9UUwxbXlwb3Q1TTEtelJoMmo1K003cGEyMk1QYTBnYzVtdEBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrN2tXTWtxM2VVN0ZRYVI5czVwM0ptR2RFYngtT09QMlFhbWVaZUBtYWlsLmdtYWlsLmNvbT4gPDEyNzgyNC45OTYyNi5xbUB3ZWIxMTA0MTMubWFpbC5ncTEueWFob28uY29tPiA8QUFOTGtUaT1URz1RTDFteXBvdDVNMS16UmgyajUrTTdwYTIyTVBhMGdjNW10QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":59094,"nextInTopic":59096,"prevInTime":59094,"nextInTime":59096,"topicId":59071,"numMessagesInTopic":0,"msgSnippet":"***You stop reading midway through to berate me, but you re wondering if I M stopping to listen? ...*** I didn t stop reading to berate you.  I stopped reading","messageBody":"<div id=\"ygrps-yiv-577599520\">***You stop reading midway through to berate me, but you&#39;re wondering if I&#39;M<br/>\nstopping to listen? ...***<br/>\n<br/>\nI didn&#39;t stop reading to berate you.  I stopped reading because I realized that <br/>\nuntil the spanking issue goes away there is little that anyone on this list can <br/>\ndo to help.  I tried not to lecture.  I stated facts very simply.  It wasn&#39;t <br/>\nmeant in the way you took it.  I&#39;m sorry.<br/>\n<br/>\nThe vegetarian analysis comes up now and again, so I&#39;ll go... If I am a <br/>\nvegetarian and I keep trying to make this soup taste like it&#39;s supposed to taste <br/>\nand others ask what I&#39;m putting in it and I run down the list and half way <br/>\nthrough I&#39;ve mentioned that I use chicken stock, then of course people are going <br/>\nto say something like... &quot;okay right there, I don&#39;t even need to read down any <br/>\nfarther, your soup doesn&#39;t taste right because you are using chicken stock and <br/>\nexpecting it to taste vegetarian.&quot;<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279647515,"authorName":"d.lewis","from":"&quot;d.lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Help Please","postDate":"1295759972","msgId":59093,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI3NDQyRjEyODU3NDQzMDY4Q0ZGOEMyNkUwMjQ2MTk1QGRlYm9yYWg3NmE3OWh2Pg==","referencesHeader":"PEFBTkxrVGlrN2tXTWtxM2VVN0ZRYVI5czVwM0ptR2RFYngtT09QMlFhbWVaZUBtYWlsLmdtYWlsLmNvbT48QUFOTGtUaT10blNyX0xHLVo0K2J4eGZXUjh3WTc3aW55VkhNSGhhblBKY19hQG1haWwuZ21haWwuY29tPiA8QUFOTGtUaW01T2VUWEZySlZCQ0t5ZDh5M0FCQ3NYTkJhb016ZUpTUXczQndrQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":59091,"nextInTopic":59094,"prevInTime":59092,"nextInTime":59094,"topicId":59071,"numMessagesInTopic":0,"msgSnippet":"***We spank because it s a last resort after trying to talk to them, trying to understand their reasoning, their side, etc, and seeing no change in a behavior","messageBody":"<div id=\"ygrps-yiv-969923042\">***We spank because it&#39;s a last resort after trying to talk<br/>\nto them, trying to understand their reasoning, their side, etc, and seeing<br/>\nno change in a behavior that is HARMFUL or DESTRUCTIVE.***<br/>\n<br/>\nDo you believe that hitting is helpful and constructive?   When K hits, is <br/>\nhe being helpful and constructive?<br/>\nI&#39;m not being snarky.  I&#39;m hoping that you can see the words you chose as <br/>\njustification for hitting a child and see that what you wrote, and probably <br/>\nwhat you&#39;re thinking when you&#39;re hitting, isn&#39;t rational.<br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":279647515,"authorName":"d.lewis","from":"&quot;d.lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Help Please","postDate":"1295759550","msgId":59094,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJFN0IwQUUzOUVCRTRGN0U4NTcwOENDNjJDOTgxNDdBQGRlYm9yYWg3NmE3OWh2Pg==","referencesHeader":"PEFBTkxrVGlrN2tXTWtxM2VVN0ZRYVI5czVwM0ptR2RFYngtT09QMlFhbWVaZUBtYWlsLmdtYWlsLmNvbT48QjA2MjY1NzYtRkM4My00QzY3LThBRjgtM0UyNDM0Q0Y4MTE0QFNhbmRyYWRvZGQuY29tPiA8QUFOTGtUaWtzMXNZdzVBdVlWUUFYY1h3akhocFltT2h1MkR2azZ2aj1uSHNPQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":59093,"nextInTopic":59095,"prevInTime":59093,"nextInTime":59095,"topicId":59071,"numMessagesInTopic":0,"msgSnippet":"***I was trying to say We currently spank but we aren t set on it.*** What you wrote was, we all believe in SOME spanking and responsive punishments  ","messageBody":"<div id=\"ygrps-yiv-1659869379\">***I was trying to say &quot;We currently spank but we aren&#39;t set on it.***<br/>\n<br/>\nWhat you wrote was, &quot;we all believe in SOME spanking and responsive <br/>\npunishments&quot;  &lt;snip&gt;  &quot;We have tried complete non-spanking and it does not <br/>\nwork for us.&quot;    And whether you meant that, I don&#39;t know,  but what it says <br/>\nis that you went from not spanking to spanking.  That is not the same as <br/>\n&quot;currently spank but aren&#39;t set on it.&quot;<br/>\n<br/>\nYou&#39;re probably feeling defensive.  That can make a person write things that <br/>\naren&#39;t very clear.  Calm down some and try to write just what you mean, not <br/>\nwhat you think the people here ought to hear.   It will help the those who <br/>\nrespond to you get a better picture of the situation.<br/>\n<br/>\nDeb Lewis</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Help Please","postDate":"1295758724","msgId":59091,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUxMEUzQjVELTNFMTQtNDZDNi05QjJGLTUxRkFFMzA4OTA3OUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEFBTkxrVGluMVJHKzlqZCtqMm1uK0s5YktHZUQ0TzB0MDgyaHBKNWZmQ0RFT0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrN2tXTWtxM2VVN0ZRYVI5czVwM0ptR2RFYngtT09QMlFhbWVaZUBtYWlsLmdtYWlsLmNvbT4gPDY4NTVEMTY4LTMwNDktNDQ5Ni05NEUyLTY4OUZEMkMwRUI1OUB2ZXJpem9uLm5ldD4gPEFBTkxrVGk9VmpURTFUTG52eFV4c1FjRXZuVS1hdnFRS3VhOGZrMUNSejM9cUBtYWlsLmdtYWlsLmNvbT4gPEFBTkxrVGluMVJHKzlqZCtqMm1uK0s5YktHZUQ0TzB0MDgyaHBKNWZmQ0RFT0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":59090,"nextInTopic":59093,"prevInTime":59090,"nextInTime":59092,"topicId":59071,"numMessagesInTopic":0,"msgSnippet":"-=-Slow down. Read some of the links posted. When you post, avoid telling people what ideas are acceptable or unacceptable. If you don t want some of the words","messageBody":"<div id=\"ygrps-yiv-177895648\">-=-Slow down. Read some of the links posted. When you post, avoid telling<br/>\npeople what ideas are acceptable or unacceptable. If you don&#39;t want some of<br/>\nthe words you&#39;re getting, then go onto what you are willing to discuss more<br/>\nabout rather than posting guidelines to what is acceptable to write to you.-=-<br/>\n<br/>\nKatherine wrote that, and I agree. <br/>\n<br/>\nAnd speaking of guidelines for posting, the list has some.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysLearning/\">http://groups.yahoo.com/group/AlwaysLearning/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/lists/alwayslearningNEW\">http://sandradodd.com/lists/alwayslearningNEW</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/lists/alwayslearningPOSTS\">http://sandradodd.com/lists/alwayslearningPOSTS</a><br/>\n<br/>\nI let all of Arsh&#39;s posts through, even though they generally ignore the guidelines, but now, really, it&#39;s time to read, try, wait and watch.<br/>\nIt&#39;s time to realize that the spanking section of my site is more than one page long.<br/>\n<br/>\nArsh, you&#39;re welcome to read on the list, but not to post for a while.  If you&#39;re truly willing to learn, work through what was written today, slowly and thoughtfully.  Consciously.  It will take a week just to read it at a pace that will begin to help, because for each point any of the posters made, you need to try, wait and watch.<br/>\n<br/>\nA week isn&#39;t nearly enough time to see a change, or to learn to make the kinds of choices that will help.  <br/>\nThere&#39;s a sound file at the bottom of this page that might help you with finding ways to make choices that move you from where you are today to where you would like to be:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/parentingpeacefully\">http://sandradodd.com/parentingpeacefully</a><br/>\n<br/>\nIt&#39;s free. You can download it and put it in the car or iPod or whatever.  It will sound different the second time you hear it.  It will sound different again after three months, and after a year.<br/>\n<br/>\nEverything on my site and Joyce&#39;s will look different when you read it after unschooling has begun to work for your family, in your home.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":414494505,"authorName":"Arsh","from":"Arsh &lt;arsieiuni@...&gt;","profile":"arsieiuni","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Help Please","postDate":"1295757739","msgId":59089,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGk9REtKY1RXaWNiZC12NS03R2lhTDA5ajAzamk2MUtWaTkzRis1NkBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDE4ODQ4Ni44MDAxNC5xbUB3ZWIxMTA0MTIubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PEFBTkxrVGlrN2tXTWtxM2VVN0ZRYVI5czVwM0ptR2RFYngtT09QMlFhbWVaZUBtYWlsLmdtYWlsLmNvbT4JPDY4NTVEMTY4LTMwNDktNDQ5Ni05NEUyLTY4OUZEMkMwRUI1OUB2ZXJpem9uLm5ldD4JPEFBTkxrVGk9VmpURTFUTG52eFV4c1FjRXZuVS1hdnFRS3VhOGZrMUNSejM9cUBtYWlsLmdtYWlsLmNvbT4JPDE4ODQ4Ni44MDAxNC5xbUB3ZWIxMTA0MTIubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":59088,"nextInTopic":59090,"prevInTime":59088,"nextInTime":59090,"topicId":59071,"numMessagesInTopic":0,"msgSnippet":"Jenny, I really think that s true sometimes though! Sometimes R DOES come just smack my arm like HEY! You re not paying enough attention! or something. I","messageBody":"<div id=\"ygrps-yiv-241814043\">Jenny,<br/>\n<br/>\nI really think that&#39;s true sometimes though!<br/>\nSometimes R DOES come just smack my arm like &#39;HEY! You&#39;re not paying enough<br/>\nattention!&quot; or something.<br/>\n<br/>\nI think she&#39;s in the same boat as me: She doesn&#39;t know what else to do at<br/>\nthat point.<br/>\nMaybe she gets frustrated with me.<br/>\n<br/>\nI don&#39;t hit her out of frustration though. I spank consciously when I feel<br/>\nit may really help to get a message through to her that is important for her<br/>\nsafety and development.<br/>\n<br/>\nI don&#39;t spank her often at all though. When she comes up and pops my arm,<br/>\nthat can&#39;t be a learned behavior because I don&#39;t ever smack her in that<br/>\nmanner.<br/>\nHer spankings are specific and routine. She bends over on the floor and is<br/>\nspanked with  a plastic paddle on the rear. I can&#39;t imagine that she learned<br/>\nto hit my arm (as she does once in a while) from my spanking.<br/>\n<br/>\n<br/>\nAt the same time, I have no idea where she got that behavior from, though<br/>\nwhen she does it, it seems frustrated.<br/>\nIt&#39;s not common though. Not a problem.<br/>\n<br/>\nI agree she doesn&#39;t understand those feelings yet and that&#39;s part of what<br/>\nI&#39;m saying... is that I don&#39;t know how to get her to be quiet since she<br/>\ndoesn&#39;t understand something like &quot;Please be quiet because x has a<br/>\nheadache&quot;.<br/>\nWith respect and trust, this wouldn&#39;t be an issue because even if she didn&#39;t<br/>\nget the &quot;headache&quot; part, she&#39;d trust me and be quiet.<br/>\nI know that may need to come with age.<br/>\n<br/>\nI mentioned this partly because I&#39;m trying, seemingly in vain, to express<br/>\nthe general idea of our problems, not just specific issues.<br/>\n<br/>\nAnd at this point I wish so much there was a way to just show you guys how<br/>\nour days go so you&#39;d understand because I don&#39;t think I&#39;m that good at<br/>\nexplaining in text.<br/>\n<br/>\n<br/>\nArsh<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sat, Jan 22, 2011 at 10:36 PM, Jenny Cyphers &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jenstarc4@...\">jenstarc4@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; *** My child is 3. She doesn&#39;t fully grasp<br/>\n&gt;<br/>\n&gt; language and concepts of interaction yet. How can I explain to her WHY she<br/>\n&gt; needs to be quiet for a while when someone has a headache if she doesn&#39;t<br/>\n&gt; grasp the importance of it? I can&#39;t. So should someone else have to suffer<br/>\n&gt; or should she respect me enough and TRUST me enough to do as I ask her<br/>\n&gt; because I told her it was important?***<br/>\n&gt;<br/>\n&gt; That&#39;s not about trust though, and you already see that by the first part<br/>\n&gt; of<br/>\n&gt; what you said. Most 3 yr olds are totally incapable of understanding that<br/>\n&gt; another person has feelings that are big just like theirs. Some kids are<br/>\n&gt; more<br/>\n&gt; compliant than others and will try to please a parent that asks for quiet,<br/>\n&gt; some<br/>\n&gt; children simply won&#39;t or can&#39;t.<br/>\n&gt;<br/>\n&gt; ***At the same time, I listen to my child and I trust her. If she tells me<br/>\n&gt; to<br/>\n&gt;<br/>\n&gt; do something, I listen and ask her about it and I trust her to have<br/>\n&gt; reasons.<br/>\n&gt; It is a mutual respect.<br/>\n&gt;<br/>\n&gt; As such, we reinforce that simple need for obedience with spanking and<br/>\n&gt; punishments. I don&#39;t like spanking but I don&#39;t see a way to get a child&#39;s<br/>\n&gt; attention that doesn&#39;t involve a consequence***<br/>\n&gt;<br/>\n&gt; Reverse that. &quot;At the same time, my child listens to me and she trusts me.<br/>\n&gt; If<br/>\n&gt; I tell her to do something, she listens and asks me about it and trusts<br/>\n&gt; that I<br/>\n&gt; have reasons. As such, she reinforces that simple need for obedience with<br/>\n&gt; hitting me and punishing me. She doesn&#39;t like to hit me, but she can&#39;t see<br/>\n&gt; another way to get my attention.&quot;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Help Please","postDate":"1295757367","msgId":59084,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4ODQ4Ni44MDAxNC5xbUB3ZWIxMTA0MTIubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PEFBTkxrVGk9VmpURTFUTG52eFV4c1FjRXZuVS1hdnFRS3VhOGZrMUNSejM9cUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrN2tXTWtxM2VVN0ZRYVI5czVwM0ptR2RFYngtT09QMlFhbWVaZUBtYWlsLmdtYWlsLmNvbT4gPDY4NTVEMTY4LTMwNDktNDQ5Ni05NEUyLTY4OUZEMkMwRUI1OUB2ZXJpem9uLm5ldD4gPEFBTkxrVGk9VmpURTFUTG52eFV4c1FjRXZuVS1hdnFRS3VhOGZrMUNSejM9cUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":59083,"nextInTopic":59085,"prevInTime":59083,"nextInTime":59085,"topicId":59071,"numMessagesInTopic":0,"msgSnippet":"*** My child is 3. She doesn t fully grasp language and concepts of interaction yet. How can I explain to her WHY she needs to be quiet for a while when","messageBody":"<div id=\"ygrps-yiv-865578052\">*** My child is 3. She doesn&#39;t fully grasp<br/>\nlanguage and concepts of interaction yet. How can I explain to her WHY she<br/>\nneeds to be quiet for a while when someone has a headache if she doesn&#39;t<br/>\ngrasp the importance of it? I can&#39;t. So should someone else have to suffer<br/>\nor should she respect me enough and TRUST me enough to do as I ask her<br/>\nbecause I told her it was important?***<br/>\n<br/>\nThat&#39;s not about trust though, and you already see that by the first part of <br/>\nwhat you said.  Most 3 yr olds are totally incapable of understanding that <br/>\nanother person has feelings that are big just like theirs.  Some kids are more <br/>\ncompliant than others and will try to please a parent that asks for quiet, some <br/>\nchildren simply won&#39;t or can&#39;t.  <br/>\n<br/>\n***At the same time, I listen to my child and I trust her. If she tells me to<br/>\ndo something, I listen and ask her about it and I trust her to have reasons.<br/>\nIt is a mutual respect.<br/>\n<br/>\nAs such, we reinforce that simple need for obedience with spanking and<br/>\npunishments. I don&#39;t like spanking but I don&#39;t see a way to get a child&#39;s<br/>\nattention that doesn&#39;t involve a consequence***<br/>\n<br/>\nReverse that.  &quot;At the same time, my child listens to me and she trusts me.  If <br/>\nI tell her to do something, she listens and asks me about it and trusts that I <br/>\nhave reasons.  As such, she reinforces that simple need for obedience with <br/>\nhitting me and punishing me.  She doesn&#39;t like to hit me, but she can&#39;t see <br/>\nanother way to get my attention.&quot;<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":414494505,"authorName":"Arsh","from":"Arsh &lt;arsieiuni@...&gt;","profile":"arsieiuni","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Help Please","postDate":"1295757195","msgId":59087,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGk9X0grdnU0MnZWaWdvblM5ekh3WVA2dV9xQ29EUDlaVEg5LWt4UEBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDgwMTk4NS42NjUzNy5xbUB3ZWIxMTA0MTAubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PEFBTkxrVGlrN2tXTWtxM2VVN0ZRYVI5czVwM0ptR2RFYngtT09QMlFhbWVaZUBtYWlsLmdtYWlsLmNvbT4JPDY4NTVEMTY4LTMwNDktNDQ5Ni05NEUyLTY4OUZEMkMwRUI1OUB2ZXJpem9uLm5ldD4JPEFBTkxrVGk9VmpURTFUTG52eFV4c1FjRXZuVS1hdnFRS3VhOGZrMUNSejM9cUBtYWlsLmdtYWlsLmNvbT4JPDgwMTk4NS42NjUzNy5xbUB3ZWIxMTA0MTAubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":59086,"nextInTopic":59088,"prevInTime":59086,"nextInTime":59088,"topicId":59071,"numMessagesInTopic":0,"msgSnippet":"That s not at all how we look at it though. We make decisions together. Our child is just as important a part of the family as any other member. Why do I keep","messageBody":"<div id=\"ygrps-yiv-1693501125\">That&#39;s not at all how we look at it though.<br/>\nWe make decisions together.<br/>\nOur child is just as important a part of the family as any other member.<br/>\n<br/>\nWhy do I keep running into people though who think that if I don&#39;t make her<br/>\nthe queen instead of an equal that I obviously make her lesser instead.<br/>\nI see this all over the place.<br/>\n<br/>\nWe believe in EQUAL and MUTUAL respect. I believe that meas we respect her<br/>\nneeds and feelings and she should respect our needs and feelings too. I know<br/>\nthat can&#39;t be forced and we don&#39;t try to demand respect, but it&#39;s something<br/>\nwe hope to incite via giving her a family and home she will naturally<br/>\nrespect.<br/>\n<br/>\n<br/>\nArsh<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sat, Jan 22, 2011 at 10:29 PM, Jenny Cyphers &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jenstarc4@...\">jenstarc4@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ***I believe in MUTUAL respect.***<br/>\n&gt;<br/>\n&gt; Here&#39;s the thing with mutual respect in regards to the parent child<br/>\n&gt; relationship: It&#39;s something that is learned by being modeled. If a child<br/>\n&gt; grows up in a home where they are respected, as being younger, less able,<br/>\n&gt; but<br/>\n&gt; equally as important, they WILL grow up to be respectful people. Often what<br/>\n&gt; a<br/>\n&gt; parent means when they say mutual respect, is that the parents should be<br/>\n&gt; able to<br/>\n&gt; get exactly what they want and the kids should respect that because that&#39;s<br/>\n&gt; how<br/>\n&gt; it is, and then the parents can then go about helping the kids get some of<br/>\n&gt; their<br/>\n&gt; needs met. When in actuality, it really should be exactly the opposite of<br/>\n&gt; that.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":414494505,"authorName":"Arsh","from":"Arsh &lt;arsieiuni@...&gt;","profile":"arsieiuni","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Help Please","postDate":"1295757050","msgId":59088,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlreHFHWGhtYmstV1FKNnR1UWU4cU9YMlJoM2cyckJUb1RMWm9rMEBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEFBTkxrVGk9VEc9UUwxbXlwb3Q1TTEtelJoMmo1K003cGEyMk1QYTBnYzVtdEBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrN2tXTWtxM2VVN0ZRYVI5czVwM0ptR2RFYngtT09QMlFhbWVaZUBtYWlsLmdtYWlsLmNvbT4JPDEyNzgyNC45OTYyNi5xbUB3ZWIxMTA0MTMubWFpbC5ncTEueWFob28uY29tPgk8QUFOTGtUaT1URz1RTDFteXBvdDVNMS16UmgyajUrTTdwYTIyTVBhMGdjNW10QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":59087,"nextInTopic":59089,"prevInTime":59087,"nextInTime":59089,"topicId":59071,"numMessagesInTopic":0,"msgSnippet":"Please. Everyone here. Understand this. Two mothers, two families are here to ask: How can we stop spanking? And no matter how badly the conversation has gone","messageBody":"<div id=\"ygrps-yiv-1240800958\">Please.<br/>\n<br/>\nEveryone here.<br/>\n<br/>\nUnderstand this.<br/>\n<br/>\nTwo mothers, two families are here to ask: How can we stop spanking?<br/>\n<br/>\nAnd no matter how badly the conversation has gone so far, we still want to<br/>\nlearn how to stop spanking our children.<br/>\n<br/>\nWe still want to learn what to do that is better.<br/>\n<br/>\nAnd the response so far is very close to driving us away.<br/>\n<br/>\nIf you are HONESTLY more concerned with the children, teaching others how to<br/>\nbe better with their children, and spreading this lifestyle than with ego<br/>\nand assumption, PLEASE, just let it go and help us learn.<br/>\n<br/>\nNo matter what has been misunderstood or misinterpreted so far, the end all<br/>\nof this is: we want to learn. Please help?<br/>\n<br/>\nArsh<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Help Please","postDate":"1295756971","msgId":59083,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgwMTk4NS42NjUzNy5xbUB3ZWIxMTA0MTAubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PEFBTkxrVGk9VmpURTFUTG52eFV4c1FjRXZuVS1hdnFRS3VhOGZrMUNSejM9cUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrN2tXTWtxM2VVN0ZRYVI5czVwM0ptR2RFYngtT09QMlFhbWVaZUBtYWlsLmdtYWlsLmNvbT4gPDY4NTVEMTY4LTMwNDktNDQ5Ni05NEUyLTY4OUZEMkMwRUI1OUB2ZXJpem9uLm5ldD4gPEFBTkxrVGk9VmpURTFUTG52eFV4c1FjRXZuVS1hdnFRS3VhOGZrMUNSejM9cUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":59082,"nextInTopic":59084,"prevInTime":59082,"nextInTime":59084,"topicId":59071,"numMessagesInTopic":0,"msgSnippet":"***I believe in MUTUAL respect.*** Here s the thing with mutual respect in regards to the parent child relationship:  It s something that is learned by being","messageBody":"<div id=\"ygrps-yiv-888957710\">***I believe in MUTUAL respect.***<br/>\n<br/>\nHere&#39;s the thing with mutual respect in regards to the parent child <br/>\nrelationship:  It&#39;s something that is learned by being modeled.  If a child <br/>\ngrows up in a home where they are respected, as being younger, less able, but <br/>\nequally as important, they WILL grow up to be respectful people.  Often what a <br/>\nparent means when they say mutual respect, is that the parents should be able to <br/>\nget exactly what they want and the kids should respect that because that&#39;s how <br/>\nit is, and then the parents can then go about helping the kids get some of their <br/>\nneeds met.  When in actuality, it really should be exactly the opposite of that.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":414494505,"authorName":"Arsh","from":"Arsh &lt;arsieiuni@...&gt;","profile":"arsieiuni","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Help Please","postDate":"1295756860","msgId":59086,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGk9VEc9UUwxbXlwb3Q1TTEtelJoMmo1K003cGEyMk1QYTBnYzVtdEBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDEyNzgyNC45OTYyNi5xbUB3ZWIxMTA0MTMubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PEFBTkxrVGlrN2tXTWtxM2VVN0ZRYVI5czVwM0ptR2RFYngtT09QMlFhbWVaZUBtYWlsLmdtYWlsLmNvbT4JPDEyNzgyNC45OTYyNi5xbUB3ZWIxMTA0MTMubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":59085,"nextInTopic":59087,"prevInTime":59085,"nextInTime":59087,"topicId":59071,"numMessagesInTopic":0,"msgSnippet":"You stop reading midway through to berate me, but you re wondering if I M stopping to listen? ... I don t know if this is the group for me. Arsh ... [Non-text","messageBody":"<div id=\"ygrps-yiv-366572316\">You stop reading midway through to berate me, but you&#39;re wondering if I&#39;M<br/>\nstopping to listen? ...<br/>\n<br/>\nI don&#39;t know if this is the group for me.<br/>\n<br/>\nArsh<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sat, Jan 22, 2011 at 10:24 PM, Jenny Cyphers &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jenstarc4@...\">jenstarc4@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ***We have tried everything from talking to him and just listening and<br/>\n&gt; trying<br/>\n&gt;<br/>\n&gt; to hear his reasons and his feelings and thoughts, addressing his concerns,<br/>\n&gt; explaining things to him better, spanking and time-outs (we all believe in<br/>\n&gt; SOME spanking and responsive punishments.*** I don&#39;t want a lecture on<br/>\n&gt; spanking.***<br/>\n&gt;<br/>\n&gt; I&#39;m sorry, I stopped reading after this. You don&#39;t need a lecture to hear<br/>\n&gt; that<br/>\n&gt; spanking doesn&#39;t work. It causes damage. Period. End of story and unless<br/>\n&gt; you<br/>\n&gt; want to examine that, there is very little advice I can give on the rest.<br/>\n&gt;<br/>\n&gt; If you really were listening to his feelings and thoughts, you wouldn&#39;t hit<br/>\n&gt; him<br/>\n&gt; because of them. If you really care about connecting with him, you won&#39;t<br/>\n&gt; send<br/>\n&gt; him to be by himself in his great time of need, in the form of a time-out.<br/>\n&gt; Punishing children won&#39;t build a relationship. Being your child&#39;s partner<br/>\n&gt; helps, it works, in the same way that being a partner to one&#39;s spouse or<br/>\n&gt; significant other works much better than hitting them or isolating them.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":414494505,"authorName":"Arsh","from":"Arsh &lt;arsieiuni@...&gt;","profile":"arsieiuni","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Help Please","postDate":"1295756806","msgId":59090,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlua0pPWHVXRU5meEYzcTQ4UVJOR2NwSndEN29BanBUPW1qdW1RYkBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEM1QUNFRTIxLTc3ODMtNDdFOS1COTJBLTEyNURDQTYzRTFEOEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEFBTkxrVGlrN2tXTWtxM2VVN0ZRYVI5czVwM0ptR2RFYngtT09QMlFhbWVaZUBtYWlsLmdtYWlsLmNvbT4JPEIwNjI2NTc2LUZDODMtNEM2Ny04QUY4LTNFMjQzNENGODExNEBTYW5kcmFkb2RkLmNvbT4JPEFBTkxrVGlrczFzWXc1QXVZVlFBWGNYd2pIaHBZbU9odTJEdms2dmo9bkhzT0BtYWlsLmdtYWlsLmNvbT4JPEM1QUNFRTIxLTc3ODMtNDdFOS1COTJBLTEyNURDQTYzRTFEOEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":59089,"nextInTopic":59091,"prevInTime":59089,"nextInTime":59091,"topicId":59071,"numMessagesInTopic":0,"msgSnippet":"Sandra, You would completely lose that bet. Look. Text is a horrible HORRIBLE medium for communication sometimes because it s hard to make a whole point clear.","messageBody":"<div id=\"ygrps-yiv-408679883\">Sandra,<br/>\n<br/>\nYou would completely lose that bet. Look. Text is a horrible HORRIBLE medium<br/>\nfor communication sometimes because it&#39;s hard to make a whole point clear.<br/>\nI tried really, REALLY hard to word my first message so no one would<br/>\nmisunderstand me in ONE particular way and yet, brilliantly, two people<br/>\nIMMEDIATELY misunderstood me in EXACTLY that way.<br/>\nSo if I&#39;m just really bad at expressing myself in text and that&#39;s the<br/>\nproblem, then I apologize. But what I tried to say when I first responded to<br/>\nYOUR first message in this thread was a clarification of my meaning when I<br/>\nasked not to be lectured on spanking.<br/>\nI wasn&#39;t just changing my original intent. I was trying to re-phrase because<br/>\nthe original message was NOT understood or you wouldn&#39;t have responded to me<br/>\nas you have.<br/>\n<br/>\nWhat you don&#39;t realize,  by all evidence from your responses, is that I am<br/>\nWILLING and WANTING to stop spanking and my friend who is in this with me<br/>\nalso. We are trying to figure out how this works without the spanking or<br/>\npunishments as such. We&#39;re looking for answers but ending up on a ledge<br/>\nhaving to defend ourselves. That&#39;s not fun. You&#39;re making me feel like I<br/>\nshould look elsewhere for answers after over a year of reading your site<br/>\n(I&#39;ve read MOST of your site already) and recommending you to other parents<br/>\nand really respecting your words.<br/>\n<br/>\n<br/>\nPlease stop for a moment and understand that I didn&#39;t mean what you thought<br/>\ninitially.<br/>\nI am not already decided and unwilling to move.<br/>\nI stated that in my FIRST post because I just knew I was going to be<br/>\nmisunderstood. :(<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Please tell me which unschooling list used the term &quot;unteachable.&quot;<br/>\n&gt; If you don&#39;t want to say it on this list, at least find someone you know<br/>\n&gt; and trust and discuss that. People need to know to stay away from any list<br/>\n&gt; sorting people into &quot;teachable&quot; and &quot;unteachable.&quot; I&#39;ve never heard that<br/>\n&gt; term on any unschooling list and would like to warn people away from one<br/>\n&gt; that uses it.<br/>\n&gt;<br/>\n </span></blockquote>I don&#39;t remember the list because I left it. It was unreasonable the way I<br/>\nwas reacted to there and I&#39;m starting to feel a similar sense of inability<br/>\nto discuss freely and openly here already because I feel VERY attacked when<br/>\nall I want is some answers on how to approach this.<br/>\n<br/>\nYou said that you don&#39;t think there&#39;s a point if I&#39;m not ready to discard<br/>\nspanking. I AM. I just need to know what I&#39;m going to do when I don&#39;t spank<br/>\nanymore. That way I know what to do instead! Otherwise, I&#39;m just going to<br/>\nflail ineffectually at problems because I don&#39;t have a solution.<br/>\n<br/>\nWithout referencing back to what I said before THIS post, since those<br/>\nmessages obviously were misunderstood, can you just go forward from here and<br/>\nunderstand I NEVER MEANT to imply I would not let go of spanking if given<br/>\nanswers about a working alternative? Please?<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Perhaps they said you were resistant to learning, or that you were<br/>\n&gt; unreceptive.<br/>\n&gt; If someone said that, I would understand.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>If you knew me in person, you would never call me resistant to learning or<br/>\nunreceptive. I&#39;m such an open book.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; You said your cup was empty, but two more posts made without your having<br/>\n&gt; had ANY time to read the links, or try any of the ideas, or to think say<br/>\n&gt; things like &quot;I am not closed-minded however ...<br/>\n&gt; But...<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>If anyone was actually reading my posts they&#39;d know I said I&#39;ve already read<br/>\nmost of those links and tried the ideas.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; ....<br/>\n&gt; Honestly wishing to learn,<br/>\n&gt; ====================================================<br/>\n&gt; Less than an hour later...<br/>\n&gt; ====================================================<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; And at the same time let you guys know I WANT a change, not<br/>\n&gt; to be told that I&#39;m right or whatever else it is that being an initially<br/>\n&gt; spanking parent labels me with.<br/>\n&gt;<br/>\n&gt; ...<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; how can you help anyone? Why bother<br/>\n&gt; having a site and a list dedicated to helping others understand unschooling<br/>\n&gt;<br/>\n&gt; ======================================================<br/>\n&gt;<br/>\n </span></blockquote>That&#39;s a response to how badly you are responding to me.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I hope you will read, try, wait and watch.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I&#39;ve been reading since I was 4 months pregnant, trying since she was born,<br/>\nwaiting all along and watching the whole time.<br/>\nMy friend has joined me in this beautiful method.<br/>\nYou don&#39;t know us. Please stop assuming.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; You&#39;re right that we can&#39;t help just anyone.<br/>\n&gt; We can only help people who will read, try, wait and watch. We can only<br/>\n&gt; help people who care more about their children than they do about their own<br/>\n&gt; comfort and their own feeling of being right. We can only help people who<br/>\n&gt; stop saying they&#39;re receptive long enough to be receptive.<br/>\n&gt;<br/>\n </span></blockquote>Reiterating:<br/>\n<br/>\nI&#39;ve been reading since I was 4 months pregnant, trying since she was born,<br/>\nwaiting all along and watching the whole time.<br/>\nMy friend has joined me in this beautiful method.<br/>\nYou don&#39;t know us. Please stop assuming.<br/>\n<br/>\nWe aren&#39;t worried about feeling right. We are worried about keeping both our<br/>\nkids safe and happy.<br/>\nWe do want to make the whole family happy.<br/>\nAnd we do want to learn. We completely open to learn.<br/>\n<br/>\nArsh<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Help Please","postDate":"1295756642","msgId":59082,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyNzgyNC45OTYyNi5xbUB3ZWIxMTA0MTMubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PEFBTkxrVGlrN2tXTWtxM2VVN0ZRYVI5czVwM0ptR2RFYngtT09QMlFhbWVaZUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrN2tXTWtxM2VVN0ZRYVI5czVwM0ptR2RFYngtT09QMlFhbWVaZUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":59081,"nextInTopic":59083,"prevInTime":59081,"nextInTime":59083,"topicId":59071,"numMessagesInTopic":0,"msgSnippet":"***We have tried everything from talking to him and just listening and trying to hear his reasons and his feelings and thoughts, addressing his concerns, ","messageBody":"<div id=\"ygrps-yiv-767801801\">***We have tried everything from talking to him and just listening and trying<br/>\nto hear his reasons and his feelings and thoughts, addressing his concerns,<br/>\nexplaining things to him better, spanking and time-outs (we all believe in<br/>\nSOME spanking and responsive punishments.*** I don&#39;t want a lecture on<br/>\nspanking.*** <br/>\n<br/>\nI&#39;m sorry, I stopped reading after this.  You don&#39;t need a lecture to hear that <br/>\nspanking doesn&#39;t work.  It causes damage.  Period.  End of story and unless you <br/>\nwant to examine that, there is very little advice I can give on the rest.<br/>\n<br/>\nIf you really were listening to his feelings and thoughts, you wouldn&#39;t hit him <br/>\nbecause of them.  If you really care about connecting with him, you won&#39;t send <br/>\nhim to be by himself in his great time of need, in the form of a time-out. <br/>\n Punishing children won&#39;t build a relationship.  Being your child&#39;s partner <br/>\nhelps, it works, in the same way that being a partner to one&#39;s spouse or <br/>\nsignificant other works much better than hitting them or isolating them.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Help Please","postDate":"1295756037","msgId":59081,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM1QUNFRTIxLTc3ODMtNDdFOS1COTJBLTEyNURDQTYzRTFEOEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEFBTkxrVGlrczFzWXc1QXVZVlFBWGNYd2pIaHBZbU9odTJEdms2dmo9bkhzT0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrN2tXTWtxM2VVN0ZRYVI5czVwM0ptR2RFYngtT09QMlFhbWVaZUBtYWlsLmdtYWlsLmNvbT4gPEIwNjI2NTc2LUZDODMtNEM2Ny04QUY4LTNFMjQzNENGODExNEBTYW5kcmFkb2RkLmNvbT4gPEFBTkxrVGlrczFzWXc1QXVZVlFBWGNYd2pIaHBZbU9odTJEdms2dmo9bkhzT0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":59080,"nextInTopic":59082,"prevInTime":59080,"nextInTime":59082,"topicId":59071,"numMessagesInTopic":0,"msgSnippet":"-=-You don t understand.-=- I would bet you any amount of money that you are wrong about that. -=-I was trying to say We currently spank but we aren t set on","messageBody":"<div id=\"ygrps-yiv-2107434911\">-=-You don&#39;t understand.-=-<br/>\n<br/>\nI would bet you any amount of money that you are wrong about that.<br/>\n<br/>\n-=-I was trying to say &quot;We<br/>\ncurrently spank but we aren&#39;t set on it. -=-<br/>\n<br/>\nThat&#39;s not what you said.  You pretty much said you spank, and you&#39;re going to continue and you didn&#39;t want that part of it discussed.<br/>\n<br/>\n-=-Yet instead of an answer ... I get words shoved into my mouth and a complete<br/>\nlack of response to all the QUESTIONS.-=-<br/>\n<br/>\nNo one shoved anything at anyone.<br/>\nNone of your other questions are worth answering if you&#39;re going to cling to spanking.<br/>\n<br/>\nIf you asked about nice furniture and carpets and interior decorating and storage of expensive photos and then told us your roof leaks and you don&#39;t want any lectures about water damage, how much time and energy would you really expect us to spend discussing carpet padding and archive-quality boxes?<br/>\n<br/>\nYou&#39;re telling us what you want and HOW you want it, in what tone, amount and direction.<br/>\n<br/>\nI invite you to read my site and Joyce&#39;s, and to stay on this list and read more and more.  I invite you to read a little, try a little, wait a while and watch.   I also invite you to consider whether you treat your son with the critical impatience you&#39;re showing here.<br/>\n<br/>\n-=-I went on an unschooling list before and asked for advice. As soon as I<br/>\nmentioned that I currently spanked, I was labeled as &#39;Unteachable&quot; -=-<br/>\n<br/>\nPlease tell me which unschooling list used the term &quot;unteachable.&quot;<br/>\nIf you don&#39;t want to say it on this list, at least find someone you know and trust and discuss that.  People need to know to stay away from any list sorting people into &quot;teachable&quot; and &quot;unteachable.&quot;  I&#39;ve never heard that term on any unschooling list and would like to warn people away from one that uses it.<br/>\n<br/>\nPerhaps they said you were resistant to learning, or that you were unreceptive.<br/>\nIf someone said that, I would understand.<br/>\n<br/>\nYou said your cup was empty, but two more posts made without your having had ANY time to read the links, or try any of the ideas, or to think say things like &quot;I am not closed-minded however ...<br/>\nBut...<br/>\n....<br/>\nHonestly wishing to learn,<br/>\n====================================================<br/>\nLess than an hour later...<br/>\n====================================================<br/>\n<br/>\nAnd at the same time let you guys know I WANT a change, not<br/>\nto be told that I&#39;m right or whatever else it is that being an initially<br/>\nspanking parent labels me with.<br/>\n<br/>\n...<br/>\n<br/>\nhow can you help anyone? Why bother<br/>\nhaving a site and a list dedicated to helping others understand unschooling<br/>\n<br/>\n======================================================<br/>\n<br/>\nI hope you will read, try, wait and watch.<br/>\n<br/>\nYou&#39;re right that we can&#39;t help just anyone. <br/>\nWe can only help people who will read, try, wait and watch.  We can only help people who care more about their children than they do about their own comfort and their own feeling of being right.  We can only help people who stop saying they&#39;re receptive long enough to be receptive.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":414494505,"authorName":"Arsh","from":"Arsh &lt;arsieiuni@...&gt;","profile":"arsieiuni","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Help Please","postDate":"1295755910","msgId":59085,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGltNU9lVFhGckpWQkNLeWQ4eTNBQkNzWE5CYW9NemVKU1F3M0J3a0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEFBTkxrVGk9dG5Tcl9MRy1aNCtieHhmV1I4d1k3N2lueVZITUhoYW5QSmNfYUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrN2tXTWtxM2VVN0ZRYVI5czVwM0ptR2RFYngtT09QMlFhbWVaZUBtYWlsLmdtYWlsLmNvbT4JPEFBTkxrVGk9dG5Tcl9MRy1aNCtieHhmV1I4d1k3N2lueVZITUhoYW5QSmNfYUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":59084,"nextInTopic":59086,"prevInTime":59084,"nextInTime":59086,"topicId":59071,"numMessagesInTopic":0,"msgSnippet":"Katherine, Thank you SO much for your thoughtful reply. Let me answer bit by bit so I can respond to what you said. ... We have all really been evaluating our","messageBody":"<div id=\"ygrps-yiv-1265797081\">Katherine, Thank you SO much for your thoughtful reply. Let me answer bit by<br/>\nbit so I can respond to what you said.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;&gt;We really don&#39;t ask all that much of the kids when we&#39;re all together<br/>\n&gt; here.<br/>\n&gt; We let them play, give them activities to do, facilitate learning and watch<br/>\n&gt; movies, enjoy snacks and create things... I don&#39;t think they could want for<br/>\n&gt; much. All we ask is for them to keep their inside voices from time to time<br/>\n&gt; (not even all the time, just usually when we&#39;re trying to talk or rest and<br/>\n&gt; they&#39;re being so loud that it is infringing on others&#39; comfort which I<br/>\n&gt; consider just simple consideration) and not to do things that are dangerous<br/>\n&gt; or could break something. We don&#39;t ask much in my thoughts. I really have<br/>\n&gt; asked them if they need anything or if they are happy and constantly get<br/>\n&gt; told that they are.&lt;&lt;&lt;<br/>\n&gt;<br/>\n&gt; Kids (even adults!) can&#39;t always articulate what they want or what they<br/>\n&gt; mean.<br/>\n&gt;<br/>\n&gt; And unschooling looks more like this: &quot;Read a little, try a little, wait a<br/>\n&gt; while, watch.&quot;<br/>\n&gt;<br/>\n&gt; Than this:<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt;&gt;&gt;We don&#39;t ask much in my thoughts.&lt;&lt;&lt;<br/>\n&gt; &gt;&gt;&gt;I don&#39;t think they could want for much.&lt;&lt;&lt;<br/>\n&gt;<br/>\n&gt; Observing what children want and seeing the effects of asking children to<br/>\n&gt; do<br/>\n&gt; or not do things goes a lot further than thoughts and thinking alone. I<br/>\n&gt; used<br/>\n&gt; to parent by just thinking and making out the logic from what I was<br/>\n&gt; thinking<br/>\n&gt; things are about too. I remember thinking (there it goes again) that I was<br/>\n&gt; being reasonable and not asking much and that Karl didn&#39;t want a lot. But<br/>\n&gt; when I got down in the floor and played with him and the more I looked the<br/>\n&gt; more I realized that I was asking more than Karl understood the point of<br/>\n&gt; (even if I told him) and that he wanted things *he* had thought of which I<br/>\n&gt; hadn&#39;t considered.<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>We have all really been evaluating our parenting for the past several months<br/>\nand trying (as two families working together) to help each other,<br/>\nsincerely.<br/>\nWe are trying to figure out what will work better since what we have been<br/>\ndoing hasn&#39;t worked out as well as we wanted.<br/>\nAs for observing what our children want, yes we are very involved and aware<br/>\nof them. We both (both families) have allowed our children to pick their own<br/>\ntoys and activities and movies, etc. We try to let them do what they are<br/>\npassionate about and we try to facilitate their interests.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; On spanking, I have a question. Do you have a moral reason for spanking?<br/>\n&gt;<br/>\n </span></blockquote>No. Absolutely not. We spank because it&#39;s a last resort after trying to talk<br/>\nto them, trying to understand their reasoning, their side, etc, and seeing<br/>\nno change in a behavior that is HARMFUL or DESTRUCTIVE.<br/>\nThis isn&#39;t just about getting the behavior we want, but about protecting our<br/>\nchildren from harm and from destroying our valuables.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Is<br/>\n&gt; it part of your values? Is it convenient?<br/>\n&gt;<br/>\n </span></blockquote>No. It&#39;s really not convenient. None of us enjoy stopping the fun we&#39;re<br/>\nhaving and having to spank a child because they are disrupting the rest of<br/>\nthe group&#39;s fun and peace. It&#39;s not convenient.<br/>\n<br/>\nAnd I notice how I felt compelled in that to say &quot;having to spank&quot;. That<br/>\ntells me it really does feel like we don&#39;t have any other choices at that<br/>\npoint. We have TRIED other methods and spanking generally is a last option.<br/>\nSo at that point, we obviously feel we&#39;re out of options.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Does it seem to work in some ways?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>With my daughter, R, it does seem to work in CERTAIN circumstances. When she<br/>\nhas gotten into a REALLY bad mood and has REALLY gotten into a rough<br/>\nattitude, a spanking and then a nap will almost ALWAYS act as a sort of<br/>\n&quot;reset button&quot;. We never do this angry. We do it as gently as we can and<br/>\nexplain to her why it&#39;s happening.<br/>\nBut I don&#39;t like it and I&#39;m not stuck on it. If there is a better way, I<br/>\nwill always try for a better way.  I&#39;m NOT attached to spanking without<br/>\nreason. I am just looking for the best way for our family.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You can stop hitting your children and here&#39;s a webpage with several links<br/>\n&gt; about spanking alternatives:<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/s/stop\">http://sandradodd.com/s/stop</a><br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I have read this whole page before but I will go read it again.<br/>\n<br/>\nPart of my problem is that I keep feeling like I&#39;m not finding the whole<br/>\nmessage.<br/>\n<br/>\nIt&#39;s like it goes from A) You are currently spanking and you should stop. to<br/>\nC) Congrats you stopped! Without a B) This is how you handle things INSTEAD<br/>\nof spanking.<br/>\n<br/>\nANd this is where I usually get the &quot;Just talk to them&quot; part. So what about<br/>\nwhen we&#39;ve tried months of non-spanking with just talking, explaining,<br/>\nrespectful conversations and rare alternate punishments like brief time-out<br/>\nor &quot;turn abouts&quot; like just now, as I was typing, my R kept trying to stop K<br/>\nfrom watching a movie by moving the screen each time he sat down just out of<br/>\nthinking it was amusing to frustrate him. As a fair punishment, we decided<br/>\nthat she then was the one that couldn&#39;t watch the movie. This teaches her to<br/>\nthink about how she makes others feel (since we explain that while enacting<br/>\nsaid punishment).<br/>\n<br/>\nSometimes that kind of alternative works. Other times, it DOESN&#39;t. And<br/>\nthat&#39;s where I get stuck and that&#39;s where K&#39;s mom gets stuck. So what then?<br/>\nWhat do you do when talking doesn&#39;t work and spanking doesn&#39;t work and<br/>\nalternative punishments don&#39;t work?<br/>\n<br/>\nWe&#39;re just trying to teach our kids how to be nice to their friends and<br/>\nfamily, love each other and play together without hurting anyone, destroying<br/>\nthings that aren&#39;t theirs, or being exceptionally inconsiderate.<br/>\nI don&#39;t *think *that&#39;s expecting too much of any child. I don&#39;t *feel *it is<br/>\ntoo much either.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; Spanking does things to relationships because it deters outright<br/>\n&gt; disobedience and curbs open (honest) disagreement. Children who are 3 and 6<br/>\n&gt; can&#39;t drum up a discussion with an adult who might resort to hitting if<br/>\n&gt; disagreement comes up. Hitting creates reasons for children to lie to and<br/>\n&gt; hide from their parents and others, and in the parent&#39;s thinking (there&#39;s<br/>\n&gt; that thinking again) those lies, that hiding and stealing, only present<br/>\n&gt; still more reasons for hitting a child.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>We&#39;ve spent the better part of a week talking about this and reading<br/>\narticles about it together, discussion what we&#39;ve learned and trying to find<br/>\nalternatives. We all generally agree with it. I just don&#39;t know how to<br/>\ntransition from spanking on what we feel is &quot;need&quot; to not spanking without<br/>\nleaving our kids to behave in ways that are really not safe or sane.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Instead of all that, look at your child.<br/>\n&gt;<br/>\n&gt; If a child feels a big empty space where there needs to be unconditional<br/>\n&gt; attention, and sincere respect (without threats, hitting, not to mention,<br/>\n&gt; yelling) then that child will look for ways to get the next best thing:<br/>\n&gt; conditional usually negative attention or take matters into their own hands<br/>\n&gt; to physically get what they need. There are a whole bunch of things that a<br/>\n&gt; child might resort to (many of those undesirable behaviors you&#39;re seeing).<br/>\n&gt; So far they have thought of a few things and as they get older they may<br/>\n&gt; come<br/>\n&gt; up with more.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I understand that kids look for negative attention if they don&#39;t get<br/>\nattention. We have tried breaking up their play time with group activities.<br/>\nSometimes they want to join us on the couch and watch the video game we&#39;re<br/>\nplaying as a group. We joke and laugh and tickle and tackle and play with<br/>\nthem and bring them into the game. The other night, we broke our game night<br/>\nup by throwing in Cat&#39;s Eye! An old Milton-Bradley game and the kids had a<br/>\nBLAST with it. They asked about playing it more all morning and I&#39;m going to<br/>\nbring it back out in just a bit so they can play it again. (We had to go out<br/>\nearlier so it wasn&#39;t applicable then). They also have to be supervised with<br/>\nit because it involves a ton of marbles that will get lost if we don&#39;t watch<br/>\nthem. Heh.<br/>\n<br/>\nWe have tried offering more and more attention and group fun, but the bad<br/>\nbehavior goes on without obvious reason. Though I do notice it doesn&#39;t tend<br/>\nto happen when we are all very focused on fun activities. Of course, the<br/>\nkids have to give us some time to do things too like cooking or picking up<br/>\nand it&#39;s often during these times when we need them to play and not<br/>\nmisbehave that we see the worst behaviors. :(<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Chewing on toys: is there something that the child is welcome to chew on.<br/>\n&gt; Chewing is very comforting. I like to chew toothpicks, gum, crunch ice<br/>\n&gt; cubes<br/>\n&gt; and so on. Offer safe and acceptable things that the child enjoys chewing.<br/>\n&gt; Are you willing to sacrifice some toys? If the child is chewing other&#39;s<br/>\n&gt; toys, s/he needs personal toys for chewing on. Several kinds.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Valid and reasonable logic. I&#39;ll mention that to his mom.<br/>\nAnd we will ask him about his need to chew.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Stealing: does the child have lots of things s/he chose for themselves that<br/>\n&gt; are personally belonging to that child? Does the child want more? When a<br/>\n&gt; child gets older the interests may change and the new interests mean<br/>\n&gt;<br/>\n </span></blockquote>different things rather than more of the same.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n </span></blockquote>That is something I addressed with his parents when he stole food in the<br/>\nhouse. I think it&#39;s hard for them to determine his limits on food because<br/>\nthe child DOES have autism spectrum disorder and he has a tendency to GORGE<br/>\nhimself if given all the food he wants,  even to the point of feeling sick<br/>\nor vomiting. They try to limit him SOME on food so he doesn&#39;t do that. It&#39;s<br/>\nnot like they limit him heavily however. That kid EATS and he&#39;ll happily eat<br/>\nmost anything you give him. I&#39;ve never seen him turn down a food, even foods<br/>\nthat surprise me for ADULTS to like such as sushi (I love sushi so I was<br/>\nvery glad to share that with him. He can kill a plate of sushi in a<br/>\nminute!)<br/>\nAt the same time, I really have to feel he is still WANTING if he sneaks the<br/>\nfood or maybe he doesn&#39;t trust he can have as much as he wants if he&#39;s<br/>\nsneaking to take it.<br/>\nThose limits are necessary because of his disorder, yet the behavior of<br/>\nstealing isn&#39;t acceptable. It leaves us unsure of what to do.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Breaking toys: aggression comes from fear. See above about spanking<br/>\n&gt; alternatives. Also read more on respecting children. Hitting is a glaring<br/>\n&gt; gap in parental respect. Hitting is aggression. A parent who hits is<br/>\n&gt; modeling aggressive behavior.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>This was more carelessness than aggression I think. He twisted a koosh toy<br/>\nuntil it was nearly broken in half. That&#39;s a good example.<br/>\nOr absentmindedly banging something on the carpet and not realizing he&#39;s<br/>\nbreaking it.<br/>\nIt&#39;s just a lack of attention and care given for something that belongs to<br/>\nsomeone else.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Also aggression may be the only acceptable expression ---in place of---<br/>\n&gt; getting parental respect, attention, being heard, feeling a sense of<br/>\n&gt; belonging. Is crying &quot;for whatever reason&quot; frowned on? I&#39;m not there so I<br/>\n&gt; don&#39;t know but I am wondering since it was very much frowned on in my own<br/>\n&gt; family of origin where yelling and hitting was the way parents expressed<br/>\n&gt; their frustration whenever they didn&#39;t understand their children. Crying<br/>\n&gt; children made them feel guilty and more sympathetic than they were<br/>\n&gt; comfortable with, and they forbade it. In those cases, children harden<br/>\n&gt; their<br/>\n&gt; hearts over time and the parents will likely grow less able to influence<br/>\n&gt; them. I&#39;m pretty sure that&#39;s not the intent but it can be the unfortunate<br/>\n&gt; result in many child/parent relationships. Some children just put up with<br/>\n&gt; it, biding their time until they can leave their parent&#39;s home.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I fully understand that. Every parent involved in this was mistreated in<br/>\nsome way as a kid. That&#39;s why my friends are joining me in the unschooling<br/>\nmethod. They remember how much school was ineffective or damaging to them<br/>\nand they don&#39;t agree with conventional methods of parents. We&#39;re all trying<br/>\nto avoid doing that to our kids. We want to live with our kids and love them<br/>\nand let them LOVE learning and learn all the time from their lives! Rather<br/>\nthan hating learning as we did and being forced through boredom and misery.<br/>\n<br/>\nWe do NOT make them feel bad for crying. The only time K gets told not to<br/>\ncry is when he &quot;yucks it up&#39; to get attention after a punishment. He will<br/>\ntry to act like something is worse than it is so someone will pity him. Then<br/>\nhe&#39;s told not to do that because it&#39;s deception, not because it bothers us<br/>\nor annoys us or anything.<br/>\nAgain, if we can find a better method to guide (the real meaning of<br/>\ndiscipline) him, I think that problem will vanish.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Another note on aggression: This is a page on Maslow&#39;s hierarchy of needs,<br/>\n&gt; which touches on why people can and can&#39;t learn, reason, understand,<br/>\n&gt; empathize or do any number of things once they&#39;ve gone into survival mode<br/>\n&gt; --<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/peace/noisy\">http://sandradodd.com/peace/noisy</a><br/>\n&gt;<br/>\n&gt; Already had that link open but we&#39;re going to read it next. :)<br/>\n </span></blockquote>Thanks SO much. I look forward to hearing more!<br/>\n<br/>\n<br/>\n<br/>\nArsh<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Help Please","postDate":"1295755154","msgId":59080,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGluMVJHKzlqZCtqMm1uK0s5YktHZUQ0TzB0MDgyaHBKNWZmQ0RFT0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEFBTkxrVGk9VmpURTFUTG52eFV4c1FjRXZuVS1hdnFRS3VhOGZrMUNSejM9cUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrN2tXTWtxM2VVN0ZRYVI5czVwM0ptR2RFYngtT09QMlFhbWVaZUBtYWlsLmdtYWlsLmNvbT4JPDY4NTVEMTY4LTMwNDktNDQ5Ni05NEUyLTY4OUZEMkMwRUI1OUB2ZXJpem9uLm5ldD4JPEFBTkxrVGk9VmpURTFUTG52eFV4c1FjRXZuVS1hdnFRS3VhOGZrMUNSejM9cUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":59079,"nextInTopic":59081,"prevInTime":59079,"nextInTime":59081,"topicId":59071,"numMessagesInTopic":0,"msgSnippet":"... needs of the child but what about the needs of the WHOLE family?","messageBody":"<div id=\"ygrps-yiv-582846251\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;I mean, it&#39;s one thing to say &quot;change your expectations to match the<br/>\n </span></blockquote>needs of the child&quot; but what about the needs of the WHOLE family?&lt;&lt;&lt;<br/>\n<br/>\nYou want your child to do for the WHOLE family what an adult is resisting to<br/>\ndo for one child?<br/>\n<br/>\nSlow down. Read some of the links posted. When you post, avoid telling<br/>\npeople what ideas are acceptable or unacceptable. If you don&#39;t want some of<br/>\nthe words you&#39;re getting, then go onto what you are willing to discuss more<br/>\nabout rather than posting guidelines to what is acceptable to write to you.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Help Please","postDate":"1295755073","msgId":59079,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMwOTBDMUU1LUE2MUYtNEJBRS04NUU3LUZGNUY0MUFGODk1RkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEFBTkxrVGk9VmpURTFUTG52eFV4c1FjRXZuVS1hdnFRS3VhOGZrMUNSejM9cUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrN2tXTWtxM2VVN0ZRYVI5czVwM0ptR2RFYngtT09QMlFhbWVaZUBtYWlsLmdtYWlsLmNvbT4gPDY4NTVEMTY4LTMwNDktNDQ5Ni05NEUyLTY4OUZEMkMwRUI1OUB2ZXJpem9uLm5ldD4gPEFBTkxrVGk9VmpURTFUTG52eFV4c1FjRXZuVS1hdnFRS3VhOGZrMUNSejM9cUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":59078,"nextInTopic":59080,"prevInTime":59078,"nextInTime":59080,"topicId":59071,"numMessagesInTopic":0,"msgSnippet":"=-I got really really tired on another list of people assuming I wasn t going to listen BECAUSE I said I believed in some spanking.-=- You told us you weren t","messageBody":"<div id=\"ygrps-yiv-424887227\">=-I got really really tired on<br/>\nanother list of people assuming I wasn&#39;t going to listen BECAUSE I said I<br/>\nbelieved in some spanking.-=-<br/>\n<br/>\nYou told us you weren&#39;t going to listen.  Then you told us you were.  Then you said you didn&#39;t want a lecture.  Then you said you would really listen.<br/>\n<br/>\nI think you wanted people to say &quot;What you&#39;re doing is fine.  You&#39;re a good mom.  Just keep doing what you&#39;re doing.&quot;<br/>\nAlthough I understand the feeling of hoping people will soothe and coo, it won&#39;t help you understand unschooling for that to happen here, nor would any of the (wait... checking Members: 2922)  nearly 3000 members of the list be helped in any way if the regular posters compromised their integrity to go against what they know to be true about how unschooling works.<br/>\n<br/>\nSupport is here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/support\">http://sandradodd.com/support</a><br/>\n<br/>\nAssistance with understanding unschooling is here.  On this list.  A few other places, but not better places, as far as I&#39;ve heard.  Because you&#39;re new to unschooling, though, you might want to try <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":454093105,"authorName":"lalow","from":"&quot;lalow&quot; &lt;lalougor@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Help Please","postDate":"1295754853","msgId":59077,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGloZzhwNSs1NGhsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGk9dG5Tcl9MRy1aNCtieHhmV1I4d1k3N2lueVZITUhoYW5QSmNfYUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":59076,"nextInTopic":59078,"prevInTime":59076,"nextInTime":59078,"topicId":59071,"numMessagesInTopic":0,"msgSnippet":"-He needs someone/an adult/parent to stay right with him all the time.  He needs a parent to help him get through this time.  Perhaps he needs to be home more","messageBody":"<div id=\"ygrps-yiv-1310143258\">-He needs someone/an adult/parent to stay right with him all the time.  He needs a parent to help him get through this time.  Perhaps he needs to be home more and not always playing at someone else house with other kids, perhaps he needs you to understand that he is a child and not thinking logically about who he waking up but expressing a need to make noise at that moment. To be heard.  Take him outside or to another part of the house so he can yell. He needs you to quit comparing him to a 3 year old just because she follows your directions and he doesn&#39;t.  He need acceptance and hugs and love and compassion and something to chew on and a place to swing and jump and move and be himself.</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Help Please","postDate":"1295753891","msgId":59074,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGk9dG5Tcl9MRy1aNCtieHhmV1I4d1k3N2lueVZITUhoYW5QSmNfYUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEFBTkxrVGlrN2tXTWtxM2VVN0ZRYVI5czVwM0ptR2RFYngtT09QMlFhbWVaZUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrN2tXTWtxM2VVN0ZRYVI5czVwM0ptR2RFYngtT09QMlFhbWVaZUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":59073,"nextInTopic":59075,"prevInTime":59073,"nextInTime":59075,"topicId":59071,"numMessagesInTopic":0,"msgSnippet":"... here. We let them play, give them activities to do, facilitate learning and watch movies, enjoy snacks and create things... I don t think they could want","messageBody":"<div id=\"ygrps-yiv-1094971626\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;We really don&#39;t ask all that much of the kids when we&#39;re all together<br/>\n </span></blockquote>here.<br/>\nWe let them play, give them activities to do, facilitate learning and watch<br/>\nmovies, enjoy snacks and create things... I don&#39;t think they could want for<br/>\nmuch. All we ask is for them to keep their inside voices from time to time<br/>\n(not even all the time, just usually when we&#39;re trying to talk or rest and<br/>\nthey&#39;re being so loud that it is infringing on others&#39; comfort which I<br/>\nconsider just simple consideration) and not to do things that are dangerous<br/>\nor could break something. We don&#39;t ask much in my thoughts. I really have<br/>\nasked them if they need anything or if they are happy and constantly get<br/>\ntold that they are.&lt;&lt;&lt;<br/>\n<br/>\nKids (even adults!) can&#39;t always articulate what they want or what they<br/>\nmean.<br/>\n<br/>\nAnd unschooling looks more like this: &quot;Read a little, try a little, wait a<br/>\nwhile, watch.&quot;<br/>\n<br/>\nThan this:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;We don&#39;t ask much in my thoughts.&lt;&lt;&lt;<br/>\n&gt;&gt;&gt;I don&#39;t think they could want for much.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Observing what children want and seeing the effects of asking children to do<br/>\nor not do things goes a lot further than thoughts and thinking alone. I used<br/>\nto parent by just thinking and making out the logic from what I was thinking<br/>\nthings are about too. I remember thinking (there it goes again) that I was<br/>\nbeing reasonable and not asking much and that Karl didn&#39;t want a lot. But<br/>\nwhen I got down in the floor and played with him and the more I looked the<br/>\nmore I realized that I was asking more than Karl understood the point of<br/>\n(even if I told him) and that he wanted things *he* had thought of which I<br/>\nhadn&#39;t considered.<br/>\n<br/>\nOn spanking, I have a question. Do you have a moral reason for spanking? Is<br/>\nit part of your values? Is it convenient? Does it seem to work in some ways?<br/>\nYou can stop hitting your children and here&#39;s a webpage with several links<br/>\nabout spanking alternatives:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/s/stop\">http://sandradodd.com/s/stop</a><br/>\n<br/>\nSpanking does things to relationships because it deters outright<br/>\ndisobedience and curbs open (honest) disagreement. Children who are 3 and 6<br/>\ncan&#39;t drum up a discussion with an adult who might resort to hitting if<br/>\ndisagreement comes up. Hitting creates reasons for children to lie to and<br/>\nhide from their parents and others, and in the parent&#39;s thinking (there&#39;s<br/>\nthat thinking again) those lies, that hiding and stealing, only present<br/>\nstill more reasons for hitting a child.<br/>\n<br/>\nInstead of all that, look at your child.<br/>\n<br/>\nIf a child feels a big empty space where there needs to be unconditional<br/>\nattention, and sincere respect (without threats, hitting, not to mention,<br/>\nyelling) then that child will look for ways to get the next best thing:<br/>\nconditional usually negative attention or take matters into their own hands<br/>\nto physically get what they need. There are a whole bunch of things that a<br/>\nchild might resort to (many of those undesirable behaviors you&#39;re seeing).<br/>\nSo far they have thought of a few things and as they get older they may come<br/>\nup with more.<br/>\n<br/>\nChewing on toys: is there something that the child is welcome to chew on.<br/>\nChewing is very comforting. I like to chew toothpicks, gum, crunch ice cubes<br/>\nand so on. Offer safe and acceptable things that the child enjoys chewing.<br/>\nAre you willing to sacrifice some toys? If the child is chewing other&#39;s<br/>\ntoys, s/he needs personal toys for chewing on. Several kinds.<br/>\n<br/>\nStealing: does the child have lots of things s/he chose for themselves that<br/>\nare personally belonging to that child? Does the child want more? When a<br/>\nchild gets older the interests may change and the new interests mean<br/>\ndifferent things rather than more of the same.<br/>\n<br/>\nBreaking toys: aggression comes from fear. See above about spanking<br/>\nalternatives. Also read more on respecting children. Hitting is a glaring<br/>\ngap in parental respect. Hitting is aggression. A parent who hits is<br/>\nmodeling aggressive behavior.<br/>\n<br/>\nAlso aggression may be the only acceptable expression ---in place of---<br/>\ngetting parental respect, attention, being heard, feeling a sense of<br/>\nbelonging. Is crying &quot;for whatever reason&quot; frowned on? I&#39;m not there so I<br/>\ndon&#39;t know but I am wondering since it was very much frowned on in my own<br/>\nfamily of origin where yelling and hitting was the way parents expressed<br/>\ntheir frustration whenever they didn&#39;t understand their children. Crying<br/>\nchildren made them feel guilty and more sympathetic than they were<br/>\ncomfortable with, and they forbade it. In those cases, children harden their<br/>\nhearts over time and the parents will likely grow less able to influence<br/>\nthem. I&#39;m pretty sure that&#39;s not the intent but it can be the unfortunate<br/>\nresult in many child/parent relationships. Some children just put up with<br/>\nit, biding their time until they can leave their parent&#39;s home.<br/>\n<br/>\nAnother note on aggression: This is a page on Maslow&#39;s hierarchy of needs,<br/>\nwhich touches on why people can and can&#39;t learn, reason, understand,<br/>\nempathize or do any number of things once they&#39;ve gone into survival mode --<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/peace/noisy\">http://sandradodd.com/peace/noisy</a><br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":414494505,"authorName":"Arsh","from":"Arsh &lt;arsieiuni@...&gt;","profile":"arsieiuni","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Help Please","postDate":"1295752968","msgId":59078,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlrczFzWXc1QXVZVlFBWGNYd2pIaHBZbU9odTJEdms2dmo9bkhzT0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEIwNjI2NTc2LUZDODMtNEM2Ny04QUY4LTNFMjQzNENGODExNEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEFBTkxrVGlrN2tXTWtxM2VVN0ZRYVI5czVwM0ptR2RFYngtT09QMlFhbWVaZUBtYWlsLmdtYWlsLmNvbT4JPEIwNjI2NTc2LUZDODMtNEM2Ny04QUY4LTNFMjQzNENGODExNEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":59077,"nextInTopic":59079,"prevInTime":59077,"nextInTime":59079,"topicId":59071,"numMessagesInTopic":0,"msgSnippet":"You don t understand. I went on an unschooling list before and asked for advice. As soon as I mentioned that I currently spanked, I was labeled as","messageBody":"<div id=\"ygrps-yiv-1691691167\">You don&#39;t understand.<br/>\n<br/>\nI went on an unschooling list before and asked for advice. As soon as I<br/>\nmentioned that I currently spanked, I was labeled as &#39;Unteachable&quot; and<br/>\npeople threw a fit. No one actually read what I said or answered my<br/>\nquestions. Instead they all focused on the fact that I did something they<br/>\ndisagreed with and automatically decided that meant I couldn&#39;t be taught<br/>\nanything at all.<br/>\n<br/>\nNow I came here trying REALLY hard to express that I WANT to learn and I am<br/>\nWILLING to change.<br/>\n<br/>\nWhat I said I didn&#39;t want was a LECTURE on spanking. I have already read<br/>\neverything on your site, Sandradodd.com about Spanking and I EMPHATICALLY<br/>\nagree that it doesn&#39;t feel right and it doesn&#39;t help and it breeds<br/>\nresentment and more resistance. What I said and why I said it was aimed at<br/>\navoiding this VERY discussion we&#39;re having now. I was trying to say &quot;We<br/>\ncurrently spank but we aren&#39;t set on it. We don&#39;t know what else to do.<br/>\nHelp. Please.&quot; And at the same time let you guys know I WANT a change, not<br/>\nto be told that I&#39;m right or whatever else it is that being an initially<br/>\nspanking parent labels me with.<br/>\n<br/>\nYet instead of an answer ... I get words shoved into my mouth and a complete<br/>\nlack of response to all the QUESTIONS.<br/>\n<br/>\nIf you want to look at it like that... how can you help anyone? Why bother<br/>\nhaving a site and a list dedicated to helping others understand unschooling<br/>\nif you meet their honest questions and open-hearted desire to learn with a<br/>\nstatement like that?<br/>\n<br/>\nConfused,<br/>\nArsh<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sat, Jan 22, 2011 at 9:03 PM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; -=-I would like to ask for some honest advice on how to handle bad behavior<br/>\n&gt; with a child who has just started unschooling.-=-<br/>\n&gt;<br/>\n&gt; You asked for honest advice, and then told us what not to tell you.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Help Please","postDate":"1295751807","msgId":59073,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIwNjI2NTc2LUZDODMtNEM2Ny04QUY4LTNFMjQzNENGODExNEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEFBTkxrVGlrN2tXTWtxM2VVN0ZRYVI5czVwM0ptR2RFYngtT09QMlFhbWVaZUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrN2tXTWtxM2VVN0ZRYVI5czVwM0ptR2RFYngtT09QMlFhbWVaZUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":59072,"nextInTopic":59074,"prevInTime":59072,"nextInTime":59074,"topicId":59071,"numMessagesInTopic":0,"msgSnippet":"-=-I would like to ask for some honest advice on how to handle bad behavior with a child who has just started unschooling.-=- You asked for honest advice, and","messageBody":"<div id=\"ygrps-yiv-1940986432\">-=-I would like to ask for some honest advice on how to handle bad behavior<br/>\nwith a child who has just started unschooling.-=-<br/>\n<br/>\nYou asked for honest advice, and then told us what not to tell you.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":284087656,"authorName":"Karen James","from":"Karen James &lt;semajrak@...&gt;","profile":"semajrak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Help Please","postDate":"1295748579","msgId":59075,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGluSm1HU3cxSEZlS3FVaTVjNHA5WHROM3NYV1ZuSnFtUExhTWQxQkBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDY4NTVEMTY4LTMwNDktNDQ5Ni05NEUyLTY4OUZEMkMwRUI1OUB2ZXJpem9uLm5ldD4=","referencesHeader":"PEFBTkxrVGlrN2tXTWtxM2VVN0ZRYVI5czVwM0ptR2RFYngtT09QMlFhbWVaZUBtYWlsLmdtYWlsLmNvbT4JPDY4NTVEMTY4LTMwNDktNDQ5Ni05NEUyLTY4OUZEMkMwRUI1OUB2ZXJpem9uLm5ldD4="},"prevInTopic":59074,"nextInTopic":59076,"prevInTime":59074,"nextInTime":59076,"topicId":59071,"numMessagesInTopic":0,"msgSnippet":"... however, taking things that aren t his or that he s been expressly told not to take). I used to steal as a child.  I did so because I could.  No one was","messageBody":"<div id=\"ygrps-yiv-1799928762\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; Stealing from within the house he&#39;s a guest in (he also steals at home,<br/>\n<br/>\n </span></blockquote>however, taking things that aren&#39;t his or that he&#39;s been expressly told not<br/>\n<br/>\nto take).<br/>\n<br/>\n<br/>\nI used to steal as a child.  I did so because I could.  No one was watching<br/>\nme.  No one was there to stop me.  I took things to replace what was really<br/>\nmissing in my life--my parents&#39; attention.  This may not be the case for<br/>\nthis young boy, but the first thing I would try would be to sit beside this<br/>\nlittle guy as much as possible during the day.  I would play with him on the<br/>\nfloor with whatever he wants to play with.  I would watch his favourite<br/>\nprograms with him.  I would play his favourite music, and dance along with<br/>\nhim.  I would snuggle him if he likes that, or just be present if he didn&#39;t<br/>\nlike a lot of contact.  I would laugh when he was happy and sympathise with<br/>\nhis frustrations as much as possible for as long as it took for him to know<br/>\nthat he is not alone.<br/>\n<br/>\nBreaking toys on purpose or out of utter carelessness (not simple things<br/>\n<br/>\nlike accidents. He can be very destructive.)<br/>\n<br/>\n<br/>\nA little girl friend of ours used to get very destructive when she was done<br/>\nplaying with our son.  Sometimes she was quite agressive toward him.  I wish<br/>\nI had taken more time to understand her needs sooner, but we finally learned<br/>\nthat she was telling us she needed to go home (or needed us to go home).<br/>\n She needed quiet time alone with her dad (the stay at home parent).  Once<br/>\nwe understood this, we watched for early signs that she was done playing.<br/>\n We made sure we acted before she needed to.  She is a lovely girl, and my<br/>\nson still adores her.  Again, I would assume this little boy needs<br/>\nsomething, and I would try to find out what that was.<br/>\n<br/>\nRegressing to chewing on things (including some of said toys) which he<br/>\n<br/>\nstopped doing 3 years ago.<br/>\n<br/>\n<br/>\nMy son is eight.  Over the past two years he has begun chewing on his nails<br/>\nwhen he is thinking.  I notice I, too, put my fingers near my mouth when I<br/>\nam thinking.  We talked about what he might like to chew on instead of his<br/>\nnails.  He thinks cinnamon sticks are good, so he chews on these when he<br/>\nneeds to chew.  Perhaps the act of chewing satisfies some need this boy has,<br/>\nand maybe something can be found to support that, if the toys are<br/>\nundesirable.<br/>\n<br/>\nI believe that by seeing this boy&#39;s actions as &quot;unacceptable&quot; you may be<br/>\nlimiting your ability to see his needs more clearly.  To me it seems this<br/>\nboy is giving a clear message that he isn&#39;t comfortable.  I would work to<br/>\nunderstand why that is, and what could be done to ease that discomfort.<br/>\n<br/>\nKaren.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":414494505,"authorName":"Arsh","from":"Arsh &lt;arsieiuni@...&gt;","profile":"arsieiuni","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Help Please","postDate":"1295748397","msgId":59076,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGk9VmpURTFUTG52eFV4c1FjRXZuVS1hdnFRS3VhOGZrMUNSejM9cUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDY4NTVEMTY4LTMwNDktNDQ5Ni05NEUyLTY4OUZEMkMwRUI1OUB2ZXJpem9uLm5ldD4=","referencesHeader":"PEFBTkxrVGlrN2tXTWtxM2VVN0ZRYVI5czVwM0ptR2RFYngtT09QMlFhbWVaZUBtYWlsLmdtYWlsLmNvbT4JPDY4NTVEMTY4LTMwNDktNDQ5Ni05NEUyLTY4OUZEMkMwRUI1OUB2ZXJpem9uLm5ldD4="},"prevInTopic":59075,"nextInTopic":59077,"prevInTime":59075,"nextInTime":59077,"topicId":59071,"numMessagesInTopic":0,"msgSnippet":"Joyce, I m listening. And I emphasize this because I got really really tired on another list of people assuming I wasn t going to listen BECAUSE I said I ","messageBody":"<div id=\"ygrps-yiv-636506973\">Joyce,<br/>\n<br/>\nI&#39;m listening. And I emphasize this because I got really really tired on<br/>\nanother list of people assuming I wasn&#39;t going to listen BECAUSE I said I<br/>\nbelieved in some spanking.<br/>\nI will listen to your advice and I am fully welcoming options at this<br/>\npoint.<br/>\n<br/>\nSo what about behavior that is not about whether it conforms to our<br/>\nexpectations. What about when the child is being DESTRUCTIVE to other<br/>\npeople&#39;s property, HURTING other children and or himself, and no one else in<br/>\nthe house can be comfortable because of how loud he is being?<br/>\n<br/>\nI have seen how unschooling families look and they don&#39;t appear to be full<br/>\nof children who make their home so uncomfortable they can&#39;t be happy<br/>\nthemselves.<br/>\nHow do they accomplish this?<br/>\n<br/>\nHow do we transform our situation so that the kids don&#39;t do these things<br/>\nthat are actually not acceptable? I mean, it&#39;s one thing to say &quot;change your<br/>\nexpectations to match the needs of the child&quot; but what about the needs of<br/>\nthe WHOLE family?<br/>\nIt&#39;s one thing to adapt our tv&#39;s volume so we can hear our game AND the kids<br/>\ncan hear their movie, but it&#39;s another thing to not be able to carry on a<br/>\nconversation without the kids yelling so loud we can&#39;t hear each other.<br/>\nShould we really just have to decide &quot;I don&#39;t expect kids to be considerate<br/>\nat all&quot; ? Because that won&#39;t fly with us. I believe in MUTUAL respect. I<br/>\nagree on not wanting to subject my child to things I wouldn&#39;t accept. Would<br/>\nI accept someone hitting me to stop me doing something? No. But I fully<br/>\nunderstand language and reasoning. My child is 3. She doesn&#39;t fully grasp<br/>\nlanguage and concepts of interaction yet. How can I explain to her WHY she<br/>\nneeds to be quiet for a while when someone has a headache if she doesn&#39;t<br/>\ngrasp the importance of it? I can&#39;t. So should someone else have to suffer<br/>\nor should she respect me enough  and TRUST me enough to do as I ask her<br/>\nbecause I told her it was important? I feel that in a loving family, enough<br/>\ntrust should be present that the children will indeed listen to what they&#39;re<br/>\ntold to do so that they can respond immediately when there is danger and so<br/>\nthey can be considerate of circumstances beyond their ability to grasp at<br/>\nthis point.<br/>\n<br/>\nAt the same time, I listen to my child and I trust her. If she tells me to<br/>\ndo something, I listen and ask her about it and I trust her to have reasons.<br/>\nIt is a mutual respect.<br/>\n<br/>\nAs such, we reinforce that simple need for obedience with spanking and<br/>\npunishments. I don&#39;t like spanking but I don&#39;t see a way to get a child&#39;s<br/>\nattention that doesn&#39;t involve a consequence.<br/>\n<br/>\n<br/>\nI am not closed-minded however and I am not unwilling to HEAR of ways that<br/>\ndon&#39;t involve such consequences.<br/>\n<br/>\nBut I tried non-spanking and it began to transform my very sweet,<br/>\nconsiderate child into a brat. I tried radical unschooling especially not<br/>\ncontrolling food at all and my child went from eating fruits and veggies and<br/>\nchicken and cheese and other good nommy treats to candy, cookies, cake all<br/>\nthe time. She wouldn&#39;t ask for ANYTHING good. I let it go 3 months without<br/>\ntouching the rule that she could eat all of whatever she wanted whenever she<br/>\nwanted and she never improved her habits, to the point I became concerned<br/>\nwith her health because she went from the 1% of national average range to<br/>\nthe 0%. I know the reading says some children don&#39;t self regulate. But if<br/>\nanything, that utter lack of structure left my child confused.<br/>\n<br/>\nAs for the older child, K, I really want to help him and his family figure<br/>\nthis out. We&#39;ve talked about listening and not invalidating his feelings by<br/>\ntelling him this or that doesn&#39;t matter, and had quite a large amount of<br/>\nconversation on the matter in general.<br/>\n<br/>\nSo spanking isn&#39;t very useful with him. It distracts him from misbehavior<br/>\nfor a short time. Time-outs breed resentment. I KNOW all of this.<br/>\nBut how do we move from what we&#39;re doing now to something that WORKS? What<br/>\ndo we do to start?<br/>\nHow do we let him move away from the spanking model WITHOUT having to<br/>\nutterly suffer his destructive, hurtful, and badly inconsiderate behaviors<br/>\nmeawhile?<br/>\n<br/>\nHonestly wishing to learn,<br/>\nArsh<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sat, Jan 22, 2011 at 6:18 PM, Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt;wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; On Jan 22, 2011, at 4:49 PM, Arsh wrote:<br/>\n&gt;<br/>\n&gt; &gt; spanking and time-outs (we all believe in<br/>\n&gt; &gt; SOME spanking and responsive punishments. I don&#39;t want a lecture on<br/>\n&gt; &gt; spanking. We have tried complete non-spanking and it does not work<br/>\n&gt; &gt; for us.<br/>\n&gt;<br/>\n&gt; Then you haven&#39;t tried the right things.<br/>\n&gt;<br/>\n&gt; Spanking and the mindset that&#39;s needed to justify it is counter to the<br/>\n&gt; values and advice given here.<br/>\n&gt;<br/>\n&gt; A larger more powerful person hurting a smaller, weaker person who<br/>\n&gt; isn&#39;t doing what they&#39;re told would be the first thing I&#39;d advise<br/>\n&gt; someone to eliminate completely. And until that was gone, there<br/>\n&gt; wouldn&#39;t be a lot more to suggest until the effects of that were<br/>\n&gt; eliminated.<br/>\n&gt;<br/>\n&gt; The weaker person shouldn&#39;t be humiliated, hurt, yelled at by a<br/>\n&gt; bigger, stronger person. The bigger one should, instead, be changing<br/>\n&gt; their expectations to match the child rather than trying to shape the<br/>\n&gt; child to match their expectations.<br/>\n&gt;<br/>\n&gt; Behavior is communication. If a child can&#39;t behave in the way the<br/>\n&gt; parent or the situation needs, then the child shouldn&#39;t be put in that<br/>\n&gt; situation. It&#39;s the parents&#39; responsibility to not ask more of the<br/>\n&gt; child than he or she is capable of. And if the parent does, it&#39;s not<br/>\n&gt; the child&#39;s responsibility to conform to the parents&#39; expectations.<br/>\n&gt;<br/>\n&gt; My guess is the older child is reacting to stress. Change is a big<br/>\n&gt; stressor. Even good change is stressful.<br/>\n&gt;<br/>\n&gt; Spanking is a huge stressor. When the people you expect to love you<br/>\n&gt; unconditionally are hurting you for reasons you aren&#39;t getting, that&#39;s<br/>\n&gt; going to be stressful. Doesn&#39;t matter how infrequent. If your husband<br/>\n&gt; punches you for reasons that make sense to him but you don&#39;t<br/>\n&gt; understand, how long before you believed he wouldn&#39;t punch you again?<br/>\n&gt; And then what if he did? What would it be like wondering when the next<br/>\n&gt; punch might come? A little stressful?<br/>\n&gt;<br/>\n&gt; Joyce<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Help Please","postDate":"1295741935","msgId":59072,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NTVEMTY4LTMwNDktNDQ5Ni05NEUyLTY4OUZEMkMwRUI1OUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PEFBTkxrVGlrN2tXTWtxM2VVN0ZRYVI5czVwM0ptR2RFYngtT09QMlFhbWVaZUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrN2tXTWtxM2VVN0ZRYVI5czVwM0ptR2RFYngtT09QMlFhbWVaZUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":59071,"nextInTopic":59073,"prevInTime":59071,"nextInTime":59073,"topicId":59071,"numMessagesInTopic":0,"msgSnippet":"... Then you haven t tried the right things. Spanking and the mindset that s needed to justify it is counter to the values and advice given here. A larger more","messageBody":"<div id=\"ygrps-yiv-549238213\">On Jan 22, 2011, at 4:49 PM, Arsh wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; spanking and time-outs (we all believe in<br/>\n&gt; SOME spanking and responsive punishments. I don&#39;t want a lecture on<br/>\n&gt; spanking. We have tried complete non-spanking and it does not work  <br/>\n&gt; for us.<br/>\n<br/>\n </span></blockquote>Then you haven&#39;t tried the right things.<br/>\n<br/>\nSpanking and the mindset that&#39;s needed to justify it is counter to the  <br/>\nvalues and advice given here.<br/>\n<br/>\nA larger more powerful person hurting a smaller, weaker person who  <br/>\nisn&#39;t doing what they&#39;re told would be the first thing I&#39;d advise  <br/>\nsomeone to eliminate completely. And until that was gone, there  <br/>\nwouldn&#39;t be a lot more to suggest until the effects of that were  <br/>\neliminated.<br/>\n<br/>\nThe weaker person shouldn&#39;t be humiliated, hurt, yelled at by a  <br/>\nbigger, stronger person. The bigger one should, instead, be changing  <br/>\ntheir expectations to match the child rather than trying to shape the  <br/>\nchild to match their expectations.<br/>\n<br/>\nBehavior is communication. If a child can&#39;t behave in the way the  <br/>\nparent or the situation needs, then the child shouldn&#39;t be put in that  <br/>\nsituation. It&#39;s the parents&#39; responsibility to not ask more of the  <br/>\nchild than he or she is capable of. And if the parent does, it&#39;s not  <br/>\nthe child&#39;s responsibility to conform to the parents&#39; expectations.<br/>\n<br/>\nMy guess is the older child is reacting to stress. Change is a big  <br/>\nstressor. Even good change is stressful.<br/>\n<br/>\nSpanking is a huge stressor. When the people you expect to love you  <br/>\nunconditionally are hurting you for reasons you aren&#39;t getting, that&#39;s  <br/>\ngoing to be stressful. Doesn&#39;t matter how infrequent. If your husband  <br/>\npunches you for reasons that make sense to him but you don&#39;t  <br/>\nunderstand, how long before you believed he wouldn&#39;t punch you again?  <br/>\nAnd then what if he did? What would it be like wondering when the next  <br/>\npunch might come? A little stressful?<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":414494505,"authorName":"Arsh","from":"Arsh &lt;arsieiuni@...&gt;","profile":"arsieiuni","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Help Please","postDate":"1295732984","msgId":59071,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlrN2tXTWtxM2VVN0ZRYVI5czVwM0ptR2RFYngtT09QMlFhbWVaZUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":59072,"prevInTime":59070,"nextInTime":59072,"topicId":59071,"numMessagesInTopic":0,"msgSnippet":"I would like to ask for some honest advice on how to handle bad behavior with a child who has just started unschooling. I know about the deschooling process","messageBody":"<div id=\"ygrps-yiv-2092231649\">I would like to ask for some honest advice on how to handle bad behavior<br/>\nwith a child who has just started unschooling.<br/>\n<br/>\nI know about the deschooling process and I know patience is required. I&#39;m<br/>\nnot looking for a quick fix, just some advice.<br/>\n<br/>\nI just brought my best friends into the unschooling mindset. They are<br/>\nstarting with their 6 year old son who has autism spectrum disorder. He is<br/>\nhigh-functioning autistic and his main issues are focus issues.<br/>\n<br/>\nWe have been getting together at my house for a few days at a time and<br/>\nplaying games, having fun and the kids have been playing together splendidly<br/>\n(6 year old K with my 3 year old R).<br/>\n<br/>\nSo while R has been unschooled since birth and responds very well to<br/>\nconversational correction to behavior (we use responsive listening and<br/>\nrespectful parenting and the Parent&#39;s Tao Te Ching!), K has been schooled a<br/>\nfew months then pulled from school and is now unschooling. He has been moved<br/>\naround a lot and just got settled in a new home here in Alabama and he has a<br/>\nnew father figure who is FANTASTIC with the kids and loves him very much but<br/>\nhe&#39;s replacing a past poor father figure.  K has a lot of stress, I&#39;m sure,<br/>\nand he has a lot of reasons to need plenty of patience. Our patience has<br/>\nbeen very lenient and remains intact. We just want some advice.<br/>\n<br/>\nHere&#39;s what he&#39;s doing that&#39;s not acceptable:<br/>\n<br/>\nStealing from within the house he&#39;s a guest in (he also steals at home,<br/>\nhowever, taking things that aren&#39;t his or that he&#39;s been expressly told not<br/>\nto take).<br/>\nBreaking toys on purpose or out of utter carelessness (not simple things<br/>\nlike accidents. He can be very destructive.)<br/>\nRegressing to chewing on things (including some of said toys) which he<br/>\nstopped doing 3 years ago.<br/>\n<br/>\n<br/>\n<br/>\nWhat he&#39;s doing that is not enjoyable for his family and friends include:<br/>\nRefusing to listen when told that things are dangerous, being inconsiderate<br/>\nof others&#39; needs (and we&#39;re pretty lenient on noise levels etc in the house<br/>\nbut yelling endlessly when someone is napping is not nice) and hitting 3<br/>\nyear old R some times.<br/>\n<br/>\n<br/>\nWe have tried everything from talking to him and just listening and trying<br/>\nto hear his reasons and his feelings and thoughts, addressing his concerns,<br/>\nexplaining things to him better, spanking and time-outs (we all believe in<br/>\nSOME spanking and responsive punishments. I don&#39;t want a lecture on<br/>\nspanking. We have tried complete non-spanking and it does not work for us.<br/>\nBoth families have tried it, I mean. I rarely ever have to spank my R. She<br/>\nhas been unschooled since birth, however, remember. She requires mostly only<br/>\nconversation. She has some days when she gets into a really bad streak of<br/>\nbehavior and at that point a spank and then a nap will almost always<br/>\ncompletely correct the bad behaviors.)<br/>\n<br/>\n<br/>\nWe really don&#39;t ask all that much of the kids when we&#39;re all together here.<br/>\nWe let them play, give them activities to do, facilitate learning and watch<br/>\nmovies, enjoy snacks and create things... I don&#39;t think they could want for<br/>\nmuch. All we ask is for them to keep their inside voices from time to time<br/>\n(not even all the time, just usually when we&#39;re trying to talk or rest and<br/>\nthey&#39;re being so loud that it is infringing on others&#39; comfort which I<br/>\nconsider just simple consideration) and not to do things that are dangerous<br/>\nor could break something. We don&#39;t ask much in my thoughts. I really have<br/>\nasked them if they need anything or if they are happy and constantly get<br/>\ntold that they are.<br/>\n<br/>\nI know some of this is just the excitement and lack of focus, but we have<br/>\naddressed the main issues in every way we know how.<br/>\n<br/>\nI want everyone to understand I&#39;m not coming at this from a standpoint of &quot;I<br/>\nalready know&quot;. I have only stated what I know so far because I want to give<br/>\nyou an idea of who I am and what I&#39;ve already tried. I&#39;ve been reading and<br/>\nlearning about unschool since before my daughter was born and have<br/>\nunschooled her since birth. I&#39;m always learning! We&#39;re all, always learning!<br/>\n I just want advice. Thus, I empty my cup.<br/>\n<br/>\n<br/>\nArsh<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":59428,"nextTopicId":59092}}